Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: id, it, pt_br

source: I2P is a full dynamic network. Each client is known to other nodes and tests local known nodes for reachability and capacity. Only reachable and capable nodes are saved to a local NetDB (This is generally only a portion of the network, around 500-1000). When I2P builds tunnels, it selects the best resource from this pool. For example, a small subset of 20-50 nodes are only available to build tunnels with. Because testing happens every minute, the pool of used nodes changes every minute. Each I2P node knows a different part of the net, meaning that each router has a different set of I2P nodes to be used for tunnels. Even if two routers have the same subset of known nodes, the tests for reachability and capacity will likely show different results, as the other routers could be under load just as one router tests, but be free if the second router tests.
id: I2p adalah jaringan dinamis penuh. Setiap client dikenal oleh node lain dan menguji lokal known node untuk reachability dan kapasitas. Hanya node yang terjangkau dan mampu, disimpan NetDB lokal (ini adalah umumnya hanya sebagian dari jaringan, di sekitar 500-1000). Ketika I2P membangun tunnel, I2P memilih sumber daya terbaik dari pool ini. Sebagai contoh, subset kecil dari 20-50 node hanya tersedia untuk membangun tunnel. Karena pengujian terjadi setiap menit, pool dari node yang telah digunakan berubah setiap menit. Setiap node I2P tahu bagian yang berbeda dari internet, berarti bahwa setiap router memiliki kumpulan I2P node digunakan untuk tunnel. Bahkan jika kedua router memiliki subset known node yang sama, tes untuk reachability dan kapasitas akan mungkin menunjukkan hasil yang berbeda, seperti router lain bisa saja di bawah beban hanya sebagai satu router tes, tetapi menjadi bebas jika router kedua menguji.
it: I2P è una rete completamente dinamica. Ogni client è conosciuto dagli altri nodi e analizza i nodi locali conosciuti per verificare la raggiungibilità e la capacità. Solo i nodi raggiungibili e idonei sono salvati nel NetDB locale (Questo è generalmente solo una porzione della rete, circa 500-1000). Quando I2P costruisce i tunnel, seleziona la risorsa migliore da questo gruppo. Per esempio, un piccolo sottogruppo di 20-50 nodi sono disponibili solo per costruire tunnel. Siccome le analisi sono effettuate ogni minuto, il gruppo dei nodi utilizzati cambia ogni minuto. Ogni nodo I2P conosce una parte differente della rete: ciò significa che ogni router ha un differente insieme di nodi I2P da essere usati come tunnel. Anche se due router hanno lo stesso sottogruppo di nodi conosciuti, le analisi di raggiungibilità e capacità probabilmente mostreranno risultati differenti, perché gli altri router saranno sotto carico appena un router analizza, ma saranno liberi se il secondo router analizza.

source: The above describes why each I2P node has different nodes to build tunnels. Because every I2P node has a different latency and bandwith, tunnels (which are built via those nodes) have different latency and bandwidth values. And because every I2P node has different tunnels built, no two I2P nodes have the same tunnel sets.
id: Di atas menjelaskan mengapa setiap node I2P memiliki node berbeda untuk membangun tunnel. Karena setiap node I2P memiliki latency dan bandwidth berbeda, tunnel (yang dibangun melalui node tersebut) memiliki nilai latency dan bandwidth yang berbeda. Karena setiap node I2P memiliki tunnel berbeda, tidak ada dua node I2P yang memiliki tunnel set yang sama .
it: L'immagine sopra descrive perchè ogni nodo I2P ha diversi nodi per costruire i tunnel. Perchè ogni nodo I2P ha diversa latenza e larghezza di banda, i tunnel (i quali sono costruiti attraverso quei nodi) hanno valori diversi di latenza e larghezza di banda. E poichè ogni nodo I2P ha diversi costrutti dei tunnel, due nodi I2P non hanno le stesse impostazioni dei tunnel.

source: A server/client is known as a "destination" and each destination has at least one inbound and one outbound tunnel. The default is 3 hops per tunnel. This adds up to 12 hops (aka 12 different I2P nodes) for a full roundtrip client-server-client.
id: Server/klien dikenal sebagai sebuah "destinasi" dan setiap destinasi memiliki setidaknya satu tunnel inbound dan outbound. Defaultnya adalah 3 hop per tunnel. Ini menambahkan hingga 12 hop (alias 12 I2P node berbeda ) untuk ulang-alik penuh client-server-client.
it: Un server/client è conosciuto come "destinazione" e ogni destinazione possiede almeno un tunnel in entrata e uno in uscita. Sono predefiniti 3 HOPS per tunnel Vengono così aggiunti fino a 12 HOPS (cioè 12 diversi nodi I2P) per ottenere un completo percorso client-server-client.
pt_br: Um servidor/cliente é também denominado como sendo um "destino" e cada destino tem pelo menos um túnel penetrante, i.e. que chega, e um túnel de fuga, i.e que parte. O padrão, por omissão, é de 3 saltos por túnel. Isso adiciona 12 saltos (ou seja, 12 nodos I2P distintos) a um vai-e-vem cliente-servidor-cliente completo.

source: Each data package is sent through 6 other I2P nodes until it reaches the server:
id: Setiap paket data dikirim melalui 6 node I2P lainnya sampai mencapai server:
it: Ogni pacchetto dati è inviato attraverso 6 altri nodi I2P fino a che raggiunge il server:
pt_br: Cada pacote de dados é enviado através de 6 outros nodos I2P antes de chegar ao servidor:

source: and on way back 6 different I2P nodes:
id: dan perjalanan kembali 6 I2P node yang berbeda :
it: e a ritroso attraverso 6 diversi nodi I2P:

source: As most traffic on I2P (www, torrent,...) needs ack packages until new data is sent, it needs to wait until a ack package returns from the server. In the end: send data, wait for ack, send more data, wait for ack,.. As the RTT (RoundTripTime) adds up from the latency of each individual I2P node and each connection on this roundtrip, it takes usually 1-3 seconds until a ack package comes back to the client. With some internals of TCP and I2P transport, a data package has a limited size and cannot be as large as we want it to be. Together these conditions set a limit of max bandwidth per tunnel of 20-50 kbyte/sec. But if ONLY ONE hop in the tunnel has only 5 kb/sec bandwidth to spend, the whole tunnel is limited to 5 kb/sec, independent of the latency and other limitations.
id: Karena sebagian besar lalu lintas di I2P (www, torrent,...) memerlukan ack package sampai data baru dikirim, I2P perlu menunggu sampai ack package kembali dari server. Pada akhirnya: mengirim data, menunggu ack, mengirim lebih banyak data, menunggu ack,... Karena RTT (RoundTripTime) menambah latency dari setiap node I2P dan setiap koneksi pada ulang-alik ini, dibutuhkan biasanya 1-3 detik sampai ack package kembali ke klien. Dengan beberapa transport TCP dan I2P internal, paket data memiliki ukuran terbatas dan tidak dapat sebesar seperti yang kita inginkan. Secara bersama-sama, kondisi ini menetapkan batas bandwidth maksimal per terowongan sebesar 20-50 kbyte/detik. Tetapi jika hanya satu hop di tunel memiliki bandwidth hanya 5 kb/detik, seluruh tunnel terbatas untuk 5 kb/detik, tidak tergantung latency dan keterbatasan lain.

source: Due to encryption used and other setups in I2P (howto built up tunnels, latency, ...) it is quite expensive in CPU time to build a tunnel. This is why a destination is only allowed to have a max of 6 IN and 6 OUT tunnels to transport data. With a max of 50 kb/sec per tunnel, a destination could use roughly 300 kb/sec traffic combined ( in reality it could be more if shorter tunnels are used with low or no anonymity available). Used tunnels are discarded every 10 minutes and new ones are built up. This change of tunnels (and sometimes clients that shutdown hard due to usage of "shut down at once" or situations where there is power loss) does sometimes break tunnels and connections, as seen on the IRC2P Network in loss of connection (ping timeout) or on when using eepget.
id: Karena enkripsi yang digunakan dan setup lainnya di I2P (bagaimana membangun terowongan, latency, ...) cukup mahal dalam waktu CPU untuk membangun tunnel. Inilah sebabnya destinasi hanya diperbolehkan untuk memiliki maks 6 tunnel MASUK dan 6 KELUAR untuk transportasi data. Dengan max 50 kb/detik per terowongan, destinasi dapat menggunakan kira-kira total 300 kb/detik lalu lintas (dalam kenyataannya mungkin lebih jika terowongan lebih pendek digunakan dengan anonimitas tidak tersedia atau rendah). Tunnel bekas dibuang setiap 10 menit dan yang baru dibangun. Perubahan terowongan ini (dan kadang-kadang klien yang hard shutdown karena penggunaan "shut down at once" atau situasi di mana ada mati lampu) kadang-kadang break tunnel dan koneksi, seperti yang terlihat pada jaringan IRC2P kehilangan koneksi (ping timeout) atau pada saat menggunakan eepget.

source: With a limited set of destinations and a limited set of tunnels per destination, one I2P node only uses a limited set of tunnels across other I2P nodes. For example, if an I2P node is "hop1" in the small example above, we only see 1 participating tunnel originating from the client. If we sum up the whole I2P network, only a rather limited number of participating tunnels could be built with a limited amount of bandwidth all together. If one distributes these limited numbers across the number of I2P nodes, there is only a fraction of available bandwidth/capacity available for use.
id: Dengan serangkaian destinasi dan serangkaian unnel per tujuan, satu node I2P hanya menggunakan serangkaian tunnel di node I2P lain. Misalnya, jika node I2P adalah "hop1" di dalam contoh kecil di atas, kita hanya melihat 1 participating tunnel yang berasal dari client. Jika kita menjumlahkan seluruh jaringan I2P, hanya sejumlah tunnel yang terbatas yang bisa dibangun dengan jumlah bandwidth yang terbatas. Jika salah satu mendistribusikan angka-angka terbatas ini di sejumlah node I2P, ada hanya sebagian dari kapasitas bandwidth tersedia yang tersedia untuk digunakan.

source: To remain anonymous one router should not be used by the whole network for building tunnels. If one router does act as a tunnel router for ALL I2P nodes, it becomes a very real central point of failure as well as a central point to grab IPs and data from the clients. This is not good. I2P attempts to spread the load across a lot of I2P nodes because of this reason.
id: Untuk tetap anonim, satu router tidak boleh digunakan oleh seluruh jaringan untuk membangun tunnel. Jika satu router bertindak sebagai tunnel router untuk semua node I2P, dia menjadi titik pusat kegagalan dan juga titik sentral untuk mengambil data dari klien dan IPs. Ini tidak bagus. I2P mencoba menyebarkan beban ke banyak node I2P karena alasan ini.

source: Another point is the full mesh network. Each connection hop-hop utilizes one TCP or UDP connection on the I2P nodes. With 1000 connections, one sees 1000 TCP connections. That is quite a lot and some home and small office routers (DSL, cable,..) only allow a small number of connections (or just go mad if you use more than X connections). I2P tries to limit these connections to be under 1500 per UDP and per TCP type. This limits the amount of traffic routed across your I2P node as well.
id: Hal lain adalah jaringan mesh penuh. Setiap hop-hop koneksi menggunakan satu koneksi TCP atau UDP pada node I2P. Dengan 1000 koneksi, seseorang melihat 1000 koneksi TCP. Itu cukup banyak dan router rumah dan kantor kecil (DSL, kabel, ..) hanya mengizinkan sejumlah kecil koneksi (atau hanya menjadi gila jika menggunakan lebih dari koneksi X). I2P mencoba untuk membatasi koneksi ini di bawah 1500 per UDP dan per tipe TCP. Ini membatasi jumlah lalu lintas yang diarahkan ke node I2P milik anda juga.

source: In summary, I2P is very complex and there is no easy way to pinpoint why your node is not used. If your node is reachable and has a bandwidth setting of >128 kbyte/sec shared and is reachable 24/7, it should be used after some time for participating traffic. If it is down in between, the testing of your I2P node done by other nodes will tell them: you are not reachable. This blocks your node for at least 24h on other nodes. So, the other nodes which tested you as down will not use your node for 24h for building tunnels. This is why your traffic will be lower after a restart/shutdown for a minimum of 24h.
id: Singkatnya, I2P sangat kompleks dan tidak ada cara mudah untuk menentukan mengapa node anda tidak digunakan. Jika node anda dapat dijangkau dan memiliki pengaturan bandwidth> 128 kbyte / detik yang dibagi dan dapat dijangkau 24/7, itu harus digunakan setelah beberapa waktu untuk participating traffic. Jika berada di tengah-tengah, pengujian simpul I2P anda yang dilakukan oleh node lain akan memberi tahu: anda tidak dapat dijangkau. Ini memblokir node anda setidaknya 24 jam pada node lain. Jadi, node lain yang menganggap anda sebagai tidak aktif tidak akan menggunakan simpul Andaaselama 24 jam untuk membangun tunnel. Inilah sebabnya mengapa lalu lintas anda akan menjadi lebih rendah setelah restart / shutdown selama minimal 24 jam.

source: Also: other I2P nodes needs to know your I2P router to test it for reachability and capacity. It takes time for other nodes to get known to your node. It will be faster if you use I2P and build more tunnels, e.g. use a torrent or www for some time.
id: Selain itu: node I2P lainnya perlu mengetahui router I2P Andaauntuk mengujinya untuk reachability dan kapasitas. Butuh waktu untuk node lain untuk diketahui node anda. Ini akan lebih cepat jika anda menggunakan I2P dan membangun lebih banyak tunnel, misalnya menggunakan torrent atau www untuk beberapa lama.
it: Altro: gli altri nodi I2P hanno bisogno di conoscere il tuo router I2P per poter effettuare i test di raggiungibilità e capacità. Gli altri nodi possono impiegare del tempo per analizzare il tuo nodo. Per risparmiare tempo, prova a costruire più tunnels con I2P, ad esempio: usa un torrent o un sito www per qualche secondo.
pt_br: Igualmente: outros nós I2P necessitam conhecer o seu roteador I2P para testá-lo em questões como alcançabilidade e capacidade. Leva tempo para outros nós conhecerem o seu nó. Será mais rápido se você usar a I2P e construir mais túneis, como usar um torrent ou www por algum tempo.

source: Performance Improvements
id: Peningkatan Kinerja
it: Miglioramenti alle prestazioni
pt_br: Ganhos de desempenho

source: For possible future performance improvements see <a href="%(future)s">Future Performance Improvements</a>.
id: Untuk peningkatan kinerja masa depan, lihat <a href="%(future)s">Perbaikan Kinerja Masa Depan</a> .
it: Per le possibili migliorie di performance future guarda su <a href="%(future)s">Migliorie di Performance in Arrivo</a>.
pt_br: Para os possíveis futuros ganhos de desempenho, ver <a href="%(future)s">Futuros Aperfeiçoamentos de Desempenho</a>.

source: Datastorage bounty
it: Dimensione dell'archiviazione dati
pt_br: Prêmio pelo sistema de armazenamento

source: I2PHex bounty
it: Dimensione I2PHex
pt_br: Prêmio pelo I2PHex

source: I2P in debian mirrors
it: I2P nei mirror di debian
pt_br: I2P nos repositórios do Debian

source: Current monthly running costs:
it: Costi attuali mensili d'esercizio:
pt_br: Custos correntes desse mês:

source: The Invisible Internet Project
it: Invisible Internet Project
pt_br: O Projeto Internet Invisível

source: Lance James (0x90) Interviewed by El País (original in Spanish) <a href="%(link)s">English translation</a> October 31, 2002.
it: Lance James (0x90) Intervistato da El País (originale in Spagnolo) <a href="%(link)s">Traduzione in Inglese</a> 31 Ottobre, 2002.
pt_br: Lance James (0x90) entrevistado pelo El País (original em espanhol). <a href="%(link)s">Tradução para o inglês</a>. 31 de Outubro de 2002.

source: <a href="%(link)s">2003 Business Week article referencing invisiblenet</a>
it: <a href="%(link)s">Articolo del 2003 su Business Week con riferimenti a invisiblenet</a>
pt_br: <a href="%(link)s">Artigo de 2003 da Business Week fazendo referência a InvisibleNET</a>

source: <a href="%(mp3)s">zzz interviewed on the InfoSec Daily Podcast Ep. 454 (mp3)</a> August 18, 2011
it: <a href="%(mp3)s">zzz intervista su InfoSec Daily Podcast, Episodio 454 (mp3)</a> 18 Agosto 2011
pt_br: <a href="%(mp3)s">zzz entrevistado no Episódio 454 do Podcast do InfoSec Daily (mp3)</a>, 18 de agosto de 2011.

source: <a href="%(mp3)s">zzz and Lance James interviewed on the InfoSec Daily Podcast Ep. 596 (mp3)</a> February 16, 2012
it: <a href="%(mp3)s">zzz e Lance James intervistati su InfoSec Daily Podcast, Episodio 596 (mp3)</a> 16 Febbraio 2012
pt_br: <a href="%(mp3)s">zzz e Lance James entrevistados no Episódio 596 do Podcast do InfoSec Daily (mp3)</a>, 16 de fevereiro de 2012.

source: Packager; Linux
it: Manutentore del pacchetto, Linux
pt_br: Empacotador: Linux

source: Packager; Windows
it: Manutentore del pacchetto, Windows
pt_br: Empacotador: Windows

source: Release Manager
it: Gestore delle versioni
pt_br: Reponsável pelas comunicações de lançamento

source: Update admin
it: Amministratore degli aggiornamenti
pt_br: Administrador de atualizações

source: Reseed admin
it: Amministratore della redistribuzione

source: threat model / crypto expert
it: modello degli attacchi / esperto di crittografia
pt_br: modelo de risco / perito em criptografia

source: Translation admins
it: Amministratori delle traduzioni
pt_br: Administradores de traduções

source: User Advocate
it: Difesa dell'utente

source: News Admin
it: Amministratore delle news
pt_br: Admin de notícias

source: Backup News Admin
it: Amministratore delle News di Backup

source: Director of passion
it: Direttore della passione
pt_br: Incentivador-chefe

source: Core Lead
it: Capo sviluppatore del core
pt_br: principal responsável pelo software-base

source: Susimail lead
it: Capo progettista di Susimail
pt_br: principal responsável pelo Susimail

source: Debian/Ubuntu Packager and PPA maintainer
it: Assemblatore del pacchetto per Debian/Ubuntu Packager e manutentore della PPA
pt_br: empacotador para Debian/Ubuntu e mantenedor de repositório PPA

source: Project lead, Syndie lead
it: Capo del progetto, capo progettista di Syndie
pt_br: principal responsável pelo Projeto e pelo Syndie

source: Project lead, Syndie lead, I2Phex, support guru
it: Capo del progetto, capo progettista di Syndie, I2Phex, guru di supporto
pt_br: principal responsável pelo Projeto e pelo Syndie, I2Phex, guru de suporte

source: iMule lead
it: Capo progettista di iMule
pt_br: principal responsável pelo iMule

source: I2Phex work
it: Lavoro su I2Phex
pt_br: trabalho no I2Phex

source: Python SAM library, attack simulations
it: Libreria Python di SAM, simulazioni di attacco

source: Syndie help
it: Aiuto di Syndie
pt_br: Ajuda do Syndie

source: i2p mail,susimail and susidns apps
it: Applicazioni i2p mail, susimail e susidns
pt_br: email i2p, susimail e susidns

source: addressbook,i2p-bt,syndie client
it: addressbook, i2p-bt, client di syndie
pt_br: livro de endereços, i2p-bt, cliente Syndie

source: encryption and signature routines, I2PIM
it: Funzioni di crittazione e firma, I2PIM
pt_br: criptografia e rotinas de assinatura, I2PIM

source: installer, systray, bogobot
it: installatore, systray, bogobot
pt_br: instalador, ícone na bandeja do sistema, bogobot

source: SAM perl module
it: Modulo perl di SAM

source: i2psnark work
it: Lavoro su i2psnark
pt_br: trabalho no i2psnark

source: java cleanup
it: Pulizia codice java

source: C# SAM library, pants, fortuna integration
it: libreria C# di SAM, pants, integrazione di: fortuna

source: Console and website themes
it: Temi della console e del sito web
pt_br: Temas para o website e para o painel do roteador

source: Network database tuning
it: Affinamento del database di rete

source: Native math
it: Matematica nativa
pt_br: Matemática nativa

source: Garlic wrapping a "reply" LeaseSet
it: Garlic incapsula una "risposta" LeaseSet

source: Adjust the tunnel testing
it: Impostazione del tunnel di prova
pt_br: Ajustar o teste de túnel

source: Persistent Tunnel / Lease Selection
it: Tunnel persistente / Scelta della locazione

source: Hall Of Fame
pt_br: Salão da Fama

source: Bounty Robert
pt_br: Prêmio pelo Robert

source: Bounty Syndie
pt_br: Prêmio pelo Syndie

source: Android lead
pt_br: principal responsável pelo Android

source: Console
pt_br: Painel

source: I2Pd lead
pt_br: principal responsável pelo I2Pd
