Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: id, it, pt_br

source: The idea for this event was first spawned by our wonderful friends at <a href="https://torontocrypto.org/">Toronto Crypto</a>. The venue was provided by <a href="https://hacklab.to/">Hacklab.to</a>. The marketing was spearheaded by <a href="https://twitter.com/YrB1rd">@YrB1rd</a> and Siew. Without them this event would not have been possible.
id: Ide untuk acara ini adalah pertama dilahirkan oleh teman-teman kita yang luar biasa di <a href="https://torontocrypto.org/">Toronto Crypto</a>. Tempat disediakan oleh <a href="https://hacklab.to/">Hacklab.to</a>. Pemasaran ini dipelopori oleh <a href="https://twitter.com/YrB1rd">@YrB1rd</a> dan Siew. Tanpa mereka acara ini akan tidak mungkin dilaksanakan.

source: Slides and Video
id: Slide dan Video

source: Slides are also available as an in-I2P torrent.
id: Slide juga tersedia sebagai torrent dalam I2P.

source: Note: Video links will be posted as they become available.
id: Catatan: Tautan video akan diposkan saat tersedia.

source: Note that in-I2P torrents may also be available on the clearnet due to bridging by Vuze clients.
id: Perhatikan bahwa torrents in-I2P mungkin juga tersedia di clearnet karena menjembatani klien Vuze.

source: Licenses
id: Lisensi

source: All videos are by z3r0fox.
id: Semua video dimiliki oleh z3r0fox.

source: License
id: Lisensi

source: Slides by psi: Public domain.
id: Slide oleh psi: adalah public domain.

source: Slides by str4d and zzz:
id: Slide oleh str4d dan zzz:

source: Slides by others: Contact the author for license information.
id: Slide oleh orang lain: Hubungi penulis untuk informasi lisensi.

source: Speakers
id: Pembicara

source: Colin Mahns has a strong interest in the use of anonymity and encryption technology to help preserve human rights in the digital age.
id: Colin Mahns memiliki minat yang kuat dalam penggunaan teknologi anonimitas dan enkripsi untuk membantu melestarikan hak asasi manusia di era digital.

source: David Dagon is a postdoc researcher at Georgia Tech focused on botnets, malware, network security, and DNS. His interest in I2P is centered on preserving user privacy, autonomous filtering, and anti-abuse.
id: David Dagon adalah peneliti postdoc di Georgia Tech yang berfokus pada botnet, malware, keamanan jaringan, dan DNS. Minatnya I2P berpusat pada menjaga privasi pengguna, penyaringan otonom, dan anti-pelecehan.

source: More info
id: Info lebih lanjut

source: J is the head of Toronto Crypto.
id: J adalah kepala Toronto Crypto.

source: Lance James is the founder of the Invisibile IRC Project, the predecessor to I2P, back in 2002. He founded his own cyber threat intelligence company in 2003. He's been focused on network security, malware research, and information security ever since. During 2011-2013, he was Director of Threat Intelligence for The Vigilant, which was acquired by Deloitte in 2013. He recently left Deloitte to do consulting through his company The James Group.
id: Lance James adalah pendiri dari Invisibile IRC Project, pendahulu I2P, pada tahun 2002. Dia mendirikan perusahaan intelijen cyber pada tahun 2003. Dia sudah terfokus pada keamanan jaringan, penelitian malware dan keamanan informasi sejak. Selama 2011-2013, ia adalah Direktur intelijen ancaman untuk The Vigilant, yang diakuisisi oleh Deloitte pada tahun 2013. Ia baru saja meninggalkan Deloitte untuk melakukan konsultasi melalui perusahaannya: The James Group.

source: Nicholas D. is a member of Hacklab Toronto.
id: Nicholas D. adalah anggota Hacklab Toronto.

source: Nicholas Johnston is a Professor of Information Security in Sheridan College's School of Applied Computing in the InfoSec Bachelor's degree program. His previous professional career was in digital forensics and investigations. He is also a contractor specializing in incident response. His research areas include secure software development and data analytics.
id: Nicholas Johnston adalah profesor informasi keamanan di Sheridan College's School of Applied Computing di program sarjana S1 InfoSec. Karier profesional sebelumnya adalah digital forensik dan investigasi. Dia juga adalah kontraktor yang berspesialisasi di respon kejadian Daerah penelitiannya termasuk analisis data dan pengembangan perangkat lunak yang aman.

source: Psi is an I2P developer.
id: Psi adalah pengembang I2P.

source: Str4d is an I2P developer.
id: Str4d adalah pengembang I2P.

source: Zzz is an I2P developer.
id: ZZZ adalah pengembang I2P.

source: Press
id: Untuk Press

source: Toronto Star article on Nicholas Johnston's talk
id: artikel Toronto Star tentang diskusi oleh Nicholas Johnston

source: Day 1
id: Hari 1

source: Talk
id: Diskusi

source: Presenter
id: Pembicara

source: Slides
id: Slide

source: Day 2
id: Hari 2

source: The first conference dedicated to I2P was held in Toronto on August 15-16, 2015. See the link below for more information and links to slides and videos. We hope to host another conference in Toronto in Summer 2016.
id: Konferensi pertama didedikasikan untuk I2P diadakan di Toronto pada 15-16 Agustus 2015. Lihat link di bawah untuk informasi lebih lanjut dan link ke slide dan video. Kami berharap untuk mengadakan konferensi lain di Toronto pada musim panas 2016.

source: Past years
id: Tahun-tahun sebelumnya

source: Future Performance Improvements
id: Penyempurnaan kinerja di masa depan
it: Futuri miglioramenti delle prestazioni
pt_br: Futuros aperfeiçoamentos de desempenho

source: August 2010
id: Agustus 2010
it: Agosto 2010
pt_br: Agosto de 2010

source: There are a few major techniques that can be done to improve the perceived performance of I2P - some of the following are CPU related, others bandwidth related, and others still are protocol related. However, all of those dimensions affect the latency, throughput, and perceived performance of the network, as they reduce contention for scarce resources. This list is of course not comprehensive, but it does cover the major ones that are seen.
id: Ada beberapa teknik utama yang dapat dilakukan untuk meningkatkan kinerja I2P - seperti yang terkait dengan CPU, yang terkait bandwidth, dan yang terkait protokol. Namun, semua dimensi tersebut mempengaruhi latensi, throughput, dan kinerja jaringan yang dirasakan, karena mengurangi pertengkaran sumber daya yang langka. Daftar ini tentu tidak komprehensif, tapi sudah mencakup hal-hal yang utama.
it: Ci sono alcune tecniche principali che si possono usare per aumentare le prestazioni percepite di I2P: alcune delle seguenti sono relative alla CPU, altre alla larghezza di banda, ed altre ancora al protocollo. Comunque, tutte influiscono sulla latenza, sulla velocità di trasmissione, e sulla prestazioni percepite della rete, perché riducono la lotta per le scarse risorse. Questa lista non è ovviamente esaustiva, ma copre le principali tecniche che si possono usare.

source: For past performance improvements see the <a href="%(history)s"> Performance History</a>.
id: Untuk perbaikan kinerja masa lalu, lihat <a href="%(history)s">Riwayat kinerja</a>.
it: Per conoscere i miglioramenti alle prestazioni apportati in passato, consulta lo <a href="%(history)s">Storico delle prestazioni</a>.
pt_br: Para os ganhos de desempenho conquistados, ver o <a href="%(history)s">Histórico de Desempenho</a>.

source: Better peer profiling and selection
id: Pembuatan profil dan seleksi peer yang lebih baik
it: Miglior profilo e selezione dei peer
pt_br: Melhor determinação de perfis e seleção de pares

source: Probably one of the most important parts of getting faster performance will be improving how routers choose the peers that they build their tunnels through - making sure they don't use peers with slow links or ones with fast links that are overloaded, etc. In addition, we've got to make sure we don't expose ourselves to a <a href="%(sybilpdf)s">Sybil</a> attack from a powerful adversary with lots of fast machines.
id: Mungkin salah satu bagian yang paling penting dari mendapatkan kinerja yang lebih cepat adalah meningkatkan cara router memilih peer yang di mana mereka membangun tunnel - memastikan mereka tidak menggunakan peer dengan link lambat atau peer dengan link cepat yang kelebihan beban, dll. Selain itu, kita harus memastikan bahwa kami tidak membuka diri terhadap serangan <a href="%(sybilpdf)s">Sybil</a> dari musuh yang kuat dengan banyak komputer yang cepat.
it: Probabilmente una delle strategie più importanti per aumentare le prestazioni è migliorare come i router scelgono i peer tramite cui costruire il percorso dei tunnel: assicurati che i router non usino peer con collegamenti lenti, né quelli che abbiano collegamenti veloci ma sovraccarichi, ecc. In aggiunta, assicurati di non esporti ai tipi di attacco <a href="%(sybilpdf)s">Sybil</a> perpetrati da un avversario potente che ha a disposizione molti elaboratori veloci.

source: We're going to want to be more efficient with the network database's healing and maintenance algorithms - rather than constantly explore the keyspace for new peers - causing a significant number of network messages and router load - we can slow down or even stop exploring until we detect that there's something new worth finding (e.g. decay the exploration rate based upon the last time someone gave us a reference to someone we had never heard of). We can also do some tuning on what we actually send - how many peers we bounce back (or even if we bounce back a reply), as well as how many concurrent searches we perform.
id: Kita akan ingin untuk menjadi lebih efisien dengan algoritma penyembuhan database dan pemeliharaan - daripada terus-menerus menjelajahi keyspace untuk peer baru - menyebabkan sejumlah besar pesan jaringan dan beban router - kita dapat memperlambat atau bahkan berhenti menjelajahi sampai mendeteksi yang ada sesuatu yang baru yang bernilai (misalnya decay dari tingkat eksplorasi berdasarkan terakhir kali seseorang memberi kami rujukan kepada seseorang yang kami belum pernah dengar). Kita juga dapat melakukan beberapa tuning pada apa benar-benar kita kirimkan - berapa banyak peer yang bounce back (atau bahkan jika kita bounce back balasan), serta seberapa banyak kita melakukan pencarian simultan.
it: Vorremmo rendere più efficienti gli algoritmi di manutenzione e salute del database della rete, invece di esplorare costantemente la keyspace per nuovi peer: ciò infatti causa incrementa significativamente il numero di messaggi di rete e il carico del router. Possiamo rallentare o anche fermare l'esplorazione fino a che ci accorgiamo che c'è qualcosa di nuovo che val la pena di essere trovato (p. es. diminuire il tasso di esplorazione, basato sull'ultima occasione in cui qualcuno ci ha indicato qualcun altro di cui non sappiamo nulla). Possiamo anche affinare quello che inviamo correntemente: quanti peer rimandiamo indietro (o anche se rimandiamo indietro una risposta), così come quante ricerche effettuiamo in contemporanea.

source: Session Tag Tuning and Improvements
id: Session Tag Tuning and Penyempurnaan
it: Miglioramenti e affinamento del tag di sessione

source: The way the <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algorithm works is by managing a set of random one-time-use 32 byte arrays, and expiring them if they aren't used quickly enough. If we expire them too soon, we're forced to fall back on a full (expensive) ElGamal encryption, but if we don't expire them quickly enough, we've got to reduce their quantity so that we don't run out of memory (and if the recipient somehow gets corrupted and loses some tags, even more encryption failures may occur prior to detection). With some more active detection and feedback driven algorithms, we can safely and more efficiently tune the lifetime of the tags, replacing the ElGamal encryption with a trivial AES operation.
id: Cara <a href="%(elgamalaes)s">ElGamal / AES + SessionTag</a> algoritma bekerja adalah dengan mengelola serangkaian 32 byte array acak satu-kali-digunakan, dan hal itu menjadi kadaluarsa jika tidak digunakan dengan cukup cepat. Jika kita mengakhiri mereka terlalu cepat, kita dipaksa untuk kembali kepada enkripsi ElGamal penuh (mahal), tapi jika kita tidak membuat mereka kedaluwarsa dengan cukup cepat, kita harus mengurangi jumlah mereka sehingga kita tidak kehabisan memori (dan jika penerima entah bagaimana rusak dan kehilangan beberapa tag, bahkan lebih banyak kegagalan enkripsi mungkin terjadi sebelum deteksi). Dengan deteksi lebih aktif dan umpan balik yang didorong algoritma, kita bisa dengan aman dan lebih efisien mengelola masa waktu tag, menggantikan enkripsi ElGamal dengan operasi trivial AES .
it: L'algoritmo <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> funziona gestendo un insieme di array di 32 byte, utilizzabili solo una volta, eliminandoli se non sono rapidamente usati. Se eliminiamo questi array troppo presto, siamo costretti a una nuova ricodifica di tipo ElGamal, che è dispendiosa; d'altra parte, se non li eliminiamo abbastanza velocemente, dobbiamo ridurre la loro quantità, per non occupare troppa memoria (ed evitare che, se il destinatario presenta errori e perde alcune etichette, ulteriori errori di codifica occorrano primo di essere trovati). Possiamo, in sicurezza e con maggiore efficienza, migliorare la durata delle etichette, utilizzando rilevazioni attive e algoritmi di feedback: ciò si ottiene rimpiazzando la codifica ElGamal con una più banale AES.

source: Additional ideas for improving Session Tag delivery are described on the <a href="%(elgamalaes)s#future">ElGamal/AES+SessionTag page</a>.
id: Ide-ide tambahan untuk meningkatkan pengiriman sesi Tag dijelaskan pada <a href="%(elgamalaes)s#future">ElGamal / AES + SessionTag halaman</a>.
it: Altre idee su come migliorare la spedizione di etichette di sessione sono descritte qui: <a href="%(elgamalaes)s#future">Pagina di ElGamal/AES+SessionTag</a>.

source: Migrate sessionTag to synchronized PRNG
id: Memigrasi sessionTag ke PRNG tersinkronisasi
it: Migrare sessionTag per sincronizzare PRNG

source: Right now, our <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algorithm works by tagging each encrypted message with a unique random 32 byte nonce (a "session tag"), identifying that message as being encrypted with the associated AES session's key. This prevents peers from distinguishing messages that are part of the same session, since each message has a completely new random tag. To accomplish this, every few messages bundle a whole new set of session tags within the encrypted message itself, transparently delivering a way to identify future messages. We then have to keep track of what messages are successfully delivered so that we know what tags we may use.
id: Sekarang, algoritma <a href="%(elgamalaes)s">ElGamal / AES + SessionTag</a> bekerja dengan tagging setiap pesan terenkripsi dengan unique random 32 byte ("session tag"), yang mengidentifikasi bahwa pesan dienkripsi dengan session key AES terkait. Hal ini mencegah peer dari membedakan pesan-pesan yang merupakan bagian dari sesi yang sama karena setiap pesan memiliki tag acak yang benar-benar baru. Untuk mencapai hal ini, setiap beberapa pesan menggabungkan keseluruhan tag sesi baru dalam pesan terenkripsi itu sendiri, secara transparan memberikan cara untuk mengidentifikasi pesan di masa mendatang. Kami kemudian harus melacak pesan yang berhasil dikirim sehingga kami tahu tag apa yang dapat digunakan.
it: Adesso, il nostro algoritmo <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> lavora etichettando ogni messaggio cifrato con un numero casuale unico di 32, di tipo nonce (una "etichetta di sessione"), che identifica quel messaggio come codificato con la chiave di sessione AES associata. Questo impedisce ai peer di distinguere i messaggi che appartengono alla stessa sessione, visto che ogni messaggio possiede una etichetta casuale completamente nuova. Per far questo, l'algoritmo impacchetta pochi messaggi alla volta ed usa un nuovo insieme di etichette di sessione, all'interno dello stesso messaggio codificato, inviando così, in modo trasparente, un metodo per identificare i messaggi futuri. In seguito bisogna tener traccia di quali messaggi sono stati inviati con successo, per sapere quali etichette possiamo usare.

source: This works fine and is fairly robust, however it is inefficient in terms of bandwidth usage, as it requires the delivery of these tags ahead of time (and not all tags may be necessary, or some may be wasted, due to their expiration). On average though, predelivering the session tag costs 32 bytes per message (the size of a tag). As Taral suggested though, that size can be avoided by replacing the delivery of the tags with a synchronized PRNG - when a new session is established (through an ElGamal encrypted block), both sides seed a PRNG for use and generate the session tags on demand (with the recipient precalculating the next few possible values to handle out of order delivery).
id: Ini bekerja dengan baik dan cukup berguna, namun ini tidak efisien dalam penggunaan bandwidth, karena memerlukan pengiriman tag terlebih dahulu (dan tidak semua tag mungkin diperlukan, atau beberapa mungkin terbuang akibat mereka menjadi kadaluarsa). Rata-rata, predelivering tag sesi memiliki biaya 32 byte per pesan (ukuran tagnya). Seperti yang disarankan oleh Taral, ukuran sebesar itu dapat dihindari dengan mengganti pengiriman tag dengan sebuah PRNG disinkronisasi - ketika sesi baru dimulai (melalui blok dienkripsi oleh ElGamal), kedua belah pihak seed sebuah PRNG untuk digunakan dan menghasilkan session tag on demand (dengan penerima precalculating berikutnya beberapa nilai yang mungkin untuk menangani pengiriman).
it: Questo funziona bene ed è abbastanza robusto, però è inefficiente per quanto riguarda l'uso della larghezza di banda, perché richiede la spedizione delle etichette in anticipo (e non tutte le etichette sono sempre necessarie: alcune possono anche essere sprecate, a causa della loro breve durata). Comunque, mediamente, la spedizione anticipata dell'etichetta di sessione costa 32 byte per ogni messaggio (cioè la dimensione di un'etichetta). Tuttavia, Taral ha suggerito che la dimensione può essere evitata rimpiazzando la spedizione delle etichette con un PRNG sincronizzato: quando si stabilisce una nuova sessione (attraverso un blocco codificato con ElGamal), entrambi i lati diffondono un PRNG da usare e generano le etichette di sessione su richiesta (con il ricevente che calcola anticipatamente i possibili valori futuri per gestire un invio non ordinato).

source: Longer lasting tunnels
id: Tunnel yang bertahan lebih lama
it: Tunnel di lunga durata

source: The current default tunnel duration of 10 minutes is fairly arbitrary, though it "feels okay". Once we've got tunnel healing code and more effective failure detection, we'll be able to more safely vary those durations, reducing the network and CPU load (due to expensive tunnel creation messages).
id: Durasi default tunnel saat ini 10 menit cukup arbritrary, meski "terasa oke". Begitu kita mendapat tunnel healing code dan deteksi kegagalan yang lebih efektif, kita akan bisa lebih aman memvariasikan durasi, mengurangi beban jaringan dan CPU (karena penciptaan message tunnel yang mahal).
it: La durata attuale predefinita di un tunnel - 10 minuti - è del tutto arbitraria, anche se "sembra ok". una volta che avremo un codice che risani il tunnel e una rilevazione dei malfunzionamenti più efficace, saremo in grado di variare questa durata con maggior sicurezza, riducendo il carico della rete e della CPU (a causa dei messaggi di creazione tunnel, avidi di risorse).

source: This appears to be an easy fix for high load on the big-bandwidth routers, but we should not resort to it until we've tuned the tunnel building algorithms further. However, the 10 minute tunnel lifetime is hardcoded in quite a few places, so substantial effort would be required to change the duration. Also, it would be difficult to maintain backward compatibility with such a change.
id: Ini tampaknya merupakan perbaikan yang mudah untuk beban tinggi pada router dengan bandwidth besar, namun kami sebaiknya tidak menggunakannya sampai kami telah menyempurnakan algoritma pengembangan tunnel lebih jauh. Namun, 10 menit umur tunnel adalah hardcoded di beberapa tempat, sehingga upaya substansial akan diperlukan untuk mengubah durasi. Juga, akan sulit untuk menjaga kompatibilitas dengan perubahan seperti itu.
it: Questo sembra una facile soluzione per elevati carichi su router con ampia larghezza di banda, ma non possiamo ricorrere a ciò fino a che non avremo affinato maggiormente gli algoritmi di costruzione del tunnel. Comunque, il ciclo di vita di 10 minuti del tunnel è codificato in molti punti, pertanto un notevole impegno sarebbe richiesto per modificare la durata. Inoltre, sarebbe difficile mantenere la retrocompatibilità con una tale modifica.

source: Currently, since the network average tunnel build success rate is fairly high, there are no current plans to extend tunnel lifetime.
id: Saat ini, karena rata-rata tingkat keberhasilan pembangunan jaringan tunnel cukup tinggi, tidak ada rencana saat ini untuk memperpanjang umur tunnel.
it: Attualmente, siccome la media delle percentuali di successo nella creazione di tunnel della rete è piuttosto alta, non abbiamo pianificato di estendere la durata dei tunnel.

source: Adjust the timeouts
id: Adjust the timeout
it: impostare i timeout
pt_br: Acertar os tempos-de-vida

source: Yet another of the fairly arbitrary but "okay feeling" things we've got are the current timeouts for various activities. Why do we have a 60 second "peer unreachable" timeout? Why do we try sending through a different tunnel that a LeaseSet advertises after 10 seconds? Why are the network database queries bounded by 60 or 20 second limits? Why are destinations configured to ask for a new set of tunnels every 10 minutes? Why do we allow 60 seconds for a peer to reply to our request that they join a tunnel? Why do we consider a tunnel that doesn't pass our test within 60 seconds "dead"?
id: Namun, hal lain yang cukup arbritrary namun "rasanya oke" yang kita dapatkan adalah timeout saat ini untuk berbagai aktivitas. Mengapa kita memiliki timeout 60 detik untuk "peer unreachable"? Mengapa kita mencoba mengirimkan sebuah pesan melalui tunnel yang berbeda yang diiklankan oleh LeaseSet setelah 10 detik? Mengapa query database jaringan dibatasi oleh batas-batas 60 atau 20 detik? Mengapa destinasi dikonfigurasi untuk meminta serangkaian tunnel baru setiap 10 menit? Mengapa kita memperbolehkan 60 detik untuk peer untuk membalas permintaan kami bahwa mereka bergabung dengan sebuah tunnel? Mengapa kita menganggap sebuah tunnel yang tidak lulus tes kami dalam waktu 60 detik dianggap "mati"?
it: I timeout attuali per varie attività sono un altro esempio di impostazioni abbastanza arbitrarie ma che "sembrano ok". Perché abbiamo un timeout di 60 secondi per il "peer irraggiungibile"? Perché cerchiamo di inviare, dopo 10 secondi, attraverso un tunnel diverso che ci mostra un LeaseSet? Perché le richieste al database di rete hanno un limite temporale di 20 o 60 secondi? Perché le destinazioni sono impostate per richiedere un nuovo insieme di tunnel ogni 10 minuti? Perché concediamo 60 secondi ad un peer per rispondere alla nostra richiesta di unirsi al tunnel? Perché consideriamo "morto" un tunnel che non supera i nostri test entro 60 secondi?
