Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: id, it, pt_br

source: Alternative I2P clients
id: Cient I2P alternatif

source: The main I2P client implementation uses Java. If for some reason you can't use Java on your device, there are alternative implementations developed by community members.
id: Implementasi client I2P utama menggunakan Java. Jika karena suatu alasan tertentu anda tidak dapat menggunakan Java di perangkat anda, ada beberapa alternatif implementasi yang dikembangkan oleh anggota komunitas.

source: <a href="%(i2pd)s">i2pd</a> is a I2P client implementation in C++. As of early 2016, i2pd is became stable enough to be used in production, and since summer 2016 it fully implements all I2P APIs.
id: <a href="%(i2pd)s">I2pd</a> adalah implementasi client I2P di C++. Pada awal 2016, i2pd menjadi cukup stabil untuk digunakan dalam produksi, dan sejak musim panas 2016, semua API I2P sepenuhnya diterapkan.

source: <a href="%(kovri)s">Kovri</a> is active i2pd fork developed for Monero cryptocurrency.
id: <a href="%(kovri)s">Kovri</a> adalah fork aktif i2pd yang dikembangkan untuk cryptocurrency Monero.

source: <a href="%(go_i2p)s">Go-I2P</a> is I2P client developed using the <a href="%(golang)s">Go</a> programming language. The project is in early development.
id: <a href="%(go_i2p)s">Go-I2P</a> adalah lient I2P yang dikembangkan menggunakan bahasa pemrograman <a href="%(golang)s">Go</a> . Proyek ini masih dalam perkembangan awal.

source: Web Browser Configuration
id: Konfigurasi Web Browser
it: Configurazione del browser web
pt_br: Configuração do navegador web

source: Your web browser will need to be configured in order to browse eepsites and to utilize the outproxies available within I2P. Below are walkthroughs for some of the most popular browsers.
id: Web browser anda perlu dikonfigurasi untuk menelusuri eepsites dan memanfaatkan outproxy yang tersedia di dalam I2P. Berikut adalah panduan untuk beberapa browser terpopuler.
it: Devi configurare il tuo browser web per nevigare negli eepsites e per usare i proxy di uscita disponibili su I2P. A seguire troverai le guide passo-passo per alcuni dei più popolari browser.
pt_br: O seu navegador web precisará ser configurado para poder exibir eepsites e para utilizar os proxies de saída disponíveis na I2P. Seguem abaixo orientações para alguns dos navegadores mais populares.

source: How to configure your browser
id: Bagaimana mengkonfigurasikan browser anda
it: Come configurare il tuo browser
pt_br: Como configurar o seu navegador

source: Outproxy Terms Of Service
id: Ketentuan Layanan Outproxy
it: Termini del servizio dei proxy di uscita
pt_br: Termos de serviço do proxy de saída

source: Internet Explorer 8 or Chrome
id: Internet Explorer 8 atau Chrome
it: Internet Explorer 8 o Chrome
pt_br: Internet Explorer 8 ou Chrome

source: In the tools menu select the "Internet Options" line to open the settings. In the settings window choose the connections tab and click on LAN settings for the proxy port configuration.
id: Pada menu tools pilih "Internet Options" untuk membuka setting. Pada jendela setting pilih tab connection dan klik pada LAN Setting untuk konfigurasi port proxy.
it: Nel menu strumenti seleziona "Opzioni Internet" per aprire le impostazioni. Nella finestra impostazioni scegli la scheda "Connessioni" e premi "Impostazioni LAN" per configurare la porta del proxy.
pt_br: No menu ferramentas selecione a linha "Opções de Internet" para abrir as configurações. Na janela de configurações escolha a aba conexões e clique em configurações de LAN para a configuração da porta proxy.

source: IE Internet Options
id: Opsi Internet IE
it: Opzioni Internet di Internet Explorer
pt_br: Opções de Internet do IE

source: Now set the checkmark at "use a proxy server for your LAN" and at the "Bypass proxy server for local addresses". With a click on Advanced-button you open the window to open the ports. Enter the values like on the picture, IP 127.0.0.1 and port 4444 for HTTP, port 4445 for HTTPS. With clicks on OK you save the settings and your browser is set to use the I2P proxy. <b>Note/Privacy tip:</b> Set the FTP proxy to the same settings as the HTTP proxy.
id: Sekarang centang di "use a proxy server for your LAN" dan di "Bypass proxy server for local addresses". Dengan sekali klik pada tombol Advanced, anda membuka jendela untuk membuka port. Masukkan nilai seperti pada gambar, IP 127.0.0.1 dan port 4444 untuk HTTP, port 4445 untuk HTTPS. Dengan klik pada OK, anda menyimpan pengaturan dan browser anda diatur untuk menggunakan proxy I2P. <b>Catatan/tip Privasi:</b> Tetapkan proxy FTP ke setting yang sama seperti proxy HTTP.
pt_br: Marque agora a caixa de seleção "Usar um servidor proxy para a rede local" e também "Não usar servidor proxy para endereços locais". Com um clique no botão Avançadas você abre a janela para especificar as portas. Forneça os valores como na figura, IP 127.0.0.1 com porta 4444 para HTTP e com porta 4445 para HTTPS. Com cliques em OK você salva as configurações e o seu navegador está pronto para usar o proxy I2P. <b>Nota/Dica de privacidade:</b> Especifique para o proxy de FTP as mesmas especificações fornecidas para o proxy de HTTP.

source: IE Proxy Settings
id: Setting Proxy IE
it: Impostazioni del proxy di Internet Explorer
pt_br: Configurações de proxy no IE

source: From the Tools menu, select Options to bring up the Firefox settings panel. Click the icon labelled <em>Advanced</em>, then click on the <em>Network</em> tab. In the <em>Connections</em> section, click on the Settings button. You'll see a Window like the following:
id: Di menu Tools, pilih Options untuk menampilkan panel setting di Firefox. Klik ikon berlabel <em>Advanced</em> , lalu klik pada tab <em>Network</em> . Di bagian <em>Connections</em> , klik pada tombol Settings. Anda akan melihat Jendela seperti berikut ini:
it: Dal menu strumenti, selezionare "Opzioni" per mostrare il pannello delle impostazioni di Firefox. Premi l'icona "<em>Impostazioni avanzate</em>", poi seleziona la scheda <em>Rete</em>. Nella sezione <em>Connessioni</em>, premi il bottone "impostazioni". Comparirà una finestra simile a questa:
pt_br: No menu 'Editar', clique em 'Preferências'. Clique no ícone 'Avançado' e, então, clique na aba 'Rede'. Na seção 'Conexão', clique no botão 'Configurar conexão...' Você verá uma janela como a seguinte:

source: Firefox Network Options
id: Opsi Jaringan Firefox
it: Opzioni di rete di Firefox
pt_br: Opções de rede no Firefox

source: In the <em>Connection Settings</em> window, click the circle next to <em>Manual proxy configuration</em>, then enter 127.0.0.1, port 4444 in the HTTP Proxy field. Enter 127.0.0.1, port 4445 in the SSL Proxy field. Be sure to enter localhost and 127.0.0.1 into the "No Proxy for" box. <b>Note/Privacy tip:</b> Set the FTP proxy to the same settings as the HTTP proxy.
id: Di jendela <em>Connection Settings</em> , klik lingkaran di samping <em>Manual</em> Konfigurasi proxy </em>, lalu masukkan 127.0.0.1, port 4444 di bidang HTTP Proxy. Masukkan 127.0.0.1, port 4445 di isian SSL Proxy. Pastikan untuk memasukkan localhost dan 127.0.0.1 ke dalam kotak "No Proxy for". <b>Catatan/tip Privasi:</b> Tetapkan proxy FTP ke setting yang sama seperti proxy HTTP.
pt_br: Na janela <em>Configurar conexão</em>, clique no círculo próximo a <em>Configuração manual de proxy</em>, e então entre com 127.0.0.1, porta 4444 no campo Proxy HTTP. Entre com 127.0.0.1, porta 4445 no campo Proxy SSL. Não esqueça de entrar com localhost e 127.0.0.1 na caixa "Sem proxy para". <b>Nota/dica de privacidade:</b> Especifique para o proxy de FTP as mesmas definições usadas para o proxy de HTTP.

source: Firefox Proxy Settings
id: Setting Proxy Firefox
it: Impostazioni del proxy di Firefox
pt_br: Configurações de proxy no Firefox

source: From the <em>Settings</em> menu, select <em>Configure Konqueror</em>. In the Web Browsing group on the left side, select Proxy, then select the option "Use manually specified proxy configuration" on the right.
id: Dari menu <em>Settings</em> , pilih <em>Configure Konqueror</em> . Di grup Web Browsing di sisi kiri, pilih Proxy, lalu pilih opsi "Use specific specified proxy configuration" di sebelah kanan.
pt_br: A partir do menu <em>Configurações</em>, selecione <em>Configurar o Konqueror</em>. No grupo <em>Navegação Web</em>, no lado esquerdo, selecione Proxy e, então, a opção "Usar a configuração de proxy especificada manualmente", no lado direito.

source: Konqueror Proxy Options
id: Opsi Proxy Konqueror
it: Opzioni del proxy di Konqueror
pt_br: Opções de proxy no Konqueror

source: Enter 127.0.0.1 and port 4444 into the HTTP box. Enter 127.0.0.1 and port 4445 into HTTPS box. Enter <code>127.0.0.1,localhost</code> into the Exceptions box. Click Apply then OK to close the configuration window. <b>Note/Privacy tip:</b> Set the FTP proxy to the same settings as the HTTP proxy.
id: Masukkan 127.0.0.1 dan port 4444 ke dalam kotak HTTP. Masukkan 127.0.0.1 dan port 4445 ke dalam kotak HTTPS. Masukkan <code>127.0.0.1,localhost</code> ke dalam kotak Exceptions. Klik Apply lalu OK untuk menutup jendela konfigurasi. <b>Catatan/tip Privasi:</b> Tetapkan proxy FTP ke setting yang sama seperti proxy HTTP.
pt_br: Entre com 127.0.0.1 e porta 4444 na caixa HTTP. Entre com 127.0.0.1 e porta 4445 na caixa HTTPS. Entre com <code>127.0.0.1,localhost</code> na caixa Exceções. Clique em Aplicar e então em OK para fechar a janela de configuração. <b>Nota/dica de privacidade:</b> Especifique para o proxy de FTP as mesmas definições usadas para o proxy de HTTP.

source: Remember: I2P was not designed for creating proxies to the outer Internet. Instead, it is meant to be used as an internal network.
id: Ingat: I2P tidak dirancang untuk membuat proxy ke Internet luar. Sebagai gantinya, I2p dimaksudkan untuk digunakan sebagai jaringan internal.
it: Ricorda che I2P non è progettato per creare proxy che accedano ad Internet. È stato invece concepito per essere usato come una rete interna.
pt_br: Lembre-se: A I2P não foi projetada para a criação de proxies para a internet exterior. Em vez disso, pretende ser utilizada como uma rede interna.

source: <p><b>The I2P project itself does not run any proxies to the Internet.</b> The only outproxy is a service from the privacy solutions project. Consider donating to them for a continued stable service. Higher bandwidth will increase with the founding of the organization. Maybe more outproxies too.</p> <a href="http://privacysolutions.no" target="_blank">http://privacysolutions.no</a>
id: <p> <b>Proyek I2P sendiri tidak menjalankan proxy ke Internet.</b> Satu-satunya outproxy adalah layanan dari proyek solusi privasi. Pertimbangkan untuk memberi donasi kepada mereka untuk layanan yang stabil. Bandwidth yang lebih tinggi akan meningkat sejalan dengan berdirinya organisasi. Mungkin lebih banyak outproxies juga. </p> <a href="http://privacysolutions.no" target="_blank">http://privacysolutions.no</a>
pt_br: <p><b>O projeto I2P não mantém em funcionamento, por sua conta, quaisquer proxies para a Internet.</b> O único proxy de saída é um serviço do <i>projeto soluções para privacidade</i>. Considere fazer uma doação a eles para que continuem a oferecer um serviço estável. A largura de banda aumentará com o financiamento da organização. Talvez o número de proxies de saída também.</p> <a href="http://privacysolutions.no" target="_blank">http://privacysolutions.no</a>

source: By default, I2P comes with two outproxies configured: <code>%(http)s</code> and <code>%(https)s</code>. Even the domain names are different, it's the same outproxy you hit. (multi-homed/keyed for better performance)
id: Secara default, I2P dilengkapi dengan dua outproxies yang dikonfigurasi: <code>%(http)s</code> dan <code>%(https)s</code> . Walau nama domainnya berbeda, itu adalah outproxy yang sama dengan yang dipilih. (Multi-homed/keyed untuk kinerja yang lebih baik)
pt_br: Por padrão, o roteador I2P vem com dois proxies de saída configurados: <code>%(http)s</code> e <code>%(https)s</code>. Ainda que os nomes de domínio sejam diferentes, o proxy de saída que você se conecta é o mesmo. (multi-homed/keyed para um desempenho melhor)

source: Filtering is active on these outproxies (for example, mibbit and torrent tracker access is blocked). Eepsites that are accessible via .i2p addresses are also not allowed via the outproxies. As a convenience, the outproxy blocks ad servers.
id: Filter aktif pada outproxies ini (misalnya akses mibbit dan torrent tracker diblokir). Eepsites yang dapat diakses melalui alamat .i2p juga tidak diperbolehkan melalui outproxies. Demi kenyamanan, outproxy memblokir server iklan.
pt_br: A filtragem encontra-se ativada nesses proxies de saída (por exemplo, o acesso do Mibbit e de trackers de torrent é bloqueado!) Eepsites que são acessíveis via endereços .i2p não são também permitidos via tais proxies de saída. Como uma conveniência, o proxy de saída bloqueia servidores de anúncios!

source: <a href="https://www.torproject.org">Tor</a> is good application to use as an outproxy to the Internet.
id: <a href="https://www.torproject.org">Tor</a> adalah aplikasi yang baik untuk digunakan sebagai sebuah outpxory ke Internet.
it: <a href="https://www.torproject.org">Tor</a> è un buon programma da usare come proxy di uscita su Internet.
pt_br: O <a href="https://www.torproject.org">Tor</a> é uma boa aplicação para ser usada como um proxy de saída para a Internet.

source: Glossary
id: Glosarium
it: Glossario
pt_br: Glossário

source: This page lists often-used terminology when discussing I2P and cryptography.
id: Halaman ini menampilkan terminologi yang sering digunakan ketika mendiskusikan I2P dan kriptografi.
it: Questa pagina elenca i termini usati frequentemente quando si discute I2P e la crittografia.
pt_br: Esta página lista os termos mais usados nas discussões sobre a I2P e criptografia.

source: Current balance: as of %(date)s
id: Saldo saat ini: per %(date)s
it: Bilancio corrente: a partire da %(date)s
pt_br: Balanço corrente: até %(date)s

source: General fund
id: Dana umum
it: Capitale
pt_br: Financiamento geral

source: %(euroval)s &euro; and %(btcval)s BTC
id: %(euroval)s &euro; dan %(btcval)s BTC
it: %(euroval)s &euro; e %(btcval)s BTC
pt_br: %(euroval)s &euro; e %(btcval)s BTC

source: Bitcoin client for I2P
id: Klien bitcoin untuk I2P
it: Client Bitcoin per I2P
pt_br: Cliente Bitcoin para a I2P

source: Unit Tests for I2P router
id: Unit Pengujian untuk router I2P
it: Unità di analisi per il router di I2P
pt_br: Testes de unidade para o roteador I2P

source: Bounty I2P for CCR Microtic Board
id: Bounty I2P untuk CCR Microtic Board
it: Bounty I2P per la CCR Microtic Board

source: Current running costs:
id: Biaya operasional saat ini:

source: Big thanks go to the following people who have donated to I2P!
id: Terima kasih yang sebesar-besarnya kepada mereka yang telah mendonasikan ke I2P!
it: Un sentito ringraziamento va a queste persone, che hanno effettuato donazioni ad I2P.
pt_br: Somos muito gratos as seguintes pessoas que doaram ao projeto I2P!

source: If you have made a donation, please send an email to <a href="mailto:%(echelon)s">echelon</a> with your name or nick (and optionally homepage) so we can list you here.
id: Jika anda telah melakukan donasi, silahkan kirimkan email ke <a href="mailto:%(echelon)s">echelon</a> dengan nama atau alias Anda (dan homepage, jika ada) jadi kami dapat mendaftarkan anda disini.
it: Se hai fatto una donazione, invia una email a <a href="mailto:%(echelon)s">echelon</a> con il tuo nome o pseudonimo (ed eventualmente l'homepage): potremo così aggiungerti a questa lista.
pt_br: Se você deseja fazer uma doação, por favor, envie um email para <a href="mailto:%(echelon)s">echelon</a> com o seu nome ou pseudônimo (e, opcionalmente, sua página web) para que possamos listá-lo aqui.

source: Current monthly subscriptions:
id: Subskripsi bulanan saat ini:
it: Contribuzioni del mese corrente:
pt_br: Subscrições mensais desse mês:

source: 2016 donations and costs:
id: Donasi 2016 dan biaya:

source: 2015 donations and costs:
id: 2015 donasi dan biaya:

source: 2014 donations and costs:
id: 2014 donasi dan biaya:
it: donazioni e costi sostenuti nel 2014:
pt_br: Custos e doações em 2014:

source: 2013 donations and costs:
id: 2013 donasi dan biaya:
it: Donazioni e spese del 2013:
pt_br: Custos e doações em 2013:

source: 2012 donations and costs:
id: 2012 donasi dan biaya:
it: Donazioni e spese del 2012:
pt_br: Custos e doações em 2012:

source: 2011 donations and costs:
id: 2011 donasi dan biaya:
it: Donazioni e spese del 2011:
pt_br: Custos e doações em 2011:

source: Previous to 2011 donations:
id: Donasi sebelum tahun 2011:
it: Donazioni precedenti al 2011:
pt_br: Doações anteriores a 2011:

source: Intro
id: Pengenalan
it: Introduzione
pt_br: Introdução

source: I2P is an anonymous network, exposing a simple layer that applications can use to anonymously and securely send messages to each other. The network itself is strictly message based (a la <a href="%(ip)s">IP</a>), but there is a library available to allow reliable streaming communication on top of it (a la <a href="%(tcp)s">TCP</a>). All communication is end to end encrypted (in total there are four layers of encryption used when sending a message), and even the end points ("destinations") are cryptographic identifiers (essentially a pair of <a href="%(pke)s">public keys</a>).
id: I2p adalah jaringan anonim, mengekspos lapisan sederhana yang dapat digunakan oleh aplikasi secara anonim dan aman untuk mengirim pesan ke satu sama lain. Jaringannya sendiri adalah benar-benar berbasis pesan (seperti <a href="%(ip)s">IP</a>), tetapi ada sebuah library tersedia untuk memungkinkan komunikasi streaming yang handal di atasnya (seperti <a href="%(tcp)s">TCP</a>). Semua komunikasi dienkripsi end-to-end (secara total ada empat lapisan enkripsi yang digunakan bila mengirim pesan), dan bahkan titik akhir ("destinasi") adalah pengidentifikasi kriptografi (pada dasarnya sepasang <a href="%(pke)s">public key</a>).
pt_br: A I2P é uma rede anônima, que disponibiliza uma camada simples sobre a qual se faz possível a comunicação entre aplicações, por meio de troca de mensagens, de maneira anônima e segura. A rede é por si só estritamente baseada em mensagens (a la <a href="%(ip)s">IP</a>), mas há disponível uma biblioteca que permite uma confiável comunicação por streaming uma camada acima (a la <a href="%(tcp)s">TCP</a>). Toda a comunicação é criptografada de ponta-a-ponta (há, no total, quatro camadas de criptografia usadas ao se enviar uma mensagem), e mesmo os extremos ("destinos") são identificadores criptográficos (essencialmente um par de <a href="%(pke)s">chaves públicas</a>).

source: How does it work?
id: Bagaiman cara kerjanya?
it: Come funziona?
pt_br: Como funciona?

source: To anonymize the messages sent, each client application has their I2P "router" build a few inbound and outbound "<a href="%(tunnelrouting)s">tunnels</a>" - a sequence of peers that pass messages in one direction (to and from the client, respectively). In turn, when a client wants to send a message to another client, the client passes that message out one of their outbound tunnels targeting one of the other client's inbound tunnels, eventually reaching the destination. Every participant in the network chooses the length of these tunnels, and in doing so, makes a tradeoff between anonymity, latency, and throughput according to their own needs. The result is that the number of peers relaying each end to end message is the absolute minimum necessary to meet both the sender's and the receiver's threat model.
id: Untuk menanonimkan pesan yang dikirim, masing-masing client application telah membangun beberapa inbound dan outbound "<a href="%(tunnelrouting)s">tunnel</a>" - sebuah urutan peer yang saling mengirimkan pesan dalam satu arah (ke dan dari klien masing-masing). Pada gilirannya, ketika client ingin mengirim pesan ke client lain, client mengirimkan pesan salah satu tunnel outbound. menargetan salah satu tunnel masuk milik client lain, akhirnya mencapai tujuan. Setiap peserta dalam jaringan memilih panjang tunnel ini, dan dengan berbuat demikian, membuat tradeoff antara anonimitas, latency dan throughput yang sesuai dengan kebutuhan mereka sendiri. Hasilnya adalah bahwa jumlah peer yang menyampaikan pesan hingga akhir minimum mutlak diperlukan untuk memenuhi model ancaman pengirim dan penerima.
it: Per render anonimi i messaggi inviati, ogni applicazione client ha un "router" I2P che costruisce "<a href="%(tunnelrouting)s">tunnel</a>" in entrata e in uscita: una sequenza di peer che passano messaggi in una direzione (per e dal client, rispettivamente). A sua volta, quando un client vuole inviare un messaggio ad un altro client, il client manda quel messaggio attraverso uno di quei tunnel in uscita, diretto verso uno dei tunnel in entrata dell'altro client, raggiungendo finalmente la destinazione. Ogni partecipante della rete decide la lunghezza di questi tunnel, e facendo così, determina un compromesso tra anonimato, latenza e velocità di gestione, in accordo con le proprie necessità. Il risultato è che il numero dei peer che si ritrasmettono reciprocamente, da un capo all'altro, il messaggio è assolutamente il minimo necessario per venire incontro alle esigenze di sicurezza sia di chi invia, sia di chi riceve.
pt_br: Para tornar anônimo o envio de mensagens, cada aplicativo cliente tem o seu “roteador” I2P para construir alguns "<a href="%(tunnelrouting)s">túneis</a>" - uma sequência de pares que passam mensagens em uma direção (para e a partir do cliente, respectivamente). Por sua vez, quando um cliente quer enviar uma mensagem para um outro cliente, o cliente passa a mensagem para o exterior por meio de um de seus túneis de fuga, mirando um dos túneis que penetram no outro cliente, eventualmente alcançando o destino. Cada participante na rede escolhe o comprimento desses túneis e, ao fazê-lo, fazem uma troca entre anonimato, latência e taxa de transferência, conforme as suas necessidades. O resultado é que o número de pares retransmitindo cada mensagem de extremo a extremo é o mínimo absoluto necessário para satisfazer tanto o modelo de risco do remetente quanto do receptor.

source: The first time a client wants to contact another client, they make a query against the fully distributed "<a href="%(netdb)s">network database</a>" - a custom structured <a href="%(dht)s"> distributed hash table (DHT)</a> based off the <a href="%(kad)s">Kademlia algorithm</a>. This is done to find the other client's inbound tunnels efficiently, but subsequent messages between them usually includes that data so no further network database lookups are required.
id: Saat pertama kali client ingin menghubungi client lain, mereka membuat sebuah query terhadap "<a href="%(netdb)s">jaringan database</a>" yang sepenuhnya terdistribusi - struktur terkustomisasi <a href="%(dht)s">distributed has table (DHT)</a> didasarkan dari <a href="%(kad)s">Kademlia algorithm</a>. Hal ini dilakukan untuk secara efisien menemukan inbound tunnel milik client lain, tetapi pesan-pesan berikutnya antara mereka biasanya mencakup data sehingga jaringan database pencarian tidak lebih lanjut diperlukan.
pt_br: Na primeira vez que um cliente tenta se comunicar com um outro cliente, eles o fazem por meio de uma consulta a um "<a href="%(netdb)s">banco de dados em rede</a>" completamente distribuído - uma <a href="%(dht)s">tabela de espalhamento distribuída (DHT)</a> estruturada específica baseada no <a href="%(kad)s">algoritmo Kademlia</a>. Isto é feito para encontrar eficientemente os túneis do outro cliente que aportam, contudo, as mensagens subsequentes entre eles incluem usualmente tais dados de modo que nenhuma busca adicional no banco de dados em rede se faz necessária.
