Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: id, it, pt_br

source: Each of those imponderables can be addressed with more adaptive code, as well as tunable parameters to allow for more appropriate tradeoffs between bandwidth, latency, and CPU usage.
id: Setiap dari imponderables tersebut dapat diatasi dengan kode lebih adaptif, serta tunable parameter untuk memungkinkan timbal balik lebih tepat antara bandwidth, latensi, dan penggunaan CPU.
it: Ciascuna di queste evenienze può essere risolta con un codice più adattivo, e anche con parametri di affinamento che permettano un adeguato compromesso tra larghezza di banda, latenza e uso della CPU.

source: Full streaming protocol improvements
id: Perbaikan protokol streaming penuh
it: Miglioramenti al protocollo di Full streaming
pt_br: Aperfeiçoamentos no protocolo de streaming completo

source: Perhaps re-enable the interactive stream profile (the current implementation only uses the bulk stream profile).
id: Mungkin kembali mengaktifkan profil stream interaktif (implementasi saat ini hanya menggunakan sebagian besar stream profile).
it: Probabilmente riabilitare il profilo interattivo dello stream (l'implementazione corrente usa solo il profilo di stream puro).

source: Client level bandwidth limiting (in either or both directions on a stream, or possibly shared across multiple streams). This would be in addition to the router's overall bandwidth limiting, of course.
id: Pembatasan bandwidth di tingkat client (dalam salah satu atau kedua arah stream, atau mungkin dibagi di beberapa aliran). Ini akan menjadi tambahan untuk keseluruhan pembatasan bandwidth router, tentu saja.
it: Limitare il livello della larghezza di banda di un client (in una o entrambe le direzioni di un flusso, o eventualmente condiviso attraverso flussi paralleli). Questo sarebbe ovviamente in aggiunta al limite medio di larghezza di banda del router.

source: Access control lists (only allowing streams to or from certain other known destinations).
id: Daftar kontrol akses (hanya mengizinkan arus ke atau dari tujuan estinasi lainnya yang diketahui).
it: Liste di controllo accesso (permette lo stream solo da o per alcune destinazioni conosciute).
pt_br: Listas de controle de acesso (permitindo apenas streams para ou a partir de certos destinos conhecidos).

source: Web controls and monitoring the health of the various streams, as well as the ability to explicitly close or throttle them.
id: Kontrol web dan pemantauan kesehatan berbagai aliran, serta kemampuan untuk secara eksplisit menutup atau meningkatkannya.
it: Controlli web e salute dei vari flussi, e anche la capacità di chiuderli esplicitamente oppure troncarli.

source: Additional ideas for improving the streaming library are described on the <a href="%(streaming)s#future">streaming library page</a>.
id: Ide-ide tambahan untuk meningkatkan streaming library dijelaskan pada <a href="%(streaming)s#future">halaman streaming library</a>.
it: Altre idee per migliorare la libreria di streaming sono descritte nella <a href="%(streaming)s#future">pagina della libreria di streaming</a>.
pt_br: Ideias adicionais para melhorias na biblioteca de streamings estão descritas na <a href="%(streaming)s#future">página da biblioteca de streamings</a>.

source: Performance History
id: Riwayat kinerja
it: Storico delle prestazioni
pt_br: Histórico de desempenho

source: Notable performance improvements have been made using the techniques below. There is more to do, see the <a href="%(performance)s">Performance</a> page for current issues and thoughts.
id: Peningkatan kinerja yang baik adalah menggunakan teknik yang di bawah ini. Ada lebih banyak hal yang harus dilakukan, lihat halaman <a href="%(performance)s">kinerja</a> untuk isu-isu dan pemikiran saat ini.
it: Importanti miglioramenti delle prestazioni sono stati ottenuti usando le tecniche che seguono. C'è ancora altro da fare, consulta la pagina delle <a href="%(performance)s">Prestazioni</a> per gli attuali problemi e riflessioni.

source: implemented
id: diimplementasikan
it: implementato
pt_br: Implementado

source: When I last profiled the I2P code, the vast majority of time was spent within one function: java.math.BigInteger's <a href="%(modpow)s">modPow</a>. Rather than try to tune this method, we'll call out to <a href="%(gmp)s">GNU MP</a> - an insanely fast math library (with tuned assembler for many architectures). (<i>Editor: see <a href="%(jbigi)s">NativeBigInteger for faster public key cryptography</a></i>)
id: Ketika saya terakhir memprofilkan kode I2P, sebagian besar waktu dihabiskan dalam satu fungsi: java.math.BigInteger's <a href="%(modpow)s">modPow</a>. Alih-alih mencoba menyesuaikan metode ini, kita akan memanggil <a href="%(gmp)s">GNU MP</a> - sebuah library matematika yang sangat cepat (dengan assembler yang disetel untuk banyak arsitektur). (<i>Editor: Lihat <a href="%(jbigi)s">NativeBigInteger untuk kriptografi public key lebih cepat </a></i>)

source: ugha and duck are working on the C/JNI glue code, and the existing java code is already deployed with hooks for that whenever its ready. Preliminary results look fantastic - running the router with the native GMP modPow is providing over a 800&#37; speedup in encryption performance, and the load was cut in half. This was just on one user's machine, and things are nowhere near ready for packaging and deployment, yet.
id: ugha dan duck sedang mengerjakan kode C/JNI glue, dan kode Java yang ada sudah diterapkan dengan hook untuk itu kapanpun itu siap. Hasil awal terlihat fantastis - menjalankan router dengan modPow GMP asli menyediakan lebih dari 800 &#37; speedup dalam kinerja enkripsi, dan beban sudah terpotong setengah. Ini hanya pada komputer yang digunakan oleh satu pengguna, dan semuanya tidak siap untuk dipaket dan dipasang.

source: implemented but needs tuning
id: Diimplementasi namun memerlukan penyempurnaan
it: implementato ma necessita affinamenti
pt_br: implementado mas requer ajustes

source: This algorithm tweak will only be relevant for applications that want their peers to reply to them (though that includes everything that uses I2PTunnel or mihi's ministreaming lib):
id: Tweak algoritma ini hanya akan relevan untuk aplikasi yang ingin peer membalas kepada mereka (meskipun yang meliputi segala sesuatu yang menggunakan I2PTunnel atau mihi's ministreaming lib):
it: Questo algoritmo di tweak può avere rilievo solo per le applicazioni che richiedono che i peer rispondano loro (comunque è incluso tutto ciò che utilizza I2PTunnel o la libreria ministreaming di mihi):

source: Previously, when Alice sent Bob a message, when Bob replied he had to do a lookup in the network database - sending out a few requests to get Alice's current LeaseSet. If he already has Alice's current LeaseSet, he can instead just send his reply immediately - this is (part of) why it typically takes a little longer talking to someone the first time you connect, but subsequent communication is faster. Currently - for all clients - we wrap the sender's current LeaseSet in the garlic that is delivered to the recipient, so that when they go to reply, they'll <i>always</i> have the LeaseSet locally stored - completely removing any need for a network database lookup on replies. This trades off a large portion of the sender's bandwidth for that faster reply. If we didn't do this very often, overall network bandwidth usage would decrease, since the recipient doesn't have to do the network database lookup.
id: Sebelumnya, ketika Alice mengirim pesan kepada Bob, ketika Bob membalas, Bob harus melakukan lookup dalam database jaringan - mengirimkan beberapa permintaan untuk mendapatkan LeaseSet milik Alice saat ini. Jika Bob sudah memiliki Alice LeaseSet saat ini, ia hanya dapat mengirim balasan nya segera - ini (sebagian) penyebab biasanya dibutuhkan waktu sedikit lebih lama untuk berbicara dengan seseorang saat pertama kalinya nda terhubung, tetapi berikutnya komunikasi dapat lebih cepat. Saat ini - untuk semua klien - kami membungkus pengirim LeaseSet saat ini dalam garlic yang akan dikirim kepada penerima, sehingga ketika mereka memberikan balasan, mereka akan <i>selalu</i> memiliki LeaseSet yang tersimpan secara lokal - yang benar-benar menghilangkan kebutuhan untuk sebuah jaringan database lookup balasan. Ini trade off dari sebagian besar bandwidth pengirim untuk balasan yang lebih cepat. Jika kita tidak melakukan ini cukup sering, penggunaan bandwidth jaringan secara keseluruhan akan menurun karena penerima tidak harus melakukan lookup jaringan database.
it: In precedenza, quando Alice invia un messaggio a Bob, quando Bob risponde deve controllare nel database della rete, spedire alcune richieste per ottenere il LeaseSet attuale di Alice. Se Bob ha già l'attuale LeaseSet di Alice, può allora inviare la risposta immediatamente: questo è uno dei motivi per cui generalmente si impiega più tempo per parlare con qualcuno la prima volta che ti connetti, mentre le comunicazioni successive sono più veloci. Attualmente, per tutti i client, incapsuliamo l'attuale LeaseSet del mittente nel garlic che è spedito al destinatario: in tal modo, quando si risponderanno, il LeaseSet sarà <i>sempre</i> memorizzato localmente, eliminando completamente ogni necessità di controlli nel database di rete quando si risponde. Ciò impegna un'ampia porzione della larghezza di banda del mittente per ottenere una risposta veloce. Se non facessimo questo molto spesso, diminuirebbe l'utilizzo medio della larghezza di banda delle rete, visto che il destinatario non dovrebbe controllare il database di rete.

source: For unpublished LeaseSets such as "shared clients", this is the only way to get the LeaseSet to Bob. Unfortunately this bundling every time adds almost 100&#37; overhead to a high-bandwidth connection, and much more to a connection with smaller messages.
id: Untuk LeaseSets tidak diterbitkan seperti "shared client", ini adalah satu-satunya cara untuk mengirimkan LeaseSet kepada Bob. Sayangnya bundling ini setiap saat menambahkan hampir 100&#37; overhead untuk sambungan bandwidth tinggi, dan lebih untuk sambungan dengan pesan yang lebih kecil.

source: Changes scheduled for release 0.6.2 will bundle the LeaseSet only when necessary, at the beginning of a connection or when the LeaseSet changes. This will substantially reduce the total overhead of I2P messaging.
id: Perubahan yang dijadwalkan untuk rilis 0.6.2 akan mem-bundel LeaseSet hanya bila diperlukan, pada awal koneksi atau ketika perubahan LeaseSet. Ini secara substansial akan mengurangi overhead total dari pesan di I2P.
it: Le modifiche previste per la versione 0.6.2 includeranno il LeaseSet solo quando necessario, all'inizio di una connessione o quando il LeaseSet cambia. Questo ridurrà sensibilmente il sovraccarico dello scambio messaggi di I2P.

source: More efficient TCP rejection
id: Penokalan TCP yang lebih efisien
it: Sistema di TCP rejection più efficiente
pt_br: Recusa de TCP mais eficiente

source: At the moment, all TCP connections do all of their peer validation after going through the full (expensive) Diffie-Hellman handshaking to negotiate a private session key. This means that if someone's clock is really wrong, or their NAT/firewall/etc is improperly configured (or they're just running an incompatible version of the router), they're going to consistently (though not constantly, thanks to the banlist) cause a futile expensive cryptographic operation on all the peers they know about. While we will want to keep some verification/validation within the encryption boundary, we'll want to update the protocol to do some of it first, so that we can reject them cleanly without wasting much CPU or other resources.
id: Saat ini, semua koneksi TCP melakukan semua validasi peer mereka setelah melalui handshaking Diffie-Hellman (mahal) untuk menegosiasikan sesi private key. Ini berarti bahwa jika clock seseorang benar-benar salah, atau NAT/firewall/etc dikonfigurasi secara tidak benar (atau mereka hanya menjalankan versi yang tidak kompatibel di router), mereka akan secara konsisten (meskipun tidak terus-menerus, karena daftar blokir) menyebabkan operasi kriptografi mahal yang sia-sia pada semua peer yang mereka ketahui. Sementara kita akan ingin menyimpan beberapa verifikasi/validasi dalam batas enkripsi, pertama-tama kita akan ingin memperbarui protokol untuk melakukan beberapa hal, sehingga kita dapat menolak mereka secara bersih tanpa membuang-buang banyak CPU atau sumber daya lainnya.

source: Rather than going with the fairly random scheme we have now, we should use a more context aware algorithm for testing tunnels. e.g. if we already know its passing valid data correctly, there's no need to test it, while if we haven't seen any data through it recently, perhaps its worthwhile to throw some data its way. This will reduce the tunnel contention due to excess messages, as well as improve the speed at which we detect - and address - failing tunnels.
id: Alih-alih menggunakan skema yang cukup acak yang kita miliki sekarang, kita harus menggunakan algoritma yang lebih sadar konteks untuk menguji tunnel. misalnya jika kita sudah tahu data yang lewat yang valid dengan benar, ada tidak perlu untuk menguji, sementara jika kita belum melihat data melalui itu baru-baru ini mungkin akan berguna untuk melemparkan beberapa data sambil jalan. Ini akan mengurangi tunnel contention karena kelebihan pesan, serta meningkatkan kecepatan di mana kita mendeteksi - dan menyelesaikan - tunnel yang gagal.
it: Al posto di usare lo schema abbastanza casuale che abbiamo ora, potremmo usare un algoritmo sensibile al contesto per i tunnel di test, ad esempio se noi stimiamo corretti i dati validi per passare, non c'è bisogno di testare il tunnel, mentre se recentemente non abbiamo visto passare alcun dato, forse è meglio inviare qualche dato di prova. Questo ridurrà i problemi del tunnel causati da troppi messaggi, e potrà migliorare la velocità con cui vengono rilevati - e indirizzati - i tunnel difettosi.

source: Outbound tunnel selection implemented in 0.6.1.30, inbound lease selection implemented in release 0.6.2.
id: Pemilihan outbound tunnel diterapkan di rilis 0.6.1.30, pemilihan inbound least diterapkan dalam rilis 0.6.2.
it: Selezione dei tunnel in uscita implementata nella versione 0.6.1.30, selezione dei lease in uscita implementata nella versione 0.6.2.

source: Selecting tunnels and leases at random for every message creates a large incidence of out-of-order delivery, which prevents the streaming lib from increasing its window size as much as it could. By persisting with the same selections for a given connection, the transfer rate is much faster.
id: Memilih tunnel dan lease secara acak untuk setiap pesan menciptakan insiden out-of-order pengiriman yang besar, yang mencegah streaming lib meningkatkan window size sebanyak mungkin. Dengan bertahan di pilihan sama untuk koneksi tertentu, kecepatan transfer menjadi jauh lebih cepat.
it: Selezionare i tunnel e i lease casualmente per ogni messaggio crea un'alta incidenza di spedizioni out-of-order: ciò impedisce che la libreria di streaming incrementi la dimensione della finestra troppo velocemente. Insistendo con le stesse selezioni per una data connessione, la velocità di trasferimento è notevolmente più alta.

source: Compress some data structures
id: Memampatkan beberapa struktur data
it: Compressione di alcune strutture di dati
pt_br: Compactar algumas estruturas de dados

source: The I2NP messages and the data they contain is already defined in a fairly compact structure, though one attribute of the RouterInfo structure is not - "options" is a plain ASCII name = value mapping. Right now, we're filling it with those published statistics - around 3300 bytes per peer. Trivial to implement GZip compression would nearly cut that to 1/3 its size, and when you consider how often RouterInfo structures are passed across the network, that's significant savings - every time a router asks another router for a networkDb entry that the peer doesn't have, it sends back 3-10 RouterInfo of them.
id: Pesan I2NP dan data yang mereka kandung sudah didefinisikan dalam struktur cukup padat, meskipun satu atribut RouterInfo struktur tidak padat - "option" adalah nama plain ASCII = value mapping. Sekarang, kami sedang mengisinya dengan statistik tersebut - sekitar 3300 byte per peer. Menerapkan kompresi GZip akan hampir memotong itu untuk 1/3 ukuran, dan jika anda mempertimbangkan seberapa sering RouterInfo struktur lewat di seluruh jaringan, itu penghematan yang signifikan - setiap kali sebuah router meminta router lain sebuah catatan networkDb yang tidak memiliki peer, ia akan mengirimkan kembali 3-10 RouterInfo dari mereka.

source: Update the ministreaming protocol
id: Uodate protokol ministreaming
it: Aggiornamento del protocollo di ministreaming
pt_br: Atualizar o protocolo de ministreaming

source: replaced by full streaming protocol
id: digantikan oleh protokol streaming penuh
it: rimpiazzato dal protocollo full streaming
pt_br: substituído pelo protocolo de streaming completo

source: Currently mihi's ministreaming library has a fairly simple stream negotiation protocol - Alice sends Bob a SYN message, Bob replies with an ACK message, then Alice and Bob send each other some data, until one of them sends the other a CLOSE message. For long lasting connections (to an IRC server, for instance), that overhead is negligible, but for simple one-off request/response situations (an HTTP request/reply, for instance), that's more than twice as many messages as necessary. If, however, Alice piggybacked her first payload in with the SYN message, and Bob piggybacked his first reply with the ACK - and perhaps also included the CLOSE flag - transient streams such as HTTP requests could be reduced to a pair of messages, instead of the SYN+ACK+request+response+CLOSE.
id: Saat ini mihi's ministreaming library memiliki protokol negosiasi stream yang cukup sederhana - Alice mengirim Bob sebuah pesan SYN, Bob menjawab dengan pesan ACK, kemudian Alice dan Bob mengirimkan satu sama lain beberapa data, sampai salah satu dari mereka mengirim satu pesan CLOSE. Untuk koneksi yang tahan lama (ke IRC server, misalnya), overhead diabaikan, tetapi untuk satu kali permintaan sederhana/tanggapan situasi (HTTP request/reply, misalnya), itu adalah lebih dari dua kali lebih banyak pesan yang diperlukan. Jika, namun, Alice bernama piggybacked muatan pertamanya dengan pesan SYN, dan Bob piggybacked balasannya dengan ACK - dan mungkin juga termasuk CLOSE tag - sementara transient stream seperti HTTP bisa dikurangi menjadi sepasang pesan, bukan SYN + ACK + request response + CLOSE.

source: Implement full streaming protocol
id: Menerapkan protokol streaming penuh
it: Implementa protocollo "full streaming"
pt_br: Implementar protocolo de streaming completo

source: The ministreaming protocol takes advantage of a poor design decision in the I2P client protocol (I2CP) - the exposure of "mode=GUARANTEED", allowing what would otherwise be an unreliable, best-effort, message based protocol to be used for reliable, blocking operation (under the covers, its still all unreliable and message based, with the router providing delivery guarantees by garlic wrapping an "ACK" message in with the payload, so once the data gets to the target, the ACK message is forwarded back to us [through tunnels, of course]).
id: Protokol ministreaming mengambil keuntungan dari keputusan desain yang buruk dalam protokol klien I2P (I2CP) - pemaparan "mode=GUARANTEED", yang memungkinkan protokol berbasis pesan yang tidak dapat diandalkan, best-effort, dapat digunakan untuk dapat diandalkan, menghalangi operasi (di bawah cover, masih semua tidak dapat diandalkan dan berbasis pesan, dengan router memberikan jaminan pengiriman pesan "ACK" oleh garlic wrapping dengan muatan, jadi begitu data sampai ke sasaran, pesan ACK diteruskan kembali kepada kami. [Melalui tunnel, tentu saja]).

source: As I've <a href="%(link)s">said</a>, having I2PTunnel (and the ministreaming lib) go this route was the best thing that could be done, but more efficient mechanisms are available. When we rip out the "mode=GUARANTEED" functionality, we're essentially leaving ourselves with an I2CP that looks like an anonymous IP layer, and as such, we'll be able to implement the streaming library to take advantage of the design experiences of the TCP layer - selective ACKs, congestion detection, nagle, etc.
id: Seperti yang saya telah <a href="%(link)s">katakan</a>, membuat I2PTunnel (dan ministreaming lib) melakukan rute ini adalah hal terbaik yang bisa dilakukan, tapi mekanisme yang lebih efisien telah tersedia. Kapan kita rip out fungsi "mode=GUARANTEED", kita pada dasarnya mendapat I2CP yang terlihat seperti layer IP anonim, dan dengan demikian, kita akan mampu menerapkan streaming library untuk mengambil keuntungan dari pengalaman desain TCP layer - ACKs selektif, deteksi kemacetan, nagle, dll.

source: Performance
id: Kinerja
it: Prestazioni
pt_br: Desempenho

source: How does I2P work, why is it slow, and why does it not use my full bandwidth?
id: Bagaimana cara kerja I2P, mengapa I2P lambat, dan mengapa I2P tidak menggunakan bandwidth penuh?
it: Come funziona I2P, perché è lenta, e perché non usa tutta la mia larghezza di banda
pt_br: Como a I2P funciona, por que é lenta, e por que não usa toda a minha banda?

source: Probably one of the most frequent things people ask is "how fast is I2P?", and no one seems to like the answer - "it depends". After trying out I2P, the next thing they ask is "will it get faster?", and the answer to that is a most emphatic <b>yes</b>.
id: Mungkin salah satu hal yang paling sering ditanya adalah "seberapa cepat I2P?", dan tak seorang pun tampaknya menyukai jawaban - "tergantung". Setelah mencoba I2P, hal berikutnya yang mereka tanyakan "akankah lebih cepat?", dan jawabannya adalah paling tegas adalah <b>ya</b>.
it: Una delle cose che le persone domandano più spesso è "quanto è veloce I2P?", e nessuno apprezza la risposta: "dipende". Dopo aver provato I2P, ciò che chiedono è "si può velocizzare?", e la risposta a ciò è più empatica: "<b>sì</b>".
