Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: id, it, pt_br

source: More details about how I2P works are <a href="%(docs)s">available</a>.
id: Rincian lebih lanjut tentang bagaimana I2P bekerja juga <a href="%(docs)s">tersedia</a>.
it: Sono disponibili <a href="%(docs)s">ulteriori dettagli</a> sul funzionamento di I2P.
pt_br: Mais detalhes sobre o funcionamento da I2P estão disponíveis <a href="%(docs)s">aqui</a>.

source: What can you do with it?
id: Apa yang dapat anda lakukan dengan I2P?
it: Cosa puoi farci?
pt_br: Para que serve?

source: Within the I2P network, applications are not restricted in how they can communicate - those that typically use UDP can make use of the base I2P functionality, and those that typically use TCP can use the TCP-like streaming library. We have a generic TCP/I2P bridge application ("<a href="%(i2ptunnel)s">I2PTunnel</a>") that enables people to forward TCP streams into the I2P network as well as to receive streams out of the network and forward them towards a specific TCP/IP address.
id: Dalam jaringan I2P, aplikasi tidak terbatas dalam bagaimana mereka dapat berkomunikasi - mereka yang biasanya menggunakan UDP dapat menggunakan dasar fungsi I2P, dan mereka yang biasanya menggunakan TCP dapat menggunakan library untuk TCP-like streaming. Kami memiliki sebuah aplikasi jembatan TCP I2P generik ("<a href="%(i2ptunnel)s">I2PTunnel</a>") yang memungkinkan orang untuk meneruskan TCP stream ke jaringan I2P serta menerima stream dari jaringan dan meneruskannya ke arah alamat TCP/IP tertentu.
it: All'interno della rete I2P, non vi sono limiti al modo in cui le applicazioni possono comunicare: quelle che usano normalmente UDP possono far uso delle funzionalità base di I2P, e quelle che usano generalmente TCP possono usare la libreria di streaming simil-TCP. Abbiamo un'applicazione generica che fa da ponte TCP/I2P ("<a href="%(i2ptunnel)s">I2PTunnel</a>") che permette alle persone di inoltrare stream TCP nella rete I2P, nonché ricevere stream dalla rete e inoltrarle verso uno specifico indirizzo TCP/IP.
pt_br: Dentro da rede I2P, aplicações não são restringidas no modo como podem se comunicar - aquelas que tipicamente usam UDP podem fazer uso da funcionalidade de base da I2P, e aquelas que usam tipicamente o TCP podem usar a biblioteca de streaming tipo TCP. Temos uma aplicação de ponte TCP/I2P genérica ("<a href="%(i2ptunnel)s">I2PTunnel</a>") que permite as pessoas encaminharem fluxos de dados via TCP na rede I2P bem como receber fluxos de fora da rede e encaminhá-los a um endereço de TCP/IP específico.

source: I2PTunnel is currently used to let people run their own anonymous website ("eepsite") by running a normal webserver and pointing an I2PTunnel 'server' at it, which people can access anonymously over I2P with a normal web browser by running an I2PTunnel HTTP proxy ("eepproxy"). In addition, we use the same technique to run an anonymous IRC network (where the IRC server is hosted anonymously, and standard IRC clients use an I2PTunnel to contact it). There are other application development efforts going on as well, such as one to build an optimized swarming file transfer application (a la <a href="%(bittorrent)s">BitTorrent</a>), a distributed data store (a la <a href="%(freenet)s">Freenet</a> / <a href="%(mnet)s">MNet</a>), and a blogging system (a fully distributed <a href="%(livejournal)s">LiveJournal</a>), but those are not ready for use yet.
id: I2PTunnel saat ini digunakan untuk membuat orang-orang menjalankan situs mereka sendiri secara anonim ("eepsite") dengan menjalankan normal webserver dan menunjuk I2PTunnel 'server', yang orang dapat mengakses secara anonim melalui I2P dengan browser web normal dengan menjalankan proxy I2PTunnel HTTP ("eepproxy"). Selain itu, kami menggunakan teknik yang sama untuk menjalankan jaringan IRC anonim (di mana server IRC dihosting secara anonim, dan klien IRC standar menggunakan I2PTunnel untuk dihubungi). Ada upaya pengembangan aplikasi lain, seperti membangun sebuah optimalisasi aplikasi transfer file swarm (seperti <a href="%(bittorrent)s">BitTorrent</a>), Penyimpanan data terdistribusi (seperti <a href="%(freenet)s">Freenet</a> / <a href="%(mnet)s">MNet</a>), dan sistem blogging (sepenuhnya terdistribusi <a href="%(livejournal)s">LiveJournal</a>), tetapi mereka belum siap untuk digunakan.
pt_br: Um I2PTunnel possibilita atualmente que pessoas tenham seu próprio site anônimo ("eepsite") rodando um servidor web normal e apontando um 'servidor' I2PTunnel para ele, de forma que possam acessá-lo anonimamente na I2P por meio de um navegador comum por meio da execução de um proxy HTTP de I2PTunnel ("eepproxy"). Além disso, usamos a mesma técnica para fornecer uma rede de IRC anônima (onde o servidor IRC é hospedado anonimamente, e os clientes IRC padrões usam o I2PTunnel para contactá-lo). Temos outros esforços de desenvolvimento de aplicações em andamento, como a construção de uma aplicação de transferência de arquivos swarming (a la <a href="%(bittorrent)s">BitTorrent</a>), um sistema de armazenamento distribuído (a la <a href="%(freenet)s">Freenet</a> / <a href="%(mnet)s">MNet</a>), e um sistema de blogs (um <a href="%(livejournal)s">LiveJournal</a> completamente distribuído), mas esses não estão prontos para uso ainda.

source: I2P is not inherently an "outproxy" network - the client you send a message to is the cryptographic identifier, not some IP address, so the message must be addressed to someone running I2P. However, it is possible for that client to be an outproxy, allowing you to anonymously make use of their Internet connection. To demonstrate this, the "eepproxy" will accept normal non-I2P URLs (e.g. "http://www.i2p.net") and forward them to a specific destination that runs a <a href="%(squid)s">squid</a> HTTP proxy, allowing simple anonymous browsing of the normal web. Simple outproxies like that are not viable in the long run for several reasons (including the cost of running one as well as the anonymity and security issues they introduce), but in certain circumstances the technique could be appropriate.
id: I2p bukan jaringan "outproxy" - klien kepada anda mengirim pesan adalah pengidentifikasi kriptografi, bukan alamat IP, sehingga pesan harus ditujukan kepada seseorang yang menjalankan I2P. Namun, memungkinkan untuk client yang menjadi outproxy, untuk secara anonim membuat anda penggunaan koneksi Internet mereka. Contohnya, "eepproxy" akan menerima URL normal non I2p (misalnya "http://www.i2p.net") dan meneruskannya ke tempat tujuan spesifik di mana sedang menjalankan proxy HTTP <a href="%(squid)s">squid</a>, memungkinkan browsing web normal secara simpel dan anonim. Outproxies Sederhana seperti itu tidak layak dalam jangka panjang karena beberapa alasan (termasuk biaya operasional serta isu-isu anonimitas dan masalah keamanan), tetapi dalam keadaan tertentu teknik ini dapat digunakan.
pt_br: A I2P não é inerentemente uma rede de “proxies de saída” - o cliente que lhe manda uma mensagem é o identificador criptográfico, não um endereço IP, de modo que a mensagem deve ser endereçada a alguém que executa o roteador I2P. No entanto, há a possibilidade para esse cliente ser um proxy de saída, permitindo que você anonimamente faça uso da conexão que ele tem com a Internet. Para demonstrar isso, o “eepproxy” aceitará normalmente URLs não-I2P (e.g. "http://www.i2p.net") e o direcionará para um destino específico que executa um proxy HTTP <a href="%(squid)s">squid</a>, permitindo simplesmente navegar anonimamente na web ordinária. Simples proxies de saída como esse não são viáveis no logo prazo por diversas razões (incluindo o custo de execução de um bem como as questões relativas a anonimato e segurança que introduzem), mas em certas circunstâncias a técnica pode ser apropriada.

source: The I2P development <a href="%(team)s">team</a> is an open group, welcome to all who are interested in <a href="%(volunteer)s">getting involved</a>, and all of the code is <a href="%(licenses)s">open source</a>. The core I2P SDK and the current router implementation is done in Java (currently working with both sun and kaffe, gcj support planned for later), and there is a <a href="%(sam)s">simple socket based API</a> for accessing the network from other languages (with a C library available, and both Python and Perl in development). The network is actively being developed and has not yet reached the 1.0 release, but the current <a href="%(roadmap)s">roadmap</a> describes our schedule.
id: Pengembangan I2P <a href="%(team)s">tim</a> adalah grup terbuka, menerima semua orang yang tertarik untuk <a href="%(volunteer)s">terlibat</a>, dan semua kode adalah <a href="%(licenses)s">open source</a>. Core I2P SDK dan implementasi router saat ini dilakukan dengan menggunakan Java (saat ini bekerja dengan Sun dan Kaffe, dukungan gcj direncanakan untuk nanti), dan ada <a href="%(sam)s">API berbasis soket sederhana </a> untuk mengakses jaringan dari bahasa lain (C library sudah tersedia, Python dan Perl sedang dalam pengembangan). Jaringan secara aktif sedang dikembangkan dan belum mencapai versi 1,0, tetapi saat ini <a href="%(roadmap)s">roadmap</a> menjelaskan jadwal kami.
it: Il <a href="%(team)s">team</a> di sviluppo di I2P è un gruppo aperto a chiunque sia interessato a <a href="%(volunteer)s">partecipare</a>, e tutto il codice è <a href="%(licenses)s">open source</a>. Il cuore del kit di sviluppo di I2P e l'attuale implementazione del router sono scritti in Java (utilizzano attualmente sia sun che kaffe, in futuro è pianificato il supporto a gcj), ed esiste anche una <a href="%(sam)s">semplice API basata su socket</a> per accedere alla rete da altri linguaggi (è disponibile una libreria C, e sono in sviluppo quelle di Python e Perl). La rete è in continuo sviluppo e non ha ancora raggiunto la versione 1.0, ma l'attuale <a href="%(roadmap)s">roadmap</a> definisce il nostro piano di lavoro.
pt_br: O <a href="%(team)s">time</a> de desenvolvedores da I2P é um grupo aberto, receptivo a todos os interessados em <a href="%(volunteer)s">engajarem-se</a>, e tudo tem o <a href="%(licenses)s">código-fonte aberto</a>. A base do SDK da I2P e a implementação atual do roteador são feitas em Java (trabalhamos atualmente tanto com Sun quanto com Kaffe, com suporte para GCJ posteriormente planejado), e há uma <a href="%(sam)s">API simples baseada em sockets</a> para acessar a rede por meio de outras linguagens (com uma biblioteca C disponível, e Python bem como Perl em desenvolvimento). A rede está em processo ativo de desenvolvimento e não alcançou ainda o lançamento da versão 1.0, mas o nosso cronograma encontra-se detalhado no <a href="%(roadmap)s">plano de ação</a> atual.

source: Presentations on I2P
id: Presentasi mengenai I2P
it: Presentazioni su I2P
pt_br: Exposições sobre a I2P

source: Following are links to presentations, videos, and tutorials about I2P. Links to research papers on I2P are available <a href="%(papers)s">here</a>.
id: Berikut adalah link ke presentasi, video, dan tutorial tentang I2P. Link ke makalah penelitian pada I2P juga tersedia <a href="%(papers)s">di sini</a>.
it: Ecco una selezione di link a presentazioni, video e guide su I2P. I link alla documentazione approfondita su I2P sono disponibili <a href="%(papers)s">qui</a>.
pt_br: Seguem linques para apresentações, videos e tutoriais sobre a I2P. Linques para artigos acadêmicos sobre a I2P estão disponíveis <a href="%(papers)s">aqui</a>.

source: To request an addition to this page, please send to %(email)s.
id: Untuk meminta tambahan untuk Halaman ini, silahkan kirim ke %(email)s.
it: Per richiedere un'aggiunta a questa pagina, invia una %(email)s.
pt_br: Para requisitar uma adição a esta página, por favor, faça contato via %(email)s.

source: Newest links are at the bottom of each section.
id: Link terbaru ada di bagian bawah di setiap bagian.
it: I link più recenti sono in fondo ad ogni sezione.
pt_br: Os linques mais recentes encontram-se relacionados na parte inferior de cada seção.

source: Presentations
id: Presentasi
it: Presentazioni
pt_br: Exposições

source: IIP Presentation at CodeCon <a href="%(mp3)s">MP3 audio</a> <a href="%(transcript)s">transcript</a> Lance James (0x90), February 2002.
id: Presentasi IIP di CodeCon <a href="%(mp3)s">MP3 audio</a> <a href="%(transcript)s">transkrip</a> Lance James (0x90), Februari 2002.
it: Presentazione IIP al CodeCon <a href="%(mp3)s">audio MP3</a> <a href="%(transcript)s">trascrizione</a> Lance James (0x90), Febbraio 2002.
pt_br: Apresentação sobre a IIP no CodeCon. <a href="%(mp3)s">Aúdio MP3</a>. <a href="%(transcript)s">Transcrição</a>. Lance James (0x90), fevereiro de 2002.

source: IIP Presentation at ToorCon <a href="%(mp3)s">MP3 audio</a> <a href="%(slides)s">slides</a> Lance James (0x90), September 2002.
id: Presentasi IIP di ToorCon <a href="%(mp3)s">MP3 audio</a> <a href="%(slides)s">slide</a> Lance James (0x90), September 2002.
it: Presentazione IIP al ToorCon <a href="%(mp3)s">Audio MP3</a> <a href="%(slides)s">Slide</a> Lance James (0x90), Settembre 2002.
pt_br: Apresentação sobre a IIP no ToorCon. <a href="%(mp3)s">Aúdio MP3</a>. <a href="%(slides)s">Slides</a>. Lance James (0x90), setembro de 2002.

source: <a href="%(video)s">To Be or I2P</a> (Youtube Video) An introduction into anonymous communication with I2P. <a href="%(pdf)s">To Be or I2P (PDF presentation)</a>, Jens Kubieziel, 24C3 Berlin, December 28, 2007.
id: <a href="%(video)s">To be atau I2P</a> (Video Youtube) Pengenalan kepada komunikasi anonim dengan I2P. <a href="%(pdf)s">To be atau I2P (PDF presentasi)</a>, Jens Kubieziel, 24C 3 Berlin, 28 Desember 2007.
it: <a href="%(video)s">To Be or I2P</a> (Video Youtube) Una introduzione alla comunicazione anonima con I2P. <a href="%(pdf)s">To Be or I2P (presentazione in PDF)</a>, Jens Kubieziel, 24C3 Berlino, 28 Dicembre 2007.
pt_br: <a href="%(video)s">Ser ou I2P</a> (Vídeo no Youtube) Uma introdução em comunicação anônima com a I2P. <a href="%(pdf)s">Ser ou I2P (PDF da apresentação)</a>, Jens Kubieziel, 24C3 Berlin, 28 de dezembro de 2007.

source: <a href="%(video)s">Video of I2P talk at Chemnitz Linux Tag</a>, Lars Schimmer, March 14-15, 2009
id: <a href="%(video)s">Video diskusi I2P di Chemnitz Linux Tag</a>, Lars Schimmer, 14-15 Maret 2009
it: <a href="%(video)s">Video del discorso su I2P al Chemnitz Linux Tag</a>, Lars Schimmer, 14-15 March 2009
pt_br: <a href="%(video)s">Vídeo de um colóquio sobre a I2P no Chemnitz Linux Tag</a>, Lars Schimmer, 14-15 de março de 2009.

source: HOPE New York July 17, 2010 - Brief overview of I2P by zzz, at the end of Adrian Hong's talk "Hackers for Human Rights". <a href="%(mp3)s">MP3 audio</a>
id: HOPE New York 17 Juli 2010 - penjelasan singkat I2P oleh zzz, pada akhir diskusi oleh Adrian Hong "hacker untuk hak asasi manusia". <a href="%(mp3)s">audion MP3</a>
it: HOPE New York, 17 Luglio 2010 - Breve presentazione di I2P, di zzz, alla fine del discorso di Adrian Hong "Hacker per i diritti umani". <a href="%(mp3)s">Audio MP3</a>
pt_br: Hope, Nova Iorque, 17 de julho de 2010 - Uma breve visão-geral acerca da I2P por zzz, ao término do Adrian Hong's talk "Hackers for Human Rights". <a href="%(mp3)s">Áudio MP3</a>.

source: <a href="%(link)s">Into the I2P Darknet: Welcome to Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, January 2011
id: <a href="%(link)s">Ke Darknet I2P: Selamat Datang di Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, bulan January 2011
it: <a href="%(link)s">Dentro la darknet I2P: benvenuti nel cipherspazio</a> Adrian Crenshaw. Schmoocon Firetalk, Gennaio 2011
pt_br: <a href="%(link)s">Na darknet I2P: Seja bem-vindo ao Criptoespaço</a>. Adrian Crenshaw. Schmoocon Firetalk, janeiro de 2011.

source: <a href="%(link)s">Using techhnology to advance liberty</a> (Youtube Video) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, March 27, 2011. I2P covered from 10:00 to 20:00 in the video.
id: <a href="%(link)s">Menggunakan teknologi untuk memajukan kebebasan</a> (Youtube Video) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, 27 Maret 2011. I2p dibahas pukul 10:00-20:00 di dalam video.
it: <a href="%(link)s">Usare la tecnologia per aumentare la libertà</a> (Video Youtube) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, 27 Marzo 2011. I riferimenti ad I2P sono a partire da 10:00 fino 20:00 nel video.
pt_br: <a href="%(link)s">Usando tecnologia para fazer avançar a liberdade</a> (Vídeo no Youtube). Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, 27 de março de 2011. A I2P é abordada de 10:00 até 20:00 no vídeo.

source: <a href="%(pdf)s">The Bright side of darknets</a>, FOSSCOMM Patras May 2011
id: <a href="%(pdf)s">Sisi terang dari darknets</a>, FOSSCOMM Patras bulan Mei 2011
it: <a href="%(pdf)s">Il lato luminoso delle darknet</a>, FOSSCOMM Patras, Maggio 2011
pt_br: <a href="%(pdf)s">O lado brilhante das darknets</a>, FOSSCOMM, Patras. Maio de 2011.

source: <a href="%(link)s">Common Darknet Weaknesses</a> (Youtube Video) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, July 11-15, 2011.
id: <a href="%(link)s">Kelemahan Umum Darknet</a> (Youtube Video) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AJUDAN</a>, 11-15 Juli 2011.
it: <a href="%(link)s">Debolezze comuni delle darknet</a> (Video Youtube) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, 11-15 Luglio 2011.
pt_br: <a href="%(link)s">Vulnerabilidades comuns em darknets</a> (Vídeo no Youtube). Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, 11-15 de julho, 2011.

source: <a href="%(link)s">I2P / Tor Workshop Notes</a> Adrian Crenshaw. DEF CON 19, Las Vegas, August 6, 2011.
id: <a href="%(link)s">Catatan Workshop I2P / Tor </a> Adrian Crenshaw. DEF CON 19, Las Vegas, 6 Agustus 2011.
it: <a href="%(link)s">Corso avanzato di I2P / Tor</a> Adrian Crenshaw. DEF CON 19, Las Vegas, 6 Agosto 2011.
pt_br: <a href="%(link)s">Notas de um seminário sobre I2P / Tor</a>. Adrian Crenshaw. DEF CON 19, Las Vegas, 6 de agosto de 2011.

source: <a href="%(live)s">Cipherspaces/Darknets: An Overview Of Attack Strategies - DEF CON Live version (Youtube Video)</a>, <a href="%(studio)s">"Studio" version (Youtube Video)</a>, <a href="%(slides)s">Slides (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, August 7, 2011.
id: <a href="%(live)s">Cipherspaces Darknets: Overview Strategi Serangan - DEF CON Versi Live (Youtube Video)</a>, <a href="%(studio)s">"versi Studio" (Youtube Video)</a>, Adrian Crenshaw <a href="%(slides)s">slide (ppt)</a> . DEF CON 19, Las Vegas, 7 Agustus 2011.
it: <a href="%(live)s">Cipherspazio/Darknets: una rassegna delle strategie di attacco - DEF CON, versione dal vivo (Video Youtube)</a>, <a href="%(studio)s">Version "Studio" (Video Youtube)</a>, <a href="%(slides)s">Slide (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, 7 Agosto 2011.
pt_br: <a href="%(live)s">Criptoespaços/Darknets: Uma visão geral das estratégias de ataque - DEF CON versão ao vivo (vídeo no Youtube)</a>. <a href="%(studio)s">versão de "Studio" (vídeo no Youtube)</a>. <a href="%(slides)s">Slides (ppt)</a>. Adrian Crenshaw. DEF CON 19, Las Vegas, 7 de agosto de 2011.

source: <a href="http://0x375.org/">Modern cipherspace ecosystems</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), November 4, 2011.
id: <a href="http://0x375.org/">Ekosistem Modern cipherspace</a>, 0x375 0x06 (Sesi Diskusi Thessaloniki Tech), 4 November 2011.
pt_br: <a href="http://0x375.org/">Ecossistemas do criptoespaço moderno</a>. 0x375 0x06 (Thessaloniki Tech Talk Sessions). 4 de novembro de 2011.

source: <a href="%(link)s">I2P - The Anonymous Network</a> (Youtube Video) Blair Dick, University of Abertay, Dundee Ethical Hacking Society, January 25, 2012.
id: <a href="%(link)s">I2p - jaringan anonim</a> (Youtube Video) Blair Dick, University of Abertay, Dundee Ethical Hacking Society, 25 Januari 2012.
pt_br: <a href="%(link)s">I2P - A rede anônima</a> (Vídeo no Youtube). Por Blair Dick - University of Abertay, Dundee Ethical Hacking Society. 25 de janeiro de 2012.

source: <a href="%(link)s">I2PCon 2015</a> Toronto, August 15-16, 2015
id: <a href="%(link)s">I2PCon 2015</a> Toronto, 15-16 Agustus 2015

source: <a href="%(link)s">I2P - Still alive! (pdf)</a> <a href="%(link2)s">(video)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburg, December 28, 2015
id: <a href="%(link)s">I2p - masih hidup!</a> (pdf)</a> <a href="%(link2)s">(video)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburg, 28 Desember 2015

source: Replacing Weary Crypto: Upgrading the I2P network with stronger primitives <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, Real World Crypto, Stanford, January 8, 2016
id: Replacing Weary Crypto: Upgrading the I2P network with stronger primitives <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, Real World Crypto, Stanford, 8 Januari 2016

source: Onions and Garlic: the protocols of I2P <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, COMPSCI 460: Computer Networking, University of Wisconsin Whitewater, February 17, 2016
id: Onions and Garlic: the protocols of I2P <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, COMPSCI 460: Computer Networking, University of Wisconsin Whitewater, 17 Februari 2016

source: Tutorials
id: Tutorial
pt_br: Tutoriais

source: <a href="%(link)s">I2P Windows Tutorial</a> (Youtube Video) This guide will show you how to install I2P in Windows XP. By <a href="http://telecomix.org/">Telecomix</a>
id: <a href="%(link)s">I2p Windows Tutorial</a> (Youtube Video) Panduan ini akan menunjukkan kepada anda tentang cara menginstal I2P di Windows XP. Dengan <a href="http://telecomix.org/">Telecomix</a>
it: <a href="%(link)s">Guida ad I2P su Windows</a> (Video Youtube) Questa guida mostra come installare I2P su Windows XP. Di <a href="http://telecomix.org/">Telecomix</a>
pt_br: <a href="%(link)s">Tutorial sobre o acesso a I2P no Windows</a> (Vídeo no Youtube) Este guia mostra como instalar a I2P no Windows XP. Por <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">I2P Debian Tutorial</a> (Youtube Video) This will guide you through how to install I2P on a Debian Linux System. By <a href="http://telecomix.org/">Telecomix</a>
id: <a href="%(link)s">I2p Debian Tutorial</a> (Youtube Video) Ini akan memandu anda dalam menginstal I2P pada sistem Debian Linux. Dengan <a href="http://telecomix.org/">Telecomix</a>
it: <a href="%(link)s">Guida ad I2P su Debian</a> (Video Youtube) Questa guida mostra come installare I2P su un sistema Linux Debian. Di <a href="http://telecomix.org/">Telecomix</a>
pt_br: <a href="%(link)s">Tutorial sobre a instalação da I2P no Debian</a> (Vídeo no Youtube) Este guia lhe ajudará a instalar a I2P numa distribuição Debian do Linux. Por <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">How to set up anonymous site in I2P</a> (Youtube Video) How to set up an anonymous web site in I2P. By <a href="http://telecomix.org/">Telecomix</a>
id: <a href="%(link)s">Cara membuat situs anonim dalam I2P</a> (Youtube Video) Cara membuat sebuah situs web yang anonim di I2P. Dengan <a href="http://telecomix.org/">Telecomix</a>
it: <a href="%(link)s">Come creare siti anonimi su I2P</a> (Video Youtube) Guida che mostra come creare siti anonimi su I2P. Di <a href="http://telecomix.org/">Telecomix</a>
pt_br: <a href="%(link)s">Como configurar um site anônimo na I2P</a> (Vídeo no Youtube) Como configurar um website anônimo na I2P. Por <a href="http://telecomix.org/">Telecomix</a>
