Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: id, it, pt_br

source: <a href="%(link)s">I2P Tutorial Mac OS X</a> (Youtube Video) A tutorial on how to run i2p on Mac OS X and how to connect to irc.telecomix.i2p. By <a href="http://telecomix.org/">Telecomix</a>
id: <a href="%(link)s">I2P Tutorial Mac OS X</a> (Youtube Video) Sebuah tutorial mengenai cara menjalankan i2p pada Mac OS X dan cara untuk terhubung ke irc.telecomix.i2p. Dengan <a href="http://telecomix.org/">Telecomix</a>
it: <a href="%(link)s">Guida ad I2P su Mac OS X</a> (Video Youtube) Questa guida mostra come installare I2P su Mac OS X e come connettersi a irc.telecomix.i2p. Di <a href="http://telecomix.org/">Telecomix</a>
pt_br: <a href="%(link)s">Tutorial sobre como usar a I2P no Mac OS X</a> (Vídeo no Youtube) Tutorial sobre como rodar a I2P no Mac OS X e como conectar-se a irc.telecomix.i2p. Por <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">Felix Atari explains the basic principles of I2P</a> (Youtube Video) Agent Felix Atari of the Telecomix Crypto Munitions Bureau. By <a href="http://telecomix.org/">Telecomix</a>
id: <a href="%(link)s">Felix Atari menjelaskan prinsip-prinsip dasar I2P</a> (Youtube Video) Agen Felix Atari dari Telecomix Crypto Munitions Bureau. Dengan <a href="http://telecomix.org/">Telecomix</a>
it: <a href="%(link)s">Felix Atari spiega i principi di base di I2P</a> (Video Youtube) L'agente Felix Atari del Telecomix Crypto Munitions Bureau. Di <a href="http://telecomix.org/">Telecomix</a>
pt_br: <a href="%(link)s">Felix Atari explica os princípios básicos da I2P</a> (Vídeo no Youtube). Agente Felix Atari do Telecomix Crypto Munitions Bureau. Por <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">How to get onto I2P, the anonymous P2P Darknet (Windows Install)</a> (Youtube Video) This tutorial shows how to install and configure software needed to access I2P.
id: <a href="%(link)s">Cara untuk mendapatkan I2P, Darknet P2P anonim (menginstal Windows)</a> (Youtube Video) Tutorial ini menunjukkan cara menginstal dan mengkonfigurasi perangkat lunak yang diperlukan untuk mengakses I2P.
it: <a href="%(link)s">Essere consapevole su I2P, la darknet anonima basata su P2P (Installazione Windows)</a> (Video Youtube) Questa guida mostra come installare e configurare il software necessario per accedere ad I2P.
pt_br: <a href="%(link)s">Como iniciar-se na I2P, a darknet peer-to-peer anônima (instalação no Windows)</a> (Vídeo no Youtube) Esse tutorial mostra como instalar e configurar o software necessário para acessar a I2P.

source: <a href="%(link)s">How to connect to I2P</a> (Youtube Video) How to install I2P on Ubuntu.
id: <a href="%(link)s">Cara mengakses I2P</a> (Youtube Video) Cara Instal I2P pada Ubuntu.
it: <a href="%(link)s">Come connettersi ad I2P</a> (Video Youtube) Come installare I2P su Ubuntu.
pt_br: <a href="%(link)s">Como conectar-se a I2P</a> (Vídeo no Youtube) Como instalar o roteador I2P no Ubuntu.

source: <a href="%(link)s">Installing the I2P darknet software in Linux</a> (Video) Adrian Crenshaw. January 2011
id: <a href="%(link)s">Cara menginstal perangkat lunak darknet I2P di Linux</a> (Video) Adrian Crenshaw. Januari 2011
it: <a href="%(link)s">Installare la il software della darknet I2P su Linux</a> (Video) Adrian Crenshaw. Gennaio 2011
pt_br: <a href="%(link)s">Instalando o software da darknet I2P no Linux</a> (Vídeo). Por Adrian Crenshaw. Janeiro de 2011.

source: <a href="%(link)s">Short garlic routing animation</a> (Youtube Video) Adrian Crenshaw.
id: <a href="%(link)s">animasi singkat garlic routing</a> (Youtube Video) Adrian Crenshaw.
it: <a href="%(link)s">Breve animazione del sistema di routing garlic</a> (Video Youtube) Adrian Crenshaw.
pt_br: <a href="%(link)s">Uma pequena animação sobre o roteamento alho</a> (Vídeo no Youtube). Por Adrian Crenshaw.

source: Articles and Interviews
id: Artikel dan wawancara
it: Articoli ed interviste
pt_br: Artigos e Entrevistas

source: Lance James (0x90) Interviewed by DistributedCity <a href="%(link1)s">Part 1</a> <a href="%(link2)s">Part 2</a> July 26, 2002.
id: Lance James (0x90) yang diwawancarai oleh DistributedCity <a href="%(link1)s">Bagian 1</a> <a href="%(link2)s">Bagian 2</a> 26 Juli 2002.
it: Lance James (0x90) Intervistato da DistributedCity <a href="%(link1)s">Parte 1</a> <a href="%(link2)s">Parte 2</a> 26 Luglio, 2002.
pt_br: Lance James (0x90) entrevistado por DistributedCity. <a href="%(link1)s">Parte 1</a>. <a href="%(link2)s">Parte 2</a>. 26 de Julho de 2002.

source: Lance James (0x90) Interviewed by El Pas (original in Spanish) <a href="%(link)s">English translation</a> October 31, 2002.
id: Lance James (0x90) diwawancarai oleh El Pas (aslinya dalam bahasa Spanyol) <a href="%(link)s">terjemahan bahasa Inggris</a> 31 Oktober 2002.

source: <a href="%(link)s">2003 Business Week article referencing invisiblenet</a> September 14, 2003.
id: <a href="%(link)s">2003 business Week artikel membahas invisiblenet</a> 14 September 2003.

source: <a href="%(link)s">Netzwelt.de article about being anonymous in the Internet</a> (German) November 2007.
id: <a href="%(link)s">artikel di Netzwelt.de tentang menjadi anonim di Internet</a> (bahasa Jerman) November 2007.
it: <a href="%(link)s">Articolo di Netzwelt.de su come essere anonimi su Internet</a> (In tedesco) Novembre 2007.
pt_br: <a href="%(link)s">Artigo do site Netzwelt.de sobre anonimato na Internet</a> (Alemão), novembro de 2007.

source: <a href="%(link)s">zzz interviewed by gulli.com</a> March 2009 <a href="%(german)s">German translation</a>
id: <a href="%(link)s">Zzz diwawancarai oleh gulli.com</a> Maret 2009 <a href="%(german)s">terjemahan bahasa Jerman</a>
it: <a href="%(link)s">zzz intervistato da gulli.com</a> Marzo 2009 <a href="%(german)s">traduzione in Tedesco</a>
pt_br: <a href="%(link)s">zzz entrevistado por gulli.com</a>, março de 2009. <a href="%(german)s">Tradução para o alemão</a>.

source: <a href="%(mp3)s">zzz interviewed on the InfoSec Daily Podcast Ep. 454 (mp3)</a> August 18, 2011 (link dead, seeded inside I2P at <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">postman's tracker</a>)
id: <a href="%(mp3)s">ZZZ diwawancarai InfoSec Daily Podcast Ep.</a> 454 (mp3) 18 Agustus 2011 (link tidak aktif, di-seed di dalam I2P di <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">postman's tracker</a>)

source: <a href="%(link)s">I2P - Anonymity for the Masses</a>, Jonathan Cox, November 11, 2011.
id: <a href="%(link)s">I2P - anonimitas untuk masyarakat luas</a>, Jonathan Cox, 11 November 2011.
it: <a href="%(link)s">I2P - Anonimato per le masse</a>, Jonathan Cox, 11 Novembre 2011.
pt_br: <a href="%(link)s">I2P - Anonimato para as massas</a>, Jonathan Cox, 11 de novembro de 2011.

source: <a href="%(mp3)s">zzz and Lance James interviewed on the InfoSec Daily Podcast Ep. 596 (mp3)</a> February 16, 2012 (link dead, seeded inside I2P at <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">postman's tracker</a>)
id: <a href="%(mp3)s">ZZZ dan Lance James diwawancarai InfoSec Daily Podcast Ep.</a> 596 (mp3) 16 Februari 2012 (link tidak aktif, di-seed di dalam I2P di <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">postman's tracker</a>)

source: <a href="%(mp3)s">Jeff and Str4d interviewed on the Brakeing Down Security Podcast Ep. 2015-010 (mp3)</a> Part 1, February 28, 2015
id: <a href="%(mp3)s">Jeff dan Str4d diwawancarai di Brakeing Down Security Podcast Ep.</a> 2015-010 (mp3) bagian 1, 28 Februari 2015

source: <a href="%(mp3)s">Jeff and Str4d interviewed on the Brakeing Down Security Podcast Ep. 2015-011 (mp3)</a> Part 2, March 6, 2015
id: <a href="%(mp3)s">Jeff dan Str4d diwawancarai di Brakeing Down Security Podcast Ep.</a> 2015-011 (mp3) bagian 2, 6 Maret 2015

source: Other
id: Lainnya
it: Altro
pt_br: Outros

source: I2P mentioned in Netflix's "House of Cards" Season 2 Episode 2, February 14, 2014
id: I2p disebut di dalam Netflix's "House of Cards" Season 2 Episode 2, 14 Februari 2014
it: I2P è stato menzionato nell' episodio 2 della seconda stagione di "House of Cards" andato in onda su Netflix il 14 Febbraio 2014
pt_br: A I2P é mencionada em "House of Cards" da Netflix, 2o Episódio da 2a Temporada. 14 de fevereiro de 2014.

source: I2P Project Members
id: Anggota Proyek i2p
it: Membri del progetto I2P
pt_br: Membros do Projeto I2P

source: We are a small group of people spread around several continents, working to advance different aspects of the project and discussing the design of the network. <a href="%(volunteer)s">Get involved!</a>
id: Kami adalah sekelompok kecil orang yang tersebar di beberapa benua, bekerja untuk memajukan aspek yang berbeda dari proyek dan membahas rancangan jaringan. <a href="%(volunteer)s">Ikut terlibat!</a>
it: Siamo un piccolo gruppo di persone sparse su molti continenti, impegnate a migliorare diversi aspetti del progetto e discutere l'implementazione della rete. <a href="%(volunteer)s">Collabora con noi!</a>
pt_br: Somos um pequeno grupo de pessoas espalhadas por vários continentes, trabalhando para conseguir avanços em diferentes aspectos do projeto e mantendo discussões sobre a arquitetura da rede. <a href="%(volunteer)s">Envolva-se!</a>

source: Admin
id: Administrator
it: Amministratore

source: Project Manager
id: Manajer Proyek
it: Gestore del progetto
pt_br: Gerente do Projeto

source: point of contact of last resort
id: Cara kontak terakhir jika kontak lain tidak bisa dihubungi
it: punto di contatto dell'ultimo ritrovo

source: Treasurer
id: Bendahara
it: Tesoriere
pt_br: Tesoureiro

source: manage donations / accounts / bounties
id: mengelola sumbangan / akun / hadiah
it: gestione donazioni / pagamenti / sovvenzioni
pt_br: gerencia doações / somas / prêmios

source: PR manager
id: Manajer Humas
it: Manager PR

source: press contact, manages public relations and affairs
id: kontak untuk wartawan, mengelola humas
it: Contatti per la stampa, gestione pubbliche relazioni e questioni

source: Assistant PR manager
id: Asisten Manajer Humas

source: Public speaking, public relations assistance
id: Membantu manajer humas dalam public speaking
pt_br: Porta-voz, assistência com relações públicas

source: Technical PR advisor
id: Penasihat Teknis Humas

source: Public relations assistance
id: Membantu Humas

source: <a href="http://%(forum)s/">Forum</a> admin
id: <a href="http://%(forum)s/">Forum</a> administrator
it: <a href="http://%(forum)s/">Forum</a> amministratore
pt_br: Administrador do <a href="http://%(forum)s/">fórum</a>

source: manage the public user forum
id: mengelola forum pengguna umum
it: Gestione forum degli utenti pubblici
pt_br: modera o fórum público de usuários

source: Download mirrors admin
id: Administrator untuk Download Mirror
it: Amministratore dei mirrors di download
pt_br: Administrador dos espelhos de download

source: manage the mirrors for the download files
id: mengelola mirror untuk file download
it: gestisci i mirrors per per i files da scaricare
pt_br: gerencia os espelhos para os arquivos disponibilizados pra download

source: Website mirrors admin
id: Administrator untuk Website Mirror
it: Amministratore dei mirrors del sito web
pt_br: Administrador dos espelhos do website

source: vacant
id: ada lowongan
it: vacante
pt_br: vago

source: manage the mirrors for the website
id: mengelola mirror untuk website
it: gestisci i mirrors per il sito web
pt_br: gerencia os espelhos do website

source: <a href="%(monotone)s">Monotone</a> guru
id: Guru <a href="%(monotone)s">monoton</a>
it: Guru di <a href="%(monotone)s">Monotone</a>
pt_br: Guru do <a href="%(monotone)s">Monotone</a>

source: manage the public monotone repositories
id: mengelola repositori monotone publik
it: Gestione degli archivi pubblici di Monotone
pt_br: gerencia os repositórios públicos do Monotone

source: Linux (Debian/Ubuntu) distribution packager
id: Packager untuk distribusi Linux (Debian/Ubuntu)
it: Manutentore del pacchetto, Linux (Debian/Ubuntu)
pt_br: empacotador para as distribuições Linux (Debian, Ubuntu)

source: Windows installer packager
id: Packager untuk Windows installer
it: Manutentore del pacchetto Windows installer
pt_br: empacotador do instalador para Windows

source: Builds and signs the releases
id: Membangun dan menandatangani rilis
it: Assemblaggio e tracciamento delle versioni
pt_br: Escreve e assina os comunicados de lançamento

source: Maintain the I2P package in Tails
id: Maintain paket I2P di Tails

source: Maintain the Continuous Integration infrastructure
id: Maintain infrastruktur integrasi berkesinambungan

source: Monitors and recruits in-network update hosts
id: Memonitor dan merekrut update host di jaringan
it: Controllo e reclutamento host per gli aggiornamenti in-network

source: Monitors, advises and recruits reseed hosts
id: Monitor, memberikan nasihat dan merekrut reseed host
it: Controlli, notifiche e reclutamenti degli host di redistribuzione

source: Security expert
id: Pakar keamanan
it: Esperto di sicurezza
pt_br: Especialista em segurança

source: Manage the project bug tracker
id: Mengelola bug tracker proyek
it: Gestisci il bug tracker del progetto
pt_br: gerencia o rastreador de falhas, <i>bug tracker</i>, do projeto

source: manage the public project webservers
id: mengelola webservers proyek publik
it: gestione dei server web pubblici del progetto
pt_br: gerencia os servidores web do projeto

source: gather, prioritize, advocate for user needs
id: mengumpulkan, memprioritaskan, dan melakukan advokasi untuk kebutuhan pengguna
it: comprensione, priorità, difesa per le necessità dell'utente

source: manage the public project website content design
id: mengelola desain konten situs proyek publik
it: gestione della progettazione dei contenuti per il sito web pubblico del progetto

source: <a href="%(website)s">Webserver</a> admin
id: Admin <a href="%(website)s">webserver</a>
it: Amministratore di <a href="%(website)s">Webserver</a>
pt_br: Administrador do <a href="%(website)s">servidor web</a>

source: <a href="%(website)s">Website</a> admin
id: Admin <a href="%(website)s">situs web</a>
it: Amministratore di <a href="%(website)s">Website</a>
pt_br: Administrador do <a href="%(website)s">sítio na web</a>

source: manage the public project website content
id: mengelola konten situs web proyek publik
it: gestione del contenuto del sito web pubblico del progetto
pt_br: gerencia o conteúdo do website público do projeto

source: manage router console news feed
id: mengelola news feed di router console
it: Gestione news feed nella console del router
pt_br: gerencia o feed de notícias do painel do roteador

source: manage the backup news feed
id: Mengelola backup news feed
it: gestisci i news feed di backup

source: community motivator
id: Motivator komunitas
it: Motivatore della comunità
pt_br: incentivador da comunidade

source: Dev
id: Developer
it: Sviluppatore
pt_br: Desenv

source: lead dev for the SDK and router
id: memimpin pengembangan SDK dan router
it: Capo sviluppatore dell'SDK e del router
pt_br: desenv-chefe do SDK e do roteador

source: <a href="http://%(postman)s/">I2P mail</a> lead
id: lead <a href="http://%(postman)s/">I2P mail</a>
it: Capo sviluppatore della <a href="http://%(postman)s/">mail I2P</a>
pt_br: encarregado pelo <a href="http://%(postman)s/">I2P mail</a>

source: organize and develop the i2p mail system
id: Mengatur dan mengembangkan sistem email i2p
it: organizzazione e sviluppo del sistema mail di I2P
pt_br: organiza e desenvolve o sistema de email da I2P

source: <a href="http://%(i2host)s/">I2Host</a> lead
id: lead <a href="http://%(i2host)s/">I2Host</a>
it: Gestore del <a href="http://%(i2host)s/">I2Host</a>
pt_br: principal responsável pelo <a href="http://%(i2host)s/">I2Host</a>

source: I2Host addressbook application
id: Aplikasi addressbook I2Host
it: Programmazione della rubrica indirizzi di I2Host

source: <a href="http://%(bob)s/">BOB</a> lead
id: lead <a href="http://%(bob)s/">BOB</a>
it: Capo progettista di <a href="http://%(bob)s/">BOB</a>
pt_br: principal responsável pela <a href="http://%(bob)s/">BOB</a>

source: <a href="http://%(bote)s/">I2P-Bote</a> lead
id: lead <a href="http://%(bote)s/">I2P-Bote</a>
it: Capo progettista di <a href="http://%(bote)s/">I2P-Bote</a>
pt_br: principal responsável pelo <a href="http://%(bote)s/">I2P-Bote</a>

source: I2P-Bote plugin
id: Plugin I2P-Bote
pt_br: extensão I2P-Bote

source: <a href="http://%(bob)s/">Robert</a> lead
id: lead <a href="http://%(bob)s/">Robert</a>
it: Capo progettista di <a href="http://%(bob)s/">Robert</a>
pt_br: principal responsável pelo <a href="http://%(bob)s/">Robert</a>

source: Robert BitTorrent client
id: Client BitTorrent Robert
it: Client BitTorrent Robert
pt_br: Cliente BitTorrent Robert

source: <a href="http://%(forum)s/viewforum?f=25">I2Phex</a> lead
id: lead <a href="http://%(forum)s/viewforum?f=25">I2Phex</a>
it: Capo progettista di <a href="http://%(forum)s/viewforum?f=25">I2Phex</a>
pt_br: principal responsável pelo <a href="http://%(forum)s/viewforum?f=25">I2Phex</a>

source: I2Phex Gnutella client
id: Client Gnutella I2Phex
it: Client Gnutella I2Phex
pt_br: Cliente Gnutella I2Phex

source: <a href="http://%(forum)s/viewforum?f=21">I2PSnark</a> lead
id: lead <a href="http://%(forum)s/viewforum?f=21">I2PSnark</a>
it: Capo progettista di <a href="http://%(forum)s/viewforum?f=21">I2PSnark</a>
pt_br: principal responsável pelo <a href="http://%(forum)s/viewforum?f=21">I2PSnark</a>

source: Maintains the integrated Bittorrent client
id: Mengelola klien Bittorrent terintegrasi
it: Manutentore del client Bittorrent integrato
pt_br: Mantém o cliente Bittorrent integrado

source: <a href="http://%(forum)s/viewforum?f=30">iMule</a> lead
id: lead <a href="http://%(forum)s/viewforum?f=30">iMule</a>
it: Capo progettista di <a href="http://%(forum)s/viewforum?f=30">iMule</a>
pt_br: principal responsável pelo <a href="http://%(forum)s/viewforum?f=30">iMule</a>

source: eMule client over I2P
id: Client eMule di I2P
it: Client eMule su I2P
pt_br: Cliente eMule sobre a I2P

source: <a href="http://%(forum)s/viewforum?f=29">Syndie</a> lead
id: lead <a href="http://%(forum)s/viewforum?f=29">Syndie</a>
it: Capo progettista di <a href="http://%(forum)s/viewforum?f=29">Syndie</a>

source: Syndie development
id: Pengembangan Syndie
it: Sviluppatore di Syndie
pt_br: Desenvolvimento do Syndie

source: Susimail development
id: Pengembangan Susimail
it: Sviluppatore di Susimail
pt_br: Desenvolvimento do Susimail

source: Android development
id: Pengembangan Android
pt_br: Desenvolvimento para Android

source: Router console HTML/CSS design
id: Desain HTML / CSS di router console
it: Progettazione HTML/CSS della console del router
pt_br: Design HTML/CSS do painel do roteador

source: SAM maintainer
id: Pengelola SAM
it: Manutentore di SAM
pt_br: Mantenedor do SAM

source: C++ Router
id: Router C++
it: Router C++
pt_br: Versão em C++ do roteador

source: Translators
id: Penerjemah
it: Traduttori
pt_br: Tradutores

source: many many people!
id: Banyak banyak orang
it: tanta tanta gente!
pt_br: muita muita gente!

source: Contributors
id: Kontributor
it: Contributori
pt_br: Contribuidores

source: fire2pe dev, console enhancements
id: Pengembangan fire2pe dev, penambahan fungsi console
it: Sviluppo fire2pe, miglioramenti della console
pt_br: desenv. do fire2pe e aperfeiçoamentos no painel

source: Routerconsole backend and UI work, website revamp, unit tests work
id: Router console backend dan pekerjaan UI, perombakan situs web, pekerjaan tes unit
it: Backend del routerconsole, migliorie alla interfaccia utente, rinnovo sito web, lavoro sul testing d'unità
pt_br: Backend do painel do roteador e trabalhos na interface com o usuário, retoques no website, trabalhos de testes de unidade

source: The improved WSGI reseed script
id: Skrip WSGI yang telah disempurnakan

source: The ICToopie twist of itoopie (the new color mix for Purple I2P)
id: The ICToopie twist itoopie (campuran warna baru untuk Purple I2P)

source: Help needed on many fronts!
id: Bantuan dibutuhkan di banyak bidang!
it: Ci serve aiuto su molti fronti!
pt_br: Precisa-se de ajuda em muitas frentes!

source: Past contributors
id: Kontributor sebelumnya
it: Contributori del passato
pt_br: Contribuidores de outrora

source: I2PTunnel development, ministreaming library
id: Pengembangan I2PTunnel, ministreaming library
it: Sviluppo I2PTunnel, libreria ministreaming

source: i2pmail development
id: Pengembangan i2pmail
it: Sviluppo i2pmail
pt_br: Desenvolvimento do i2pmail

source: I2Phex (port of Phex to I2P)
id: I2Phex (port Phex ke I2P)
it: I2Phex (port di Phex su I2P)
pt_br: I2Phex (transporte do Phex para a I2P)

source: organize and develop the i2p-bt BitTorrent port
id: Mengatur dan mengembangkan port BitTorrent i2p-bt
it: organizzazione e sviluppo del port BitTorrent i2p-bt
pt_br: organiza e desenvolve o i2p-bt: transporte do BitTorrent para a I2P

source: addressbook, i2p-bt, syndie client development
id: Addressbook, i2p-bt, pengembangan syndie client
it: Sviluppo di addressbook, i2p-bt, client syndie

source: SAM jython code, work on stasher (DHT) and v2v (VoI2P)
id: SAM jython kode, bekerja pada stasher (DHT) dan v2v (VoI2P)
it: codice SAM jython code, lavoro su stasher (DHT) e v2v (VoI2P)

source: jbigi development, wiki migration, doc cleanup
id: pengembangan jbigi, migrasi wiki, pembersihan doc
it: sviluppo jbigi, migrazione wiki, pulizia documentazione

source: java debugging and client development on I2PTunnel and the router console
id: Debugging java dan pengembangan client di I2PTunnel dan router console
it: debugging java, sviluppo del client I2PTunnel e della console del router

source: docs. wiki migration
id: Dokumen migrasi wiki
it: documentazione, migrazione wiki
pt_br: documentação. migração da wiki

source: translations into French
id: penerjemahan ke bahasa Perancis
it: Traduzioni in francese
pt_br: traduções para o francês

source: C port of jcpuid
id: C port untuk jcpuid
it: Port in C di jcpuid

source: i2p-bt tracker development
id: pengembangan tracker i2p-bt
it: Sviluppo tracker i2p-bt

source: &hellip; and many others
id: &hellip; dan banyak lagi
it: &hellip; e molti altri
pt_br: &hellip; e muitos outros

source: I2PCon 2015 was the first event of its kind. It had two short-term goals. First, to provide the general public with an event where knowledge about privacy could be obtained. Second, to further the I2P project and its community with technical discussions about cryptography, anonymity and I2P-centric topics.
id: I2PCon 2015 adalah acara pertama. Ini mempunyai dua tujuan jangka pendek. Pertama, untuk menyediakan masyarakat umum dengan suatu peristiwa yang mana pengetahuan tentang privasi dapat diperoleh. Kedua, untuk memajukan proyek I2P dan komunitasnya dengan diskusi teknis tentang kriptografi, anonimitas dan topik I2P-sentris.

source: A a larger and more long-term goal of this event was to build a commnutiy of privacy-conscious individuals. By connecting people who recognize the importance of privacy, we wanted to provide a forum where this community can grow.
id: Tujuan yang lebih besar dan lebih jangka panjang dari acara ini adalah untuk membangun sebuah keberlangsungan dari individu yang sadar privasi. Dengan menghubungkan orang-orang yang menyadari pentingnya privasi, kami ingin menyediakan forum di mana komunitas ini dapat berkembang.
