Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/comparison.po
Languages: es, fr, id, ro

source: I2P Compared to Freenet
es: Comparación de I2P con Freenet
fr: I2P comparé à Freenet
id: I2P Dibandingkan dengan Freenet
ro: I2P in comparatie cu Freenet

source: Freenet is a fully distributed, peer to peer anonymous publishing network, offering secure ways to store data, as well as some approaches attempting to address the loads of a flash flood. While Freenet is designed as a distributed data store, people have built applications on top of it to do more generic anonymous communication, such as static websites and message boards.
es: Freenet es una red completamente distribuida, red anónima de publicación par a par, que ofrece una forma segura de almacenar datos, y también enfocada en solucionar los problemas de carga y desbordamientos. Mientras que Freenet está diseñada como un almacén distribuido de datos, la gente ha construido aplicaciones sobre el sistema para tener otras comunicaciones anónimas genéricas, como webs estáticas y foros.
fr: Freenet est entièrement distribué, c’est un réseau pair à pair de publication anonyme, offrant des moyens sûrs pour stocker des données, ainsi que des approches qui tentent de répondre aux charges d’une crue éclair. Alors que Freenet est conçu comme un magasin de données distribuées, des gens ont construit des applications par dessus celui-ci afin de faire de la communication anonyme plus générique, tels que des sites web statiques et des forums électroniques.
id: Freenet adalah sepenuhnya didistribusikan, jaringan yang menerbitkan peer to peer anonim, menawarkan cara aman menyimpan data, serta beberapa pendekatan yang berusaha mengatasi banjir flash. Sementara Freenet dirancang sebagai sebuah penyimpanan data terdistribusi, mereka telah membangun aplikasi diatas untuk melakukan komunikasi anonim yang lebih umum, seperti statistik website dan message boards.
ro: Freenet este o rețea de publicare anonima distribuita pe deplin, egal la egal , oferind metode sigure de a stoca date, precum și încearcă să facă fata inundărilor de trafic. În timp ce Freenet este conceput ca un depozit de date distribuite, persoane au construit aplicații pentru a face comunicarea anonimă mai generice, cum ar fi site-uri web statice și forumuri.

source: Compared to I2P, Freenet offers some substantial benefits - it is a distributed data store, while I2P is not, allowing people to retrieve the content published by others even when the publisher is no longer online. In addition, it should be able to distribute popular data fairly efficiently. I2P itself does not and will not provide this functionality. On the other hand, there is overlap for users who simply want to communicate with each other anonymously through websites, message boards, file sharing programs, etc. There have also been some attempts to develop a distributed data store to run on top of I2P, (most recently a port of <a href="%(tahoe)s">Tahoe-LAFS</a>) but nothing is yet ready for general use.
es: Comparado con I2P, Freenet ofrece substanciales beneficios - es un sistema distribuido de almacenamiento de datos, mientras que I2P no lo es, permitiendo a la gente obtener al contenido publicado por otros incluso cuando el que lo ha publicado no esté online. Además es capaz de distribuir eficientemente la información más utilizada. I2P ni tiene ni tendrá esta funcionalidad. Por otro lado, hay demasiada redundancia para los usuarios que simplemente quieren comunicarse con otros anónimamente a través de webs, foros, aplicaciones de compartición de archivos, etc. Ha habido varios intentos de desarrollar un sistema de almacenamiento distribuido funcionando sobre I2P, (más recientemente un port de <a href="%(tahoe)s">Tahoe-LAFS</a>) pero todavía no está listo para uso general.
fr: Comparé à I2P, Freenet offre des avantages considérables : c’est un magasin de données distribuées, alors qu’I2P ne l’est pas, ce qui permet de récupérer les contenus publiés par autrui, même si l’éditeur n’est plus en ligne. En outre, il devrait être en mesure de distribuer des données populaires assez efficacement. I2P même n’offre et n’offrira pas cette fonction. D’autre part, il existe un chevauchement pour les utilisateurs qui veulent simplement communiquer anonymement les uns avec les autres par les sites Web, les forums, les logiciels de partage de fichiers, etc. Il y a aussi eu des tentatives de développement d’un magasin de données distribuées qui fonctionnerait par-dessus I2P (plus récemment un portage de <a href="%(tahoe)s">Tahoe-LAFS</a>), mais rien n’est encore prêt pour une utilisation générale.
id: Dibandingkan dengan I2P, Freenet menawarkan beberapa keuntungan substansial - yaitu penyimpanan data terdistribusi, sementara I2P tidak, memungkinkan masyarkat mendapatkan konten yang diterbitkan oleh pengguna lain bahkan saat penerbit tidak lagi online. Selain itu, Freenet juga dapat mendistribusikan data populer cukup efisien. I2P sendiri tidak dan tidak akan menyediakan fungsionalitas ini. Di sisi lain, ada tumpang tindih untuk pengguna yang hanya ingin berkomunikasi dengan satu sama lain secara anonim melalui website, message boards, program file sharing, etc. Ada juga beberapa upaya untuk mengembangkan penyimpanan data terdistribusi untuk berjalan diatas I2P, (yang terakhir port dari <a href="%(tahoe)s">Tahoe-LAFS</a>) tetapi saat ini belum siap untuk penggunaan umum.
ro: Comparativ cu I2P, Freenet oferă unele avantaje substanțiale - este un depozit de date distribuite, în timp ce I2P nu este, permite oamenilor pentru a prelua conținutul publicat de către alte persoane, chiar atunci când editorul nu mai este on-line. În plus, ar trebui să fie în măsură de a distribui date populare destul de eficient. I2P în sine nu are și nu va oferi această funcționalitate. Pe de altă parte, există o suprapunere utilizatorilor care doar să comunice unul cu celălalt anonim prin intermediul site-uri, forumuri, programe de file sharing, etc asemenea, au existat câteva tentative de a elabora un magazin de date distribuite pentru a rula pe partea de sus a I2P, (cel mai recent un port de <a href="%(tahoe)s"> Tahoe-LAFS </ a>), dar nimic nu este inca gata pentru uz general.

source: However, even ignoring any implementations issues, there are some concerns about Freenet's algorithms from both a scalability and anonymity perspective, owing largely to Freenet's heuristic driven routing. The interactions of various techniques certainly may successfully deter various attacks, and perhaps some aspects of the routing algorithms will provide the hoped for scalability. Unfortunately, not much analysis of the algorithms involved has resulted in positive results, but there is still hope. At the very least, Freenet does provide substantial anonymity against an attacker who does not have the resources necessary to analyze it further.
es: Sin ,embargo, e incluso ignorando los problemas de implementación, hay algunas preocupaciones sobre la escalabilidad y el anonimato de algunos algoritmos de Freenet, debido básicamente a la heurística de ruteo de Freenet. La unión de varias técnicas puede desalentar el hacer varios tipos de ataques, y quizás algunos aspectos del algoritmo de ruteo podrían proveer la escalabilidad esperada. Desafortunadamente, no muchos de los análisis sobre los algoritmos han dado resultados satisfactorios, pero aún hay esperanzas. Al final, Freenet nos proporciona bastante anonimato contra cualquier atacante que no tenga los recursos necesarios para análisis completos.
fr: Cependant, même sans tenir compte des questions relatives aux mises en œuvre, il y a des préoccupations sur les algorithmes de Freenet à la fois sur l’évolutivité et la perspective d’anonymat, en raison en grande partie du mode de routage de Freenet, axé heuristique. Les interactions des différentes techniques peuvent certainement réussir à dissuader diverses attaques, et peut-être que certains aspects des algorithmes de routage peuvent faire espérer de l’évolutivité. Malheureusement, peu d’analyses des algorithmes concernés ont abouti à des résultats positifs, mais il reste encore de l’espoir. À tout le moins, Freenet fournit un anonymat substantiel contre un assaillant qui n’aurait pas les ressources nécessaires pour l’analyser davantage.
id: Akan tetapi, meskipun menghiraukan segala masalah implementasi, ada beberapa kekhawatiran mengenai algoritma Freenet dari kedua perspektif skalabilitas dan anonimitas, karena sebagian besar untuk routing pendorongan heuristic Freenet. Interaksi dari beragam teknik tentu bisa berhasil mencegah berbagai serangan, dan mungkin beberapa aspek algoritma routing akan memberikan skalabilitas yang diharapkan. Sayangnya, tidak banyak analisis algoritma yang diikut sertakan berhasil memberikan hasil yang positif, namun masih ada harapan. Setidaknya, Freenet tidak menyertakan anonimitas substansial terhadap penyerang yang tidak memiliki sumber daya yang diperlukan untuk menganalisa lebih jauh.
ro: Cu toate acestea, chiar și ignorând orice probleme implementării, există unele preocupări cu privire algoritmi Freenet scalabilitate și de perspectivă anonimata, datorită în mare parte la euristica Freenet condusa de rutare. Interacțiunile de diferite tehnici de siguranță pot descuraja cu succes diferite atacuri, și, probabil, unele aspecte ale algoritmilor de rutare va oferi sperat pentru scalabilitate. Din păcate, analiza nu demult a algoritmilor implicate a dus la rezultate pozitive, dar încă mai există speranță. Cel puțin, Freenet nu oferă anonimatul substanțial față de un atacator care nu are resursele necesare pentru a analiza în continuare.

source: Comparing I2P to other projects
fr: I2P comparé à d’autres projets
id: Membandingkan I2P dengan projek lain
ro: I2P in comparatie cu alte proiecte

source: There are a great many other applications and projects working on anonymous communication and I2P has been inspired by much of their efforts. This is not a comprehensive list of anonymity resources - both freehaven's <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> and GNUnet's <a href="https://www.gnunet.org/links/">related projects</a> serve that purpose well. That said, a few systems stand out for further comparison. The following have individual comparison pages:
es: Hay muchas otras buenas aplicaciones y proyectos trabajando en comunicaciones anónimas, e I2P se ha inspirado en muchos de sus esfuerzos. Esto no es una lista completa de recursos para el anonimato - ambos <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> y los <a href="https://www.gnunet.org/links/">proyectos relacionados</a> con GNUnet sirven también para ese mismo propósito. Dicho eso, pocos proyectos destacan como para comparaciones adicionales. Los siguientes proyectos tienen webs con comparaciones individuales:
fr: Il existe un grand nombre d’autres applications et de projets travaillant sur les communications anonymes et I2P s’en est largement inspiré. Cette liste est loin d’être exhaustive concernant le thème de l’anonymat (<a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> de Freehaven et les <a href="https://www.gnunet.org/links/">projets liés</a> à GNUnet servent à celà). Néanmoins, certains systèmes se prêtent bien à la comparaison. Les suivants disposent d’ailleurs d’une page dédiée :
id: Ada banyak aplikasi hebat dan projek lainnya yang bekerja pada komunikasi anonim dan I2P telah terinspirasi oleh banyak upaya mereka. Ini bukanlah daftar komprehensif sumber anonimitas - kedua freehaven <a href="http://freehaven.net/anonbib/topic.html">Bibliografi Anonimitas</a> dan <a href="https://www.gnunet.org/links/">projek terkait</a> GNUnet melayani tujuan yang baik. Mengatakan bahwa, beberapa sistem menonjol untuk perbandingan lebih lanjut. Berikut ini memiliki laman perbandingan individu:
ro: Există o mulțime de alte aplicații și proiecte ce lucrează asupra comunicării anonimă și I2P a fost inspirat de o mare parte a eforturilor lor. Aceasta nu este o listă completă a resurselor de anonimat - <a href="http://freehaven.net/anonbib/topic.html">Bibliografie Anonimatului</a> și de GNUnet <a href = "https://www .gnunet.org/link-uri/"> proiecte legate de </a> servesc acestui scop. Asa spus, câteva sisteme se disting prin comparație continua. Următoarele pagini au comparații individuale :

source: The following are discussed on the <a href="%(othernetworks)s">other networks page:</a>
es: Los siguientes proyectos son discutidos en la <a href="%(othernetworks)s">página sobre otras redes:</a>
fr: Ceux qui suivent sont discuté sur la page <a href="%(othernetworks)s">autres réseaux</a>
id: Berikut ini yang didiskusikan pada <a href="%(othernetworks)s">laman jaringan lain:</a>
ro: Următoarele sunt discutate pe pagina<a href="%(othernetworks)s">alte retele: </ a>

source: The content of this page is subject to update, discussion and dispute, and we welcome comments and additions. You may contribute an analysis by entering a <a href="%(trac)s">new ticket on Trac</a>.
fr: Le contenu de cette page est soumis à mises à jour, discussions et conflits, et nous accueillons avec plaisir les commentaires et ajouts. Vous pouvez nous faire part de votre analyse en saisissant un <a href="%(trac)s">nouveau ticket dans Trac</a>.
id: Konten pada laman ini tunduk pada informasi, diskusi dan perdebatan, dan kami menyambut komentar dan tambahan. Anda dapat mengkontribusikan analisis dengan memasukkan <a href="%(trac)s">tiket baru di Trac</a>.
ro: Conținutul acestei pagini este subiectul actualizarii, discuții și dispute, și observații și completări sunt binevenite. Puteți contribui o analiză prin introducerea unui <a href="%(trac)s"> bilet nou pe Trac </a>.

source: I2P Compared to Other Anonymous Networks
es: Comparación de I2P con otras redes anónimas
fr: I2P comparé à d’autres réseaux anonymes
id: I2P Dibandingkan dengan Jaringan Anonim Lain
ro: I2P Comparativ cu alte rețele anonime

source: The following networks are discussed on this page.
es: Las siguientes redes son discutidas en esta página.
fr: Les réseaux suivants sont abordés sur cette page.
id: Jaringan berikut ini didiskusikan pada laman ini.
ro: Urmatoarele rețele sunt discutate pe aceasta pagina.

source: Most of the following sections are fairly old, and may not be accurate. For an overview of available comparisons, see the <a href="%(comparison)s">main network comparisons page</a>. You may contribute an analysis by entering a <a href="%(trac)s">new ticket on Trac</a>.
fr: La plupart des sections suivantes sont assez vieilles et peuvent ne pas être précises. Pour une vue d’ensemble des comparaisons disponibles, voir la <a href="%(comparison)s">page de comparaisons réseau principale</a>. Vous pouvez également nous faire part de votre analyse en créant un <a href="%(trac)s">nouveau ticket dans Trac</a>.
id: Sebagian besar bagian berikut sudah cukup tua dan mungkin tidak akurat. Untuk overview perbandingan yang tersedia, silakan baca <a href="%(comparison)s">halaman perbandingan jaringan utama</a>. Anda dapat memberikan kontribusi analisis dengan memasukkan <a href="%(trac)s">tiket baru di Trac</a>.
ro: Cele mai multe dintre următoarele secțiuni sunt destul de vechi, și ar putea să nu fie exacte. Pentru o privire de ansamblu asupra comparații disponibile, a se vedea href="%(comparison)s"> pagina principală comparații rețea </ a>. Puteți contribui o analiză prin introducerea unui <a href="%(trac)s"> bilet nou pe Trac </ a>.

source: Morphmix and Tarzan are both fully distributed, peer to peer networks of anonymizing proxies, allowing people to tunnel out through the low latency mix network. Morphmix includes some very interesting collusion detection algorithms and Sybil defenses, while Tarzan makes use of the scarcity of IP addresses to accomplish the same. The two primary differences between these systems and I2P are related to I2P's <a href="%(threatmodel)s">threat model</a> and their out-proxy design (as opposed to providing both sender and receiver anonymity). There is source code available to both systems, but we are not aware of their use outside of academic environments.
es: Morphmix y Tarzan son las dos totalmente distribuidas, redes para a par anónimas con proxies para el anonimato, permitiendo a la gente enviar datos fuera a través de redes de mezcla de baja latencia. Morphmix incluye unos algoritmos de detección de colisiones bastante interesante y defensas contra Sybil, mientras que Tarzan hace uso de la escasez de direcciones IP para obtener lo mismo. Las dos principales diferencias entre estos dos sistemas e I2P tienen que ver con el <a href="%(threatmodel)s">modelo de amenazas</a> de I2p y su diseño de outproxies (al contrario que el anonimato proporcionado para ambos, el que envía y el que recibe) El código está disponible para ambos sistemas, pero no sabemos de su uso fuera de ambientes académicos.
fr: Morphmix et Tarzan sont tous les deux des réseaux pair à pair de mandataires d’anonymisation entièrement distribués, permettant aux utilisateurs de tunnelliser vers l’extérieur par le réseau de mélange à latence faible. Morphmix comportent des algorithmes très intéressants de détection de collusion et des défenses contre les Sybil, tandis que Tarzan fait appel à la rareté d’adresses IP pour accomplir la même chose. Les deux principales différences entre ces systèmes et I2P sont liées au <a href="%(threatmodel)s">modèle de menace</a> d’I2P et à leur conception de mandataire sortant (au lieu de fournir de l’anonymat à la fois à l’émetteur et au destinataire). Le code source est offert pour les deux systèmes, mais nous ne sommes pas au courant d’une utilisation en dehors des milieux universitaires.
id: Morphmix dan Tarzan adalah jaringan peer to peer proxi anonim terdistribusi penuh, yang memungkinkan orang untuk menggunakan tunnel melalui jaringan rendah latency. Morphmix mencakup beberapa algoritma deteksi collusion yang sangat menarik dan pertahanan Sybil, sementara Tarzan memanfaatkan kelangkaan alamat IP untuk mencapai hal yang sama. Dua perbedaan utama antara keduanya dan I2P ini adalah terkait dengan <a href="%(threatmodel)s">model ancaman</a> I2P dan desain out-proxy mereka (berlawanan dengan penyediaan pengirim dan penerima anonimitas). Ada source code yang tersedia untuk kedua sistem, tapi kami tidak mengetahui penggunaannya di luar lingkungan akademis.
ro: Morphmix și Tarzan sunt ambele complet distribuite , de tip peer-to-peer rețelele de proxy-uri anonime, care permit oamenilor să tunel prin intermediul rețelei de amestec scăzut latență. Morphmix include unele algoritmi foarte interesante de detectare a comploturilor și apărare Sybil, în timp ce Tarzan face uz de deficitul de adrese IP pentru a realiza aceasta. Cele două diferențe principale între aceste sisteme și I2P sunt legate de <a href="%(threatmodel)s"> modelul amenințare I2P </a> și proiectarea lor de-proxy (spre deosebire de a oferi atât anonimare expeditorului și receptorului). Există un cod sursă disponibil pentru ambele sisteme, dar noi nu sunt constienti de utilizarea lor în afara mediilor academice.

source: Mixminion and Mixmaster are networks to support anonymous email against a very powerful adversary. High-latency messaging applications running on top of I2P (for example <a href="%(syndie)s">Syndie</a> or I2PBote) may perhaps prove adequate to meet the threat model of those adversaries, while running in parallel along side the needs of low latency users, to provide a significantly larger anonymity set. High-latency support within the I2P router itself may or may not be added in a distant future release. It is too early to say if I2P will meet the needs of users requiring extreme protection for email.
fr: Mixminion et Mixmaster sont des réseaux pour offrir un système de courriel anonyme contre des adversaires très puissants. Les applications de messagerie à latence élevée fonctionnant sur I2P (par exemple <a href="%(syndie)s">Syndie</a> ou I2PBote) pourraient se révéler adéquates pour répondre au modèle de menace de ces adversaires, en s’exécutant simultanément aux besoins des utilisateurs à latence faible, pour fournir un jeu d’anonymat considérablement plus important. La prise en charge d’une latence élevée dans le routeur I2P même pourrait ou pas être ajoutée dans une version future éloignée. Il est trop tôt pour dire si I2P répondra aux besoins d’utilisateurs exigeant une protection extrême pour le courriel.
id: Mixminion dan Mixmaster adalah jaringan untuk mendukung email anonim terhadap musuh yang sangat kuat. Aplikasi pesan high-latency yang berjalan di atas I2P (misalnya <a href="%(syndie)s">Syndie</a> atau I2PBote) mungkin terbukti cukup untuk memenuhi ancaman model musuh tersebut, sementara berjalan secara paralel seiring kebutuhan pengguna low-latency, untuk menyediakan anonimitas yang secara signifikan lebih besar. Dukungan latency tinggi di dalam router I2P itu sendiri mungkin atau mungkin tidak ditambahkan dalam rilis di masa depan. Masih terlalu dini untuk mengatakan apakah I2P akan memenuhi kebutuhan pengguna yang membutuhkan perlindungan ekstrim untuk email.
ro: Mixminion și Mixmaster sunt rețele de suport e-mail anonim împotriva unui adversar foarte puternic. Aplicații high-latență de mesagerie care rulează pe partea de sus a I2P (de exemplu, <a href="%(syndie)s"> Syndie </ a> sau I2PBote) se poate dovedi, probabil, suficient pentru a satisface modelul amenințarea acestor adversari, în timp ce rulează în paralel de-a lungul partea de nevoile utilizatorilor latență redusă, pentru a oferi un set de anonimat semnificativ mai mare. Suport de înaltă latență în router-ul I2P în sine poate sau nu poate fi adăugat într-un comunicat viitor îndepărtat. Este prea devreme pentru a spune dacă I2P va satisface nevoile utilizatorilor care necesită protecție extrem de e-mail.

source: As with Tor and Onion Routing, both Mixminion and Mixmaster take the directory based approach as well.
es: Al igual que con Tor y Onion routing, Mixminion y Mixmaster toman también la aproximación basada en directorios.
fr: Comme Tor et Onion Routing, Mixminion et Mixmaster ont une approche basée sur un répertoire.
id: Seperti Tor dan Onion Routing, Mixminion dan Mixmaster juga mengambil pendekatan berbasis direktori.
ro: Ca și în cazul Tor și ceapa de rutare, atât Mixminion și Mixmaster ia o abordare bazată pe directorul
