Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/comparison.po
Languages: es, fr, id, ro

source: JAP (Java Anonymous Proxy) is a network of mix cascades for anonymizing web requests, and as such it has a few centralized nodes (participants in the cascade) that blend and mix requests from clients through the sequence of nodes (the cascade) before proxying out onto the web. The scope, threat model, and security is substantially different from I2P, but for those who don't require significant anonymity but still are not satisfied with an Anonymizer-like service, JAP is worth reviewing. One caution to note is that anyone under the jurisdiction of the German courts may want to take care, as the German Federal Bureau of Criminal Investigation (FBCI) has successfully mounted an <a href="%(url)s">attack</a> on the network. Even though the method of this attack was later found to be illegal in the German courts, the fact that the data was successfully collected is the concern. Courts change their minds based upon circumstance, and this is evidence that if a government body or intelligence agency wanted to, they could gather the data, even if it may be found inadmissible in some courts later)
es: JAP (Proxy Anónimo en Java) es una red de mezcla en cascadas para el anonimato de las solicitudes web que tiene varios nodos centrales (participantes en la cascada) que combinan y mezclan las solicitudes de los clientes a través de una secuencia de nodos (la cascada) antes de enviarlos por un proxy a la web. El alcance, modelo de amenazas y la seguridad son bastantes diferentes a las de I2P, pero para aquellos que requieran bastante anonimato pero no están satisfechos con un servicio de tipo anonimizador, puede venirles bien echarle un ojo a JAP. Un precaución que debe tener todo aquel que se encuentre bajo la jurisdicción de los juzgados alemanes, es que el German Federal Bureau of Criminal Investigation (FBCI) ha montado un <a href="%(url)s">ataque</a> con éxito sobre esta red. Incluso aunque el ataque se encontró más tarde ilegal en los juzgados alemanes, la realidad es que la información fue sustraída con éxito. Los jueces cambian sus mentes basados en las circunstancias, y esta es la evidencia de que si el gobierno quisiese la información podrían conseguirla, aunque fuese inadmisible más tarde en un juicio)
fr: JAP (mandataire anonyme Java) est un réseau de mélange en cascades pour l’anonymisation de demandes Web et comme tel a quelques nœuds centralisés (participants à la cascade) qui brassent et mélangent les requêtes des clients à travers la séquence de nœuds (la cascade) avant de les relayer vers le Toile par un mandataire. Le champ d’application, le modèle de menace et la sécurité sont sensiblement différents d’I2P, mais pour ceux qui n’exige pas un anonymat important, mais qui ne sont quand même pas satisfaits par un service genre Anonymizer, JAP mérite d’être examiné. Une précaution à noter pour toute personne relevant de la juridiction des tribunaux allemands, car le bureau fédéral allemand des enquêtes criminelles (FBCI) a monté avec succès une <a href="%(url)s"> attaque </a> contre le réseau. Même si la méthode de cette attaque a ensuite été jugée illégale par les tribunaux allemands, le fait que les données ont été recueillies avec succès est une préoccupation. Les tribunaux changent d’avis selon les circonstances et c’est la preuve que si un organisme gouvernemental ou une agence de renseignement le voulaient, ils pourraient recueillir les données, même si cela peut être déclaré irrecevable ultérieurement par certains tribunaux)
id: JAP (Java Anonymous Proxy) adalah jaringan mix cascades untuk menganonimkan web requests,Dan karena itu memiliki sedikit node terpusat (peserta dalam cascade) yang berbaurdan mencampur permintaan dari klien melalui urutan node (caskade) sebelummenggunakan proxy keluar ke internet biasa. Jangkauan, model ancaman, dan keamanan secara substansialberbeda dengan I2P, tapi bagi mereka yang tidak membutuhkan anonimitas yang signifikan tapi tetap sajatidak puas dengan layanan seperti Anonymizer, JAP layak untuk dipertimbangkan. Satuhal yang perlu diperhatikan adalah bahwa siapapun yang berada di bawah yurisdiksi pengadilan Jerman mungkin berhati-hati karena Biro Investigasi Kriminal Federal Jerman (FBCI) berhasil <a href="%(url)s">menyerang</a> jaringan tersebut. Meski metode serangan ini ternyata ilegaldi pengadilan Jerman, faktanya bahwa data berhasil dikumpulkan. Pengadilan mengubah pikiran mereka berdasarkan keadaan, dan ini adalah bukti bahwajika badan pemerintah atau badan intelijen menginginkannya, mereka bisa mengumpulkan datanyawalau kemudian tidak dapat diterima di pengadilan)
ro: JAP ( Java Proxy Anonim ) este o rețea de cascade de amestece pentru anonimizarea cererilor de web , și , ca atare, are câteva noduri centralizate ( participanții la cascada ), care amesteca cereri de la clienti prin secvența de noduri (cascadă ) înainte de proxy de pe web . Domeniul de aplicare , modelul de amenințare , si siguranța este substanțial diferită de I2P , dar pentru cei care nu au nevoie de anonimat semnificativ , dar încă nu sunt mulțumit cu un Anonymizer - cum ar fi serviciu , JAP este în valoare de revizuire . O remarcare de prudenta este faptul că oricine sub jurisdicția instanțelor germane ar putea dori să aibă grijă , ca Biroul Federal German de Investigații Penale ( FBCI ) a montat cu succes un <a href="%(url)s"> atac < /a> pe rețea . Chiar dacă metoda a acestui atac a fost ulterior dovedit a fi ilegal în instanțele germane , faptul că datele au fost colectate cu succes . Instanțele schimba mintea lor bazate pe situație , iar acest lucru este o dovadă că în cazul în care un organism guvernamental sau agenția de informații a vrut , ar putea aduna date , chiar dacă acesta poate fi găsite inadmisibile în unele instanțe mai târziu )

source: Both of these systems work through the same basic <a href="%(antnet)s">antnet</a> routing, providing some degree of anonymity based on the threat model of providing plausible deniability against a simple non-colluding adversary. With the antnet routing, they first either do a random walk or a broadcast search to find some peer with the data or identity desired, and then use a feedback algorithm to optimize that found path. This works well for applications that merely want to know what other people around them have to offer - "How are y'all doing" vs. "Hey Alice, how are you" - you basically get a local cluster of nodes that can share files with and maintain some degree of anonymity (though you don't have much control over who is in that group of peers).
fr: Ces deux systèmes fonctionnent par le même routage <a href="%(antnet)s">antnet</a> de base, fournissant un certain degré d’anonymat d’après un modèle de menace qui consiste à fournir un déni plausible contre un adversaire seul. Avec le routage d’antnet, soit ils appliquent d’abord un cheminement aléatoire, soit une recherche par diffusion pour trouver un pair ayant les données ou l’identité désirée. Ils utilisent ensuite un algorithme de rétroaction pour optimiser ce chemin trouvé. Cela fonctionne bien pour les applications qui veulent simplement savoir ce que les autres aux alentours ont à offrir. « Comment allez vous tous ? » par opposition à « Salut Alice, comment vas-tu ? ». Vous obtenez essentiellement une grappe locale de nœuds qui peuvent partager des fichiers et garder un certain niveau d’anonymat (quoique vous n’ayez pas beaucoup de contrôle sur qui est dans ce groupe de pairs).
id: Kedua sistem ini bekerja melalui dasar <a href="%(antnet)s">antnet</a> routing yang sama, yang memberikan beberapa derajat anonimitas berdasarkan model ancaman untuk memberikan penolakan yang masuk akal terhadap musuh sederhanya yang tidak berkolusi. Dengan antnet routing, mereka terlebih dahulu melakukan random walk atau siaran untuk menemukan beberapa peer dengan data atau identitas yang diinginkan, lalu gunakan algoritma umpan balik untuk mengoptimalkan jalur yang ditemukan. Ini bekerja dengan baik untuk aplikasi yang hanya ingin diketahui Apa yang orang lain di sekitar mereka tawarkan - "Bagaimana kabarmu" vs. "Hei Alice, apa kabarmu" -Anda pada dasarnya mendapatkan sekelompok node lokal yang dapat berbagi file dengan dan mempertahankan beberapa tingkat anonimitas (meski Anda tidak memiliki banyak kendali atas siapa yang berada dalam kelompok peer itu).
ro: Ambele din aceste sisteme funcționează prin aceeași baza <a href="%(antnet)s"> antnet </a> de rutare, oferind un anumit grad de anonimat bazat pe modelul amenințarea de a oferi negare plauzibilă față de un simplu adversar non-conspiră. Cu rutare antnet, ei în primul rând, fie fac o plimbare aleatoare sau o căutare difuzata a găsit unii utilizatori cu datele de identitate sau dorite, iar apoi folosiți un algoritm de feedback pentru a optimiza această cale gasita. Aceasta funcționează bine pentru aplicații care pur și simplu doresc să știe ce alți oameni din jurul lor au de oferit - "Cum voi face" vs "Hei Alice, ce mai faci" - veți obține de fapt un grup local, de noduri, care pot partaja fișiere cu și menține un anumit grad de anonimat (dacă nu aveți mai mult control asupra cine este în acel grup de colegii).

source: However, the algorithm does not scale well at all - if the application wants to speak with a particular peer it ends up doing a broadcast search or random walk (though if they are lucky enough for that to succeed, the antnet routing should optimize that found connection). This means that while these networks can work great at small scales, they are not suitable for large networks where someone wants to get in touch with another specific peer. That does not mean that there is no value in these systems, just that their applicability is limited to situations where their particular issues can be addressed.
es: Sin embargo, el algoritmo no escala bien del todo - si la aplicación quiere hablar con un par en particular termina haciendo una búsqueda broadcast o un paseo aleatorio (si son afortunados de que eso ocurra). Esto significa que mientras esas redes trabajan bien a escalas pequeñas, no son apropiadas para redes grandes donde alguien quiere ponerse en contacto con un par en particular. Esto no quiere decir que este sistema no tenga ningún valor, sólo que su aplicación está limitada a situaciones donde sus problemas pueden evitarse.
fr: Cependant, l’algorithme d’adaptation en taille (scale) ne se fait pas du tout - si l’application veut parler avec un pair en particulier cela finit par faire une large recherche (broadcast) ou une promenade aléatoire (random walk) (quoique s’ils ont assez de chance pour que cela réussisse, le routage antnet devrait optimiser cette connexion trouvée). Cela signifie que tandis que ces réseaux peuvent très bien marcher à petite échelle, ils ne sont pas appropriés pour de grands réseaux où quelqu’un veut se mettre en contact avec un autre pair spécifique. Cela ne signifie pas qu’il n’y a pas de valeur dans ces systèmes, juste que leur applicabilité est limitée aux situations où leur problèmes (issues) particuliers peuvent être adressés.
id: Namun, algoritmanya sama sekali tidak bagus - jika aplikasi ingin berbicara dengan peer tertentu akhirnya melakukan broadcast search atau random walk (meski jika mereka cukup beruntung, antnet routing harus mengoptimalkan koneksi yang ditemukan). Ini berarti sementara jaringan ini bisa bekerja hebat pada skala kecil, mereka tidak cocok untuk jaringan besar di mana seseorang ingin berhubungan dengan peer spesifik lainnya. Itu tidak berarti tidak ada manfaat dalam sistem ini, hanya saja penerapannya terbatas pada situasi di mana ada masalah tertentu harus diatasi
ro: Cu toate acestea, algoritmul nu scaleaza de bine la toate - în cazul în care cererea vrea să vorbească cu un anumit utilizator se termină prin a face o emisiune de căutare sau de mers aleator (deși, dacă acestea sunt suficient de norocos pentru a reuși, de rutare antnet ar trebui să optimizeze găsirea conexiunii). Acest lucru înseamnă că, în timp ce aceste rețele pot lucra bine la solzi mici, ele nu sunt potrivite pentru retele mari în cazul în care cineva vrea să intre în contact cu un alt inter pares. Asta nu înseamnă că nu există nicio valoare în aceste sisteme, doar că aplicabilitatea lor este limitată la situațiile în care problemele lor specifice pot fi abordate.

source: This was a closed-source network targeted at Iranian users. Tor did a <a href="%(torpost)s">good writeup on what to look for in a circumvention tool</a>. Suffice it to say that being closed source and publicly targeting a specific country are not good ideas. I2P is, of course, open source. However, that source, and our <a href="%(docs)s">technical documentation</a>, need much more review.
fr: C’était un réseau closed-source visant les utilisateurs iraniens. Tor a fait <a href="%(torpost)s">une bonne réécriture de ce que l’on doit chercher dans un outil de mise en échec</a>. Suffit-il de dire que être closed-source et cibler publiquement un pays spécifique ne sont pas de bonnes idées. I2P est, bien sûr, open-source. Cependant, ce code source, et notre <a href="%(docs)s">documentation technique</a>, nécessitent beaucoup plus d’examen.
id: Ini adalah jaringan closed source yang ditujukan untuk pengguna Iran. Tor <a href="%(torpost)s">menulis dengan baik tentang apa yang harus dicari dengan alat pengelakan</a>. Cukup dengan mengatakan bahwa menjadi closed source dan menargetkan secara publik negara tertentu bukanlah ide bagus. I2P tentu saja open source. Namun, source code-nya dan <a href="%(docs)s">dokumentasi teknis</a> perlu ditinjau lebih lanjut.
ro: Aceasta a fost o rețea închisă-source destinata utilizatorilor iraniene. Tor a făcut o <a href="%(torpost)s"> writeup bun asupra a ceea ce să caute într-un instrument de eludare </ a>. Este suficient să spunem că este o sursa închisă și care vizează în mod public o anumită țară nu sunt idei bune. I2P este, desigur, sursă deschisă. Cu toate acestea, această sursă, și documentația noastră <a href="%(docs)s">tehnice </a>, are nevoie de mult mai multa revizuire.

source: Paid VPN Services
es: Servicios VPN de pago
fr: Services RPV payants
id: Jasa VPN berbayar
ro: Servicii VPN platite

source: You may contribute an analysis by entering a <a href="%(trac)s">new ticket on Trac</a>.
fr: Vous pouvez contribuer par votre analyse en saisissant un <a href="%(trac)s">nouveau ticket dans Trac</a>.
id: Anda dapat memberikan kontribusi analisis dengan memasukkan <a href="%(trac)s">tiket baru di Trac</a>
ro: Puteți contribui o analiză prin introducerea unui <a href="%(trac)s"> bilet nou pe Trac </a>.

source: Others
es: Otros
fr: Autres
id: Lainnya
ro: Alții

source: I2P Compared to Tor
es: Comparación de I2P con Tor
fr: I2P Comparé à Tor
id: I2P dibandingkan dengan Tor
ro: I2P in comparatie cu Tor

source: November 2016
fr: Novembre 2016

source: Tor and Onion Routing are both anonymizing proxy networks, allowing people to tunnel out through their low latency mix network. The two primary differences between Tor / Onion-Routing and I2P are again related to differences in the threat model and the out-proxy design (though Tor supports hidden services as well). In addition, Tor takes the directory-based approach - providing a centralized point to manage the overall 'view' of the network, as well as gather and report statistics, as opposed to I2P's distributed <a href="%(netdb)s">network database</a> and <a href="%(peerselection)s">peer selection</a>.
es: Tor y el rutado Onion son ambas redes de proxies anónimas, que permiten a la gente salir a través de su red ya mezclada de baja latencia. Las dos primeras diferencias entre Tor/Onion-Routing e I2P están de nuevo relacionas con las diferencias en el modelo de amenazas y el diseño de los out-proxies ( a través de Tor soporta también servicios ocultos) Además, Tor usa un enfoque basado en directorios - creando un punto central para manejar la 'vista' general de las redes, y además se obtienen más estadísticas, al contrario que la <a href="%(netdb)s">base de datos de la red </a> dsitribuida de I2P y la <a href="%(peerselection)s">selección de pares</a>.
fr: Tor et le routage en oignon sont tous deux des réseaux mandataires d’anonymisation, permettant aux gens de tunnelliser par leur réseau de mélange à latence faible. Les deux principales différences entre Tor, le routage en oignon et I2P sont, encore une fois, liées à des différences dans le modèle de menaces et la conception du mandataire sortant (bien que Tor prenne aussi en charge les services cachés). De plus, Tor utilise une approche basée sur un annuaire, fournissant un point centralisé de gestion de la « vue » d’ensemble du réseau, recueille et rapporte aussi des statistiques, contrairement à la <a href="%(netdb)s">base de données de réseau</a> distribuée d’I2P et la <a href="%(peerselection)s">sélection de pairs</a>.
id: Tor dan Onion Routing keduanya menganonimkan jaringan proxy, memungkinkan orang untuk menggunakan tunnel melalui campuran jaringan latency rendah. Dua perbedaan utama antara Tor/Onion-Routing dan I2P adalah lagi-lagi terkait dengan perbedaan model ancaman dan desain out-proxy (meskipun Tor juga mendukung hidden service). Selain itu, Tor mengambil pendekatan berbasis direktori - menyediakan titik terpusat untuk mengelola keseluruhan 'tampilan' dari jaringan, serta mengumpulkan dan melaporkan statistik, berbeda dengan jaringan I2P di mana <a href="%(netdb)s">database</a> dan <a href="%(peerselection)s">peer selection</a> terdistribusi.
ro: Tor și Onion Routing sunt rețele anonime proxy, permițând oamenilor să tuneleze prin intermediul rețelei de amestec latență scăzuta. Cele două diferențe principale între Tor/onion-routing și I2P sunt în legătură cu diferențele de model-amenințare și de design de-proxy (deși Tor acceptă servicii ascunse, de asemenea). În plus, Tor are abordarea directorului bazat - pe oferirea unui punct centralizat de gestionare a "vederii" generale a rețelei, precum și adunarea și raportarea statistici, spre deosebire de I2P distribuita <a href = "% (netdb) s" > Baza de date rețea </ a> și <a href="%(peerselection)s">selecție egal la egal </ a>.

source: The I2P/Tor outproxy functionality does have a few substantial weaknesses against certain attackers - once the communication leaves the mixnet, global passive adversaries can more easily mount traffic analysis. In addition, the outproxies have access to the cleartext of the data transferred in both directions, and outproxies are prone to abuse, along with all of the other security issues we've come to know and love with normal Internet traffic.
es: El outproxy de I2P/Tor tiene varias debilidades contra cierto tipo de ataques - una vez que la comunicación deja la red Tor, adversarios pasivos puede hacer más fácilmente ataques de análisis. Además los outproxies tienen acceso al texto en claro transferido en las dos direcciones, y los outproxies son propensos a abusos, y además tenemos que tener en cuenta otros ataques posibles dentro del Internet normal.
fr: La fonction de mandataire sortant d’I2P/Tor présente quelques faiblesses importantes contre certains assaillants. Une fois que la communication quitte le réseau de mélange, les adversaires passifs de partout peuvent plus facilement mettre en place une analyse du trafic. De plus, les mandataires sortants ont accès aux données en clair transférées dans les deux sens, et les mandataires sortants sont sujets aux abus, en plus de tous les autres problèmes de sécurité inhérents au trafic normal d’Internet, que nous avons appris à connaître et à aimer.
id: Fungsi outproxy di I2P/Tor memang memiliki beberapa kelemahan substansial terhadap penyerang tertentu. Begitu komunikasi meninggalkan mixnet, global passive adversaries bisa lebih mudah melakukan analisis lalu lintas. Selain itu, outproxies memiliki akses teks dari data yang ditransfer kedua arah. Outproxies rentan terhadap penyalahgunaan dan semua masalah keamanan lainnya yang kita kenal di lalu lintas internet normal.
ro: Funcționalitatea outproxy I2P/Tor are câteva puncte slabe importante împotriva unor agresori - odata comunicarea părăsește mixnet, adversarea pasiva la nivel mondial se poate mai ușor monta analiza traficului. În plus, outproxies au acces la textul datelor transferate în ambele direcții, și outproxies sunt predispuse la abuz, împreună cu toate celelalte probleme de securitate le-am venit să-l cunoastem cu trafic normal din Internet.

source: However, many people don't need to worry about those situations, as they are outside their threat model. It is, also, outside I2P's (formal) functional scope (if people want to build outproxy functionality on top of an anonymous communication layer, they can). In fact, some I2P users currently take advantage of Tor to outproxy.
es: Aún así, mucha gente no tiene por que preocuparse por estas situaciones, ya que no están dentro del modelo de amenazas. Y además esto está fuera del alcance (fromal) de I2P (si la gente desea construir un outproxy sobre la capa de comunicación anónima, pueden hacerlo). De hecho, actualmente algunos usuarios utilizan el outproxy de Tor.
fr: Cependant, la plupart des gens ne doivent pas s’inquiéter de ces situations, car elles ne correspondent pas à leur modèle de menace. Et cela dépasse aussi le champ d’action fonctionnel (officiel) d’I2P (si des personnes veulent construire une fonction de mandataire sortant par-dessus une couche de communication anonyme, elles le peuvent). En fait, certains utilisateurs d’I2P utilisent actuellement Tor comme mandataire sortant.
id: Namun, banyak orang tidak perlu khawatir dengan hal tersebut karena mereka berada di luar model ancaman mereka. Demikian juga, di luar lingkup fungsional I2P (formal) (jika orang menginginkan untuk membangun fungsionalitas di atas Lapisan komunikasi anonim, mereka bisa). Bahkan, beberapa pengguna I2P saat ini memanfaatkan Tor untuk outproxy.
ro: Cu toate acestea, majoritatea persoanelor nu trebuie să faca griji cu privire la aceste situații, deoarece acestea sunt în afara modelului lor de amenințare. Este, de asemenea, în afara (formal) domeniul de aplicare funcțională I2P lui (în cazul în care oamenii doresc să construiască funcționalitate outproxy pe partea de sus a unui strat de comunicare anonimă, ei pot). De fapt, unii utilizatori de I2P în prezent profita de Tor la outproxy.

source: Comparison of Tor and I2P Terminology
es: Comparación de la terminología de I2P y Tor
fr: Comparaison de terminologie entre Tor et I2P
id: Perbandingan Terminologi di Tor dan I2P
ro: Compararea cu Tor și I2P terminologie

source: While Tor and I2P are similar in many ways, much of the terminology is different.
es: Mientras que Tor e I2p tienen algunas similitudes, mucha de la terminología cambia.
fr: Alors que Tor et I2P sont similaires à bien des égards, une grande partie de la terminologie est différente.
id: Walau Tor dan I2P serupa dalam banyak hal, sebagian terminologinya berbeda.
ro: În timp ce Tor și I2P sunt similare în multe feluri, o mare parte din terminologie este diferita.

source: Cell
es: Celda
fr: Cellule
ro: Celulă

source: Router or Client
es: Ruter o Cliente
fr: Routeur ou client
id: Router dan Klien
ro: Router sau Client

source: Directory
es: Directorio
fr: Répertoire
id: Direktori
ro: Dosar

source: NetDb
es: NetDb, baso de datos de la red
fr: BDréseau

source: Directory Server
es: Servidor de directorios
fr: Serveur répertoire
ro: Server de directoare

source: Floodfill Router
es: Ruter Floodfill o de relleno
fr: Routeur de remplissage par diffusion

source: Entry Guards
es: Control de entradas
fr: Seuils de portes (entry guards)
id: Entry Guard
ro: Gărzile de intrare

source: Fast Peers
es: Pares rápidos
fr: Pairs rapides
id: Peer cepat
ro: Utilizatori rapizi

source: Entry Node
es: Nodo de entrada
fr: Nœud d’entrée
ro: Nod de intrare
