Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/comparison.po
Languages: es, fr, id, ro

source: Mixminion and Mixmaster are networks to support anonymous email against a very powerful adversary. High-latency messaging applications running on top of I2P (for example <a href="http://syndie.i2p2.de/">Syndie</a> or I2PBote) may perhaps prove adequate to meet the threat model of those adversaries, while running in parallel along side the needs of low latency users, to provide a significantly larger anonymity set. High-latency support within the I2P router itself may or may not be added in a distant future release. It is too early to say if I2P will meet the needs of users requiring extreme protection for email.
es: Mixminion y Mixmaster son redes para el envío anónimo de emails. Aplicaciones de envío de mensajes de baja latencia sobre I2P (por ejemplo a href="http://syndie.i2p2.de/">Syndie</a> o⏎ I2PBote) podrían ser adecuadas para ese modelo de amenazas, ya que corriendo en paralelo cubre las necesidades de la baja latencia y crea una capa grande de anonimato. Soporte para alta latencia en los ruters de I2P puede que se añada en un futuro distante, o puede que no. Es demasiado pronto para decir si I2P podrá cubrir las necesidades de los usuarios con necesidades de protección extrema para sus emails.

source: This was a closed-source network targeted at Iranian users. Tor did a <a href="http://blog.torproject.org/blog/ten-things-look-circumvention-tool">good writeup on what to look for in a circumvention tool</a>. Suffice it to say that being closed source and publicly targeting a specific country are not good ideas. I2P is, of course, open source. However, that source, and our <a href="%(docs)s">technical documentation</a>, need much more review.
es: Esta era un red de código cerrado orientada a los usuarios iraníes. Tor hizo un buen <a href="http://blog.torproject.org/blog/ten-things-look-circumvention-tool"> artículo sobre el tema</a>. Baste decir que siendo de código cerrado y publicado para un país específico no es una buena idea. I2P, por supuesto, es de código libre. Sin embargo, el código, y nuestra <a href="%(docs)s">documentación técnica</a>, necesitan mucho más revisión.

source: You may contribute an analysis by entering a <a href="http://%(trac)s/report/1">new ticket on %(trac)s</a>.
es: Puede contribuir con análisis creando un <a href="http://%(trac)s/report/1">nuevo ticket en %(trac)s</a>.

source: Message
es: Mensaje
id: Pesan
ro: Mesaj

source: Client
es: Cliente
id: Klien

source: Circuit
es: Circuito

source: Tunnel
es: Túnel
ro: Tunel

source: RetroShare is a set of peer-to-peer applications running in a <a href="%(f2fwiki)s">Friend-to-friend (F2F)</a> network. Each peer of such F2F network makes direct IP connections only to authenticated peers ("friends") after explicit certificates exchange. It can discover unauthenticated peers (e.g. friends of friends), but connections to them are relayed over "friend" peers for providing privacy and anonymity.
id: RetroShare adalah kumpulam aplikasi peer-to-peer yang berjalan di dalam jaringan <a href="%(f2fwiki)s">Friend-to-friend (F2F)</a>. Setiap peer seperti jaringan F2F membuat koneksi IP langsung hanya kepada peers ("friends") yang terotentifikasi setelah pertukaran sertifikat secara eksplisit . Ini dapat menemukan peers yang tidak terotentifikasi (misalnya friends dari friends), tapi koneksi ke mereka dialihkan melalui "friend" peers untuk privasi dan anonimitas.

source: RetroShare is designed to build a private network of trusted peers, while I2P is designed to be a large-scaled public anonymous network. Recent versions of RetroShare have options to run as a public "darknet" by using I2P or Tor as a transport. That way all connections are anonymized and no trust is required for adding new "friends".
id: RetroShare didesain untuk membangun jaringan pribadi yang berisi peers terpercaya, sementara I2P didesain sebagai jaringan publik anonim berskala besar. Versi-versi terbaru RetroShare memiliki opsi untuk berjalan sebagai "darknet" publik dengan menggunakan I2P atau Tor sebagai transport. Dengan itu, semua koneksi menjadi anonim dan kepercayaan tidak diperlukan untuk menambah "friend" baru.
