Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/comparison.po
Languages: es, fr, id, ro

source: Inproxy
es: Inproxy, proxy de entrada
fr: Mandataire entrant

source: Exit Node
es: Nodo de salida
fr: Nœud de sortie
ro: Nod de ieșire

source: Outproxy
es: Outproxy, o proxy de salida
fr: Mandataire sortant

source: Hidden Service
es: Servicio oculto
fr: Service caché
ro: Serviciul ascuns

source: Eepsite or Destination
es: Eepsite o destinación
fr: Eepsite ou Destination
id: Eepsite atau distinasi
ro: Eepsite sau Destinatie

source: Hidden Service Descriptor
es: Descriptor de servicio oculto
fr: Descripteur de service caché
ro: Descriptor de serviciu ascuns

source: LeaseSet
fr: Jeu de baux

source: Introduction point
es: Punto de introducción
fr: Point d’introduction
ro: Punct de introducere

source: Inbound Gateway
es: Salida entrante
fr: Passerelle entrante
ro: Gateway intrare

source: Node
es: Nodo
fr: Nœud
ro: Nod

source: Router
es: Ruter
fr: Routeur
ro: Ruter

source: Onion Proxy
es: Proxy Onion
fr: Mandataire Onion
ro: Proxy ceapa

source: I2PTunnel Client (more or less)
es: Cliente de I2PTunnel (más o menos)
fr: Client I2PTunnel (plus ou moins)
id: I2PTunnel Client (kurang atau lebih)
ro: I2PTunnel client (mai multi sau mai puțini)

source: Onion Service
fr: Service Onion

source: Relay
fr: Relais
ro: Intermediere

source: Rendezvous Point
es: Punto de reunión
fr: Point Rendezvous
ro: Punct de rendezvous

source: somewhat like Inbound Gateway + Outbound Endpoint
es: algo así como inbound Gateway + Outbound Endpoint, salida entrante + punto final de salida
fr: un peu comme passerelle entrante + extrémité sortante (outbound endpoint)
id: Agak mirip seperti Inbound Gateway + Outbound Endpoint
ro: oarecum ca Gateway intrare + Endpoint ieșire

source: Router Descriptor
es: Descriptor del ruter
fr: Descripteur de routeur
ro: Descriptor ruter

source: RouterInfo
es: Información del ruter
fr: InfosRouteur

source: Server
es: Servidor
fr: Serveur

source: Benefits of Tor over I2P
es: Beneficios de Tor sobre I2p
fr: Avantages de Tor sur I2P
id: Manfaat Tor dibandingkan I2P
ro: Beneficiile Tor peste I2P

source: Much bigger user base; much more visibility in the academic and hacker communities; benefits from formal studies of anonymity, resistance, and performance; has a non-anonymous, visible, university-based leader
es: El número de usuarios es mucho mayor; mucho más visible en entorno académicos y comunidades de hackers; beneficios de tener estudios formales sobre el anonimato, resistencia y rendimiento; tienen un líder universitario no anónimo, de cara a público
fr: Plus grand nombre d’utilisateurs ; beaucoup plus de visibilité dans les communautés universitaires et hackers ; bénéficie d’études formelles d’anonymat, de résistance, et de performance ; a un chef de file universitaire non-anonyme, visible
id: Jumlah pengguna yang jauh lebih besar; Lebih banyak diperhatikan di komunitas akademis dan hacker; Mendapat manfaat dari studi formal tentang anonimitas, perlawanan, dan kinerja; Memiliki pemimpin non-anonim, terlihat, bertempat di universitas
ro: Baza mult mai mare de utilizatori; vizibilitate mult mai multa în comunitățile academice și hacker, beneficiaza de studii formale de anonimat, rezistenta, și de performanță, vizibila, liderul non-anonim universitate pe baza de

source: Has already solved some scaling issues I2P has yet to address
es: Ha resuelto ya algunos problemas de escalado que I2P aún debe arreglar.
fr: A déjà résolu certains problèmes d’échelle que I2P n’a pas eu encore à aborder
id: Sudah menyelesaikan beberapa masalah penskalaan I2P yang belum sempat ditangani
ro: S-au rezolvat deja unele probleme de scalare I2P a fost încă pentru adresare

source: Has significant funding
es: Tiene muchos fondos
fr: A un financement important
id: Memiliki pendanaan yang cukup banyak
ro: Are fonduri semnificative

source: Has more developers, including several that are funded
es: Tiene más desarrolladores, incluso algunos con fondos
fr: À plus de développeurs, dont plusieurs sont financés
id: Memiliki lebih banyak pengembang, termasuk beberapa yang mendapat pendanaan
ro: Are mai multe dezvoltatori, inclusiv câteva care sunt finanțate

source: More resistant to state-level blocking due to TLS transport layer and bridges (I2P has proposals for "full restricted routes" but these are not yet implemented)
es: Tiene un bloqueo de nivel de estado más resistente debido la capa de transporte TLS y a los puentes (I2P tienen propuestas de "rutas completamente restringidas" pero estas aún no están implementadas)
fr: Plus résistant au blocage au niveau d’un État en raison de la couche transport TLS et des ponts (I2P a des propositions pour des "routes restreintes pleines" mais celles-ci ne sont pas encore mises en œuvre)
id: Lebih tahan terhadap pemblokiran tingkat negara karena lapisan transport TLS dan jembatan (I2P memiliki proposal untuk "full restricted routes" tapi ini belum diterapkan)
ro: Mai rezistent la blocarea din cauza stratului transport TLS și poduri (I2P are propuneri pentru "rute restricționate complete", dar acestea încă nu sunt puse în aplicare )

source: Big enough that it has had to adapt to blocking and DOS attempts
es: Es tan grande que incluso se ha adaptado para bloquear los intentos de DOS
fr: Assez grand pour avoir dû s’adapter aux tentatives de blocage et de DOS
id: Cukup besar bahwa ia harus menyesuaikan diri dengan pemblokiran dan usaha DOS
ro: Suficient de mare pentru că a trebuit să se adapteze la blocarea și DOS încercări

source: Designed and optimized for exit traffic, with a large number of exit nodes
es: Diseñado para optimizar el tráfico de salida, con un gran número de nodos de salida
fr: Conçu et optimisé pour le trafic sortant, avec un grand nombre de nœuds de sortie
id: Dirancang dan dioptimalkan untuk lalu lintas keluar jaringan, dengan jumlah exit node yang banyak
ro: Concepute și optimizate pentru traficul de ieșire, cu un număr mare de noduri de ieșire

source: Better documentation, has formal papers and specifications, better website, many more translations
es: Mejor documentación, tiene estudios formales y especificaciones, una web mejor, y muchas traducciones
fr: Une meilleure documentation avec des articles et des spécifications formelles, un meilleur site Web, beaucoup plus de traductions
id: Dokumentasi yang lebih baik, memiliki dokumen dan spesifikasi formal, situs web yang lebih baik, lebih banyak terjemahan
ro: Documentația mai bună, are acte oficiale și specificațiile, site-ul mai bun, mult mai multe traduceri

source: More efficient with memory usage
es: Más eficiente con el uso de la memoria
fr: Plus efficace concernant l’utilisation de la mémoire
id: Lebih hemat dengan penggunaan memori
ro: Mai eficienta utilizarea memoriei

source: Tor client nodes have very low bandwidth overhead
es: Los nodos cliente de Tor tienen muy poco gasto de ancho de nada
fr: Les nœuds client de Tor ont une très faible surcharge de la bande passante
id: Tor client node memiliki overhead bandwidth yang sangat rendah
ro: Nodurile client Tor au foarte putin trafic overhead

source: Centralized control reduces the complexity at each node and can efficiently address Sybil attacks
es: El control centralizado reduce la complejidad de cada nodo y puede evitar ataques Sybil fácilmente
fr: Le contrôle centralisé réduit la complexité à chaque nœud et peut répondre efficacement à des attaques Sybil
id: Kontrol terpusat mengurangi kompleksitas pada masing-masing node dan secara efisien dapat menangani serangan Sybil
ro: Control centralizat reduce complexitatea de la fiecare nod și poate răspunde în mod eficient atacuri Sybil

source: A core of high capacity nodes provides higher throughput and lower latency
es: Un núcleo de nodos de gran capacidad proporciona una mayor rendimiento y menor latencia
fr: Un coeur de nœuds à grande capacité a la possibilité de fournir un plus haut débit tout en gardant une faible latence
id: Inti node berkapasitas tinggi memberikan nilai throughput lebih tinggi dan latency lebih rendah
ro: O bază de noduri de mare capacitate oferă transfer mai mare și latență mai mică

source: C, not Java (ewww)
es: C, no java (ey!)
fr: C, pas Java
id: C, bukan Java (hadeeeeuh)
ro: C, nu este Java (ewww)

source: Benefits of I2P over Tor
es: Beneficios de I2P sobre Tor
fr: Avantages d’I2P sur Tor
id: Manfaat I2P dibandingkan Tor
ro: Beneficiile I2P peste Tor

source: Designed and optimized for hidden services, which are much faster than in Tor
es: Diseñado para optimizar los servicios ocultos, que son mucho más rápidos que los de Tor
fr: Conçu et optimisé pour les services cachés, qui sont beaucoup plus rapide que dans Tor
id: Dirancang dan dioptimalkan untuk hidden servie, yang jauh lebih cepat daripada di Tor
ro: Concepute și optimizate pentru serviciile ascunse, care sunt mult mai rapide decât în Tor

source: Fully distributed and self organizing
es: Totalmente distribuido y auto organizado
fr: Entièrement distribué et auto-organisé
id: Sepenuhnya terdistribusi dan mengorganisi diri sendiri
ro: Complet distribuit și de auto organizare

source: Peers are selected by continuously profiling and ranking performance, rather than trusting claimed capacity
es: Los pares son seleccionados continuamente según el rendimiento y categoría, en vez de confiar en la capacidad indicada
fr: Les pairs sont choisis par profilage continu et par classement de leurs performances, plutôt que de se contenter de faire confiance à la capacité qu’ils revendiquent
id: Peer dipilih dengan terus melakukan profiling dan memeringkat kinerja, daripada mempercayai kapasitas yang diklaim
ro: Colegii sunt selectate de către profilare continua si clasament de performanță, mai degrabă decât încredere în capacitatea de a pretins

source: Floodfill peers ("directory servers") are varying and untrusted, rather than hardcoded
es: Los pares Floodfill ("servidores de directorios") cambian, en vez de estar siempre fijos.
fr: Les pairs de remplissage par diffusion (serveurs annuaires) varient et ne sont pas fiables, plutôt que figés dans le code
id: Floodfill peer ("server direktori") bervariasi dan tidak dipercaya, bukan hardcoded
ro: Colegii Floodfill ("serverele director") sunt diferiti și nu sunt de încredere, mai degrabă decât codate

source: Small enough that it hasn't been blocked or DOSed much, or at all
es: Tan pequeña que no ha sido bloqueada o Dosed.
fr: Tellement petit qu’il n’a pas été bloqué ni subi beaucoup de DOS, ou pas du tout
id: Cukup kecil bahwa itu belum pernah diblokir atau banyak di-DOS, atau sama sekali di-DOS
ro: Suficient de mici pentru că sa nu fie blocati sau administrati demult, sau deloc

source: Peer-to-peer friendly
es: Amigable con las aplicaciones p2p
fr: Favorable au pair-à-pair
id: Mudah berbagi file secara peer-to-peer seperti torrent
ro: Peer-to-peer prietenos

source: Packet switched instead of circuit switched
es: Conmutado por paquete en vez de conmutado por circuito
fr: Commutation de paquets à la place de commutation de circuit
id: Packet switched alih-alih circuit switched
ro: Comutarea pachetelor în loc de comutarea circuitelor

source: implicit transparent load balancing of messages across multiple peers, rather than a single path
es: Implica control de carga transparente de los mensajes a través de múltiples pares, en vez de por un sólo camino.
fr: équilibrage de charge transparent et implicite des messages à travers plusieurs pairs, plutôt que par un seul chemin
id: Penyeimbangan beban transparan secara implisit terhadap pesan di beberapa peer, bukan satu jalur tunggal
ro: balansare incarcarii implicita si transparentă a mesajelor pe mai multe colegii, mai des decât o singură cale

source: resilience vs. failures by running multiple tunnels in parallel, plus rotating tunnels
es: Resistencia contra fallos ya que usa varios túneles en paralelo, además de rotar los túneles
fr: résistance contre les défaillances, ceci par exécution de plusieurs tunnels en parallèle, ainsi que par rotation des tunnels
id: Ketahanan vs kegagalan dengan menjalankan beberapa tunnel secara paralel, ditambah rotating tunnel
ro: rezistența vs eșecurile prin rularea mai multor tuneluri în paralel, plus tuneluri rotative

source: scale each client's connections at O(1) instead of O(N) (Alice has e.g. 2 inbound tunnels that are used by all of the peers Alice is talking with, rather than a circuit for each)
es: el número de conexiones en i2p vienen dado por O(1) en vez de O(N) (por ejemplo, Alice tiene 2 túneles de entrada que son usados por todos los pares con lo que habla Alice, en vez de un circuito por cada par)
fr: s’adapte à l’échelle des connexions de chaque client à O(1) au lieu de O(N) (Alice a par exemple 2 tunnels entrants qui sont utilisés par tous les pairs avec lesquels parle Alice, plutôt qu’un circuit pour chaque)
id: Skala setiap koneksi klien di O(1) dan bukan O(N) (Alice memiliki 2 inbound terowongan yang digunakan oleh semua peer yang sedang berbicara dengan Alice, bukan satu rangkaian untuk masing-masing)
ro: scala conexiuni ale fiecărui client la O (1) în loc de O (N) (Alice de exemplu are 2 tuneluri de intrare care sunt utilizate de către toti colegi cu care Alice converseaza , mai degrabă decât un circuit pentru fiecare)

source: Unidirectional tunnels instead of bidirectional circuits, doubling the number of nodes a peer has to compromise to get the same information.
es: Túneles unidireccionales en vez de circuitos bidireccionales, usando el doble de nodos un par se compromete más par obtener la misma información.
fr: Tunnels unidirectionnels au lieu de circuits bidirectionnel, doublant le nombre de nœuds qu’un pair doit avoir à compromettre pour obtenir la même information.
id: Tunnel searah dan bukan rangkaian dua arah, menggandakan jumlah node peer harus berkompromi untuk mendapatkan informasi yang sama.
ro: Tuneluri unidirecționale în loc de circuite bidirecționale, dublarea numărului de noduri colegilor trebuie să facă un compromis pentru a obține aceleași informații.

source: Counter-arguments and further discussion <a href="%(netdb)s">here</a>.
fr: Contre-arguments et discussion plus poussée <a href="%(netdb)s">ici</a>.
id: Argumen yang bertentangan dan pembahasan lebih lanjut ada <a href="%(netdb)s">di sini</a>.

source: Protection against detecting client activity, even when an attacker is participating in the tunnel, as tunnels are used for more than simply passing end to end messages (e.g. netDb, tunnel management, tunnel testing)
es: Protección contra la detección de la actividad de un cliente, incluso cuando un atacante participa en el túnel, ya que los túneles no son sólo usados para pasar el mensaje de punto a punto (por ejemplo, netDB, administración de túneles, pruebas en los túneles)
fr: Protection contre la détection de l’activité du client, même si un assaillant participe au tunnel, puisque les tunnels ne sont pas juste utilisés pour passer simplement des messages de bout en bout (p. ex. BDréseau, gestion de tunnels, test de tunnels)
id: Perlindungan terhadap mendeteksi aktivitas klien, bahkan saat penyerang berpartisipasi dalam terowongan karena terowongan digunakan lebih dari sekedar menyampaikan pesan end-to-end (misalnya netDb, pengelolaan tunnel, pengujian tunnel)
ro: Protecția împotriva detectarii de activitate clientului, chiar și atunci când un atacator participă la tunel, așa cum tuneluri sunt folosite pentru mai multe decât pur și simplu trecerea intr-un capăt mesaje finali (de exemplu netDb, managementul tunel, tunel

source: Tunnels in I2P are short lived, decreasing the number of samples that an attacker can use to mount an active attack with, unlike circuits in Tor, which are typically long lived.
es: Los túneles de I2P tienen una vida corta, reduciendo el número de muestras que un atacante puede usar para lograr un ataque activo, al contrario que con los circuitos en Tor, que son típicamente de larga duración.
fr: Dans I2P, les tunnels ont une durée de vie courte, diminuant ainsi le nombre d’échantillons qu’un assaillant peut utiliser pour lancer une attaque active, contrairement aux circuits dans Tor, qui ont généralement une durée de vie longue.
id: Terowongan di I2P berumur pendek, mengurangi jumlah sampel yang dapat digunakan penyerang untuk memasang serangan aktif, tidak seperti sirkuit di Tor, yang biasanya berumur panjang.
ro: Tunelurile din I2P sunt de scurtă durată, scăderea numărului de probe care un atacator poate folosi pentru a monta un atac activ , spre deosebire de circuite din Tor, care de obicei au viata lunga.

source: I2P APIs are designed specifically for anonymity and security, while SOCKS is designed for functionality.
es: Los APIs de I2P están específicamente diseñados para el anonimato y la seguridad, mientras que SOCKS está diseñado para su funcionalidad.
fr: Les API d’I2P sont conçues précisément pour assurer anonymat et sécurité, tandis que SOCKS est conçu pour la fonctionnalité.
id: API I2P dirancang khusus untuk anonimitas dan keamanan, sementara SOCKS dirancang untuk fungsionalitas.
ro: I2P API-uri sunt proiectate special pentru anonimatul și securitate, în timp ce SOCKS este proiectat pentru funcționalitate.

source: Essentially all peers participate in routing for others
es: Básicamente todos los pares participan en el rutado de otros
fr: Par essence, tous les pairs participent à acheminer pour d’autres
id: Intinya semua peer berpartisipasi dalam routing untuk peer lain
ro: În esență, toți colegii participa la rutare pentru alții

source: The bandwidth overhead of being a full peer is low, while in Tor, while client nodes don't require much bandwidth, they don't fully participate in the mixnet.
es: El uso de ancho de banda de cualquier par completo es bajo, mientras que en Tor, aunque un nodo cliente no necesita mucho ancho de banda, realmente no participan completamente en la red.
fr: Être un pair à part entière ne présente qu’une faible surcharge de bande passante, alors que dans Tor, bien que les nœuds client n’exigent que peu de bande passante, ils ne participent pas complètement au réseau de mélange.
id: Pengeluaran tambahan bandwidth dengan menjadi full peer sangat rendah, sementara Tor, ketika simpul klien tidak memerlukan banyak bandwidth, mereka tidak berpartisipasi penuh dalam mixnet.
ro: Overhead de bandă a utilizatorului este scăzut, decit în Tor, în timp ce nodurile client nu necesită mai mult de lățime de bandă, ele nu participă pe deplin la mixnet.

source: Integrated automatic update mechanism
es: Sistema integrado de actualizaciones automáticas
fr: Mécanisme intégré de mise à jour automatique
id: Mekanisme pembaruan otomatis terintegrasi
ro: Mecanism integrat de actualizare automată

source: Both TCP and UDP transports
es: Ambos tipos de transporte, TCP y UDP
fr: Utilise à la fois les transports TCP et UDP
id: Baik transpor TCP dan UDP
ro: Atât TCP cit și UDP transporturi

source: Java, not C (ewww)
es: Java, en vez de C (ewww)
fr: Java, pas C
id: Java, bukan C (ewww)
ro: Java nu e C (ewww)

source: Other potential benefits of I2P but not yet implemented
es: Otros beneficios potencial de I2P aún no implementados
fr: Autres avantages potentiels d’I2P, mais pas encore mis en œuvre
id: Potensi keuntungan I2P lainnya namun saat ini belum diimplementasikan
ro: Alte beneficii ale I2P dar neimplementate încă

source: ...and may never be implemented, so don't count on them!
es: ...y puede ser que nunca lleguen a ser implementados, ¡osea que no cuente con ellos!
fr: ... et qui pourraient ne jamais être mis en œuvre, alors ne comptez pas sur eux !
id: ...dan mungkin tidak pernah diimplementasikan, jadi jangan mengandalkan mereka!
ro: ... și posibil sa nu fie puse în aplicare, astfel încât nu conta pe ei!

source: Defense vs. message count analysis by garlic wrapping multiple messages
es: Defensa contra el análisis de conteo de mensajes envolviendo múltiples mensajes dentro de la red garlic
fr: Défense contre l’analyse du nombre de messages par enveloppement en ail de plusieurs messages
id: Pertahanan vs. analisis penghitung pesan dengan membungkus beberapa pesan seperti bawang
ro: Apărare vs analiza numărului de mesaje de ambalaj usturoi invelite mai multe mesaje

source: Defense vs. long term intersection by adding delays at various hops (where the delays are not discernible by other hops)
es: Defensa contra la intersección a largo plazo añadiendo demoras en varios saltos (donde las demoras no son perceptibles por los oros saltos)
fr: Défense contre intersection long terme en ajoutant des retards à différents sauts (où les retards ne sont pas discernables par d’autres sauts)
id: Pertahanan vs. persimpangan jangka panjang denga menambahkan delay pada berbagai hop (dimana delay tidak terlihat oleh hop lain)
ro: Apărare vs intersecție pe termen lung prin adăugarea de întârzieri la diferite hamei (în cazul în care întârzierile nu sunt perceptibile prin alte hamei)

source: Various mixing strategies at the tunnel level (e.g. create a tunnel that will handle 500 messages / minute, where the endpoint will inject dummy messages if there are insufficient messages, etc)
es: Varias estrategias de mezclado el nivel del túnel (por ejemplo, creando túneles que manejaran 500 mensajes al minuto, donde el punto final inyectará mensajes de relleno si no hubiese suficientes mensajes, etc)
fr: Diverses stratégies de mélange au niveau du tunnel (par exemple créer un tunnel qui va gérer 500 messages / minute, dans lequel le point final va injecter des messages factices si il y a une nombre de messages insuffisant, etc)
id: Berbagai strategi pencampuran pada level saluran (misal, membuat saluran yang akan menangani 500 pesan / menit, yang mana titik akhir akan menginjek pesan dummy jika ada ketidakcukupan pesan, dll)
ro: Diverse strategii de amestecare la nivel tunel (de exemplu, a crea un tunel care se va ocupa 500 de mesaje / minut, în cazul în care obiectivul va injecta mesaje false dacă există mesaje insuficiente, etc)

source: The content of this page is subject to update, discussion and dispute, and we welcome comments and additions. You may contribute an analysis by entering a <a href="http://%(trac)s/report/1">new ticket on Trac</a>.
es: El contenido de esta página puede ser objeto de actualizaciones, discusión y disputa, y aprobamos comentarios y adiciones. Puede contribuir al análisis creando una <a href="http://%(trac)s/report/1">nueva entrada en el Trac</a>.

source: Most of the following sections are fairly old, and may not be accurate. For an overview of available comparisons, see the <a href="%(comparison)s">main network comparisons page</a>. You may contribute an analysis by entering a <a href="http://%(trac)s/report/1">new ticket on %(trac)s</a>.
es: La mayoría de las siguientes secciones son bastante viejas y podrían no ser precisas. Para una vista general de comparaciones disponibles, vea la<a href="%(comparison)s">página principal de comparaciones entre redes</a>. Pude contribuir al análisis creando un <a href="http://%(trac)s/report/1">nuevo ticket en el %(trac)s</a>.
