Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Can the establishment messages be randomly padded somehow, to frustrate identification of I2P traffic based on initial packet sizes?
es: ¿Pueden ser rellenado aleatoriamente de alguna forma el mensaje establecido, para evitar la identificación del tráfico I2P basado en el tamaño del paquete inicial?

source: Secure Semireliable UDP
es: UDP Seguro Semifiable

source: SSU (also called "UDP" in much of the I2P documentation and user interfaces) is one of two <a href="%(transports)s">transports</a> currently implemented in I2P. The other is <a href="%(ntcp)s">NTCP</a>.
es: SSU (también llamado "UDP" en gran parte de la documentación de I2P y de los interfaces de usuario) es uno de los dos <a href="%(transports)s">transportes</a> actualmente implementados en I2P. El otro es <a href="%(ntcp)s">NTCP</a>.

source: SSU is the newer of the two transports, introduced in I2P release 0.6. In a standard I2P installation, the router uses both NTCP and SSU for outbound connections. SSU-over-IPv6 is supported as of version 0.9.8.
es: SSU es el más reciente de los dos transportes, introducidos en la versión 0.6 de I2P. En una instalación I2P standard, el router usa tanto NTCP como SSU para conexiones salientes. SSU-sobre-IPv6 está soportado desde la versión 0.9.8.

source: SSU is called "semireliable" because it will repeatedly retransmit unacknowledged messages, but only up to a maximum number of times. After that, the message is dropped.
es: SSU (UDP seguro semifiable) se llama "semifiable" porque retransmitirá repetidamente mensajes de no recibidos completamente, pero sólo hasta un número máximo de veces. Después de esto, el mensaje es descartado.

source: SSU Services
es: Servicios SSU

source: Like the NTCP transport, SSU provides reliable, encrypted, connection-oriented, point-to-point data transport. Unique to SSU, it also provides IP detection and NAT traversal services, including:
es: Al igual que el transporte NTCP, SSU proporciona un transporte de datos de punto-a-punto, orientado a conexión, fiable y. A diferencia de SSU, también proporciona detección de servicios de NAT transversales, incluyendo:

source: Cooperative NAT/Firewall traversal using <a href="#introduction">introducers</a>
es: NAT/cortafuego trasversal cooperativo usando <a href="#introduction">introductores</a>

source: Local IP detection by inspection of incoming packets and <a href="#peerTesting">peer testing</a>
es: Detección de la IP local inspeccionado los paquetes de entrada y la <a href="#peerTesting">prueba de pares</a>

source: Communication of firewall status and local IP, and changes to either to NTCP
es: Comunicación del estado del cortafuegos y de la IP local, y los cambios en cualquiera de ellos a NTCP

source: See below
es: Vea debajo

source: Protocol Details
es: Detalles del protocolo

source: Congestion control
es: Control de congestión

source: SSU's need for only semireliable delivery, TCP-friendly operation, and the capacity for high throughput allows a great deal of latitude in congestion control. The congestion control algorithm outlined below is meant to be both efficient in bandwidth as well as simple to implement.
es: Gracias a que SSU sólo necesita entrega semifiable, a una operativa compatible con TCP, y a la capacidad para un alto rendimiento, esto permite un amplio abanico de posibilidades en el control de congestión. El algoritmo de control de congestión esbozado debajo está pensado para ser tanto eficiente en ancho de banda, como fácil de implementar.

source: Packets are scheduled according to the router's policy, taking care not to exceed the router's outbound capacity or to exceed the measured capacity of the remote peer. The measured capacity operates along the lines of TCP's slow start and congestion avoidance, with additive increases to the sending capacity and multiplicative decreases in face of congestion. Unlike for TCP, routers may give up on some messages after a given period or number of retransmissions while continuing to transmit other messages.
es: Los paquetes son programados de acuerdo con la política del ruter, teniendo cuidado de no exceder la capacidad de salida del ruter o de exceder la capacidad medida en el par remoto. La capacidad medida opera según el inicio lento y la prevención de la congestión de TCP, con aumentos que se suman a la capacidad de envío y disminuciones en caso de congestión. Al contrario que TCP, algunos ruters pueden renunciar a algunos mensajes despues de un periodo indicado o un número de retransmisiones, mientras que continúa transmitiendo otros mensajes.

source: The congestion detection techniques vary from TCP as well, since each message has its own unique and nonsequential identifier, and each message has a limited size - at most, 32KB. To efficiently transmit this feedback to the sender, the receiver periodically includes a list of fully ACKed message identifiers and may also include bitfields for partially received messages, where each bit represents the reception of a fragment. If duplicate fragments arrive, the message should be ACKed again, or if the message has still not been fully received, the bitfield should be retransmitted with any new updates.
es: Las técnicas de detección de congestión tampoco son iguales a las de TCP, ya que cada mensaje tiene su identificador único y no secuencial, y cada mensaje tiene un tamaño limitado - como máximo, 32 KB. Para transmitir eficientemente esta respuesta al remitente, el receptor periódicamente incluye una lista de identificadores de mensaje totalmente 'ACKed' y también puede incluir campos de bits, 'bitfields', para los mensajes recibidos parcialmente, donde cada bit representa la recogida de un fragmento. Si llegan fragmentos duplicados, el mensaje deber ser 'ACKed' de nuevo, o si el mensaje aún no ha sido recibido en su totalidad, el bitfield debería ser retransmitido con cualquier nuevo cambio.

source: The current implementation does not pad the packets to any particular size, but instead just places a single message fragment into a packet and sends it off (careful not to exceed the MTU).
es: La implementación actual no rellena los paquetes a un tamaño en particular, en cambio simplemente coloca un solo fragmento de un mensaje dentro de un paquete y lo envía para fuera (con cuidado de no exceder el MTU).

source: As of router version 0.8.12, two MTU values are used for IPv4: 620 and 1484. The MTU value is adjusted based on the percentage of packets that are retransmitted.
es: A partir de la versión del ruter 0.8.12 se usan dos valores de MTU para IPv4: 620 y 1484. El valor del MTU es reajustado dependiendo del porcentaje de paquetes que es retrasnmitido.

source: For both MTU values, it is desirable that (MTU &#37; 16) == 12, so that the payload portion after the 28-byte IP/UDP header is a multiple of 16 bytes, for encryption purposes.
es: Para ambos valores MTU (unidad máxima de transmisión), es deseable que (MTU &#37; 16 == 12), así que la porción de la carga tras la cabecera de 28-bytes IP/UDP es un múltiplo de 16 bytes, para propositos de cifrado.

source: For the small MTU value, it is desirable to pack a 2646-byte Variable Tunnel Build Message efficiently into multiple packets; with a 620-byte MTU, it fits into 5 packets with nicely.
es: Para el valor más pequeño de MTU, es preferible empaquetar un mensaje de construcción de túnel variable de 2646 bytes eficientemente dentro de múltiples paquetes; el MTU de 620 bytes encaja bien dentro de 5 paquetes.

source: Based on measurements, 1492 fits nearly all reasonably small I2NP messages (larger I2NP messages may be up to 1900 to 4500 bytes, which isn't going to fit into a live network MTU anyway).
es: Basado en las mediciones, 1492 encaja en casi todos los mensajes I2NP razonablemente pequeños (los mensajes I2NP más grandes pueden ser desde 1900 hasta 4500 bytes, que de todas formas no encajarían dentro del MTU de la red).

source: The MTU values were 608 and 1492 for releases 0.8.9 - 0.8.11. The large MTU was 1350 prior to release 0.8.9.
es: Los valores del MTU eran 608 y 1492 para las versiones 0.8.9 - 0.8.11. El MTU largo era de 1350 en las versiones anteriores a la 0.8.9.

source: The maximum receive packet size is 1571 bytes as of release 0.8.12. For releases 0.8.9 - 0.8.11 it was 1535 bytes. Prior to release 0.8.9 it was 2048 bytes.
es: Para la versión 0.8.12 el tamaño máximo del paquete recibido es de 1571 bytes. Para las versiones 0.8.9 - 0.8.11 era de 1535 bytes. Para las versiones anteriores a 0.8.9 era de 2048 bytes.

source: As of release 0.9.2, if a router's network interface MTU is less than 1484, it will publish that in the network database, and other routers should honor that when a connection is established.
es: A partir de la versión 0.9.2, si el MTU del interfaz de red del ruter es menor de 1484, esto será publicado en la base de datos de la red, y los otros ruters deberían respetarlo cuando una conexión es establecida.

source: For IPv6, the minimum MTU is 1280. The IPv6 IP/UDP header is 48 bytes, so we use an MTU where (MTN &#37; 16 == 0), which is true for 1280. The maximum IPv6 MTU is 1472.
es: Para IPv6, la mínima MTU (unidad de transmisión máxima) es 1280. La cabecera IP/UDP IPv6 es de 48 bytes, así que usamos una MTU donde (MTN &#37; 16 == 0), lo que es cierto para 1280. La máxima MTU IPv6 es 1472.

source: Message Size Limits
es: Límites de los tamaños de mensaje

source: While the maximum message size is nominally 32KB, the practical limit differs. The protocol limits the number of fragments to 7 bits, or 128. The current implementation, however, limits each message to a maximum of 64 fragments, which is sufficient for 64 * 534 = 33.3 KB when using the 608 MTU. Due to overhead for bundled LeaseSets and session keys, the practical limit at the application level is about 6KB lower, or about 26KB. Further work is necessary to raise the UDP transport limit above 32KB. For connections using the larger MTU, larger messages are possible.
es: Mientras que normalmente el tamaño máximo de un mensaje es de 32KB, los límites prácticos difieren. El protocolo limita el número de fragmentos a 7 bits, o 128. La implementación actual limita cada mensaje a un máximo de 64 fragmentos, lo cual es suficiente para, 64 * 534 = 33.3 KB, cuando se usa el MTU de 608. Debido al gasto de las claves de sesión y los LeaseSets incluidos, el límite práctico en el nivel de aplicación es alrededor de 6KB menos, o alrededor de 26KB. Se necesita más trabajo para poder aumentar el límite del transporte UDP por encima de 32KB. Para las conexiones que usan un MTU más largo, son posibles mensajes más largos.

source: Keys
es: Claves

source: All encryption used is AES256/CBC with 32 byte keys and 16 byte IVs. When Alice originates a session with Bob, the MAC and session keys are negotiated as part of the DH exchange, and are then used for the HMAC and encryption, respectively. During the DH exchange, Bob's publicly knowable introKey is used for the MAC and encryption.
es: Todo el cifrado que se usa es AES256/CBC con claves de 32 bytes e IVs (vectores de inicialización) de 16 bytes. Cuando Alice origina una sesión con Bob, el MAC (código de autentificación de mensaje) y las claves de sesión se negocian como parte de un intercambio DH (Diffie-Hellman), y luego se usan respectivamente para el HMAC (MAC en un hash cifrado) y el cifrado (de la comunicación). Durante el intercambio DH, la introKey (clave de entrada) públicamente accesible de Bob se usa para el MAC y el cifrado (de la comunicación).

source: Both the initial message and the subsequent reply use the introKey of the responder (Bob) - the responder does not need to know the introKey of the requester (Alice). The DSA signing key used by Bob should already be known to Alice when she contacts him, though Alice's DSA key may not already be known by Bob.
es: Tanto el mensaje inicial como la subsiguiente respuesta usan la introKey (clave de introducción) de quien responde - quien responde no necesita conocer la introKey del solicitante (Alice). La clave de firmado DSA usada por Bob ya debería ser conocida por Alice cuando ella contacte con él, aunque la clave DSA de Alice puede que aún no sea concocida por Bob.

source: Upon receiving a message, the receiver checks the "from" IP address and port with all established sessions - if there are matches, that session's MAC keys are tested in the HMAC. If none of those verify or if there are no matching IP addresses, the receiver tries their introKey in the MAC. If that does not verify, the packet is dropped. If it does verify, it is interpreted according to the message type, though if the receiver is overloaded, it may be dropped anyway.
es: Tras recibir un mensaje, el destinatario comprueba la dirección IP y el puerto "desde" de todas las sesiones establecidas - si hay coincidencias, las claves MAC de sesión son probadas en el HMAC. Si ninguna de esas se verifican, o si no coinciden con la IP, el receptor prueba su introKey en el MAC, si esta no se verifica, el paquete es denegado. Si se verifica, es interpretado de acuerdo el tipo de mensaje, aunque si el destinatario está sobrecargado, puede que también sea desechado.

source: If Alice and Bob have an established session, but Alice loses the keys for some reason and she wants to contact Bob, she may at any time simply establish a new session through the SessionRequest and related messages. If Bob has lost the key but Alice does not know that, she will first attempt to prod him to reply, by sending a DataMessage with the wantReply flag set, and if Bob continually fails to reply, she will assume the key is lost and reestablish a new one.
es: Si Alice y Bob tienen una sesión establecida, pero Alice pierde las claves por alguna razón y quiere contactar con Bob, ella puede simplemente establecer una nueva sesión a través del SessionRequest y los mensajes relacionados. Si Bob ha perdido la clave pero Alice no lo sabe, ella primero intentará que le responda, y si Bob continúa sin responder, ella asumirá que la clave se perdió y restablecerá una nueva.

source: For the DH key agreement, <a href="%(rfc3526)s">RFC3526</a> 2048bit MODP group (#14) is used:
es: Para el acuerdo de la clave DH, <a href="%(rfc3526)s">RFC3526</a> grupo MODP de 2048bit (#14) se utiliza:

source: These are the same p and g used for I2P's <a href="%(cryptography)s#elgamal">ElGamal encryption</a>.
es: Estos son los mismos p y g usados por el <a href="%(cryptography)s#elgamal">cifrado ElGamal</a> de I2P.

source: Replay prevention
es: Prevención de Respuesta

source: Replay prevention at the SSU layer occurs by rejecting packets with exceedingly old timestamps or those which reuse an IV. To detect duplicate IVs, a sequence of Bloom filters are employed to "decay" periodically so that only recently added IVs are detected.
es: La prevención de respuesta en la capa SSU ocurre denegando paquetes excesivamente viejos o aquellos que reutilizan un IV. Para detectar IVs duplicados, se utilizan una secuencia de filtros Bloom para "destruirlos", y así sólo se detecten los IVs añadidos recientemente.

source: The messageIds used in DataMessages are defined at layers above the SSU transport and are passed through transparently. These IDs are not in any particular order - in fact, they are likely to be entirely random. The SSU layer makes no attempt at messageId replay prevention - higher layers should take that into account.
es: Los mensajesId usados en los DataMessages son definidos en capas por encima del transporte SSU y son pasados a través transparentemente. Estos IDs no están en un orden en particular - de hecho, es probable que sean totalmente aleatorios. La capa SSU no intenta hacer prevención de respuesta en los messageId - las capas superiores deberían tener esto en cuenta.

source: Addressing
es: Direccionamiento

source: To contact an SSU peer, one of two sets of information is necessary: a direct address, for when the peer is publicly reachable, or an indirect address, for using a third party to introduce the peer. There is no restriction on the number of addresses a peer may have.
es: Para contactar un par SSU, se necesita uno de estos datos: una dirección directa, para cuando el par sea accesible públicamente, o una dirección indirecta, para usar a un tercero para que introduzca al par. No hay restricción en el número de direcciones que un par puede tener.

source: Each of the addresses may also expose a series of options - special capabilities of that particular peer. For a list of available capabilities, see <a href="#capabilities">below</a>.
es: Cada una de las direcciones puede mostrar una serie de opciones - capacidades especiales para un par en particular. Para una lista de capacidades disponibles, vea <a href="#capabilities">más abajo</a>.

source: The addresses, options, and capabilities are published in the <a href="%(netdb)s">network database</a>.
es: Las direcciones, opciones y capacidades son publicadas en la <a href="%(netdb)s">base de datos de la red</a>.

source: Direct Session Establishment
es: Establecimiento de una sesión directa

source: Direct session establishment is used when no third party is required for NAT traversal. The message sequence is as follows:
es: El establecimiento de una sesión directa se usa cuando no hace falta un tercero para el NAT trasversal. La secuencia del mensaje es como sigue:

source: Connection establishment (direct)
es: Establecimiento de la conexión (directa)

source: Alice connects directly to Bob. IPv6 is supported as of version 0.9.8.
es: Alice conecta directamente con Bob. IPv6 está soportado desde la versión 0.9.8.

source: After the SessionConfirmed message is received, Bob sends a small <a href="%(i2npspec)s#msg_DeliveryStatus">DeliveryStatus message</a> as a confirmation. In this message, the 4-byte message ID is set to a random number, and the 8-byte "arrival time" is set to the current network-wide ID, which is 2 (i.e. 0x0000000000000002).
es: Después de que se haya recibido el SessionConfirmed, Bob envía un pequeño <a href="%(i2npspec)s#msg_DeliveryStatus">mensaje DeliveryStatus</a> como confirmación. En este mensaje, el ID de 4 bytes es aleatorio, y el "tiempo de llegada" de 8 bytes es el ID de toda la red actual, el cual es 2 (por ejemplo 0x0000000000000002).

source: After the status message is sent, the peers exchange <a href="%(i2npspec)s#msg_DatabaseStore">DatabaseStore messages</a> containing their <a href="%(commonstructures)s#struct_RouterInfo">RouterInfos</a>.
es: Después de ser enviado el mensaje, los pares intercambia <a href="%(i2npspec)s#msg_DatabaseStore">mensajes DatabaseStore</a> conteniendo sus <a href="%(commonstructures)s#struct_RouterInfo">RouterInfos</a>.

source: It does not appear that the type of the status message or its contents matters. It was originally added becasue the DatabaseStore message was delayed several seconds; since the store is now sent immediately, perhaps the status message can be eliminated.
es: No parece que importe el tipo del mensaje de estado o su contenidos . Se añadió originalmente porque el mensaje DatabaseStore era retardado varios segundos, desde que el mensaje es enviado inmediatamente, quizás el mensaje de estado se pueda eliminar.

source: Introduction keys are delivered through an external channel (the network database, where they are identical to the router Hash for now) and must be used when establishing a session key. For the indirect address, the peer must first contact the relayhost and ask them for an introduction to the peer known at that relayhost under the given tag. If possible, the relayhost sends a message to the addressed peer telling them to contact the requesting peer, and also gives the requesting peer the IP and port on which the addressed peer is located. In addition, the peer establishing the connection must already know the public keys of the peer they are connecting to (but not necessary to any intermediary relay peer).
es: Las claves introductorias son enviadas a través de un canal externo (la base de datos de la red, donde son idénticos al Hash del ruter, por ahora) y tienen que ser usados cuando se establece la clave de sesión. Para la dirección indirecta, el par primero tiene que contactar un relayhost y preguntar por una introducción para el par conocido en el relayhost bajo la etiqueta dada. Si es posible, el relayhost envía un mensaje al par direccionado diciéndole que contacte el par que está solicitando, y también indica al par solicitante la IP y el puerto den donde se encuentra el par direccionado. Además, el par que está estableciendo la conexión ya tiene que conocer las claves públicas del par con el que está conectando (pero no necesariamente a ninguno de los pares intermediarios).

source: Indirect session establishment by means of a third party introduction is necessary for efficient NAT traversal. Charlie, a router behind a NAT or firewall which does not allow unsolicited inbound UDP packets, first contacts a few peers, choosing some to serve as introducers. Each of these peers (Bob, Bill, Betty, etc) provide Charlie with an introduction tag - a 4 byte random number - which he then makes available to the public as methods of contacting him. Alice, a router who has Charlie's published contact methods, first sends a RelayRequest packet to one or more of the introducers, asking each to introduce her to Charlie (offering the introduction tag to identify Charlie). Bob then forwards a RelayIntro packet to Charlie including Alice's public IP and port number, then sends Alice back a RelayResponse packet containing Charlie's public IP and port number. When Charlie receives the RelayIntro packet, he sends off a small random packet to Alice's IP and port (poking a hole in his NAT/firewall), and when Alice receives Bob's RelayResponse packet, she begins a new full direction session establishment with the specified IP and port.
es: El establecimiento de sesiones indirectas por parte de un tercero es necesario para el funcionamiento eficiente del NAT trasversal. Charlie, un ruter tras un NAT o cortafuegos que no permite paquetes UDP no solicitados de entrada, primero contacta con unos pocos pares, eligiendo algunos para usarlos como introductores. Cada uno de estos pares (Bob, Bill, Betty, etc) proporcionan a Charlie una etiqueta de introducción - un número aleatorio de 4 bytes -la cual él después hace público como una forma de contactarlo. Alice, un ruter que tiene publicado los métodos para contactar con Charlie, primero envía un paquete RelayReques a uno o más de los introductores, preguntando a cada uno para que le introduzca a Charlie (ofreciendo la etiqueta de introducción para identificar a Charlie). Bob entonces envía un paquete RelayIntro a Charlie incluyendo el puerto y la IP pública de Charlie. Cuando Charlie recibe el paquete RelayIntro, envía un pequeño paquete aleatorio al puerto e IP de Alice (creando un agujero en su NAT/cortafuegos), y cuando Alice recibe el paquete RelayResponse de Bob, ella empieza una establecimiento de sesión completamente nuevo con el puerto y la IP especificados.

source: Connection establishment (indirect using an introducer)
es: Establecimiento de la conexión (usando un introductor indirecto)

source: Alice first connects to introducer Bob, who relays the request to Charlie.
es: Alice primero se conecta al Bob introductor, que reenvía la petición a Charlie.

source: After the hole punch, the session is established between Alice and Charlie as in a direct establishment.
es: Después de la creación del agujero en el NAT, la sesión es establecida entre Alice y Charlie como si fuese directa.

source: Peer testing
es: Prueba del par
