Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: The automation of collaborative reachability testing for peers is enabled by a sequence of PeerTest messages. With its proper execution, a peer will be able to determine their own reachability and may update its behavior accordingly. The testing process is quite simple:
es: La automatización del las pruebas colaborativas de accesibilidad de un par es habilitada por una secuencia de mensajes PeerTest. Con su buen funcionamiento, el par será capaz de determinar su estado de accesibilidad y puede actualizar su comportamiento de acuerdo con ello. El proceso de prueba es bastante simple:

source: Each of the PeerTest messages carry a nonce identifying the test series itself, as initialized by Alice. If Alice doesn't get a particular message that she expects, she will retransmit accordingly, and based upon the data received or the messages missing, she will know her reachability. The various end states that may be reached are as follows:
es: Cada uno de los mensajes PeerTest lleva un nonce identificando las series de pruebas, como fueron inicializadas por Alice. Si Alice no recibe un mensaje en particular que estuviese esperando, ella retransmitirá de acuerdo con ello, y basándose en los datos recibidos o en los mensajes perdidos, ella conocerá su estado de accesibilidad. Los estados a los que puede llegar son:

source: If she doesn't receive a response from Bob, she will retransmit up to a certain number of times, but if no response ever arrives, she will know that her firewall or NAT is somehow misconfigured, rejecting all inbound UDP packets even in direct response to an outbound packet. Alternately, Bob may be down or unable to get Charlie to reply.
es: Si no recibe una respuesta de Bob, ella retransmitirá un número de veces dado, pero si nunca llega una respuesta, ella sabrá que su cortafuegos o NAT están desconfigurados de alguna forma, denegando todos los paquetes UDP de entrada incluso con una respuesta directa a un paquete de salida. Alternativamente, Bob puede estar caído o incapaz de hacer que Charlie responda.

source: If Alice doesn't receive a PeerTest message with the expected nonce from a third party (Charlie), she will retransmit her initial request to Bob up to a certain number of times, even if she has received Bob's reply already. If Charlie's first message still doesn't get through but Bob's does, she knows that she is behind a NAT or firewall that is rejecting unsolicited connection attempts and that port forwarding is not operating properly (the IP and port that Bob offered up should be forwarded).
es: Si Alice no recibe un mensaje PeerTest con el nonce esperado de una tercera parte (Charlie), retransmitirá su petición inicial a Bob un cierto número de veces, incluso si ya ha recibido la respuesta de Bob. Si el primer mensaje de Charlie no pasa a través, pero el de Bob sí, ella sabe que está tras un NAT o cortafuegos que deniega los intentos de conexiones no solicitadas y que el reenvío de ese puerto no funciona correctamente (la IP y el puerto que Bob ofrece deberían estar reenviados/forwarded).

source: If Alice receives Bob's PeerTest message and both of Charlie's PeerTest messages but the enclosed IP and port numbers in Bob's and Charlie's second messages don't match, she knows that she is behind a symmetric NAT, rewriting all of her outbound packets with different 'from' ports for each peer contacted. She will need to explicitly forward a port and always have that port exposed for remote connectivity, ignoring further port discovery.
es: Si Alice recibe el mensaje PeerTest de Bob y los dos mensajes PeerTest de Charle, pero la IP y el puerto de Bob adjuntos y el segundo mensaje de Charlie no coinciden, ella sabe que está bajo un NAT simétrico que está reescribiendo todos sus paquetes de salida con los puertos 'desde' cambiados para cada uno de los pares contactados. Ella necesitará abrir explícitamente un puerto y tener ese puesto expuesto siempre a las conexiones remotas, ignorando cualquier búsqueda de puertos futura.

source: If Alice receives Charlie's first message but not his second, she will retransmit her PeerTest message to Charlie up to a certain number of times, but if no response is received she knows that Charlie is either confused or no longer online.
es: Si Alice recibe el primer mensaje de Charlie pero no el segundo, ella retransmitirá su mensaje PeerTest a Charlie un cierto número de veces, pero si no se recibe ninguna respuesta sabrá que o Charlie está confundido o no está encendido.

source: Alice should choose Bob arbitrarily from known peers who seem to be capable of participating in peer tests. Bob in turn should choose Charlie arbitrarily from peers that he knows who seem to be capable of participating in peer tests and who are on a different IP from both Bob and Alice. If the first error condition occurs (Alice doesn't get PeerTest messages from Bob), Alice may decide to designate a new peer as Bob and try again with a different nonce.
es: Alice debería elegir a Bob arbitrariamente entre los pares conocidos que parezcan ser capaces de participar el las pruebas de pares. Bob a su vez debería elegir a Charlie arbitrariamente entre los pares conocidos que parezcan ser capaces de participar el las pruebas de pares y que están en una IP diferente a la de Bob y Alice. Si ocurre la primera condición de error (Alice no recibe el mensaje PeerTest de Bob), Alice puede decidir designar un nuevo par como Bob e intentar de nuevo con un nonce diferente.

source: Alice's introduction key is included in all of the PeerTest messages so that she doesn't need to already have an established session with Bob and so that Charlie can contact her without knowing any additional information. Alice may go on to establish a session with either Bob or Charlie, but it is not required.
es: La clave de introducción de Alice es incluida en todos los mensajes PeerTest para que no necesite una conexión ya establecida con Bob y para que Charlie pueda contactar con ella sin necesidad de tener más datos. Alice puede establecer una sesión con Bob o Charlie, pero no es necesario.

source: Transmission window, ACKs and Retransmissions
es: Window,ventana, de retransmisión, ACKs y Retrasmisiones

source: The DATA message may contain ACKs of full messages and partial ACKs of individual fragments of a message. See the data message section of <a href="%(ssuspec)s">the protocol specification page</a> for details.
es: El mensaje de DATOS puede contener ACKs de mensajes completos y ACKs parciales de fragmentos individuales de un mensaje. Vea la sección de los mensajes de datos de la <a href="%(ssuspec)s">página de especificación del protocolo</a> para más detalles.

source: The details of windowing, ACK, and retransmission strategies are not specified here. See the Java code for the current implementation. During the establishment phase, and for peer testing, routers should implement exponential backoff for retransmission. For an established connection, routers should implement an adjustable transmission window, RTT estimate and timeout, similar to TCP or <a href="%(streaming)s">streaming</a>. See the code for initial, min and max parameters.
es: Los detalles de las Windows, ACKS y las estrategias de retransmisión no se especifican aquí. Vea el código de Java para ver la implementación actual. Durante la fase de establecimiento, y para las pruebas de pares, los ruters deberían implementar backoff exponencial para la retransmisión. Para una conexión establecida, los ruters deberían implementar una ventana de retransmisión ajustable, RTT estimado y tiempo de espera, similar al TCP o <a href="%(streaming)s">streaming</a>. Vea el código para los valores iniciales, mínimos y máximos.

source: Security
es: Seguridad

source: UDP source addresses may, of course, be spoofed. Additionally, the IPs and ports contained inside specific SSU messages (RelayRequest, RelayResponse, RelayIntro, PeerTest) may not be legitimate. Also, certain actions and responses may need to be rate-limited.
es: La dirección de la fuente UDP puede, por supuesto, ser falseada. Adicionalmente, las IPs y los puertos contenidos en los mensajes SSU específicos (RelayRequest, RelayResponse, RelayIntro, PeerTest) puede que no sean legítimos. Además, algunas acciones y respuestas pueden necesitar de ser vueltas a limitar.

source: The details of validation are not specified here. Implementers should add defenses where appropriate.
es: Los detalles de validación no están especificados aquí. Los desarrolladores deberían añadir defensas donde sea apropiado.

source: Peer capabilities
es: Capacidades del par

source: If the peer address contains the 'B' capability, that means they are willing and able to participate in peer tests as a 'Bob' or 'Charlie'.
es: Si la dirección del par contiene la capacidad 'B', esto significa que desea y puede participar en una prueba de par como un 'Bob' o como un 'Charlie'.

source: If the peer address contains the 'C' capability, that means they are willing and able to serve as an introducer - serving as a Bob for an otherwise unreachable Alice.
es: Si la dirección del par contiene la capacidad 'C', esto significa que desea y puede servir como un introductor - funcionando como un Bob para un Alice, que de otra forma dería inaccesible.

source: Analysis of current SSU performance, including assessment of window size adjustment and other parameters, and adjustment of the protocol implementation to improve performance, is a topic for future work.
es: El análisis del rendimiento actual del SSU es un tema para un trabajo futuro, incluyendo la valoración del ajuste del tamaño de ventana y otros parámetros, y el ajuste de la implementación del protocolo para mejorar el rendimiento.

source: The current implementation repeatedly sends acknowledgments for the same packets, which unnecessarily increases overhead.
es: La implementación actual envía repetidamente reconocimientos para los mismos paquetes, lo que aumenta la sobrecarga innecesariamente.

source: The default small MTU value of 620 should be analyzed and possibly increased. The current MTU adjustment strategy should be evaluated. Does a streaming lib 1730-byte packet fit in 3 small SSU packets? Probably not.
es: El pequeño valor por defecto del MTU de 620 debería ser analizado y probablemente aumentado. La estrategia actual de adaptación del MTU debería ser evaluada. ¿Cabe un paquete de streaming de 1730 bytes en 3 paquetes pequeños SSU? Probablemente no.

source: The protocol should be extended to exchange MTUs during the setup.
es: El protocolo debería ser ampliado para intercambiar MTUs durante la configuración.

source: Rekeying is currently unimplemented and may never be.
es: Rekeying no está implementado y puede que nunca lo esté.

source: The potential use of the 'challenge' fields in RelayIntro and RelayResponse, and use of the padding field in SessionRequest and SessionCreated, is undocumented.
es: El uso potencial de los campos "desafío" en el RelayIntro y en el RelayResponse, y el uso del campo de relleno en el SessionRequest en el SessionCreated, no están documentados.

source: Instead of a single fragment per packet, a more efficient strategy may be to bundle multiple message fragments into the same packet, so long as it doesn't exceed the MTU.
es: En vez de un sólo fragmento por paquete, una estrategia más eficiente podría ser el juntar varios fragmentos de mensajes dentro del mismo paquete, mientras no exceda el MTU.

source: A set of fixed packet sizes may be appropriate to further hide the data fragmentation to external adversaries, but the tunnel, garlic, and end to end padding should be sufficient for most needs until then.
es: Un conjunto de tamaños de paquetes podría ser apropiado para la ocultación futura de la fragmentación de los datos a adversarios externos, pero el túnel, garlic, y un relleno de fin a fin deberían ser suficiente para la mayoría de las necesidades hasta entonces.

source: Why are introduction keys the same as the router hash, should it be changed, would there be any benefit?
es: ¿Por qué son las claves de introducción las mismas que el hash del ruter, deberían cambiarse, habría algún beneficio?

source: Capacities appear to be unused.
es: Las capacidades parecen estar sin usar.

source: Signed-on times in SessionCreated and SessionConfirmed appear to be unused or unverified.
es: Los tiempos acordados en SessionCreated (sesión creada) y SessionConfirmed (sesión confirmada) parecen estar sin usar o verificar.

source: Implementation Diagram
es: Diagrama de implementación

source: This diagram should accurately reflect the current implementation, however there may be small differences.
es: El diagrama debe reflejar con exactitud la implementación actual, sin embargo puede haber muchas diferencias pequeñas.

source: Now on the SSU specification page
es: En la actualidad en la página de especificación SSU (UDP seguro semiconfiable)

source: Tunnel Implementation
es: Implementación de túnel

source: October 2010
es: Octubre de 2010

source: This page documents the current tunnel implementation.
es: Esta página documenta la implementación actual del túnel.

source: Tunnel overview
es: Introducción a los túneles

source: Within I2P, messages are passed in one direction through a virtual tunnel of peers, using whatever means are available to pass the message on to the next hop. Messages arrive at the tunnel's </i>gateway</i>, get bundled up and/or fragmented into fixed-size tunnel messages, and are forwarded on to the next hop in the tunnel, which processes and verifies the validity of the message and sends it on to the next hop, and so on, until it reaches the tunnel endpoint. That <i>endpoint</i> takes the messages bundled up by the gateway and forwards them as instructed - either to another router, to another tunnel on another router, or locally.
es: Dentro de I2P, los mensajes se pasan en una dirección a través de un túnel virtual de pares (`peers`), usando cualquier medio que esté disponible para pasar el mensaje al siguiente salto. Los mensajes llegan a la </i>pasarela</i> (`gateway`) del túnel, son empaquetados y/o fragmentados en mensajes de túnel de tamaño-fijo, y son reenviados hacia el siguiente salto en el túnel, que procesa y verifica la validez del mensaje y lo envía al siguiente salto, y así sucesivamente, hasta que alcanza el extremo del túnel. Ese <i>extremo</i> toma los mensajes empaquetados por la pasarela y los reenvía como se se le ha indicado - bien hacia otro router, bien hacia otro túnel en otro router, o bien localmente.

source: Tunnels all work the same, but can be segmented into two different groups - inbound tunnels and outbound tunnels. The inbound tunnels have an untrusted gateway which passes messages down towards the tunnel creator, which serves as the tunnel endpoint. For outbound tunnels, the tunnel creator serves as the gateway, passing messages out to the remote endpoint.
es: Los túneles funcionan todos de la misma forma, pero pueden estar segmentados en dos diferentes grupos - túneles de entrada o túneles de salida. Los túneles de entrada tienen una pasarela (`gateway`) no confiable que pasa mensajes hacia el creador del túnel, que sirve como extremo del túnel. Para túneles de salida, el creador del túnel hace de pasarela pasando mensajes al exterior hacia el extremo remoto.

source: The tunnel's creator selects exactly which peers will participate in the tunnel, and provides each with the necessary configuration data. They may have any number of hops. It is the intent to make it hard for either participants or third parties to determine the length of a tunnel, or even for colluding participants to determine whether they are a part of the same tunnel at all (barring the situation where colluding peers are next to each other in the tunnel).
es: El creador del túnel selecciona exactamente qué pares (`peers`) participarán en el túnel, y proporciona a cada uno los datos de configuración necesarios. Pueden tener cualquier número de saltos. La intención es hacer difícil, tanto a los partícipantes en el túnel como a terceros, determinar la longitud de un túnel, o incluso que unos participantes compinchados determinen si ellos forman parte de un mismo túnel (impidiendo la situación en la que pares compinchados estén próximos unos de otros en el túnel).

source: In practice, a series of tunnel pools are used for different purposes - each local client destination has its own set of inbound tunnels and outbound tunnels, configured to meet its anonymity and performance needs. In addition, the router itself maintains a series of pools for participating in the network database and for managing the tunnels themselves.
es: En la práctica, una serie de depósitos (`pools`) de túneles se usan para diferentes propósitos - cada destino de cliente local tiene su propio conjunto de túneles de entrada configurados para alcanzar sus necesidades de anonimato y rendimiento. Además, el propio router mantiene una serie de depósitos para participar en la base de datos de red y para administrar los propios túneles.

source: I2P is an inherently packet switched network, even with these tunnels, allowing it to take advantage of multiple tunnels running in parallel, increasing resilience and balancing load. Outside of the core I2P layer, there is an optional end to end streaming library available for client applications, exposing TCP-esque operation, including message reordering, retransmission, congestion control, etc.
es: I2P es inherentemente una red de paquetes conmutados, incluso con estos túneles, lo que le permite aprovechar la ventaja de múltiples túneles ejecutándose en paralelo, incrementando la flexibilidad y el equilibrado de la carga. Fuera del núcleo de la capa I2P, hay una librería streaming (de flujo) extremo a extremo opcional disponible para aplicaciones cliente, que ofrece operaciones estilo-TCP, incluyendo reordenamiento de mensajes, retransmisión, control de congestión, etc.

source: An overview of I2P tunnel terminology is <a href="%(tunnelrouting)s">on the tunnel overview page</a>.
es: Encontrará una introducción a la terminología de túneles I2P en la <a href="%(tunnelrouting)s">página de introducción a los túneles</a>.

source: Tunnel Operation (Message Processing)
es: Operaciones de los túneles (procesamiento de mensajes)

source: After a tunnel is built, <a href="%(i2np)s">I2NP messages</a> are processed and passed through it. Tunnel operation has four distinct processes, taken on by various peers in the tunnel.
es: Después de que un túnel sea erigido, los <a href="%(i2np)s">mensajes I2NP</a> (protocolo de red I2P) se procesan y se pasan a través de él. Las operaciones de los túneles comprenden cuatro procesos diferentes, llevados a cabo por diferentes pares (`peers`) en el túnel.

source: First, the tunnel gateway accumulates a number of I2NP messages and preprocesses them into tunnel messages for delivery.
es: Primero, la pasarela (`gateway`) del túnel acumula un número de mensajes I2NP y los preprocesa en mensajes de túnel para su entrega.

source: Next, that gateway encrypts that preprocessed data, then forwards it to the first hop.
es: Después, esa pasarela cifra los datos preprocesados, luego los reenvía al primer salto.

source: That peer, and subsequent tunnel participants, unwrap a layer of the encryption, verifying that it isn't a duplicate, then forward it on to the next peer.
es: Ese par (`peer`), y los subsiguientes participantes en el túnel, desenvuelven una capa del cifrado, verificando que no esté duplicada, y luego la reenvían hacia el siguiente par.

source: Eventually, the tunnel messages arrive at the endpoint where the I2NP messages originally bundled by the gateway are reassembled and forwarded on as requested.
es: Eventualmente, los mensajes de túnel llegan al extremo donde los mensajes I2NP fueron originalmente empaquetados por la pasarela, entonces son reensamblados y reenviados de la forma requerida.

source: Intermediate tunnel participants do not know whether they are in an inbound or an outbound tunnel; they always "encrypt" for the next hop. Therefore, we take advantage of symmetric AES encryption to "decrypt" at the outbound tunnel gateway, so that the plaintext is revealed at the outbound endpoint.
es: Los participantes intermedios del túnel no saben si ellos están en un túnel de entrada o de salida; ellos siempre "cifran" para el siguiente salto. Por lo tanto, aprovechamos la ventaja del cifrado AES simétrico para "descifrar" en la pasarela (`gateway`) del túnel de salida, así que el texto plano se revela en el extremo de salida.

source: Role
es: Rol

source: Preprocessing
es: Preprocesado

source: Encryption Operation
es: Operación de cifrado

source: Postprocessing
es: Posprocesado

source: Outbound Gateway (Creator)
es: Pasarela (`gateway`) saliente (Creador)

source: Fragment, Batch, and Pad
es: Fragmento, lote, y fardo

source: Iteratively encrypt (using decryption operations)
es: Cifrar iterativamente (usando operaciones de descifrado)

source: Forward to next hop
es: Reenvíar al siguiente salto

source: Participant
es: Participante

source: Decrypt (using an encryption operation)
es: Descifrar (usando una operación de cifrado)

source: Decrypt (using an encryption operation) to reveal plaintext tunnel message
es: Descifrar (usando una operación de cifrado) para revelar el mensaje de túnel de texto plano

source: Reassemble Fragments, Forward as instructed to Inbound Gateway or Router
es: Reensamblar fragmentos, reenviar hacia la pasarela (`gateway`) o router entrante tal como se indicó

source: Encrypt
es: Cifrar

source: Inbound Endpoint (Creator)
es: Extremo de entrada (Creador)

source: Iteratively decrypt to reveal plaintext tunnel message
es: Descifrar iterativamente para revelar mensajes de túnel de texto plano

source: Reassemble Fragments, Receive data
es: Reensamblar fragmentos, recibir datos

source: Gateway Processing
es: Procesado de la pasarela (`gateway`)

source: Message Preprocessing
es: Preprocesado de mensaje

source: A tunnel gateway's function is to fragment and pack <a href="%(i2np)s">I2NP messages</a> into fixed-size <a href="%(tunnelmessage)s">tunnel messages</a> and encrypt the tunnel messages. Tunnel messages contain the following:
es: Una función de la pasarela (`gateway`) del túnel es fragmentar y empaquetar <a href="%(i2np)s">mensajes I2NP</a> (protocolo de red I2P) en <a href="%(tunnelmessage)s">mensajes de túnel</a> de tamaño-fijo y cifrar los mensajes de túnel. Los mensajes de túnel contienen lo siguiente:

source: A 4 byte Tunnel ID
es: Un identificador (`ID`) de túnel de 4 bytes

source: A 16 byte IV (initialization vector)
es: Un IV (vector de inicialización) de 16 bytes

source: A checksum
es: Un identificador criptográfico (`checksum`)

source: Padding, if necessary
es: Relleno (datos inútiles desechables criptográficamente), si fuera necesario

source: One or more { delivery instruction, I2NP message fragment } pairs
es: Uno o más pares { instrucción de entrega, fragmento de mensaje I2NP }
