Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: To verify a storage was successful, a router simply waits about 10 seconds, then sends a lookup to another floodfill router close to the key (but not the one the store was sent to). Lookups sent out one of the outbound client tunnels for the destination of the LeaseSet being verified. To prevent snooping by the OBEP of the outbound tunnel, lookups are end-to-end garlic encrypted. The replies are specified to return via one of the client's inbound tunnels.
es: Para verificar que el almacenamiento fue exitoso, un router simplemente espera cerca de 10 segundos, y luego envía una consulta a otro router de inundación (`floodfill`) cercano a la clave (pero no al que se envió el almacenamiento). Las consultas establecieron uno de los túneles de salida del cliente para el destino del LeaseSet (grupo de túneles para un destino) que se está verificando. Para prevenir la vigilancia en el OBEP (extremo exterior) del túnel de salida, las consultas están cifradas extremo-a-extremo con garlic (ajo). Se especifica a las respuestas que vuelvan a través de uno de los túneles de entrada del cliente.

source: As of release 0.9.7, replies for both RouterInfo and LeaseSet lookups (a DatabaseStoreMessage or a DatabaseSearchReplyMessage) will be encrypted, to hide the reply from the inbound gateway (IBGW) of the reply tunnel.
es: Desde la versión 0.9.7, las respuestas tanto para las consultas de RouterInfo como de LeaseSet (un DatabaseStoreMessage o un DatabaseSearchReplyMessage) estarán cifradas para ocultar la respuesta desde la pasarela de entrada (`inbound gateway`, IBGW) del túnel de respuesta.

source: Exploration
es: Exploración

source: <i>Exploration</i> is a special form of netdb lookup, where a router attempts to learn about new routers. It does this by sending a floodfill router a <a href="%(i2np)s">I2NP</a> DatabaseLookupMessage, looking for a random key. As this lookup will fail, the floodfill would normally respond with a <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage containing hashes of floodfill routers close to the key. This would not be helpful, as the requesting router probably already knows those floodfills, and it would be impractical to add ALL floodfill routers to the "don't include" field of the lookup. For an exploration query, the requesting router adds a router hash of all zeros to the "don't include" field of the DatabaseLookupMessage. The floodfill will then respond only with non-floodfill routers close to the requested key.
es: La <i>exploración</i> es una forma especial de consulta netDb, donde un router intenta aprender sobre nuevos routers. Esto lo hace enviando a un router de inundación (`floodfill`) un DatabaseLookupMessage <a href="%(i2np)s">I2NP</a>, en busca de una clave aleatoria. Como esta consulta fallará, el router de inundación normalmente respondería con un DatabaseSearchReplyMessage <a href="%(i2np)s">I2NP</a> conteniendo los identificacadores criptográficos (`hashes`) de routers de inundación cercanos a la clave. Esto no sería de ayuda ya que el router solicitante probablemente ya conoce esos routers de inundación, y no sería práctico añadirlos a TODOS al campo "no incluir" de la consulta. Para una petición de exploración, el router solicitante añade un identificador criptográfico (`hash`) de router, con todo ceros, al campo "no incluir" del DatabaseLookupMessage de la consulta. El router de inundación entonces responderá sólo con routers no-de-inundación cercanos a la clave solicitada.

source: Notes on Lookup Responses
es: Notas sobre las respuestas a consultas

source: The response to a lookup request is either a Database Store Message (on success) or a Database Search Reply Message (on failure). The DSRM contains a 'from' router hash field to indicate the source of the reply; the DSM does not. The DSRM 'from' field is unauthenticated and may be spoofed or invalid. There are no other response tags. Therefore, when making multiple requests in parallel, it is difficult to monitor the performance of the various floodfill routers.
es: La respuesta a una solicitud de consulta es o bien (si tiene éxito) un mensaje de alcemacenamiento en la base de datos (DSM), o (si falla) un mensaje de respuesta de búsqueda en la base de datos (DSRM). El DSRM contiene un campo 'from' (desde) en el hash del router para indicar la fuente de la respueta; el DSM no. El campo 'from' (desde) del DSRM no está autentificado y pude ser vigilado o inválido. No hay otras etiquetas de respuesta. Por lo tanto, cuando se hacen múltiples solicitudes en paralelo, es difícill monitorizar el rendimiento de los diferentes routers de inundación.

source: MultiHoming
es: Alojamiento redundante (MultiHoming)

source: Destinations may be hosted on multiple routers simultaneously, by using the same private and public keys (traditionally stored in eepPriv.dat files). As both instances will periodically publish their signed LeaseSets to the floodfill peers, the most recently published LeaseSet will be returned to a peer requesting a database lookup. As LeaseSets have (at most) a 10 minute lifetime, should a particular instance go down, the outage will be 10 minutes at most, and generally much less than that. The multihoming function has been verified and is in use by several services on the network.
es: Los destinos I2P pueden ser alojados simultáneamente en múltiples routers I2P, usando las mismas claves pública y privada (tradicionalmente almacenadas en los ficheros eepPriv.dat). Como ambas ambas instancias publicarán periódicamente sus LeaseSets hacia los pares de inundación (floodfill peers), el LeaseSet (túneles al mismo destino I2P) publicado más recientemente será devuelto a un par como resultado de una búsqueda en la base de datos. Como los LeaseSets tienen (como mucho) 10 minutos de vida, si alguno de los routers I2P se cae, el corte será como mucho de 10 minutos, y normalmente mucho menos tiempo. La función de alojamiento redundante (multihoming) ha sido verificada y está en uso en varios servicios de la red.

source: Threat Analysis
es: Análisis de amenazas

source: Also discussed on <a href="%(threatmodel)s#floodfill">the threat model page</a>.
es: También se debate en <a href="%(threatmodel)s#floodfill">la web de los modelos de amenazas</a>.

source: A hostile user may attempt to harm the network by creating one or more floodfill routers and crafting them to offer bad, slow, or no responses. Some scenarios are discussed below.
es: Un usuario hostil puede intentar dañar la red creando uno o más ruters floodfill y configurándolos para ofrecer respuestas malas, lentas o incluso no ofrecerlas. Algunos escenarios se discuten más abajo.

source: General Mitigation Through Growth
es: Mitigación general a través del crecimiento

source: There are currently around %(ffcount)s floodfill routers in the network. Most of the following attacks will become more difficult, or have less impact, as the network size and number of floodfill routers increase.
es: Actualmente hay alrededor de %(ffcount)s routers floodfill (de inundación) en la red. La mayoría de los ataques siguientes se harán más difíciles, o tendrán menos impacto, al incrementarse el tamaño de la red e incrementarse el número de routers floodfill.

source: General Mitigation Through Redundancy
es: Mitigación general a través de la redundancia

source: Via flooding, all netdb entries are stored on the %(floodsize)s floodfill routers closest to the key.
es: Mediante la inundación, todas las entradas NetDb se almacenan en los %(floodsize)s routers floodfill (de inundación ) más próximos a la clave.

source: Forgeries
es: Falsificaciones

source: All netdb entries are signed by their creators, so no router may forge a RouterInfo or LeaseSet.
es: Todas las entradas de la netdb están firmadas por sus creadores, por lo que ningún ruter puede crear un RouterInfo o un LeaseSet.

source: Slow or Unresponsive
es: Lento o sin respuestas

source: Each router maintains an expanded set of statistics in the <a href="%(peerselection)s">peer profile</a> for each floodfill router, covering various quality metrics for that peer. The set includes:
es: Cada ruter mantiene un dilatado conjunto de estadísticas en el <a href="%(peerselection)s">perfil del par</a> por cada ruter floodfill, con información sobre varias medidas de calidad de ese par. Este conjunto incluye:

source: Average response time
es: Tiempo medio de respuesta

source: Percentage of queries answered with the data requested
es: Porcentaje de consultas respondidas con los datos solicitados

source: Percentage of stores that were successfully verified
es: Porcentaje de los almacenamientos que fueron verificados satisfactoriamente

source: Last successful store
es: El último almacenaje exitoso

source: Last successful lookup
es: La última búsqueda exitosa

source: Last response
es: Última respuesta

source: Each time a router needs to make a determination on which floodfill router is closest to a key, it uses these metrics to determine which floodfill routers are "good". The methods, and thresholds, used to determine "goodness" are relatively new, and are subject to further analysis and improvement. While a completely unresponsive router will quickly be identified and avoided, routers that are only sometimes malicious may be much harder to deal with.
es: Cada vez que un ruter necesita determinar cual ruter floodfill está más cercano a cierta clave, utiliza estas medidas para determinar que floodfills son "buenos". Estos métodos, y umbrales, usados para determinar "lo bueno que es" son relativamente nuevos, y pueden ser revisados y mejorados. Mientras que un ruter que no responda será identificado y evitado rápidamente, los ruters que sólo son maliciosos a veces pueden ser mucho más difíciles de manejar.

source: Sybil Attack (Full Keyspace)
es: Ataque Sybil (espacio de claves completo)

source: An attacker may mount a <a href="%(url)s">Sybil attack</a> by creating a large number of floodfill routers spread throughout the keyspace.
es: Un atacante puede crear un <a href="%(url)s">ataque Sybil</a> creando un gran número de ruters floodfill repartidos a través del espacio de claves, keyspace.

source: (In a related example, a researcher recently created a <a href="%(url)s">large number of Tor relays</a>.) If successful, this could be an effective DOS attack on the entire network.
es: (Como ejemplo relacionado, recientemente un investigador creó un <a href="%(url)s">gran número de relays Tor</a>.) Si es exitoso, podría ser un ataque DOS efectivo en toda la red.

source: If the floodfills are not sufficiently misbehaving to be marked as "bad" using the peer profile metrics described above, this is a difficult scenario to handle. Tor's response can be much more nimble in the relay case, as the suspicious relays can be manually removed from the consensus. Some possible responses for the I2P network are listed below, however none of them is completely satisfactory:
es: Si los floodfills no se comportan suficientemente mal para ser marcados como "malos" usando las medidas del perfil del par descritas antes, sería un escenario muy difícil de manejar. Las respuestas de la red Tor pueden ser mucho más ágiles en el caso de los relays, ya que los relays maliciosos pueden ser eliminados manualmente del consenso. Algunas respuestas factibles para la red I2P son listadas debajo, aunque ninguna de ellas es totalmente satisfactoria:

source: Compile a list of bad router hashes or IPs, and announce the list through various means (console news, website, forum, etc.); users would have to manually download the list and add it to their local "blacklist".
es: Crear una lista de hashes de ruters malos o IPs, y anunciar la lista de varias formas (novedades de consola, web, forums, etc.); los usuarios tendrían que descargar la lista manualmente y añadirla a "lista negra" local.

source: Ask everyone in the network to enable floodfill manually (fight Sybil with more Sybil)
es: Pedir a todos los usuarios de la red el activar el floodfill manualmente (luchar contra Sybil con más Sybil)

source: Release a new software version that includes the hardcoded "bad" list
es: Liberar una nueva versión del software que incluya la lista "mala" inscrustada en el código

source: Release a new software version that improves the peer profile metrics and thresholds, in an attempt to automatically identify the "bad" peers.
es: Liberar una versión del software nueva que mejore los umbrales y las medidas del perfil de los pares, para intentar identificar los pares "malos" automáticamente.

source: Add software that disqualifies floodfills if too many of them are in a single IP block
es: Añadir una ampliación que descalifique floodfills si hay demasiados de ellos en un único bloque de IPs

source: Implement an automatic subscription-based blacklist controlled by a single individual or group. This would essentially implement a portion of the Tor "consensus" model. Unfortunately it would also give a single individual or group the power to block participation of any particular router or IP in the network, or even to completely shutdown or destroy the entire network.
es: Implementar una lista negra automática basada en suscripciones controlada por un único grupo individual. Esto esencialmente implementaría una parte del modelo de "consenso" de Tor. Desafortunadamente le daría a un solo grupo el poder de bloquear la participación de cualquier ruter o IP en la red, o incluso apagar o destruir la red entera.

source: This attack becomes more difficult as the network size grows.
es: Este ataque se hace más difícil cuanto más grande es la red.

source: Sybil Attack (Partial Keyspace)
es: Ataque Sybil (espacio de claves parcial)

source: An attacker may mount a <a href="%(url)s">Sybil attack</a> by creating a small number (8-15) of floodfill routers clustered closely in the keyspace, and distribute the RouterInfos for these routers widely. Then, all lookups and stores for a key in that keyspace would be directed to one of the attacker's routers. If successful, this could be an effective DOS attack on a particular eepsite, for example.
es: Un atacante puede montar un <a href="%(url)s">ataque Sybil</a> creando un pequeño número de ruters floodfill (8-15) cercanos en el espacio de claves, y distribuir los RouterInfos de esos ruters extensamente. Entonces, todas las búsquedas y almacenamientos de una clave en ese espacio de claves serán dirigidod a uno de los ruters del atacante. Si ha tenido éxito, esto podía provocar un ataque DOS efectivo sobre un eepsite en particular, por ejemplo.

source: As the keyspace is indexed by the cryptographic (SHA256) Hash of the key, an attacker must use a brute-force method to repeatedly generate router hashes until he has enough that are sufficiently close to the key. The amount of computational power required for this, which is dependent on network size, is unknown.
es: Ya que el espacio de claves está indexado por el hash criptográfico (SHA256) de la clave, un atacante tiene que usar la fuerza bruta para generar repetidamente hashes de routers hasta que tenga suficientes que estén suficientemente cerca de la clave. La cantidad de potencia de cálculo requerida para esto, la cual depende del tamaño de la red, es desconocida.

source: As a partial defense against this attack, the algorithm used to determine Kademlia "closeness" varies over time. Rather than using the Hash of the key (i.e. H(k)) to determine closeness, we use the Hash of the key appended with the current date string, i.e. H(k + YYYYMMDD). A function called the "routing key generator" does this, which transforms the original key into a "routing key". In other words, the entire netdb keyspace "rotates" every day at UTC midnight. Any partial-keyspace attack would have to be regenerated every day, for after the rotation, the attacking routers would no longer be close to the target key, or to each other.
es: Como una defensa parcial contra este ataque, el algoritmo usado para determinar la "cercanía" Kademlia varía con el tiempo. En vez de usar el hash de la clave (por ejemplo H(k)) para determinar la cercanía, usamos el Hash de la clave añadido a la cadena de datos actuales, por ejemplo H(k + YYYYMMDD). En otras palabras, el espacio de claves completo de la netdb "rota" cada día a la media noche UTC. Cualquier ataque parcial al espacio de claves tendría que regenerarse cada día, después de cada rotación los ruters atacantes no estarán ya cerca de la clave del objetivo.

source: This attack becomes more difficult as the network size grows. However, recent research demonstrates that the keyspace rotation is not particularly effective. An attacker can precompute numerous router hashes in advance, and only a few routers are sufficient to "eclipse" a portion of the keyspace within a half hour after rotation.
es: Este ataque se hace más difícil según crece la red. Aunque estudios recientes han demostrado que la rotación del espacio de claves no es particularmente efectiva. Un atacante podría pre-calcular numerosos hashes de ruters de antemano, y sólo son necesarios unos pocos ruters para "eclipsar" una parte del espacio de claves en sólo media hora después de la rotación.

source: One consequence of daily keyspace rotation is that the distributed network database may become unreliable for a few minutes after the rotation -- lookups will fail because the new "closest" router has not received a store yet. The extent of the issue, and methods for mitigation (for example netdb "handoffs" at midnight) are a topic for further study.
es: Una de las consecuencias de la rotación diaria del espacio de claves es que la base de datos de la red distribuida se vuelve no fiable durante unos minutos tras la rotación -- las búsquedas fallarán porque los nuevos routers "más cercanos" no han recibido aún un almacenamiento. El alcance del problema, y los métodos para mitigarlo (por ejemplo con "handoffs, manos fuera" de la netdb a media noche) es un tema para futuros estudios.

source: Bootstrap Attacks
es: Ataques Bootstrap, de arranque

source: An attacker could attempt to boot new routers into an isolated or majority-controlled network by taking over a reseed website, or tricking the developers into adding his reseed website to the hardcoded list in the router.
es: Un atacante podría intentar arrancar nuevos ruters dentro de una red aislada o controlada en su mayoría por él tomando control de una web de resiembra, o engañando a los desarrolladores para que añadan su web de resembrado dentro del código del ruter.

source: Several defenses are possible, and most of these are planned:
es: Existen varias defensas posibles, y la mayoría ya están planeadas:

source: Disallow fallback from HTTPS to HTTP for reseeding. A MITM attacker could simply block HTTPS, then respond to the HTTP.
es: Desautoriza recurrir a HTTP desde HTTPS para el resembrado. Un atacante mediante un ataque de hombre-en-el-medio (MitM) podría simplemente bloquear HTTPS, y responder al HTTP.

source: Bundling reseed data in the installer
es: Incluyendo los datos de resiembra en el instalador

source: Defenses that are implemented:
es: Defensas que están implementadas:

source: Changing the reseed task to fetch a subset of RouterInfos from each of several reseed sites rather than using only a single site
es: Cambiar la tarea de resembrado para obtener un subconjunto de RouterInfos desde varias webs de resiembra en vez de usar una única web.

source: Creating an out-of-network reseed monitoring service that periodically polls reseed websites and verifies that the data are not stale or inconsistent with other views of the network
es: Creando un servicio de monitoreo de resiembras fuera de la red, que periódicamente pregunte a las webs de resiembra y verifique que los datos no están corruptos o son inconsistentes con otras vistas de la red.

source: As of release 0.9.14, reseed data is bundled into a signed zip file and the signature is verified when downloaded.
es: Desde la versión 0.9.14, los datos de resembrado están empaquetados en un fichero zip firmado, y la firma se verifica cuando es descargado.

source: Query Capture
es: Captura de peticiones

source: See also <a href="#lookup">lookup</a> (Reference: <a href="%(pdf)s">Hashing it out in Public</a> Sections 2.2-2.3 for terms below in italics)
es: Vea también <a href="#lookup">búsquedas</a> (Referencia: <a href="%(pdf)s">Hashing it out in Public</a> Secciones 2.2-2.3 para los términos en cursiva de abajo)

source: Similar to a bootstrap attack, an attacker using a floodfill router could attempt to "steer" peers to a subset of routers controlled by him by returning their references.
es: Similar a un ataque bootstrap, un atacante usando un ruter floodfill podría intentar "dirigir" a los pares a un subconjunto de ruters controlados por él devolviendo sus referencias.

source: This is unlikely to work via exploration, because exploration is a low-frequency task. Routers acquire a majority of their peer references through normal tunnel building activity. Exploration results are generally limited to a few router hashes, and each exploration query is directed to a random floodfill router.
es: Esto es raro que funcione vía exploración, porque la exploración es una tarea de baja frecuencia. Los ruters obtienen la mayoría de sus referencias sobre los pares cuando crean los túneles normales. Los resultados de exploración están generalmente limitados a unos pocos hashes de ruters, y cada petición de exploración es dirigida a un ruter floodfill aleatorio.

source: As of release 0.8.9, <i>iterative lookups</i> are implemented. For floodfill router references returned in a <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage response to a lookup, these references are followed if they are closer (or the next closest) to the lookup key. The requesting router does not trust that the references are closer to the key (i.e. they are <i>verifiably correct</i>. The lookup also does not stop when no closer key is found, but continues by querying the next-closet node, until the timeout or maximum number of queries is reached. This prevents a malicious floodfill from black-holing a part of the key space. Also, the daily keyspace rotation requires an attacker to regenerate a router info within the desired key space region. This design ensures that the query capture attack described in <a href="%(pdf)s">Hashing it out in Public</a> is much more difficult.
es: A partir de la versión 0.8.9, se han implementado las <i>búsquedas iterativas</i>. Las referencias de los ruters floodfill devueltas en una respuesta de búsqueda <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage, son seguidas si están más cerca (o la siguiente más cerca) a la clave de búsqueda. El ruter que hace la petición no confía en que las referencias estén más cerca a la clave (por ejemplo, son <i>verificablemente correctas</i>). Además la búsqueda no termina cuando la clave más cercana es encontrada, continúa haciendo peticiones al siguiente nodo más cercano, hasta que termine su tiempo o el número de peticiones. Esto previene que un floodfill malicioso haga un 'agujero negro' a una parte del espacio de claves. Además, la rotación diaria del espacio de claves requiere que el atacante regenere la información de un ruter dentro de la región del espacio de claves deseada. Este diseño asegura que el ataque de captura de peticiones descrito en <a href="%(pdf)s">Hashing it out in Public</a> sea mucho más difícil.

source: DHT-Based Relay Selection
es: Selección del Relay basado en DHT

source: (Reference: <a href="%(pdf)s">Hashing it out in Public</a> Section 3)
es: (Referencia: <a href="%(pdf)s">Hashing it out in Public</a> Sección 3)
