Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: As explained on the <a href="%(netdb)s#delivery">network database page</a>, local <a href="%(commonstructures)s#struct_LeaseSet">LeaseSets</a> are sent to floodfill routers in a <a href="%(i2npspec)s#msg_DatabaseStore">Database Store Message</a> wrapped in a <a href="%(i2npspec)s#msg_Garlic">Garlic Message</a> so it is not visible to the tunnel's outbound gateway.
es: Como se ha explicado en la <a href="%(netdb)s#delivery">página de la base de datos de la red</a>, los <a href="%(commonstructures)s#struct_LeaseSet">LeaseSets</a> locales son enviados a los ruters FloodFill en un <a href="%(i2npspec)s#msg_DatabaseStore">mensaje de almacenamiento de la base de datos</a> envuelto en un <a href="%(i2npspec)s#msg_Garlic">mensaje Garlic</a>, con lo cual no es visible para la puerta de salida del túnel de salida.

source: The Garlic Message mechanism is very flexible and provides a structure for implementing many types of mixnet delivery methods. Together with the unused delay option in the <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">tunnel message Delivery Instructions</a>, a wide spectrum of batching, delay, mixing, and routing strategies are possible.
es: El mecanismo del mensaje garlic (ajo) es muy flexible y proporciona una estructura que implementa muchos tipos de métodos de entrega mixnet (red interpuesta que desliga emisor y receptor mezclando transmisiones). Junto con la opción de retardo en desuso presente en las <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">Instrucciones de Entrega de mensaje por túnel</a>, es posible un amplio espectro de estrategias con lotes, retardo, mezclado, y enrutado.

source: In particular, there is potential for much more flexibility at the outbound tunnel endpoint. Messages could possibly be routed from there to one of several tunnels (thus minimizing point-to-point connections), or multicast to several tunnels for redundancy, or streaming audio and video.
es: En particular, hay potencial para mucha más flexibilidad en el punto final del túnel de salida. Los mensajes podrían ser rutados desde ahí a uno o varios túneles (con lo cual se minimizarían las conexiones de punto a punto), o enviar a varios túneles para hacerlo redundante, o hacer streming de audio o vídeo.

source: Such experiments may conflict with the need to ensure security and anonymity, such as limiting certain routing paths, restricting the types of I2NP messages that may be forwarded along various paths, and enforcing certain message expiration times.
es: Estos experimentos pudrían entrar en conflicto con la necesidad de seguridad y anonimato, ya sea limitando ciertos caminos de enrutado, restringiendo los mensajes I2NP que puedan ser enviados a través de varios caminos, e imponiendo ciertos tiempos de espiración a los mensajes.

source: As a part of <a href="%(elgamalaes)s">ElGamal/AES encryption</a>, a garlic message contains a sender specified amount of padding data, allowing the sender to take active countermeasures against traffic analysis. This is not currently used, beyond the requirement to pad to a multiple of 16 bytes.
es: Como parte de un <a href="%(elgamalaes)s">cifrado ElGamal/AES</a>, un mensaje Garlic contiene una cantidad especificada de datos de relleno, que permiten al transmisor tomar ciertas contramedidas activas contra el análisis de tráfico. Esto no se usa actualmente, mas allá de la necesidad de rellenar a un múltiplo de 16 bytes.

source: Encryption of additional messages to and from the <a href="%(netdb)s#delivery">floodfill routers</a>.
es: El cifrado de mensajes adicionales hacia y desde los <a href="%(netdb)s#delivery">ruters floodfill</a>.

source: References
es: Referencias

source: The term garlic routing was first coined in Roger Dingledine's Free Haven <a href="http://www.freehaven.net/papers.html">Master's thesis</a> (June 2000), see Section 8.1.1 authored by <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a>.
es: El término de garlic routing, rutado de ajo, fue acuñado en la <a href="http://www.freehaven.net/papers.html">Master's thesis</a> en Free Haven de Roger Dingledine (June 2000), ver sección 8.1.1 de <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a>.

source: Onion router publications
es: Publicaciones sobre ruter Onion

source: Onion Routing on Wikipedia
es: Rutado Onion en la Wikipedia

source: Garlic Routing on Wikipedia
es: Rutado Garlic en la Wikipedia

source: <a href="%(meeting58)s">I2P Meeting 58</a> (2003) discussing the implementation of garlic routing
es: <a href="%(meeting58)s">Reunión 58 de I2P</a> (2003) discutiendo la implementación del rutado Garlic

source: Free Haven publications
es: Publicaciones en Free Heaven

source: Onion routing was first described in <a href="http://www.onion-router.net/Publications/IH-1996.pdf">Hiding Routing Information</a> by David M. Goldschlag, Michael G. Reed, and Paul F. Syverson in 1996.
es: El rutado Onion fue descrito por primera vez en 1996 por David M. Goldschlag, Michael G. Reed, and Paul F. Syverson en <a href="http://www.onion-router.net/Publications/IH-1996.pdf">Hiding Routing Information</a>.

source: A Gentle Introduction to How I2P Works
es: Una breve introducción de cómo funciona I2P

source: I2P is a project to build, deploy, and maintain a network supporting secure and anonymous communication. People using I2P are in control of the tradeoffs between anonymity, reliability, bandwidth usage, and latency. There is no central point in the network on which pressure can be exerted to compromise the integrity, security, or anonymity of the system. The network supports dynamic reconfiguration in response to various attacks, and has been designed to make use of additional resources as they become available. Of course, all aspects of the network are open and freely available.
es: I2P es un proyecto para construir, desplegar y mantener una red que soporte comunicación segura y anónima. Los usuarios de I2P pueden administrar el balance entre el anonimato, fiabilidad, uso de ancho de banda y latencia. No hay un punto central en la red sobre el cual se pueda ejercer presión para comprometer la integridad, seguridad y anonimato del sistema. La red soporta reconfiguración dinámica en respuesta a diversos ataques, y ha sido diseñada para hacer uso de recursos adicionales según vayan estando disponibles. Por supuesto, todos los aspectos de la red son abiertos y están a libre disposición.

source: Unlike many other anonymizing networks, I2P doesn't try to provide anonymity by hiding the originator of some communication and not the recipient, or the other way around. I2P is designed to allow peers using I2P to communicate with each other anonymously &mdash; both sender and recipient are unidentifiable to each other as well as to third parties. For example, today there are both in-I2P web sites (allowing anonymous publishing / hosting) as well as HTTP proxies to the normal web (allowing anonymous web browsing). Having the ability to run servers within I2P is essential, as it is quite likely that any outbound proxies to the normal Internet will be monitored, disabled, or even taken over to attempt more malicious attacks.
es: A diferencia de la mayoría de las redes anónimas, I2P no intenta proporcionar anonimato ocultando al autor de una comunicación y no al destinatario, o vice versa. Al contrario: I2P está diseñada para permitir a los pares comunicarse unos con otros anónimamente - ambos, quien envía y quien recibe, no son identificables entre ellos y tampoco por terceras partes. Por ejemplo, actualmente hay sitios web I2P internos (permitiendo publicación y hospedaje anónimo) además de proxies HTTP hacia la web normal (permitiendo navegación anónima). Disponer de la posibilidad de correr servidores internamente en I2p es esencial, ya que es bastante probable que cualquier proxy de salida hacia el Internet normal pueda ser monitorizado, desactivado o incluso comprometido para luego intentar más ataques maliciosos.

source: The network itself is message oriented - it is essentially a secure and anonymous IP layer, where messages are addressed to cryptographic keys (Destinations) and can be significantly larger than IP packets. Some example uses of the network include "eepsites" (webservers hosting normal web applications within I2P), a BitTorrent client ("I2PSnark"), or a distributed data store. With the help of the <a href="%(i2ptunnel)s">I2PTunnel</a> application, we are able to stream traditional TCP/IP applications over I2P, such as SSH, IRC, a squid proxy, and even streaming audio. Most people will not use I2P directly, or even need to know they're using it. Instead their view will be of one of the I2P enabled applications, or perhaps as a little controller app to turn on and off various proxies to enable the anonymizing functionality.
es: La red es en sí misma está orientada a mensajes - es en esencia una capa IP segura y anónima donde los mensajes son direccionados hacia claves criptográficas (Destinos) y pueden ser considerablemente más largos que los paquetes IP. Algunos ejemplos del uso de la red incluyen "eepsites" (servidores web hospedando aplicaciones web normales dentro de I2P), un cliente BitTorrent ("I2PSnark"), o un sistema de almacenaje de datos distribuido. Con la ayuda de la aplicación <a href="%(i2ptunnel)s"> I2PTunnel</a>, somos capaces de correr aplicaciones TCP/IP tradicionales sobre I2P, como SSH, IRC, un proxy Squid, e igualmente streaming de audio. Mucha gente no usará I2P directamente, o mismamente no necesitarán saber que lo están usando. En vez de eso, su percepción será la de una de las aplicaciones I2P habilitadas, o quizá la de una pequeña aplicación de control para activar y desactivar varios proxies que permitan funcionalidades de anonimato.

source: An essential part of designing, developing, and testing an anonymizing network is to define the <a href="%(threatmodel)s">threat model</a>, since there is no such thing as "true" anonymity, just increasingly expensive costs to identify someone. Briefly, I2P's intent is to allow people to communicate in arbitrarily hostile environments by providing good anonymity, mixed in with sufficient cover traffic provided by the activity of people who require less anonymity. This way, some users can avoid detection by a very powerful adversary, while others will try to evade a weaker entity, <i>all on the same network</i>, where each one's messages are essentially indistinguishable from the others.
es: Una parte esencial de diseñar, desarrollar y probar una red anónima es definir el <a href="%(threatmodel)s">modelo de amenaza</a>, si partimos de que no existe lo que podría ser considerado anonimato auténtico, solamente se puede hacer más costoso el identificar a alguien. Brevemente, el propósito de I2P es permitir comunicarse a la gente en ambientes arbitrariamente hostiles suministrando buen anonimato, mezclado con suficiente tráfico de cobertura proporcionado por la actividad de gente que requiere menos anonimato. De esta forma algunos usuarios pueden evitar ser detectados por poderosos adversarios, mientras otros intentarán ocultar su identidad de forma más débil, <i>todo en la misma red</i>, donde los mensajes de cada uno son esencialmente indistinguibles de los del resto.

source: Why?
es: ¿Por qué?

source: There are a multitude of reasons why we need a system to support anonymous communication, and everyone has their own personal rationale. There are many <a href="%(comparisons)s">other efforts</a> working on finding ways to provide varying degrees of anonymity to people through the Internet, but we could not find any that met our needs or threat model.
es: Hay múltiples razones por las que necesitamos un sistema que soporte comunicaciones anónimas, y además cada uno tiene si propias razones. Hay muchos <a href="%(comparisons)s">otros proyectos</a> en Internet trabajando para encontrar formas de ofrecer varios niveles de anonimato para la gente, pero no habíamos encontrado ninguno que cumpliera nuestras necesidades o el modelo de amenazas.

source: How?
es: ¿Cómo?

source: The network at a glance is made up of a set of nodes ("routers") with a number of unidirectional inbound and outbound virtual paths ("tunnels", as outlined on the <a href="%(tunnelrouting)s">tunnel routing</a> page). Each router is identified by a cryptographic RouterIdentity which is typically long lived. These routers communicate with each other through existing transport mechanisms (TCP, UDP, etc), passing various messages. Client applications have their own cryptographic identifier ("Destination") which enables it to send and receive messages. These clients can connect to any router and authorize the temporary allocation ("lease") of some tunnels that will be used for sending and receiving messages through the network. I2P has its own internal <a href="%(netdb)s">network database</a> (using a modification of the Kademlia algorithm) for distributing routing and contact information securely.
es: Un vistazo a la red muestra que se compone de una instalación de nodos ("ruters") con un número de rutas virtuales unidireccionales entrantes y salientes (Túneles, como se describen en la página <a href="%(tunnelrouting)s">tunnel routing</a>). Cada ruter está identificado por una RouterIdentity cifrada que es e normalmente permanente. Estos ruters se comunican entre ellos a través de mecanismos de transporte existentes (TCP, UDP, etc) enviándose distintos mensajes. Las aplicaciones clientes tienen su propio identificador criptográfico ("Destino") que las habilita para enviar y recibir mensajes. Estos clientes pueden conectarse a cualquier ruter y autorizar la asignación temporal ("arrendamiento") de varios túneles que serán usados para enviar y recibir mensaje a través de la red. I2P tiene su propia <a href="%(netdb)s">base de datos de red</a> (utilizando una modificación del algoritmo Kademlia) para distribuir información de rutas y contactos de forma segura.

source: Network topology example
es: Ejemplo de topología de red

source: In the above, Alice, Bob, Charlie, and Dave are all running routers with a single Destination on their local router. They each have a pair of 2-hop inbound tunnels per destination (labeled 1, 2, 3, 4, 5 and 6), and a small subset of each of those router's outbound tunnel pool is shown with 2-hop outbound tunnels. For simplicity, Charlie's inbound tunnels and Dave's outbound tunnels are not shown, nor are the rest of each router's outbound tunnel pool (typically stocked with a few tunnels at a time). When Alice and Bob talk to each other, Alice sends a message out one of her (pink) outbound tunnels targeting one of Bob's (green) inbound tunnels (tunnel 3 or 4). She knows to send to those tunnels on the correct router by querying the network database, which is constantly updated as new leases are authorized and old ones expire.
es: En la imagen, Alice, Bob, Charlie y Dave están corriendo ruters con una simple Destinación en su ruter local. Cada uno de ellos tiene un par de túneles de dos saltos entrantes por destino (etiquetados como 1, 2, 3, 4, 5 y 6), y una pequeña parte del grupo de los túneles de salida de esos ruters se representa con túneles de salida de dos saltos. Para simplificar, los túneles entrantes de Charlie y los de salida de Dave no se muestran, tampoco está el resto del grupo de túneles de salida de cada ruter (típicamente compuesto por varios túneles a la vez). Cuando Alice y Bob se comunican entre ellos, Alice envía un mensaje por uno de sus túneles de salida (rosa) en dirección a uno de los túneles entrantes (verde) de Bob (túnel 3 o 4). Ella sabe cómo enviar a los túneles del ruter correcto mediante consultas a la base de datos de red, que está constantemente actualizándose tan pronto cómo son autorizados nuevos contactos y expiran los viejos.

source: If Bob wants to reply to Alice, he simply goes through the same process - send a message out one of his outbound tunnels targeting one of Alice's inbound tunnels (tunnel 1 or 2). To make things easier, most messages sent between Alice and Bob are <a href="%(garlicrouting)s">garlic</a> wrapped, bundling the sender's own current lease information so that the recipient can reply immediately without having to look in the network database for the current data.
es: Si Bob quiere contestar a Alice, simplemente utilizará el mismo proceso - envía un mensaje por uno de sus túneles de salida en dirección hacia uno de los túneles de entrada de Alice (túnel 1 o 2). Para hacer las cosas más sencillas, la mayor parte de los mensajes enviados entre Alice y Bob usan el envoltorio <a href="%(garlicrouting)s">de ajo, garlic</a>, incluyendo la información del contrato, lease, del propio remitente para que el receptor pueda responder inmediatamente sin tener que mirar en la base de datos de la red por ellos.

source: To deal with a wide range of attacks, I2P is fully distributed with no centralized resources - and hence there are no directory servers keeping statistics regarding the performance and reliability of routers within the network. As such, each router must keep and maintain profiles of various routers and is responsible for selecting appropriate peers to meet the anonymity, performance, and reliability needs of the users, as described in the <a href="%(peerselection)s">peer selection</a> page.
es: Para tratar con un amplio rango de ataques, I2P es completamente distribuida sin recursos centralizados - no hay servidores manteniendo estadísticas sobre el rendimiento y fiabilidad de los ruters dentro de la red. De esta forma cada ruter debe guardar y mantener los perfiles de varios ruters y es responsable de seleccionar los pares apropiados para satisfacer el anonimato, rendimiento y fiabilidad requeridos por los usuarios tal y como se describe en la página de <a href="%(peerselection)s">selección de pares</a>.

source: The network itself makes use of a significant number of <a href="%(cryptography)s">cryptographic techniques and algorithms</a> - a full laundry list includes 2048bit ElGamal encryption, 256bit AES in CBC mode with PKCS#5 padding, 1024bit DSA signatures, SHA256 hashes, 2048bit Diffie-Hellman negotiated connections with station to station authentication, and <a href="%(elgamalaes)s">ElGamal / AES+SessionTag</a>.
es: La red hace uso de un gran número de <a href="%(cryptography)s">técnicas criptográficas y algoritmos</a> - una lista completa incluye el cifrado El Gamal de 2048 bits, AES de 256 bits en modo CBC con relleno PKCS#5, firmas DSA de 1024 bits, hashes SHA256, negociación de conexiones Diffie-Hellman de 2048 bits con autenticación estación a estación y <a href="%(elgamalaes)s"> ElGamal / AES+SessionTag</a>.

source: Content sent over I2P is encrypted through three layers garlic encryption (used to verify the delivery of the message to the recipient), tunnel encryption (all messages passing through a tunnel is encrypted by the tunnel gateway to the tunnel endpoint), and inter router transport layer encryption (e.g. the TCP transport uses AES256 with ephemeral keys).
es: El contenido enviado sobre I2P está cifrado a través del cifrado garlic de tres capas (usado para verificar la entrega del mensaje a destinatario), cifrado de túnel (todos los mensajes cruzando a través de un túnel están cifrados desde el túnel de salida hasta el túnel de destino final) y cifrado de la capa de transporte inter-router (e. g. el transporte TCP usa AES256 con claves efímeras).

source: End-to-end (I2CP) encryption (client application to server application) was disabled in I2P release 0.6; end-to-end (garlic) encryption (I2P client router to I2P server router) from Alice's router "a" to Bob's router "h" remains. Notice the different use of terms! All data from a to h is end-to-end encrypted, but the I2CP connection between the I2P router and the applications is not end-to-end encrypted! A and h are the routers of Alice and Bob, while Alice and Bob in following chart are the applications running atop of I2P.
es: El cifrado (I2CP) punto a punto (aplicación cliente hacia aplicación servidor) fue deshabilitado en la versión 0.6 de I2P; el cifrado (garlic) punto a punto (ruter cliente I2P hacia ruter servidor I2P) desde el ruter de Alice "a" hasta el ruter de Bob "h" aún permanece. ¡Observe el uso diferente de los términos! Todos los datos desde "a" hasta "h" están cifrados punto a punto, pero las conexiones I2CP entre el ruter I2P y las aplicaciones no son cifradas punto a punto. "A" y "h" son los ruters de Alice y Bob, mientras que, y siguiendo el diagrama, Alice y Bob son las aplicaciones corriendo sobre I2P.

source: End to end layered encryption
es: Cifrado por capas de punto a punto

source: The specific use of these algorithms are outlined <a href="%(cryptography)s">elsewhere</a>.
es: El uso específico de estos algoritmos está descrito en <a href="%(cryptography)s">otra parte</a>.

source: The two main mechanisms for allowing people who need strong anonymity to use the network are explicitly delayed garlic routed messages and more comprehensive tunnels to include support for pooling and mixing messages. These are currently planned for release 3.0, but garlic routed messages with no delays and FIFO tunnels are currently in place. Additionally, the 2.0 release will allow people to set up and operate behind restricted routes (perhaps with trusted peers), as well as the deployment of more flexible and anonymous transports.
es: Los dos mecanismos principales que permiten usar la red a gente que necesita un fuerte anonimato son explícitamente mensajes enrutados garlic con retardo y túneles más completos que incluyan agrupamiento y mezcla de mensajes. Estos están actualmente planeados para la release 3.0, pero los mensajes enrutados garlic sin retardo y túneles FIFO están ya implementados. Adicionalmente la versión 2.0 permitirá a los usuarios establecerse y operar detrás de ruters restrictivos (puede que con pares de confianza), así como el despliegue de transportes más flexibles y anónimos.

source: Some questions have been raised with regards to the scalability of I2P, and reasonably so. There will certainly be more analysis over time, but peer lookup and integration should be bounded by <code>O(log(N))</code> due to the <a href="%(netdb)s">network database</a>'s algorithm, while end to end messages should be <code>O(1)</code> (scale free), since messages go out K hops through the outbound tunnel and another K hops through the inbound tunnel, with K no longer than 3. The size of the network (N) bears no impact.
es: Han surgido algunas preguntas referentes a la escalabilidad de I2P. Habrá ciertamente más análisis con el tiempo, pero la búsqueda e integración de pares debería ser limitado por <code>O(log(N))</code> debido al algoritmo de <a href="%(netdb)s">base de datos de red</a>, mientras que los mensajes punto a punto serían <code>O(1)</code> (escala libre), puesto que los mensajes pasan por K saltos a través del túnel de salida y otros K saltos por el túnel de entrada, donde K no es mayor de 3. El tamaño de la red (N) no acarrea impacto.

source: When?
es: ¿Cuándo?
