Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: I2PTunnel is probably I2P's most popular and versatile client application, allowing generic proxying both into and out of the I2P network. I2PTunnel can be viewed as four separate proxying applications - a "client" which receives inbound TCP connections and forwards them to a given I2P destination, an "httpclient" (aka "eepproxy") which acts like an HTTP proxy and forwards the requests to the appropriate I2P destination (after querying the naming service if necessary), a "server" which receives inbound I2P streaming connections on a destination and forwards them to a given TCP host+port, and an "httpserver" which extends the "server" by parsing the HTTP request and responses to allow safer operation. There is an additional "socksclient" application, but its use is not encouraged for reasons previously mentioned.
es: I2pTunnel es probablemente la aplicación más versátil y popular de I2P, permitiendo 'proxificar' dentro y fuera de la red I2P. Se puede ver I2PTunnel como cuatro aplicaciones de proxy diferentes - un cliente que recibe conexiones TCP de entrada y las envía a una destinación I2P, un "cliente http" ("eeproxy) que funciona con un proxy HTTP y envía las peticiones a la destinación I2P apropiada (Después de preguntar a un servicio de dominios si es necesario), un "servidor" el cual recibe conexiones de entrada de I2P en una destinación y los envía a un host+puerto TCP dado, y un "servidor http" el cual amplía el "servidor" pasando las solicitudes y respuestas HTTP para permitir un funcionamiento seguro. Hay una aplicación adicional "socksclient", pero su uso no se fomenta por razones mencionadas anteriormente.

source: I2P itself is not an outproxy network - the anonymity and security concerns inherent in a mix net which forwards data into and out of the mix have kept I2P's design focused on providing an anonymous network which capable of meeting the user's needs without requiring external resources. However, the I2PTunnel "httpclient" application offers a hook for outproxying - if the hostname requested doesn't end in ".i2p", it picks a random destination from a user-provided set of outproxies and forwards the request to them. These destinations are simply I2PTunnel "server" instances run by volunteers who have explicitly chosen to run outproxies - no one is an outproxy by default, and running an outproxy doesn't automatically tell other people to proxy through you. While outproxies do have inherent weaknesses, they offer a simple proof of concept for using I2P and provide some functionality under a threat model which may be sufficient for some users.
es: En sí mismo I2P no es una red creada para outproxy - los problemas de seguridad de una red que envía datos dentro y fuera de esta han hecho que el diseño de I2P se haya centrado en crear una red anónima con capacidad para cubrir las necesidades de los usuarios sin necesitar recursos externos. Aún así la aplicación de "httpclient" I2PTunnel ofrece la posibilidad de 'outproxying' - si el nombre de dominio no termina en .i2p, elije una destinación aleatoria de una lista de outproxies para el usuario dado y se lo envía. Estas destinaciones son simplemente "servidores" I2PTunnels ejecutados por voluntarios que han decidido explícitamente ejecutar outproxies - nadie es un outproxy por defecto, y ejecutar un outproxy no hace que nadie pase automáticamente a través de su ruter. Aunque los outproxys tienen debilidades inherentes, ofrecen un servicio para I2P que tiene un modelo de seguridad que puede ser suficiente para algunos usuarios.

source: I2PTunnel enables most of the applications in use. An "httpserver" pointing at a webserver lets anyone run their own anonymous website (or "eepsite") - a webserver is bundled with I2P for this purpose, but any webserver can be used. Anyone may run a "client" pointing at one of the anonymously hosted IRC servers, each of which are running a "server" pointing at their local IRCd and communicating between IRCds over their own "client" tunnels. End users also have "client" tunnels pointing at <a href="#app.i2pmail">I2Pmail's</a> POP3 and SMTP destinations (which in turn are simply "server" instances pointing at POP3 and SMTP servers), as well as "client" tunnels pointing at I2P's CVS server, allowing anonymous development. At times people have even run "client" proxies to access the "server" instances pointing at an NNTP server.
es: I2PTunnel es el que permite el funcionamiento de la mayoría de las aplicaciones. Un "servidor http" apuntando a un servidor web permite a cualquiera tener su propia web anónima ( o "eepsite") - un servidor web se incluye por defecto en I2P para este propósito, pero se puede utilizar cualquier servidor web. Cualquiera puede ejecutar un "cliente" apuntando a cualquiera de los servidores IRC, todos ellos ejecutan un "servidor" apuntando a su demonio IRCd local y comunicándose entre servidores IRCd a través de sus propios túneles "cliente". Los usuarios finales también tienen túneles clientes apuntando a las destinaciones POP3 y SMTP de <a href="#app.i2pmail">I2Pmail</a> ( que realmente sólo son simples instancias "servidores" apuntando a servidores POP3 y SMTP), también hay túneles apuntando al servidor CVS de I2P, permitiendo el desarrollo anónimo. Incluso a veces hay gente que ha ejecutado proxies "clientes" para acceder instancias de "servidores" apuntando a servidores NNTP.

source: i2p-bt is a port of the mainline python BitTorrent client to run both the tracker and peer communication over I2P. Tracker requests are forwarded through the eepproxy to eepsites specified in the torrent file while tracker responses refer to peers by their destination explicitly, allowing i2p-bt to open up a <a href="#app.streaming">streaming lib</a> connection to query them for blocks.
es: I2p-bt es un port del cliente principal de BitTorrent en python para usarse como par y tracker sobre I2P. Las peticiones del tracker son enviadas a través del eepproxy a las eepsites especificadas en el archivo torrent, mientras que las respuestas del tracker se refieren a los pares explícitamente por su destinación, permitiendo a i2p-bt abrir una conexión a la <a href="#app.streaming">librería de streaming</a> para preguntar por los bloques.

source: In addition to i2p-bt, a port of bytemonsoon has been made to I2P, making a few modifications as necessary to strip any anonymity-compromising information from the application and to take into consideration the fact that IPs cannot be used for identifying peers.
es: Ademas de i2p-bt, se ha creado un port de bytemonsoon para I2P, haciendo las modificaciones necesarias para separar las información comprometedora de la aplicación y tomar en consideración el hecho de que las IPs no pueden usarse para identificar los pares.

source: I2PSnark developed: jrandom, et al, ported from <a href="http://www.klomp.org/mark/">mjw</a>'s <a href="http://www.klomp.org/snark/">Snark</a> client
es: I2Psnark es programado por jrandom y otros, portado desde el cliente <a href="http://www.klomp.org/snark/">Snark</a> de <a href="http://www.klomp.org/mark/">mjw</a>.

source: Bundled with the I2P install, I2PSnark offers a simple anonymous BitTorrent client with multitorrent capabilities, exposing all of the functionality through a plain HTML web interface.
es: Incluido en la instalación de I2P, I2PSnark ofrece un cliente anónimo de BitTorrent con capacidades para multitorrents, mostrando todas sus funcionaliudades a través de in unterfaz web HTML.

source: Robert is a Bittorrent client written in Python. It is hosted on <a href="http://%(bob)s/Robert.html">http://%(bob)s/Robert.html</a> <!-- TODO: expand -->
es: Robert es un cliente Bittorrent escrito en Python. Se aloja en <a href="http://%(bob)s/Robert.html">http://%(bob)s/Robert.html</a> <!-- TODO: desarrollar -->

source: PyBit is a Bittorrent client written in Python. It is hosted on <a href="%(pybit)s">%(pybit)s</a> <!-- TODO: expand -->
es: PyBit es un cliente Bittorrent escrito en Python. Está hospedado en <a href="%(pybit)s">%(pybit)s</a> <!-- TODO: expand -->

source: I2Phex is a fairly direct port of the Phex Gnutella filesharing client to run entirely on top of I2P. While it has disabled some of Phex's functionality, such as integration with Gnutella webcaches, the basic file sharing and chatting system is fully functional.
es: I2Phex es un port de Phex, el cliente de para compartir archivos Gnutella, para ser ejecutado en I2P. Aunque se han deshabilitado algunas funciones de Phex, como la integración los los webcaches de GNUtella, los sistemas básicos de compartición y chateo son funcionales.

source: iMule is a fairly direct port of the aMule filesharing client running entirely inside I2P.
es: iMule es un port del cliente p2p aMule, que funciona completamente dentro de I2P.

source: I2Pmail is more a service than an application - postman offers both internal and external email with POP3 and SMTP service through I2PTunnel instances accessing a series of components developed with mastiejaner, allowing people to use their preferred mail clients to send and receive mail pseudonymously. However, as most mail clients expose substantial identifying information, I2P bundles susi23's web based susimail client which has been built specifically with I2P's anonymity needs in mind. The I2Pmail/mail.i2p service offers transparent virus filtering as well as denial of service prevention with hashcash augmented quotas. In addition, each user has control of their batching strategy prior to delivery through the mail.i2p outproxies, which are separate from the mail.i2p SMTP and POP3 servers - both the outproxies and inproxies communicate with the mail.i2p SMTP and POP3 servers through I2P itself, so compromising those non-anonymous locations does not give access to the mail accounts or activity patterns of the user. At the moment the developers work on a decentralized mailsystem, called "v2mail". More information can be found on the eepsite <a href="http://%(postman)s/">%(postman)s</a>.
es: I2Pmail es más un servicio que una aplicación - postman ofrece correos internos y externos con servicios POP3 y SMTP a través de instancias de I2PTunnel que acceden a una serie de componentes desarrollados con mastiejaner, permitiendo a la gente usar su cliente de correo favorito para enviar y recibir seudoanónimamente. Ya que la mayoría de los clientes de mail muestran demasiado información identificativa, I2P incluye el cliente susimail basado en web de susi23 construido específicamente para las necesidades de anonimato de I2P. El servicio de I2Pmail/mail.i2p ofrece filtrado transparente de virus así como protección contra ataques DOS con cuotas de hashcash. Además, cada usuario tiene control de su estrategia de lotes antes de enviar a través de los outproxies de mail.i2p, que están separados de los servidores de SMTP y POP3 de mail.i2p - los inproxies y outproxies se comunican con los servidores SMTP y POP3 a través de I2P, con lo cual si se comprometen localizaciones no anónimas no se da acceso a la actividad de las cuentas de correo o las pautas del usuario. En este momento los desarrolladores trabajan en un sistema de correo descentralizado, llamado "v2mail". Se puede encontrar más información en <a href="http://%(postman)s/">%(postman)s</a>.

source: I2P-Bote is a distributed e-mail application. It does not use the traditional e-mail concept of sending an e-mail to a server and retrieving it from a server. Instead, it uses a Kademlia Distributed Hash Table to store mails. One user can push a mail into the DHT, while another can request the e-mail from the DHT. And all the mails sent within the I2P-Bote network are automatically encrypted end-to-end. <br> Furthermore, I2P-Bote offers a remailer function on top of I2P, for increased high-latency anonymity.
es: I2P-Bote es un aplicación distribuida de correo. No usa el modelo tradicional de enviar un correo a un servidor y obtenerlo de ese servidor. En cambio, usa el sistema distribuido de tablas hash Kademila para almacenar los correos. Un usuario puede enviar el correo al DHT, mientras que otro puede obtener al correo del DHT. Y todos los correos enviados con la red I2P-Bote son automáticamente cifrados de fin a fin.<br> Además, I2P-Bote ofrece una función de remailer sobre I2P, para el anonimato de alta latencia.

source: I2P-Messenger is an end-to-end encrypted serverless communication application. For communication between two users, they need to give each other their destination keys, to allow the other to connect. It supports file transfer and has a search for other users, based on Seedless.
es: I2P-Messenger es un aplicación de comunicación cifrada de fin a fin. Para la comunicación entre 2 usuarios sólo necesitan compartir entre ellos las claves de destino. Soporta transferencia de archivos y búsqueda de otros usuarios, basado en Seedlees.

source: I2P's Threat Model
es: Modelos de riesgo en I2P

source: November 2010
es: Noviembre 2010

source: low
es: bajo

source: medium
es: medio

source: high
es: alto

source: Damage Potential
es: Posibles daños

source: Reliability
es: Fiabilidad

source: Exploitability
es: Explotabilidad

source: Affected Users
es: Usuarios afectados

source: Discoverability
es: Detección

source: Severity
es: Severidad

source: Priority
es: Prioridad

source: Index of Attacks
es: Índices de ataques

source: Brute force attacks
es: Ataques de fuerza bruta

source: Timing attacks
es: Ataques de sincronización

source: Intersection attacks
es: Ataques por intersección

source: Denial of service attacks
es: Ataques de denegación de servicio

source: Tagging attacks
es: Ataques de etiquetado

source: Partitioning attacks
es: Ataques de particionamiento

source: Predecessor attacks
es: Ataques del predecesor

source: Harvesting attacks
es: Ataques de cosechado

source: Identification Through Traffic Analysis
es: Identificación a través de análisis del tráfico

source: Sybil attacks
es: Ataques Sybil

source: Buddy Exhaustion attacks
es: Ataques por agotamiento de amigos

source: Cryptographic attacks
es: Ataques de cifrados

source: Floodfill attacks
es: Ataques Floodfill

source: Other Network Database attacks
es: Otros ataques a la base de datos de la red

source: Attacks on centralized resources
es: Ataques a recursos centralizados

source: Development attacks
es: Ataques de desarrollo

source: Implementation attacks
es: Ataques de implementación

source: Other Defenses
es: Otras defensas

source: What do we mean by "anonymous"?
es: ¿Qué quiere decir con "anónimo"?

source: Your level of anonymity can be described as "how hard it is for someone to find out information you don't want them to know?" - who you are, where you are located, who you communicate with, or even when you communicate. "Perfect" anonymity is not a useful concept here - software will not make you indistinguishable from people that don't use computers or who are not on the Internet. Instead, we are working to provide sufficient anonymity to meet the real needs of whomever we can - from those simply browsing websites, to those exchanging data, to those fearful of discovery by powerful organizations or states.
es: El nivel de anonimato se puede describir "como la dificultad para alguien de encontrar información sobre usted que no quiere que sea encontrada" - quien es usted, su localización, con quien se comunica, o incluso cuándo se comunica. El anonimato "perfecto" no es aquí un concepto útil - las aplicaciones no le harán indistinguible de las personas que no utilizan ordenadores o no usan Internet. Aún así intentamos proveer suficiente anonimato pera cumplir las verdaderas necesidades de quien podemos - de aquellos simplemente navegando por webs, o para aquellos que intercambian información, hasta aquellos con miedo de ser descubiertos por organizaciones poderosas o estados.

source: The question of whether I2P provides sufficient anonymity for your particular needs is a hard one, but this page will hopefully assist in answering that question by exploring how I2P operates under various attacks so that you may decide whether it meets your needs.
es: La cuestión de si I2P provee suficiente anonimato para usted es una pregunta difícil, pero esperemos que esta página le responda a esa pregunta explorando como I2P opera ante varios atauqes y así puede decidir si se amolda a sus necesidades.

source: We welcome further research and analysis on I2P's resistance to the threats described below. More review of existing literature (much of it focused on Tor) and original work focused on I2P is needed.
es: Damos la bienvenida a más investigaciones y análisis sobre la resistencia de I2P a las amenazas más abajo descritas. Se necesitan revisiones sobre los textos ya existentes (la mayoría sobre Tor) y trabajos originales sobre I2P.

source: Network Topology Summary
es: Sumario de la topología de la red

source: I2P builds off the ideas of many <a href="%(comparisons)s">other</a> <a href="%(links)s">systems</a>, but a few key points should be kept in mind when reviewing related literature:
es: I2P se crea sobre las ideas de muchos <a href="%(comparisons)s">otros</a> <a href="%(links)s">sistemas</a>, pero a la hora de revisar la información hay que tener en cuenta varios puntos:

source: <b>I2P is a free route mixnet</b> - the message creator explicitly defines the path that messages will be sent out (the outbound tunnel), and the message recipient explicitly defines the path that messages will be received on (the inbound tunnel).
es: <b>I2P es una mixnet de rutas libres</b> - el creador del mensaje define explícitamente el camino que seguirán los mensajes enviados (el túnel de salida), y el receptor del mensaje define explícitamente el camino por el cual serán recibidos los mensajes (el túnel de entrada).

source: <b>I2P has no official entry and exit points</b> - all peers fully participate in the mix, and there are no network layer in- or out-proxies (however, at the application layer, a few proxies do exist)
es: <b>I2P no tiene puntos de entrada y salida oficiales</b> - todos los pares participan completamente en la mezcla, y no hay proxies de entrada o salida en la capa de red (aún así existen varios proxies de salida en la capa de aplicación)

source: <b>I2P is fully distributed</b> - there are no central controls or authorities. One could modify some routers to operate mix cascades (building tunnels and giving out the keys necessary to control the forwarding at the tunnel endpoint) or directory based profiling and selection, all without breaking compatibility with the rest of the network, but doing so is of course not necessary (and may even harm one's anonymity).
es: <b>I2P es totalmente distribuido</b> - no existen centros de control o autoridades. Cualquiera pude modificar algunos ruters para operar cascadas de mezcla (construyendo túneles y dando las claves necesarias para controlar el envío al final del túnel) o controlar los perfiles de los directorios, todo esto sin romper la compatibilidad con el resto de la red, pero por supuesto no es necesario hacer nada de esto (y además podría poner en peligro su anonimato).

source: We have documented plans to implement <a href="%(todo)s#stop">nontrivial delays</a> and <a href="%(todo)s#batching">batching strategies</a> whose existence is only known to the particular hop or tunnel gateway that receives the message, allowing a mostly low latency mixnet to provide cover traffic for higher latency communication (e.g. email). However we are aware that significant delays are required to provide meaningful protection, and that implementation of such delays will be a significant challenge. It is not clear at this time whether we will actually implement these delay features.
es: Tenemos planes documentados para implementar <a href="%(todo)s#stop">retardos no triviales</a> y <a href="%(todo)s#batching">estrategias de procesados por lote</a> cuya estrategia es sólo conocida por un salto en particular o por las puerta de salida del túnel que recibe el mensaje, permitiendo una red de baja latencia para proveer tráfico de cobertura para las comunicaciones de mayor latencia (por ejemplo correos). Aún así somos conscientes de que son necesarios retardos importantes para proveer una protección útil, y la implementación de esos retardos será un gran desafío. No está claro aún si implementaremos estas características de retardo.

source: In theory, routers along the message path may inject an arbitrary number of hops before forwarding the message to the next peer, though the current implementation does not.
es: En teoría, los ruters a lo largo del camino pueden inyectar un número arbitrario de saltos antes de enviar el mensaje al siguiente par, pero la implementación actual no lo hace.

source: The Threat Model
es: El modelo de amenazas

source: I2P design started in 2003, not long after the advent of <a href="http://www.onion-router.net">[Onion Routing]</a>, <a href="http://freenetproject.org/">[Freenet]</a>, and <a href="https://www.torproject.org/">[Tor]</a>. Our design benefits substantially from the research published around that time. I2P uses several onion routing techniques, so we continue to benefit from the significant academic interest in Tor.
es: El diseño de I2P comenzó en 2003, no mucho tiempo después del llegada del <a href="http://www.onion-router.net">[Onion Routing]</a> (enrutamiento cebolla), <a href="http://freenetproject.org/">[Freenet]</a> (red libre), y <a href="https://www.torproject.org/">[Tor]</a>. Nuestro diseño se beneficia sustancialmente de las investigaciones publicadas en torno a esa época. I2P usa varias técnicas de enrutamiento cebolla, así que continuamos beneficiándonos del significativo interés académico en Tor.

source: Taking from the attacks and analysis put forth in the <a href="http://freehaven.net/anonbib/topic.html">anonymity literature</a> (largely <a href="http://citeseer.ist.psu.edu/454354.html">Traffic Analysis: Protocols, Attacks, Design Issues and Open Problems</a>), the following briefly describes a wide variety of attacks as well as many of I2Ps defenses. We update this list to include new attacks as they are identified.
es: Teniendo en cuenta los ataques y análisis en la <a href="http://freehaven.net/anonbib/topic.html">literatura sobre el anonimato</a> (en gran parte <a href="http://citeseer.ist.psu.edu/454354.html">Traffic Analysis: Protocols, Attacks, Design Issues and Open Problems</a>), a continuación describimos brevemente un gran variedad de ataques así como las defensas en i2P. Actualizaremos esta lista según sean identificados nuevos ataques.

source: Included are some attacks that may be unique to I2P. We do not have good answers for all these attacks, however we continue to do research and improve our defenses.
es: Se incluyen algunos ataques que pueden ser solamente para I2P. No tenemos soluciones perfectas para esos ataques, pero continuamos estudiando como defendernos de ellos.

source: In addition, many of these attacks are significantly easier than they should be, due to the modest size of the current network. While we are aware of some limitations that need to be addressed, I2P is designed to support hundreds of thousands, or millions, of participants. As we continue to spread the word and grow the network, these attacks will become much harder.
es: Además, muchos de esos ataques son significativamente más fáciles de lo que deberían ser debido al pequeño tamaño actual de la red. Aunque somos conscientes de algunas limitaciones que deben ser reparadas, I2P está diseñado para soportar cientos de miles, o millones de pares. Según vayamos difundiendo la palabra y la red crezca, esos ataques serán mucho mas difíciles de llevar acabo.
