Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: The following options are traditionally passed to the router via a <a href="%(i2cp)s#struct_SessionConfig">SessionConfig</a> contained in a <a href="%(i2cp)s#msg_CreateSession">CreateSession Message</a> or a <a href="%(i2cp)s#msg_ReconfigureSession">ReconfigureSession Message</a>.
es: Las siguientes opciones se pasan tradicionalmente al router a través de un <a href="%(i2cp)s#struct_SessionConfig">SessionConfig</a> (configuración de la sesión) contenida en un <a href="%(i2cp)s#msg_CreateSession">mensaje CreateSession</a> (crear sesión) o un <a href="%(i2cp)s#msg_ReconfigureSession">Mensaje ReconfigureSession</a> (reconfiguración de sesión).

source: As Of Release
es: Desde la versión

source: Recommended Arguments
es: Parámetros recomendados

source: Allowable Range
es: Rango permitido

source: The timeout (ms) for all sent messages. Unused. See the protocol specification for per-message settings.
es: El tiempo de espera (ms) para todos los mensajes enviados. No usado. Vea la especificación del protocolo para configuraciones por-mensaje.

source: Minimum number of ElGamal/AES Session Tags before we send more. Recommended: approximately tagsToSend * 2/3
es: Número mínimo de etiquetas de sesión ElGamal/AES antes de que enviemos más. Recomendado: aproximadamente 'tagsToSend * 2/3'

source: Number of ElGamal/AES Session Tags to send at a time. For clients with relatively low bandwidth per-client-pair (IRC, some UDP apps), this may be set lower.
es: Número de etiquetas de sesión ElGamal/AES para enviar de golpe. Para los clientes con anchos de baja relativamente bajos para el par cliente (IRC, algunas aplicaciones UDP), esto valor puede ser más bajo.

source: Comma-separated list of Base 64 Hashes of peers to build tunnels through; for debugging only
es: Lista separada por comas de los Hashes Base 64 de los pares con los que construir túneles para pasar a través; sólo para depuración

source: Should generally be set to true for clients and false for servers
es: Generalmente suele ser verdadero para los clientes y falso para los servidores

source: If true, the router just sends the MessagePayload instead of sending a MessageStatus and awaiting a ReceiveMessageBegin.
es: Si es verdadero, el ruter simplemente envía el MessagePayload, en lugar de enviar MessageStatus y esperar por un ReceiveMessageBegin.

source: Guaranteed is disabled; None implemented in 0.8.1; the streaming lib default is None as of 0.8.1, the client side default is None as of 0.9.4
es: Asegurarse de que está desactivado; None fue implementado en 0.8.1; la librería de straming por defecto es None como en 0.8.1, la parte cliente es None como en 0.9.4

source: For authorization, if required by the router. If the client is running in the same JVM as a router, this option is not required. Warning - username and password are sent in the clear to the router, unless using SSL (i2cp.SSL=true). Authorization is only recommended when using SSL.
es: Para la autorización, si es requerida por el router. Si el cliente está ejecutandose en la misma JVM (máquina virtual Java) que el router, no se requiere esta opción. Advertencia - el nombre de usuario y la contraseña se envían en claro al router, a menos que se use SSL (i2cp.SSL=true). La autorización sólo está recomendada cuando se usa SSL.

source: If incoming zero hop tunnel is allowed
es: Si es de entrada están permitidos los túneles de cero saltos

source: If outgoing zero hop tunnel is allowed
es: Si es de salida están permitidos los túneles de cero saltos

source: number from %(from)s to %(to)s
es: número desde %(from)s hasta %(to)s

source: No limit
es: Sin límite

source: Number of redundant fail-over for tunnels in
es: Número de túneles de respaldo (`fail-over`) redundantes para túneles entrantes

source: Number of redundant fail-over for tunnels out
es: Número de túneles de respaldo (`fail-over`) redundantes para túneles salientes

source: %(from)s to %(to)s
es: %(from)s a %(to)s

source: Number of IP bytes to match to determine if two routers should not be in the same tunnel. 0 to disable.
es: El número de bytes de la IP para comparar y determinar si los dos ruters están en el mismo túnel. 0 para deshabilitarlo

source: Length of tunnels in
es: Longitud de túneles de entrada.

source: Length of tunnels out
es: Longitud de túneles de salida..

source: Random amount to add or subtract to the length of tunnels in. A positive number x means add a random amount from 0 to x inclusive. A negative number -x means add a random amount from -x to x inclusive. The router will limit the total length of the tunnel to 0 to 7 inclusive. The default variance was 1 prior to release 0.7.6.
es: Cantidad aleatoria a añadir o sustraer a la longitud de los túneles entrantes. Un número positivo significa añadir una cantidad aletoria de 0 a x ambos incluidos. Un número negativo -x significa añadir una cantidad aleatoria de -x a x ambos incluidos. El router limitará la longitud total del túnel de 0 a 7 ambos incluidos. La varianza por defecto era 1 antes de la versión 0.7.6.

source: Random amount to add or subtract to the length of tunnels out. A positive number x means add a random amount from 0 to x inclusive. A negative number -x means add a random amount from -x to x inclusive. The router will limit the total length of the tunnel to 0 to 7 inclusive. The default variance was 1 prior to release 0.7.6.
es: Cantidad aleatoria a añadir o sustraer a la longitud de los túneles salientes. Un número positivo x significa añadir una cantidad aleatoria de 0 a x ambos incluidos. Un número negativo -x significa añadir una cantidad de -x a x ambos incluidos. El router limitará la longitud total del túnel de 0 a 7 ambos incluidos. La varianza por defecto era 1 antes de la versión 0.7.6.

source: Name of tunnel - generally used in routerconsole, which will use the first few characters of the Base64 hash of the destination by default.
es: Nombre del túnel - usado por lo general en routerconsole, que usara los primeros pocos caracteres del identificador criptográfico (`hash`) Base64 del destino por defecto.

source: Name of tunnel - generally ignored unless inbound.nickname is unset.
es: Nombre del túnel - ignorado por lo general a menos que inbound.nickname (apodo entrante) no esté establecido.

source: Priority adjustment for outbound messages. Higher is higher priority.
es: Ajustes de prioridades para los mensajes de salida. Más alto indica más prioridad.

source: Number of tunnels in. Limit was increased from 6 to 16 in release 0.9; however, numbers higher than 6 are incompatible with older releases.
es: Número de túneles entrantes. El límite fue elevado de 6 a 16 en la versión 0.9; sin embargo, números superiores a 6 son incompatibles con versiones anteriores.

source: Number of tunnels out
es: Número de túneles hacia fuera

source: Used for consistent peer ordering across restarts.
es: Se usa para mantener consistente el orden de los pares (peers) entre reinicios.

source: Any other options prefixed with "inbound." are stored in the "unknown options" properties of the inbound tunnel pool's settings.
es: Cualquier otra opción con el prefijo "inbound" es almacenada en las "opciones desconocidas" del grupo de configuraciones del túnel de entrada.

source: Any other options prefixed with "outbound." are stored in the "unknown options" properties of the outbound tunnel pool's settings.
es: Cualquier otra opción con el prefijo "outbound" es almacenada en las "opciones desconocidas" del grupo de configuraciones del túnel de salida.

source: Set to false to disable ever bundling a reply LeaseSet. For clients that do not publish their LeaseSet, this option must be true for any reply to be possible. "true" is also recommended for multihomed servers with long connection times.
es: Configúrela a 'falso' para deshabilitar que se llegue a empaquetar un LeaseSet de respuesta. Para los clientes que no publican su LeaseSet (túneles a su destino I2P), esta opción debe marcarse verdadera para que las repuestas sean posibles. También se recomienda 'verdadero', para los servidores alojados de modo redundante (multihomed) con tiempos de conexión largos.

source: Setting to "false" may save significant outbound bandwidth, especially if the client is configured with a large number of inbound tunnels (Leases). If replies are still required, this may shift the bandwidth burden to the far-end client and the floodfill. There are several cases where "false" may be appropriate:
es: Poniéndolo en "false", falso, puede ahorrar bastante ancho de banda de salida, especialmente si el cliente está configurado para usar un gran número de túneles de entrada (Leases). Si las respuestas son aún necesarias, esto puede cambiar la carga a el cliente más lejano final y en el floodfill. Hay varios casos donde "false" podría ser apropiado:

source: Unidirectional communication, no reply required
es: Dirección unidireccional, no se necesita respuesta

source: LeaseSet is published and higher reply latency is acceptable
es: El LeaseSet está publicado y un latencia de respuesta mayor es aceptable

source: LeaseSet is published, client is a "server", all connections are inbound so the connecting far-end destination obviously has the leaseset already. Connections are either short, or it is acceptable for latency on a long-lived connection to temporarily increase while the other end re-fetches the LeaseSet after expiration. HTTP servers may fit these requirements.
es: El LeaseSet está publicado, el cliente es un "servidor", todas las conexiones son de entrada, por lo que la destinación lejana que se está conectanda ya tiene el leaseset, obviamente. Las conexiones o son cortas, o son aceptables para la latencia o conexiones de larga duración para incrementar temporalmente mientras que la otra descarga de nuevo el LeaseSet después de expirar. Los servidores HTTP puede encajar en estos requerimientos.

source: Note: Large quantity, length, or variance settings may cause significant performance or reliability problems.
es: Nota: Una gran cantidad de configuraciones, el tamaño o variaciones en las configuraciones pueden causar bastantes problemas en el rendimiento o fiabilidad.

source: Note: As of release 0.7.7, option names and values must use UTF-8 encoding. This is primarily useful for nicknames. Prior to that release, options with multi-byte characters were corrupted. Since options are encoded in a <a href="%(commonstructures)s#type_Mapping">Mapping</a>, all option names and values are limited to 255 bytes (not characters) maximum.
es: Nota: Desde la versión 0.7.7, los nombre y valores de las opciones deben usar codificación UTF-8. Esto es útil principalmente para los nicknames ('apodos'). Con anterioridad a esta versión, la opciones con caracteres multi-byte estaban corruptas. Como estas opicones están codificadas en un <a href="%(commonstructures)s#type_Mapping">mapeado</a>, los nombres de todas las opciones y valores están limitados a un máximo de 255 bytes (no caracteres).

source: Client-side Options
es: Opciones de la parte cliente

source: The following options are interpreted on the client side, and will be interpreted if passed to the I2PSession via the I2PClient.createSession() call. The streaming lib should also pass these options through to I2CP. Other implementations may have different defaults.
es: Las siguientes opciones son interpretadas por la parte cliente, y serán interpretadas si pasan a la I2PSession a través de la llamada I2PClient.createSession(). La librería de streaming también debería pasar estas opciones a través de I2CP. Otras implementaciones pueden tener otros valores por defecto.

source: %(num)s minimum
es: mínimo %(num)s

source: (ms) Idle time required (default 30 minutes)
es: (ms) tiempo inactivo requerido (por defecto 30 minutos)

source: Close I2P session when idle
es: Cerrar las sesiones I2P cuando esté inactivo

source: Encrypt the lease
es: Cifrar el lease

source: Gzip outbound data
es: Gzip los datos de salida

source: For encrypted leasesets. Base 64 SessionKey (44 characters)
es: Para leasesets cifrados. SessionKey (clave de sesión) Base 64 (44 caracteres)

source: Base 64 private key for encryption. Optionally preceded by the key type and ':'. Only "ELGAMAL_2048:" is supported, which is the default. I2CP will generate the public key from the private key. Use for persistent leaseset keys across restarts.
es: Clave privada base 64 para cifrado. Precedida opcionalmente por el tipo de clave y ':'. Sólo está soportado "ELGAMAL_2048:", que es el predeterminado. I2CP generará la clave pública desde la clave privada. Se utiliza para claves persistentes de leasesets entre reinicios.

source: Base 64 private key for signatures. Optionally preceded by the key type and ':'. DSA_SHA1 is the default. Key type must match the signature type in the destination. I2CP will generate the public key from the private key. Use for persistent leaseset keys across restarts.
es: Clave privada Base 64 para firmas. Precedido opcionalmente por el tipo de clave y ':'. DSA_SHA1 es la predeterminada. El tipo de clave tiene que coincidir con el tipo de firma en el destino I2P. I2CP generará la clave pública desde la clave privada. Se utiliza para claves persistentes de leasets entre reinicios.

source: Guaranteed is disabled; None implemented in 0.8.1; None is the default as of 0.9.4
es: Asegurarse de que está desactivado; None fue implementado en 0.8.1; None es el valor por defecto en 0.9.4

source: (ms) Idle time required (default 20 minutes, minimum 5 minutes)
es: (ms) el tienpo inactivo requerido (por defecto 20 minutos, mínimo 5 minutos)

source: Reduce tunnel quantity when idle
es: Reducir la cantidad de túneles cuando está inactivo

source: Tunnel quantity when reduced (applies to both inbound and outbound)
es: Cantidad de túneles cuando se reduce el número (se aplica tanto a los de entrada como a los de salida)

source: Connect to the router using SSL. If the client is running in the same JVM as a router, this option is ignored, and the client connects to that router internally.
es: Conectar con el ruter usando SSL. Si el cliente se está ejecutando en la misma JVM que el ruter esta opción es ignorada, y el cliente conecta con el ruter internamente.

source: Router hostname. If the client is running in the same JVM as a router, this option is ignored, and the client connects to that router internally.
es: Hostname del ruter. Si el cliente se ejecuta en la misma JVM como un ruter, esta opción es ignorada, y el cliente se conecta al ruter internamente.

source: Router I2CP port. If the client is running in the same JVM as a router, this option is ignored, and the client connects to that router internally.
es: Puerto I2CP del ruter. Si el cliente se ejecuta en la misma JVM como un ruter, esta opción es ignorada, y el cliente se conecta al ruter internamente.

source: Note: All arguments, including numbers, are strings. True/false values are case-insensitive strings. Anything other than case-insensitive "true" is interpreted as false. All option names are case-sensitive.
es: Nota: todos los argumentos, incluyendo los números, son cadenas de caracteres. Los valores True/false son cadenas de caracteres y son sensibles a las mayúsculas o minúsculas. Cualquier otro que no sea "true" en minúsculas será interpretado como falso. Todas los nombres de opciones son sensibles a las mayúsculas/minúsculas.

source: I2CP Payload Data Format and Multiplexing
es: Formato de los datos del payload I2CP y de Multiplexing

source: The end-to-end messages handled by I2CP (i.e. the data sent by the client in a <a href="%(i2cp)s#msg_SendMessage">SendMessageMessage</a> and received by the client in a <a href="%(i2cp)s#msg_MessagePayload">MessagePayloadMessage</a>) are gzipped with a standard 10-byte gzip header beginning with 0x1F 0x8B 0x08 as specified by <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>. As of release 0.7.1, I2P uses ignored portions of the gzip header to include protocol, from-port, and to-port information, thus supporting streaming and datagrams on the same destination, and allowing query/response using datagrams to work reliably in the presence of multiple channels.
es: El mensaje de fin a fin manejado por I2CP (por ejemplo los dato enviados por el cliente en el <a href="%(i2cp)s#msg_SendMessage">SendMessageMessage</a> y recibido por el cliente en un <a href="%(i2cp)s#msg_MessagePayload">MessagePayloadMessage</a>) están comprimidos con gzip con una cabecera de inicio de 10 bytes con 0x1F 0x8B 0x08 como se especifica en el <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>. A partir de la versión 0.7.1, I2P usa partes ignoradas de la cabecera gzip para incluir el protocolo, el puerto desde, y la información del puerto hacia, con lo que se soporta streamings y datagramas en la misma destinación, y permite peticiones/respuestas usando datagramas para trabajar fiable en presencia de múltiples canales.

source: The gzip function cannot be completely turned off, however setting i2cp.gzip=false turns the gzip effort setting to 0, which may save a little CPU.
es: La función gzip puede apagarse completamente, aunque si se pone la opción i2cp.gzip=false, se cambia el valor de esfuerzo de gzip a 0, lo que puede ahorrar un poco de CPU.

source: Content
es: Contenido

source: Gzip header
es: Cabecera gzip

source: Gzip flags
es: Opciones de gzip

source: I2P Source port (Gzip mtime)
es: Puerto de origen I2P (mtime de Gzip)

source: I2P Destination port (Gzip mtime)
es: Puerto de destino de I2p (mtime de Gzip)

source: Gzip xflags
es: Zflags de Gzip

source: I2P Protocol (6 = Streaming, 17 = Datagram, 18 = Raw Datagrams) (Gzip OS)
es: Protocolo I2P (6= Streaming, 17 = Datagram, 18 = Raw Datagrams) (OS de Gzip)

source: Data integrity is verified with the standard gzip CRC-32 as specified by <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>.
es: La integridad de los datos es verificada con el estándar gzip CRC-32 como es especificado por el <a href="http://www.ietf.org/rfc/rfc1952.txt">RFC 1952</a>.

source: The current authorization mechanism could be modified to use hashed passwords.
es: El mecanismo actual de autorización puede modificarse para usar contraseñas 'hashed'.

source: The Signing Private Keys is included in the Create Lease Set message, it is not required. Revocation is unimplemented. It should be replaced with random data or removed.
es: Las claves privadas firmantes están incluidas en el mensaje de Crear Lease Set (grupo de túneles al mismo destino), no son requeridas. La revocación no está implementada. Deben ser reemplazadas con datos aleatorios o eliminadas.

source: Some improvements may be able to use messages previously defined but not implemented. For reference, here is the <a href="%(pdf1)s">I2CP Protocol Specification Version 0.9</a> (PDF) dated August 28, 2003. That document also references the <a href="%(pdf2)s">Common Data Structures Specification Version 0.9</a>.
es: Algunas mejoras pueden ser capaces de usar los mensajes previamente definidos pero no implementados. Para más referencias, aquí está la <a href="%(pdf1)s">especificación del protocolo 2CP versión 0.9</a> (PDF), del 28 de Agosto del 2003. Este documento también hace referencia al <a href="%(pdf2)s">Especificación de las estructuras de datos comunes , Common Data Structures Specification, Versión 0.9</a>.

source: I2P Network Protocol
es: Protocolo de red I2P

source: June 2013
es: Junio de 2013

source: The I2P Network Protocol (I2NP), which is sandwiched between I2CP and the various I2P transport protocols, manages the routing and mixing of messages between routers, as well as the selection of what transports to use when communicating with a peer for which there are multiple common transports supported.
es: El protocolo de red de I2P (I2NP), el cual está intercalado entre I2CP (Protocolo de Cliente I2P) y los diferentes protocolos de transporte I2P, administra el enrutado y mezclado de los mensajes entre routers, así como la seleccion de qué transportes se usan cuando se comunica con un par (`peer`) para el que hay múltiples transportes comunes soportados.

source: I2NP Definition
es: Definición de I2NP

source: I2NP (I2P Network Protocol) messages can be used for one-hop, router-to-router, point-to-point messages. By encrypting and wrapping messages in other messages, they can be sent in a secure way through multiple hops to the ultimate destination. Priority is only used locally at the origin, i.e. when queuing for outbound delivery.
es: Los mensajes I2PN (Protocolo de red I2P) pueden usarse para los mensajes punto a punto, router a router, de un solo salto. Al cifrar y envolver los mensajes dentro de otros mensajes, pueden ser enviados de forma segura a través de múltiples saltos hasta el destino final. Las prioridades sólo se usan localmente, en el origen, es decir cuando se hacen colas para entregas salientes.

source: The priorities listed below may not be current and are subject to change. See the <a href="%(outnetmessage)s">OutNetMessage Javadocs</a> for the current priority settings. Priority queueing implementation may vary.
es: Las prioridades listadas abajo pueden no ser actuales y están sujetas a cambios. Vea el <a href="%(outnetmessage)s">OutNetMessage Javadocs</a> para las prioridades actuales de las opciones. La implementación de las prioridades de las colas puede cambiar.

source: Message Format
es: Formato del mensaje

source: Field
es: Campo

source: Unique ID
es: ID único

source: Expiration
es: Expiración

source: Payload Length
es: Tamaño de la carga

source: Payload
es: Carga

source: While the maximum payload size is nominally 64KB, the size is further constrained by the method of fragmenting I2NP messages into multiple 1KB tunnel messages as described on <a href="%(tunnelimpl)s">the tunnel implementation page</a>. The maximum number of fragments is 64, and the message may not be perfectly aligned, So the message must nominally fit in 63 fragments.
es: Aunque el máximo tamaño de carga normalmente es de 64 KB, el tamaño está restringido adicionalmente por el método de fragmentación de mensajes I2NP (Protocolo de Red I2P) en múltiples mensajes de túnel de 1 KB, como se describe en la <a href="%(tunnelimpl)s">página de implementación de túnel</a>. El número máximo de fragmentos es 64, y el mensaje podría no estar pefectamente alineado, así que el mensaje debe ajustarse nominalmente en 63 fragmentos.

source: The maximum size of an initial fragment is 956 bytes (assuming TUNNEL delivery mode); the maximum size of a follow-on fragment is 996 bytes. Therefore the maximum size is approximately 956 + (62 * 996) = 62708 bytes, or 61.2 KB.
es: El tamaño máximo de un fragmento inicial es de 956 bytes (asumiendo el modo de entrega del TÚNEL); el tamaño máximo de un fragmento de continuación es de 996 bytes. Por lo tanto el tamaño máximo es de aproximadamente 956 + (62 * 996) = 62708 bytes, o 61,2 KB.

source: In addition, the transports may have additional restrictions. NTCP currently limits to 16KB - 6 = 16378 bytes but this will be increased in a future release. The SSU limit is approximately 32 KB.
es: Además, los transportes pueden tener restricciones adicionales. NTCP (TCP basado en NIO) limita actualmente a 16KB - 6 = 16378 bytes, pero esto se incrementará en una versión futura. El límite SSU (UDP Seguro Semiconfiable) es aproximadamente de 32 KB.
