Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Whether the peer can accept incoming connections for that transport, as advertised in its RouterInfo
es: Si el par puede aceptar conexiones entrantes para ese transporte, como se indica en su RouterInfo

source: Whether the connection would be indirect (requiring introducers) or direct
es: Si la conexión debería ser indirecta (requiriendo introductores) o directa

source: The peer's transport preference, as advertised in its RouterInfo
es: El transporte preferido por el par, como se anuncia en el RouterInfo

source: In general, the bid values are selected so that two routers are only connected by a single transport at any one time. However, this is not a requirement.
es: En general, los valores de las ofertas son seleccionados para que los ruters sólo estén conectados a un solo transporte a la vez. Aunque esto no es obligatorio.

source: New Transports and Future Work
es: Nuevos transportes y trabajos futuros

source: Additional transports may be developed, including:
es: Puede que se desarrollen transportes adicionales, incluyendo:

source: A TLS/SSH look-alike transport
es: Un transporte que parezca TLS/SSH

source: An "indirect" transport for routers that are not reachable by all other routers (one form of "restricted routes")
es: Un transporte "indirecto" para los ruters que no sean accesibles por todos los otros ruters (una forma de "ruters restringidos")

source: Tor-compatible pluggable transports
es: Transportes enchufables compatibles-con-Tor

source: Work continues on adjusting default connection limits for each transport. I2P is designed as a "mesh network", where it is assumed that any router can connect to any other router. This assumption may be broken by routers that have exceeded their connection limits, and by routers that are behind restrictive state firewalls (restricted routes).
es: Seguimos trabajando para ajustar los límites de las conexiones de cada transporte. I2P está diseñado como una "red mesh", donde se asume que cada ruter puede conectar con cualquier otro ruter. Esta asunción puede ser falsa para los ruter que han excedido los límites de conexiones, y para los ruters detrás de cortafuegos de estado restrictivos (rutas restringidas).

source: The current connection limits are higher for SSU than for NTCP, based on the assumption that the memory requirements for an NTCP connection are higher than that for SSU. However, as NTCP buffers are partially in the kernel and SSU buffers are on the Java heap, that assumption is difficult to verify.
es: Los actuales límites de la conexión son más altos para SSU (UDP seguro semiconfiable) que para NTCP (TCP basado en NIO), partiendo de asumir que los requisitos de memoria para una conexión NTCP son mayores que para una SSU. Sin embargo, como los buffers (prealmacenamiento) NTCP están parcialmente en el kernel (núcleo del sistema) y los buffers SSU están en la pila de Java, esa asunción es difícil de verificar.

source: Analyze <a href="%(pdf)s">Breaking and Improving Protocol Obfuscation</a> and see how transport-layer padding may improve things.
es: Analice <a href="%(pdf)s">Breaking and Improving Protocol Obfuscation</a> (rompiendo y mejorando el protocolo de ofuscación) y vea como usar datos de relleno (descartables criptográficamente) en la capa-de-transporte puede mejorar las cosas.

source: NTCP (NIO-based TCP)
es: NTCP (TCP basado-en-NIO)

source: November 2014
es: Noviembre de 2014

source: NTCP is one of two <a href="%(transports)s">transports</a> currently implemented in I2P. The other is <a href="%(ssu)s">SSU</a>. NTCP is a Java NIO-based transport introduced in I2P release 0.6.1.22. Java NIO (new I/O) does not suffer from the 1 thread per connection issues of the old TCP transport. NTCP-over-IPv6 is supported as of version 0.9.8.
es: NTCP es uno de los dos <a href="%(transports)s">transportes</a> implementados actualmente en I2P. El otro es <a href="%(ssu)s">SSU</a>. NTCP es un transporte basado en Java NIO introducido en la versión 0.6.1.22. Java NIO (nueva entrada/salida) no adolece de los problemas de 1 hilo por conexión del antiguo transporte TCP. NTCP-sobre-IPv6 está soportado desde la versión 0.9.8.

source: By default, NTCP uses the IP/Port auto-detected by SSU. When enabled on config.jsp, SSU will notify/restart NTCP when the external address changes or when the firewall status changes. Now you can enable inbound TCP without a static IP or dyndns service.
es: Por defecto, NTCP usa la IP/puerto autodetectados por SSU. Cuando esté habilitado en config.jsp, SSU notificará/reiniciará NTCP cuando cambie una dirección externa o cuando cambie el estado del cortafuegos (`firewall`). Ahora puede habilitar la conexión TCP entrante sin una IP estática o un servicio DynDNS.

source: The NTCP code within I2P is relatively lightweight (1/4 the size of the SSU code) because it uses the underlying Java TCP transport for reliable delivery.
es: El código de NTCP dentro de I2P es relativamente ligero (1/4 del tamaño del código de SSU) porque usa el transporte TCP Java subyacente para una entrega fiable.

source: Router Address Specification
es: Especificación de dirección de router

source: The following properties are stored in the network database.
es: Las siguientes propiedades se almacenan en la base de datos de red.

source: NTCP Protocol Specification
es: Especificación del protocolo NTCP

source: Standard Message Format
es: Formato de mensaje estándar

source: After establishment, the NTCP transport sends individual I2NP messages, with a simple checksum. The unencrypted message is encoded as follows:
es: Después del establecimiento, el trasporte NTCP envía mensajes individuales I2NP (protocolo de red I2P), con un identificador criptográfico (`checksum`). El mensaje no cifrado está codificado de la siguiente manera:

source: The data is then AES/256/CBC encrypted. The session key for the encryption is negotiated during establishment (using Diffie-Hellman 2048 bit). The establishment between two routers is implemented in the EstablishState class and detailed below. The IV for AES/256/CBC encryption is the last 16 bytes of the previous encrypted message.
es: Los datos entonces son cifrados con AES/256/CBC (cadena de cifrado por bloques con el estándar avanzado de cifrado de 256 bits). La clave de sesión para el cifrado se negocia durante el establecimiento (usando Diffie-Hellman de 2048 bits). El establecimiento entre dos routers (enrutadores) está implementado en la clase EstablishState (estado del establecimiento) y detallado debajo. El IV (vector de inicialización) para el cifrado AES/256/CBC son los últimos 16 bytes del anterior mensaje cifrado.

source: 0-15 bytes of padding are required to bring the total message length (including the six size and checksum bytes) to a multiple of 16. The maximum message size is currently 16 KB. Therefore the maximum data size is currently 16 KB - 6, or 16378 bytes. The minimum data size is 1.
es: Son necesarios datos de relleno (desechables criptográficamente) de entre 0-15 bytes para llevar el tamaño total del mensaje (incluyendo el `tamaño seis` y los bytes del identificador criptográfico (`checksum`)) a un múltiplo de 16. El tamaño máximo de mensaje actualmente es de 16 KB. Por lo tanto el tamaño de dato máximo actualmente es de 16 KB - 6, o lo que es lo mismo 16378 bytes. El tamaño mínimo de dato es de 1 byte.

source: Time Sync Message Format
es: Formato de mensaje de sincronización de horaria

source: One special case is a metadata message where the sizeof(data) is 0. In that case, the unencrypted message is encoded as:
es: Un caso especial es un mensaje de metadatos donde el `sizeof(data)` (tamañode(dato)) sea 0. En ese caso, el mensaje no cifrado esta codificado como:

source: Total length: 16 bytes. The time sync message is sent at approximately 15 minute intervals. The message is encrypted just as standard messages are.
es: Longitud total: 16 bytes. El mensaje de sincronización horaria se envía aproximadamente en intervalos de 15 minutos. El mensaje se cifra tal como se hace con los mensajes estándar.

source: Checksums
es: Identificadores criptográficos (`checksums`)

source: The standard and time sync messages use the Adler-32 checksum as defined in the <a href="%(rfc1950)s">ZLIB Specification</a>.
es: Los mensajes estándar y de sincronización horaria usan el identificador criptográfico (`checksum`) Adler-32 tal como se define en la <a href="%(rfc1950)s">especificación ZLIB</a>.

source: Idle Timeout
es: Periodo de inactividad

source: Idle timeout and connection close is at the discretion of each endpoint and may vary. The current implementation lowers the timeout as the number of connections approaches the configured maximum, and raises the timeout when the connection count is low. The recommended minimum timeout is two minutes or more, and the recommended maximum timeout is ten minutes or more.
es: El periodo de inactividad y cierre de conexión se establece a discreción de cada extremo, y puede variar. La actual implementación reduce el periodo cuando el número de conexiones se aproxima al máximo configurado, y eleva el periodo cuando el recuento de conexiones es bajo. El periodo mínimo recomendado es de dos minutos o más, y el periodo máximo recomendado es de diez minutos o más.

source: RouterInfo Exchange
es: Intercambio de RouterInfo

source: After establishment, and every 30-60 minutes thereafter, the two routers should generally exchange RouterInfos using a DatabaseStoreMessage. However, Alice should check if the first queued message is a DatabaseStoreMessage so as not to send a duplicate message; this is often the case when connecting to a floodfill router.
es: Después del establecimiento, y cada 30-60 minutos en adelante, los dos routers I2P generalmente deben intercambiar sus RouterInfos usando un DatabaseStoreMessage. Sin embargo, Alice debe comprobar si el primer mensaje en la cola es un DatabaseStoreMessage para no enviar un mensaje duplicado; a menudo este es el caso al conectar a un router I2P de inundación (floodfill).

source: Establishment Sequence
es: Secuencia de establecimiento

source: In the establish state, there is a 4-phase message sequence to exchange DH keys and signatures. In the first two messages there is a 2048-bit Diffie Hellman exchange. Then, signatures of the critical data are exchanged to confirm the connection.
es: En el estado de establecimiento, hay una secuencia de mensaje de 4-fases para intercambiar claves DH y firmas. En los dos primeros mensajes hay un intercambio Diffie Hellman de 2048-bits. Luego, las firmas de los datos críticos se intercambian para confirmar la conexión.

source: Legend:
es: Leyenda:

source: 256 byte DH public keys
es: Claves públicas DH de 256 bytes

source: timestamps (4 bytes, seconds since epoch)
es: Marcas de tiempo (4 bytes, segundos desde epoch (época, origen de tiempo UNIX))

source: 32 byte Session key
es: Clave de sesión de 32 bytes

source: 2 byte size of Alice identity to follow
es: Identidad Alice de 2 bytes de tamaño a seguir

source: DH Key Exchange
es: Intercambio de clave DH

source: The initial 2048-bit DH key exchange uses the same shared prime (p) and generator (g) as that used for I2P's <a href="%(cryptography)s#elgamal">ElGamal encryption</a>.
es: El intercambio de clave DH de 2048-bits inicial usa los mismos primo (p) y generador (g) compartidos que los usados por el <a href="%(cryptography)s#elgamal">cifrado ElGamal</a> de I2P.

source: The DH key exchange consists of a number of steps, displayed below. The mapping between these steps and the messages sent between I2P routers, is marked in bold.
es: El intercambio de clave DH consiste en un determinado número de pasos, mostrados debajo. El mapeado entre estos pasos y los mensajes enviados entre los routers (enrutadores) I2P, está marcado en negrita.

source: Alice generates a secret integer x. She then calculates <code>X = g^x mod p</code>.
es: Alice genera un entero secreto . Ella entonces calcula <code>X = g^x mod p</code>.

source: Alice sends X to Bob <b>(Message 1)</b>.
es: Alice envía X a Bob <b>(mensaje 1)</b>.

source: Bob generates a secret integer y. He then calculates <code>Y = g^y mod p</code>.
es: Bob genera un entero secreto y. Él entonces calcula <code>Y = g^y mod p</code>.

source: Bob sends Y to Alice.<b>(Message 2)</b>
es: Bob envía Y a Alice <b>(mensaje 2)</b>.

source: Alice can now compute <code>sessionKey = Y^x mod p</code>.
es: Alice puede ahora calcular <code>sessionKey = Y^x mod p</code>.

source: Bob can now compute <code>sessionKey = X^y mod p</code>.
es: Bob puede ahora calcular <code>sessionKey = X^y mod p</code>.

source: Both Alice and Bob now have a shared key <code>sessionKey = g^(x*y) mod p</code>.
es: Ambos, Alice y Bob, tienen una clave compartida <code>sessionKey = g^(x*y) mod p</code>.

source: The sessionKey is then used to exchange identities in <b>Message 3</b> and <b>Message 4</b>. The exponent (x and y) length for the DH exchange is documented on the <a href="%(crypto)s#exponent">cryptography page</a>.
es: La sessionKey (clave de sesión) se usa entonces para intercambiar identidades en <b>Mensaje 3</b> y <b>Mensaje 4</b>. El exponente de tamaño (x AND y) para el intercambio Diffie-Hellman (DH) está documentado en la <a href="%(crypto)s#exponent">página de crifrado</a>.

source: Message 1 (Session Request)
es: Mensaje 1 (solicitud de sesión)

source: This is the DH request. Alice already has Bob's <a href="%(commonstructures)s#struct_RouterIdentity">Router Identity</a>, IP address, and port, as contained in his <a href="%(commonstructures)s#struct_RouterInfo">Router Info</a>, which was published to the <a href="%(netdb)s">network database</a>. Alice sends Bob:
es: Esta es la solicitud DH. Alice tiene ya la <a href="%(commonstructures)s#struct_RouterIdentity">RouterIdentity</a> (identidad del router) de Bob, la dirección IP, y el puerto, tal como los contiene su <a href="%(commonstructures)s#struct_RouterInfo">RouterInfo</a> (información del router), que estaba publicada en la <a href="%(netdb)s">base de datos de red</a>. Alice envía a Bob:

source: Size:
es: Tamaño:

source: Contents:
es: Contenidos:

source: 256 byte X from Diffie Hellman
es: X de 256 bytes desde Diffie Hellman

source: SHA256 Hash(X) xored with SHA256 Hash(Bob's `RouterIdentity`)
es: SHA256 Hash(X) XOReado con SHA256 Hash(`RouterIdentity` de Bob)

source: Notes:
es: Notas:

source: Bob verifies HXxorHI using his own router hash. If it does not verify, Alice has contacted the wrong router, and Bob drops the connection.
es: Bob verifica HXxorHI usando su propio hash de router. Si no se verifica, Alice ha contactado el router equivocado, y Bob corta la conexión.

source: Message 2 (Session Created)
es: Mensaje 2 (sesión creada)

source: This is the DH reply. Bob sends Alice:
es: Esta es la respuesta DH. Bob envía a Alice:

source: Unencrypted Contents:
es: Contenidos no cifrados:

source: 256 byte Y from Diffie Hellman
es: Y de 256 bytes desde Diffie Hellman

source: SHA256 Hash(X concatenated with Y)
es: SHA256 Hash(X concatenado con Y).

source: 4 byte timestamp (seconds since the epoch)
es: Marca de tiempo de 4 bytes (segundos desde epoch (época, origen de tiempo UNIX))

source: 12 bytes random data
es: 12 bytes datos aleatorios

source: Encrypted Contents:
es: Contenidos cifrados:

source: 48 bytes <a href="%(cryptography)s#AES">AES encrypted</a> using the DH session key and the last 16 bytes of Y as the IV
es: 48 bytes <a href="%(cryptography)s#AES">cifrados con AES</a> usando la clave de sesión DH y los últimos 16 bytes de Y usados como el IV (vector de inicialización)

source: Alice may drop the connection if the clock skew with Bob is too high as calculated using tsB.
es: Alice puede denegar la conexión si el desfase horario con el relog de Bob es demasiado alto al calcularse usando tsB.

source: Message 3 (Session Confirm A)
es: Mensaje 3 (Confirmar Sesión A)

source: This contains Alice's router identity, and a signature of the critical data. Alice sends Bob:
es: Esto contiene la identificación del router I2P de Alice, y una firma de los datos críticos. Alice le envía a Bob:

source: 2 byte size of Alice's router identity to follow (387+)
es: 2 bytes de tamaño de la identificación del router I2P de Alice a seguir (387+)

source: Alice's 387+ byte `RouterIdentity`
es: 'RouterIdentity' (identificación de router I2P) de 387+ bytes de Alice

source: 0-15 bytes random data
es: 0-15 bytes de datos aleatorios

source: the `Signature` of the following concatenated data: X, Y, Bob's `RouterIdentity`, tsA, tsB. Alice signs it with the `SigningPrivateKey` associated with the `SigningPublicKey` in her `RouterIdentity`
es: la `Signature` (firma) de los siguientes datos concatenados: X, Y, `RouterIdentity` (identificación de router I2P) de Bob, tsA, tsB (marcas de tiempo A y B). Alice los firma con la `SigningPrivateKey` (clave privada de firmante) asociada con la `SigningPublicKey` (clave pública firmante) en su `RouterIdentity`

source: 448 bytes <a href="%(cryptography)s#AES">AES encrypted</a> using the DH session key and the last 16 bytes of HXxorHI (i.e., the last 16 bytes of message #1) as the IV
es: 448 bytes <a href="%(cryptography)s#AES">cifrados con AES</a> usando la clave de sesión DH y los últimos 16 bytes de HXxorHI ( por ejemplo, los últimos 16 bytes del mensaje #1) como el IV

source: Bob verifies the signature, and on failure, drops the connection.
es: Bob verifica la firma, y si falla, rechaza la conexión.

source: Bob may drop the connection if the clock skew with Alice is too high as calculated using tsA.
es: Bob puede rechazar la conexión si si el desfase horario con el reloj de Alice es demasiado alto al calcularse usando tsA.

source: Alice will use the last 16 bytes of the encrypted contents of this message as the IV for the next message.
es: Alice usará los últimos 16 bytes de los contenidos cifrados de este mensaje como IV (vector de inicialización) para el siguiente mensaje.

source: Message 4 (Session Confirm B)
es: Mensaje 4 (Confirmar Sesión B)

source: This is a signature of the critical data. Bob sends Alice:
es: Esta es una firma de los datos críticos. Bob le envía a Alice:

source: the `Signature` of the following concatenated data: X, Y, Alice's `RouterIdentity`, tsA, tsB. Bob signs it with the `SigningPrivateKey` associated with the `SigningPublicKey` in his `RouterIdentity`
es: la `Signature` (firma) de los siguientes datos concatenados: X, Y, `RouterIdentity` (identificación de router I2P) de Alice, tsA, tsB (marcas de tiempo A y B). Bob lo firma con la `SigningPrivateKey` (clave privada firmante) asociada con la `SigningPublicKey` (clave pública firmante) en su `RouterIdentity`

source: Data <a href="%(cryptography)s#AES">AES encrypted</a> using the DH session key and the last 16 bytes of the encrypted contents of message #2 as the IV 48 bytes for a DSA signature, may vary for other signature types
es: Los datos <a href="%(cryptography)s#AES">cifrados con AES</a> usando la clave de sesión DH (Diffie-Hellman), y los últimos 16 bytes de contenidos cifrados del mensaje #2 como IV (vector de inicialización) de 48 bytes para una firma DSA, pueden variar para otros tipos de firmas

source: Alice verifies the signature, and on failure, drops the connection.
es: Alice verifica la firma, y en caso de fallo, rechaza la conexión.

source: Bob will use the last 16 bytes of the encrypted contents of this message as the IV for the next message.
es: Bob usará los últimos 16 bytes de los contenidos cifrados de este mensaje como IV (vector de inicialización) para el siguiente mensaje.

source: After Establishment
es: Después del establecimiento

source: The connection is established, and standard or time sync messages may be exchanged. All subsequent messages are AES encrypted using the negotiated DH session key. Alice will use the last 16 bytes of the encrypted contents of message #3 as the next IV. Bob will use the last 16 bytes of the encrypted contents of message #4 as the next IV.
es: La conexión está establecida, y pueden intercambiarse mensajes normales o mensajes de sincronización de tiempo. Todos los mensajes siguientes están cifrados con AES usado la clave de sesión DH antes acordada. Alice usará los últimos 16 bytes del contenido cifrado del mensaje #3 como el siguiente IV. Bob usará los últimos 16 bytes del contenido cifrado del mensaje #4 como el siguiente IV.

source: Check Connection Message
es: Mensaje de conexión del reloj

source: Alternately, when Bob receives a connection, it could be a check connection (perhaps prompted by Bob asking for someone to verify his listener). Check Connection is not currently used. However, for the record, check connections are formatted as follows. A check info connection will receive 256 bytes containing:
es: Alternativamente, cuando Bob recibe una conexión, puede ser una conexión de prueba (quizás mostrada por Bob al preguntar a alguien para verificar a su interlocutor). Las conexiones de prueba no se usan actualmente. Aunque, para que quede en el registro, las conexiones de prueba son formateadas como sigue. Una conexión de prueba de información recibirá 256 bytes que contienen:

source: 32 bytes of uninterpreted, ignored data
es: 32 bytes sin interpretar, datos ignorados

source: 1 byte size
es: tamaño de 1 byte

source: that many bytes making up the local router's IP address (as reached by the remote side)
es: el número de bytes que componen la dirección IP del ruter local (como haya sido contactado por la parte remota)

source: 2 byte port number that the local router was reached on
es: el número de puerto de 2 bytes, en donde ha sido contactado el ruter local

source: 4 byte i2p network time as known by the remote side (seconds since the epoch)
es: la hora de la red i2p de 4 bytes según la parte remota (segundos desde la 'época')

source: uninterpreted padding data, up to byte 223
es: datos de relleno sin interpretar, hasta 223 bytes

source: xor of the local router's identity hash and the SHA256 of bytes 32 through bytes 223
es: xor del hash de la identidad del ruter local y el SHA256 de los bytes desde el 32 hasta el 223

source: Check connection is completely disabled as of release 0.9.12.
es: La comprobación de la conexión está completamente deshabilitada desde la versión 0.9.12.

source: Discussion
es: Discusión

source: Now on the <a href="%(ntcpdisc)s">NTCP Discussion Page</a>.
es: Ahora en al <a href="%(ntcpdisc)s">Página de discusión de NTCP</a>.

source: The maximum message size should be increased to approximately 32 KB.
es: El tamaño máximo del mensaje debería aumentarse hasta aproximadamente 32 KB

source: A set of fixed packet sizes may be appropriate to further hide the data fragmentation to external adversaries, but the tunnel, garlic, and end to end padding should be sufficient for most needs until then. However, there is currently no provision for padding beyond the next 16-byte boundary, to create a limited number of message sizes.
es: Un conjunto de tamaños de paquetes fijos podría ser apropiado para ocultar aún más la fragmentación de los datos a adversarios externos, pero el túnel garlic y el relleno de fin a fin deberían ser suficientes para la mayoría de las necesidades hasta entonces. Sin embargo, actualmente no se realiza el relleno más allá del límite de 16 bytes, para crear un número limitado de tamaños de mensajes.

source: Memory utilization (including that of the kernel) for NTCP should be compared to that for SSU.
es: La utilización de la memoria (incluyendo la del kerne) para NTCP debería compararse con la del SSU.
