Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Note that higher-layer APIs, such as <a href="%(samv3)s">SAM</a>, <a href="%(bob)s">BOB</a>, and <a href="%(i2ptunnel)s">I2PTunnel</a>, may override these defaults with their own defaults. Also note that many options only apply to servers listening for incoming connections.
es: Observe que las APIs de capa-superior, tales como <a href="%(samv3)s">SAM</a>, <a href="%(bob)s">BOB</a>, e <a href="%(i2ptunnel)s">I2PTunnel</a>, pueden imponer sus propias configuraciones predeterminadas sobre estas configuraciones por defecto. Observe también que muchas opciones sólo se aplican a los servidores que están escuchando conexiones entrantes.

source: As of release 0.9.1, most, but not all, options may be changed on an active socket manager or session. See the javadocs for details.
es: Desde la versión 0.9.1 la mayoría de las opciones, pero no todas, pueden ser cambiadas en un administrador de socket activo o sesión. Vea los Javadocs para más detalles.

source: Option
es: Opción

source: Default
es: Valor predeterminado

source: Notes
es: Notas

source: Comma- or space-separated list of Base64 peer Hashes used for either access list or blacklist.
es: Lista separada por comas - o espacios - de hashes de pares (`peers`) Base64 usada bien como lista de acceso, o como lista negra.

source: As of release %(release)s.
es: Desde la versión %(release)s.

source: Use the access list as a whitelist for incoming connections.
es: Usar la lista de acceso como lista blanca para conexiones entrantes.

source: The name or number of the signature type for a transient destination.
es: El nombre o número del tipo de firma para un destino pasajero

source: Use the access list as a blacklist for incoming connections.
es: Usar la lista de acceso como lista negra para conexiones entrantes.

source: Whether to respond to incoming pings
es: Responder o no a los pings entrantes.

source: Comma- or space-separated list of Base64 peer Hashes to be blacklisted for incoming connections to ALL destinations in the context. This option must be set in the context properties, NOT in the createManager() options argument. Note that setting this in the router context will not affect clients outside the router in a separate JVM and context.
es: Lista separada por comas - o espacios - de hashes de pares (`peers`) Base64 que sera usada como lista negra para las conexiones entrantes a TODOS los destinos en el contexto. Esta opción debe ser configurada en las propiedades contextuales, NO en el argumento createManager() de las opciones. Observe que establecer esto en el contexto del router no afectará a clientes fuera del router en una JVM y contexto aparte.

source: How much transmit data (in bytes) will be accepted that hasn't been written out yet.
es: Cuántos datos de transmisión (en bytes) serán aceptados que no hayan sido emitidos aún.

source: When we're in congestion avoidance, we grow the window size at the rate of <code>1/(windowSize*factor)</code>. In standard TCP, window sizes are in bytes, while in I2P, window sizes are in messages. A higher number means slower growth.
es: Cuando estamos evitando la congestión, aumentamos el tamaño de la ventana (protocolo) al ritmo de <code>1/(tamañodeventana*factor)</code>. En TCP estándar, los tamaños de ventana se miden en bytes, mientras que en I2P los tamaños de ventana se miden en mensajes. Un número más alto significa un crecimiento más lento.

source: How long to wait after instantiating a new con before actually attempting to connect. If this is &lt;= 0, connect immediately with no initial data. If greater than 0, wait until the output stream is flushed, the buffer fills, or that many milliseconds pass, and include any initial data with the SYN.
es: Cuánto esperar después de crear una instancia de nueva conexión antes de intentar conectar realmente. Si esto es &lt;= 0 conecta inmediatamente sin datos inciales. Si es mayor que 0, espera hasta que la salida del flujo de datos (`stream`) sea evacuada, se llene el buffer, o que pasen muchos milisegundos, e incluye cualquier dato inicial con el SYN.

source: How long to block on connect, in milliseconds. Negative means indefinitely. Default is 5 minutes.
es: Durante cuánto bloquear al conectar, en milisegundos. Valores negativos significan indefinidamente. El valor predeterminado es 5 minutos.

source: Whether to disable warnings in the logs when an incoming connection is rejected due to connection limits.
es: Desactivar o no las advertencias en los registros (`logs`), cuando se rechaza una conexión entrante debido a los límites de la conexión.

source: Comma- or space-separated list of Base64 peer Hashes or host names to be contacted using an alternate DSA destination. Only applies if multisession is enabled and the primary session is non-DSA (generally for shared clients only). This option must be set in the context properties, NOT in the createManager() options argument. Note that setting this in the router context will not affect clients outside the router in a separate JVM and context.
es: Lista separada por comas/espacios de identificadores criptográficos Base64 de pares (peer hashes) o nombres de nodos, a ser conectados usando un destino DSA alternativo. Sólo se aplica si está habilitada la multisesión y la sessión primaria es no-DSA (generalmente sólo para clientes compartidos). Esta opción se debe establecer en las propiedades de contexto, NO en el argumento de las opciones de createManager() . Observe que estableciendo esto en el contexto del router I2P no afectará a los a los clientes fuera de este en una JVM y contexto aparte.

source: Whether to listen only for the streaming protocol. Setting to true will prohibit communication with Destinations earlier than release 0.7.1 (released March 2009). Set to true if running multiple protocols on this Destination.
es: Escuchar o no sólo el protocolo streaming. Configurando a verdadero (`true`) prohibirá la comunicación con Destinos que usen una versión más temprana que la 0.7.1 (publicada en marzo de 2009). Configure a verdadero si ejecuta múltiples protocolos sobre este Destino.

source: (0=noop, 1=disconnect) What to do on an inactivity timeout - do nothing, disconnect, or send a duplicate ack.
es: (0=nada, 1=desconectar) Qúe hacer durante un periodo de inactividad - no hacer nada, desconectar, o enviar un ACK duplicado.

source: Idle time before sending a keepalive
es: Tiempo de inactividad antes de enviar un keepalive (mantener viva)

source: Delay before sending an ack
es: Retardo antes de enviar un ack (acuse de recibo)

source: The initial value of the resend delay field in the packet header, times 1000. Not fully implemented; see below.
es: El valor incial del campo de demora del reenvío en la cabecera del paquete, marca 1000. No está implementado completamente; vea debajo.

source: Initial timeout (if no <a href="#sharing">sharing data</a> available).
es: Tiempo límite inicial (si no hay <a href="#sharing">datos compartidos</a> disponibles).

source: Initial round trip time estimate (if no <a href="#sharing">sharing data</a> available). Disabled as of release 0.9.8; uses actual RTT.
es: Estimación de (RTT/RTD) tiempo de viaje de ida y vuelta (si no hay <a href="#sharing">datos compartidos</a> disponibles). Deshabilitado desde la versión 0.9.8; usa el RTT real.

source: if no <a href="#sharing">sharing data</a> available
es: si no hay <a href="#sharing">datos compatidos</a> disponibles

source: In standard TCP, window sizes are in bytes, while in I2P, window sizes are in messages.
es: En TCP estándar, los tamaños de las ventanas se miden en bytes, mientras que en I2P los tamaños de las ventanas se miden en mensajes.

source: (0 or negative value means unlimited) This is a total limit for incoming and outgoing combined.
es: (0 o valores negativos significan ilimitado) Esto es un límite total para la combinación entrante y saliente.

source: Incoming connection limit (per peer; 0 means disabled)
es: Límite de conexión entrante (por pares ('peer`); 0 significa deshabilitado)

source: (per peer; 0 means disabled)
es: (por pares (`peer`); 0 significa deshabilitado)

source: The MTU in bytes.
es: La MTU en bytes.

source: Maximum number of retransmissions before failure.
es: Número máximo de retransmisiones antes de fallo.

source: Incoming connection limit (all peers; 0 means disabled)
es: Límite de conexión entrante (todos los pares (`peers`); 0 significa deshabilitado)

source: (all peers; 0 means disabled) Use with caution as exceeding this will disable a server for a long time.
es: (todos los pares (`peers`); 0 significa deshabilitado) Usar con precaución ya que exceder esto deshabilitará un servidor por un largo periodo.

source: (2=interactive not supported) This doesn't currently do anything, but setting it to a value other than 1 will cause an error.
es: (2=interactivo no soportado) Esto actualmente no hace nada, pero configurándolo a un valor distino de 1 causará un error.

source: How long to block on read, in milliseconds. Negative means indefinitely.
es: Durante cuánto bloquear al leer, en milisegundos. Valores negativos significan indefinidamente.

source: When we're in slow start, we grow the window size at the rate of 1/(factor). In standard TCP, window sizes are in bytes, while in I2P, window sizes are in messages. A higher number means slower growth.
es: Cuando estemos en un inicio lento, elevaremos el tamaño de la ventana (del protocolo) a un ritmo de 1/(factor). En TCP estándar, los tamaños de ventana se miden en bytes, mientras que en I2P los tamaños de ventana se miden en mensajes. Un número más alto significa un crecimiento más lento.

source: Ref: RFC 2140. Floating point value. May be set only via context properties, not connection options.
es: Ref: RFC 2140. Valor del punto flotante. Puede ser establecido sólo mediante las propiedades contextuales, no las opciones de conexión

source: How long to block on write/flush, in milliseconds. Negative means indefinitely.
es: Durante cuánto bloquear al escribir/limpiar, en milisegundos. Los valores negativos significan indefinidamente.

source: Protocol Specification
es: Especificación del protocolo

source: See the Streaming Library Specification page.
es: Vea la página Especificación de la librería streaming.

source: Implementation Details
es: Detalles de la implementación

source: Setup
es: Configuración

source: The initiator sends a packet with the SYNCHRONIZE flag set. This packet may contain the initial data as well. The peer replies with a packet with the SYNCHRONIZE flag set. This packet may contain the initial response data as well.
es: El iniciador envía un paquete con el distintitivo SYNCHRONIZE (sincronizar) establecido. Este paquete puede contener también los datos iniciales. El par (`peer`) responde con un paquete con el distintivo SYNCHRONIZE establecido. Este paquete puede contener también los datos de respuesta iniciales

source: The initiator may send additional data packets, up to the initial window size, before receiving the SYNCHRONIZE response. These packets will also have the send Stream ID field set to 0. Recipients must buffer packets received on unknown streams for a short period of time, as they may arrive out of order, in advance of the SYNCHRONIZE packet.
es: El iniciador puede enviar paquetes de datos adicionales, hasta el tamaño de ventana inicial, antes de recibir la respuesta SYNCHRONIZE. Estos paquetes también tendrán el campo `envíar Identificador de Stream` establecido a 0. Los receptores deben guardar en el buffer los paquetes recibidos sobre flujos (`streams`) desconocidos durante un periodo corto de tiempo, ya que pueden llegar estropeados, adelantándose al paquete SYNCHRONIZE.

source: MTU Selection and Negotiation
es: Selección y negociación MTU

source: The maximum message size (also called the MTU / MRU) is negotiated to the lower value supported by the two peers. As tunnel messages are padded to 1KB, a poor MTU selection will lead to a large amount of overhead. The MTU is specified by the option i2p.streaming.maxMessageSize. The current default MTU of 1730 was chosen to fit precisely into two 1K I2NP tunnel messages, including overhead for the typical case.
es: El máximo tamaño de mensaje (también llamado MTU / MRU) es negociado al menor valor soportado por los dos pares (`peers`). Como los mensajes túnel están acotados a 1KB, una elección MTU pobre llevaría a una gran cantidad de tráfico de control. La MTU está especificada por la opción i2p.streaming.maxMessageSize. La MTU está especificada por la opción i2p.streaming.maxMessageSize. La MTU actual por defecto de 1720 fue elegida para encajar precisamente en dos mensajes túnel I2NP de 1K, incluyendo el tráfico de control para un caso típico.

source: The first message in a connection includes a 387 byte (typical) Destination added by the streaming layer, and usually a 898 byte (typical) LeaseSet, and Session keys, bundled in the Garlic message by the router. (The LeaseSet and Session Keys will not be bundled if an ElGamal Session was previously established). Therefore, the goal of fitting a complete HTTP request in a single 1KB I2NP message is not always attainable. However, the selection of the MTU, together with careful implementation of fragmentation and batching strategies in the tunnel gateway processor, are important factors in network bandwidth, latency, reliability, and efficiency, especially for long-lived connections.
es: El primer mensaje en una conexión incluye un Destino de 387 bytes (típico) añadido por la capa streaming, y usualmente un LeaseSet (todos los leases o túneles autorizados a recibir conexiones para un destino concreto) de 898 bytes (típico), y claves de Sesión, empaquetadas en un mensaje Ajo (`Garlic`) por el router (El LeaseSet y las Claves de Sesión no serán empaquetadas si se estableció previamente una Sesión ElGamal). Por lo tanto, la meta de encajar una petición HTTP completa en un sólo mensaje I2NP (I2P Network Protocol) de 1KB no siempre es alcanzable. Sin embargo, la elección de MTU, junto con una cuidadosa implementación de fragmentación y estrategias de elaboración de lotes en el procesador del túnel de la pasarela de salida (`gateway`), son factores importantes en el ancho de banda, latencia, fiabilidad y eficiencia de la red, especialmente para conexión de vida-larga.

source: Data integrity is assured by the gzip CRC-32 checksum implemented in <a href="%(i2cp)s#format">the I2CP layer</a>. There is no checksum field in the streaming protocol.
es: La integridad de los datos está asegurada por el checksum CRC-32 de gzip implementado en <a href="%(i2cp)s#format">la capa I2CP</a>. No hay un campo checksum en el protocolo streaming.

source: Each packet is sent through I2P as a single message (or as an individual clove in a <a href="%(garlicrouting)s">Garlic Message</a>). Message encapsulation is implemented in the underlying <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a>, and <a href="%(tunnelmessage)s">tunnel message</a> layers. There is no packet delimiter mechanism or payload length field in the streaming protocol.
es: Cada paquete es enviado a través de I2P como un solo mensaje (o como un diente en un <a href="%(garlicrouting)s">mensaje Garlic</a>). La encapsulación de los mensajes es implementada en el <a href="%(i2cp)s">I2CP</a> subyacente, en el <a href="%(i2np)s">I2NP</a>, y en las capas de los <a href="%(tunnelmessage)s">túneles de mensajes</a>. No hay mecanismo delimitador o campo de tamaño del payload en el protocolo de streaming.

source: Windowing
es: Ventanización

source: The streaming lib uses standard slow-start (exponential window growth) and congestion avoidance (linear window growth) phases, with exponential backoff. Windowing and acknowledgments use packet count, not byte count.
es: La librería streaming utiliza fases estándar de inicio-lento (crecimiento exponencial de la ventana (del protocolo)) y de elusión de congestión (crecimiento lineal de la ventana), con retroceso exponencial. La ventanización y los acuses de recibo ('acknowledments') cuentan paquetes, no bytes.

source: Close
es: Cerrar

source: Any packet, including one with the SYNCHRONIZE flag set, may have the CLOSE flag sent as well. The connection is not closed until the peer responds with the CLOSE flag. CLOSE packets may contain data as well.
es: Cualquier paquete, incluyendo uno con el distintivo SYNCHRONIZE establecido, puede haber enviado también el distintivo CLOSE. La conexión no está cerrada hasta que el par (`peer`) responde con el distintivo CLOSE. Los paquetes CLOSE también pueden contener datos.

source: There is no ping function at the I2CP layer (equivalent to ICMP echo) or in datagrams. This function is provided in streaming. Pings and pongs may not be combined with a standard streaming packet; if the ECHO option is set, then most other flags, options, ackThrough, sequenceNum, NACKs, etc. are ignored.
es: No hay función de ping en la capa I2CP (equivalente a ICMP echo) o en los datagramas. Esta función se proporciona en el transporte streaming. Los pings y pongs pueden no estar combinados con un paquete streaming estándar; si la opción ECHO está establecida, entonces la mayoría del resto de indicativos, opciones, ackThrough, sequenceNum, NACKs, etc. se ignoran.

source: A ping packet must have the ECHO, SIGNATURE_INCLUDED, and FROM_INCLUDED flags set. The sendStreamId must be greater than zero, and the receiveStreamId is ignored. The sendStreamId may or may not correspond to an existing connection.
es: Un paquete de ping debe tener establecidos los indicadores ECHO (eco), SIGNATURE_INCLUDED (firma incluida), y FROM_INCLUDED (origen incluido). El sendStreamId (identificador de stream de envío) puede o no corresponder con una conexión existente.

source: A pong packet must have the ECHO flag set. The sendStreamId must be zero, and the receiveStreamId is the sendStreamId from the ping. The pong packet does not include any payload that was contained in the ping.
es: Un paquete pong debe tener el indicador ECHO establecido. El sendStreamId debe ser cero, y el receiveStreamId (identificador de stream de recepción) es el sendStreamId del ping. El paquete pong no incluye carga alguna que estuviera contenida en el ping.

source: As of release 0.9.18, pings and pongs may contain a payload. The payload in the ping, up to a maximum of 32 bytes, is returned in the pong.
es: Desde la versión 0.9.18 los pings y pongs puede que contengan un cargamento. El cargamento en el ping, hasta un máximo de 32 bytes, es devuelto en el pong.

source: Streaming may be configured to disable sending pongs with the configuration i2p.streaming.answerPings=false.
es: El protocolo de streaming puede ser configurado para deshabilitar el envío de pongs con la configuración i2p.streaming.answerPings=false .

source: Control Block Sharing
es: Compartición del bloque de control

source: The streaming lib supports "TCP" Control Block sharing. This shares three important streaming lib parameters (window size, round trip time, round trip time variance) across connections to the same remote peer. This is used for "temporal" sharing at connection open/close time, not "ensemble" sharing during a connection (See <a href="http://www.ietf.org/rfc/rfc2140.txt">RFC 2140</a>). There is a separate share per ConnectionManager (i.e. per local Destination) so that there is no information leakage to other Destinations on the same router. The share data for a given peer expires after a few minutes. The following Control Block Sharing parameters can be set per router:
es: La librería streaming (de flujo) soporta compartición del Bloque de Control "TCP" (protocolo de control de transmisiones). Esto comparte tres importantes parámetros de la librería streaming (tamaño de la ventana, tiempo de viaje de ida y vuelta (RTT/RTD), variación del RTT) entre las conexiones al mismo par (`peer`) remoto. Esto se usa para la compartición "temporal" en el momento de apertura/cierre de la conexión, no para la compartición "coral" durante una conexión (Vea <a href="http://www.ietf.org/rfc/rfc2140.txt">RFC 2140</a>). Hay una compartición separada por ConnectionManager (administrador de conexión) (ej: por destino local), así que no hay información sobre filtraciones a otros destinos en el mismo router. Los datos compartidos para un par (`peer`) dado expiran después de unos pocos minutos. Los siguientes parámetros de Compartición del Bloque de Control pueden ser establecidos en cada router.

source: Other Parameters
es: Otros parámetros

source: The following parameters are hardcoded, but may be of interest for analysis:
es: Los siguientes parámetros son internos, pero pueden ser de interés para el análisis:

source: History
es: Historia

source: The streaming library has grown organically for I2P - first mihi implemented the "mini streaming library" as part of I2PTunnel, which was limited to a window size of 1 message (requiring an ACK before sending the next one), and then it was refactored out into a generic streaming interface (mirroring TCP sockets) and the full streaming implementation was deployed with a sliding window protocol and optimizations to take into account the high bandwidth x delay product. Individual streams may adjust the maximum packet size and other options. The default message size is selected to fit precisely in two 1K I2NP tunnel messages, and is a reasonable tradeoff between the bandwidth costs of retransmitting lost messages, and the latency and overhead of multiple messages.
es: La librería streaming ha crecido orgánicamente para I2P - primero mihi implementó la "librería mini streaming" como parte de I2PTunnel, que estaba limitada a un tamaño de ventana de 1 mensaje (requiriendo un ACK antes de enviar el siguiente), y entonces fue desgajado en una interfaz streaming genérica (a semejanza de los sockets TCP) y la implementación streaming completa fue desplegada con un protocolo de ventanas deslizantes y optimizaciones para tener en cuenta el alto valor del producto (ancho-de-banda x demora). Los flujos (`streams`) individuales pueden ajustar su tamaño máximo de paquete y otras opciones. El tamaño predeterminado del mensaje se selecciona para encajar de forma precisa en dos mensajes túnel I2NP (I2P Network Protocol) de 1KB, y es un compromiso de equilibrio razonable entre el coste en ancho de banda de retransmitir mensajes perdidos, y la latencia y tráfico de control de múltiples mensajes.

source: Future Work
es: Trabajo futuro

source: The behavior of the streaming library has a profound impact on application-level performance, and as such, is an important area for further analysis.
es: El comportamiento de la librería streaming tiene un profundo impacto sobre el rendimiento en el nivel-aplicación, y como tal, es un área importante para análisis detallados.

source: Additional tuning of the streaming lib parameters may be necessary.
es: Podrían ser necesarios ajustes adicionales de los parámetros de librería streaming.

source: Another area for research is the interaction of the streaming lib with the NTCP and SSU transport layers. See <a href="%(ntcpdisc)s">the NTCP discussion page</a> for details.
es: Otro área de investigación es la interacción de la librería streaming con las capas de transporte NTCP (TCP basado en NIO) y SSU (UDP Seguro Semiconfiable). Para mayor detalle vea la <a href="%(ntcpdisc)s">página de discusión sobre NTCP</a>.
