Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: As of release 0.9.2, the client may configure the default number of Session Tags to send and the low tag threshold for the current session. For brief streaming connections or datagrams, these options may be used to significantly reduce bandwidth. See the <a href="%(i2cp)s#options">I2CP options specification</a> for details. The session settings may also be overridden on a per-message basis. See the <a href="%(i2cpspec)s#msg_SendMessageExpires">I2CP Send Message Expires specification</a> for details.
es: Desde la versión 0.9.2, el cliente puede configurar el número de etiquetas de sesión (SessionTags) a enviar, y el umbral de bajo número de etiquetas para la sesión actual. Para conexiones de transporte streaming breves o datagramas, estas opciones pueden usarse para reducir significativamente el consumo de ancho de banda. Vea la <a href="%(i2cp)s#options">especificación de opciones I2CP</a> para más detalles. Las preferencias de sesión también pueden ser sustituidas por cada mensaje. Vea la <a href="%(i2cpspec)s#msg_SendMessageExpires">especificación de expiración de envío de mensaje I2CP</a> para más detalles.

source: There are many possible areas to tune the Session Key Manager's algorithms; some may interact with the streaming library behavior, or have significant impact on overall performance.
es: Hay muchas áreas posibles para ajustar los algoritmos del administrador de claves de sesión; algunos pueden interactuar con el comportamiento de la librería streaming, o tener un impacto significativo en el rendimiento conjunto.

source: The number of tags delivered could depend on message size, keeping in mind the eventual padding to 1KB at the tunnel message layer.
es: El número de etiquetas entregadas podría depender del tamaño del mensaje, teniendo en cuenta el eventual esquema de relleno de 1KB en la capa de mensaje de túnel.

source: Clients could send an estimate of session lifetime to the router, as an advisory on the number of tags required.
es: Los clientes podrían enviar una estimación del tiempo de vida de la sesión al router, a modo de aviso del número de etiquetas solicitado.

source: Delivery of too few tags causes the router to fall back to an expensive ElGamal encryption.
es: La entrega de demasiado pocas etiquetas provoca que el ruter regrese al costoso cifrado de respaldo ElGamal.

source: The router may assume delivery of Session Tags, or await acknowledgement before using them; there are tradeoffs for each strategy.
es: El router puede asumir como un hecho la entrega de etiquetas de sesión, o esperar acuse de recibo ('acknowledgement') antes de usarlas; cada estrategia tiene sus propios sacrificios.

source: For very brief messages, almost the full 222 bytes of the pre-IV and padding fields in the ElGamal block could be used for the entire message, instead of establishing a session.
es: Para mensajes muy breves, casi la totalidad de los 222 bytes del pre-IV (pre-Vector de Inicialización) y los campos de esquemas de relleno en el bloque ElGamal podrían usarse para el mensaje completo, en lugar de para establecer una sesión.

source: Evaluate padding strategy; currently we pad to a minimum of 128 bytes. Would be better to add a few tags to small messages than pad.
es: Evaluar la estrategia de esquema de relleno; actualmente rellenamos hasta un mínimo de 128 bytes. Para los mensajes pequeños sería mejor añadirles unas pocas etiquetas que rellenarlos.

source: Perhaps things could be more efficient if the Session Tag system was bidirectional, so tags delivered in the 'forward' path could be used in the 'reverse' path, thus avoiding ElGamal in the initial response. The router currently plays some tricks like this when sending tunnel test messages to itself.
es: Quizá las cosas podrían ser más eficientes si el sistema de etiqueta de sesión fuera bidireccional, así las etiquetas entregadas en la ruta 'forward' (directa) podrían usarse en la ruta 'reverse' (inversa), evitando así ElGamal en la respuesta inicial. El router actualmente usa algunos trucos como este cuando se envían mensajes de prueba de túnel a si mismo.

source: Change from Session Tags to <a href="%(futureperf)s#prng">a synchronized PRNG</a>.
es: Cambiar de las etiquetas de sesión a <a href="%(futureperf)s#prng">un PRNG (generador de números pseudo aleatorios) sincronizado</a>.

source: Several of these ideas may require a new I2NP message type, or set a flag in the <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">Delivery Instructions</a>, or set a magic number in the first few bytes of the Session Key field and accept a small risk of the random Session Key matching the magic number.
es: Varias de estas ideas puede que requieran un nuevo tipo de mensaje I2NP (protocolo de red I2P), o establecer un indicador en las <a href="%(tunnelmessage)s#struct_TunnelMessageDeliveryInstructions">Instrucciones de Entrega</a>, o establecer un número mágico en los primeros pocos bytes del campo de Clave de Sesión y aceptar un pequeño riesgo de que la Clave de Sesión aleatoria coincida con el número mágico.

source: Garlic Routing
es: Garlic Routing, enrutado Garlic

source: March 2014
es: Marzo de 2014

source: Garlic Routing and "Garlic" Terminology
es: Garlic Routing y terminología "Garlic"

source: The terms "garlic routing" and "garlic encryption" are often used rather loosely when referring to I2P's technology. Here, we explain the history of the terms, the various meanings, and the usage of "garlic" methods in I2P.
es: Los términos "garlic routing, enrutado garlic" y "garlic encryption, cifrado garlic"son usados a menudo imprecisamente para designar la tecnología de I2P. Aquí vamos a explicar la historia de estos términos, su significados,y el uso de los métodos "garlic" en I2P.

source: "Garlic routing" was first coined by <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a> in Roger Dingledine's Free Haven <a href="http://www.freehaven.net/papers.html">Master's thesis</a> Section 8.1.1 (June 2000), as derived from <a href="http://www.onion-router.net/">Onion Routing</a>.
es: "Garlic Routing" fue acuñado por <a href="http://www.cs.princeton.edu/~mfreed/">Michael J. Freedman</a> en la <a href="http://www.freehaven.net/papers.html">Master's thesis</a> de Roger Dingledine en Free Haven. Sección 8.1.1 (Junio 2000), derivado de <a href="http://www.onion-router.net/">Onion Routing</a>.

source: "Garlic" may have been used originally by I2P developers because I2P implements a form of bundling as Freedman describes, or simply to emphasize general differences from Tor. The specific reasoning may be lost to history. Generally, when referring to I2P, the term "garlic" may mean one of three things:
es: "Garlic" fue quizás usado por los desarrolladores originales de I2P porque implementa un forma de agrupación tal y como Freedman describió, o simplemente para enfatizar las diferencias con Tor. La razón exacta puede haberse perdido en el tiempo. Generalmente, cuando nos referimos al término "garlic", puede significar una de estas tres cosas:

source: Layered Encryption
es: Cifrado por capas

source: Bundling multiple messages together
es: Agrupa varios mensajes juntos

source: ElGamal/AES Encryption
es: Cifrado ElGamal/AES

source: Unfortunately, I2P's usage of "garlic" terminology over the past seven years has not always been precise; therefore the reader is cautioned when encountering the term. Hopefully, the explanation below will make things clear.
es: Desafortunadamente, el uso del término "garlic" por parte de I2P en los pasados siete años no ha sido siempre preciso; por lo tanto los usuarios están avisados para cuando se topen con el término. Esperemos que la siguiente explicación dejará las cosas más claras.

source: Onion routing is a technique for building paths, or tunnels, through a series of peers, and then using that tunnel. Messages are repeatedly encrypted by the originator, and then decrypted by each hop. During the building phase, only the routing instructions for the next hop are exposed to each peer. During the operating phase, messages are passed through the tunnel, and the message and its routing instructions are only exposed to the endpoint of the tunnel.
es: El enrutado Onion es una técnica para construir caminos, o túneles, a través de una serie de pares, y después usar ese túnel. Los mensajes son repetidamente cifrados por el creador, y después descifrados por cada salto. Durante la fase de construcción sólo las instrucciones de enrutado para el siguiente salto son expuestas a cada par. Durante la fase de operación los mensajes se pasan a través del túnel, y el mensaje y sus instrucciones de enrutado sólo son mostradas en el punto final del túnel.

source: This is similar to the way Mixmaster (see <a href="%(comparisons)s">network comparisons</a>) sends messages - taking a message, encrypting it to the recipient's public key, taking that encrypted message and encrypting it (along with instructions specifying the next hop), and then taking that resulting encrypted message and so on, until it has one layer of encryption per hop along the path.
es: Esto es similar a como Mixmaster (ver <a href="%(comparisons)s">comparación entre redes</a>) envía mensajes - toma un mensaje, lo cifra con la clave pública del destinatario, toma ese mensaje cifrado y lo cifra (junto con instrucciones indicando el siguiente salto) de nuevo, y así sucesivamente hasta que tiene una capa de cifrado por salto a lo largo de todo el camino.

source: In this sense, "garlic routing" as a general concept is identical to "onion routing". As implemented in I2P, of course, there are several differences from the implementation in Tor; see below. Even so, there are substantial similarities such that I2P benefits from a <a href="http://www.onion-router.net/Publications.html">large amount of academic research on onion routing</a>, <a href="http://freehaven.net/anonbib/topic.html">Tor, and similar mixnets</a>.
es: En este senido, "garlic routing" como concepto general es idéntico a "onion routing". Aunque tal y como se ha implementado en I2P tiene varias diferencias con la implementación de Tor; ver más abajo. Aun así, hay similitudes substanciales, como algunas de las que se beneficia I2P gracias <a href="http://www.onion-router.net/Publications.html">al gran número de estudios académicos sobre la onion routing</a>, <a href="http://freehaven.net/anonbib/topic.html">Tor, y mixnets similares</a>.

source: Bundling Multiple Messages
es: Construyendo múltiples mensajes

source: Michael Freedman defined "garlic routing" as an extension to onion routing, in which multiple messages are bundled together. He called each message a "bulb". All the messages, each with its own delivery instructions, are exposed at the endpoint. This allows the efficient bundling of an onion routing "reply block" with the original message.
es: Michael Freedman definión "garlic routing" como una extensión de onion routing, en la cual varios mensajes son agrupados juntos. El llamó a cada mensaje "bulb, bulbo". Todos los mensajes, cada uno con sus instrucciones de envío, son expuestos en el punto final. Esto permite una agrupación eficiente del "bloque de respuesta" de una una ruta onion con el mensaje original.

source: This concept is implemented in I2P, as described below. Our term for garlic "bulbs" is "cloves". Any number of messages can be contained, instead of just a single message. This is a significant distinction from the onion routing implemented in Tor. However, it is only one of many major architectural differences between I2P and Tor; perhaps it is not, by itself, enough to justify a change in terminology.
es: Este concepto ha sido implementado en I2p como se describe más abajo. Nuestro término para "bulbs, bulbos" garlic es "cloves, dientes del ajo". Puede contener cualquier número de mensajes, en vez de un solo mensaje. Esta es una gran diferencia con la implementación de Tor. Aun así, es sólo una de las diferencias entre I2P y Tor; quizás por si misma no sea suficiente para justificar un cambio de terminología.

source: Another difference from the method described by Freedman is that the path is unidirectional - there is no "turning point" as seen in onion routing or mixmaster reply blocks, which greatly simplifies the algorithm and allows for more flexible and reliable delivery.
es: Otra diferencia con el método descrito por Freedman es que el camino es unidireccional - no existe un "punto de retorno" como en el enrutado onion o en los bloques de respuesta mixmaster, lo que simplifica mucho el algoritmo y permite una entrega fiable.

source: In some cases, "garlic encryption" may simply mean <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> encryption (without multiple layers).
es: En algunos casos el "cifrado garlic" simplemente significa cifrado <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> (sin múltiples capas).

source: "Garlic" Methods in I2P
es: Métodos "Garlic" en I2P

source: Now that we've defined various "garlic" terms, we can say that I2P uses garlic routing, bundling and encryption in three places:
es: Ahora que hemos definido varios términos "garlic", podemos decir que I2P usa rutado garlic, agrupación y cifrado en tres partes:

source: For building and routing through tunnels (layered encryption)
es: Para la construcción y enrutado a través de los túneles (cifrado por capas)

source: For determining the success or failure of end to end message delivery (bundling)
es: Para determinar el éxito o fallo del envío de un mensaje de fin a fin (agrupamiento)

source: For publishing some network database entries (dampening the probability of a successful traffic analysis attack) (ElGamal/AES)
es: Para publicar algunas entradas en la base de datos de la red (amortiguando la posibilidad de un ataque de análisis exitoso) (ElGamal/AES)

source: There are also significant ways that this technique can be used to improve the performance of the network, exploiting transport latency/throughput tradeoffs, and branching data through redundant paths to increase reliability.
es: Hay muchas otras formas de usar esta técnica para mejorar el rendimiento de la red, aprovechando las compensaciones de la latencia del transporte, y derivando datos a través de caminos redundantes para incrementar la fiabilidad.

source: Tunnel Building and Routing
es: Rutado y construcción de los túneles

source: In I2P, tunnels are unidirectional. Each party builds two tunnels, one for outbound and one for inbound traffic. Therefore, four tunnels are required for a single round-trip message and reply.
es: En I2P los túneles son unidireccionales. Cada parte construye dos túneles, uno para el tráfico de salida y otro para el de entrada. Por lo tanto se necesitan cuatro túneles para una vuelta completa de un mensaje y su respuesta.

source: Tunnels are built, and then used, with layered encryption. This is described on the <a href="%(tunnelimpl)s">tunnel implementation page</a>. Tunnel building details are defined on <a href="%(tunnelcreation)s">this page</a>. We use <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> for the encryption.
es: Los túneles son usados y creados con un cifrado por capas. Esto se describe en <a href="%(tunnelimpl)s">página de implementación de los túneles</a>. La construcción de los túneles es definida en <a href="%(tunnelcreation)s">esta página</a>. Para el cifrado usamos <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a>

source: Tunnels are a general-purpose mechanism to transport all <a href="%(i2np)s">I2NP messages</a>, and <a href="%(i2npspec)s#msg_Garlic">Garlic Messages</a> are not used to build tunnels. We do not bundle multiple <a href="%(i2np)s">I2NP messages</a> into a single <a href="%(i2npspec)s#msg_Garlic">Garlic Message</a> for unwrapping at the outbound tunnel endpoint; the tunnel encryption is sufficient.
es: Los túneles son un mecanismo de propósito general para transportar todos los <a href="%(i2np)s">mensajes I2NP</a>, y los <a href="%(i2npspec)s#msg_Garlic">mensajes Garlic</a> no se usan para construir túneles. No agrupamos múltiples <a href="%(i2np)s">mensajes I2NP</a> dentro de un solo <a href="%(i2npspec)s#msg_Garlic">mensaje Garlic</a> para desenvolver en el punto funal del túnel de salida, el cifrado del túnel es suficiente.

source: End-to-End Message Bundling
es: Agrupación de mensajes de fin a fin.

source: At the layer above tunnels, I2P delivers end-to-end messages between <a href="%(commonstructures)s#struct_Destination">Destinations</a>. Just as within a single tunnel, we use <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> for the encryption. Each client message as delivered to the router through the <a href="%(i2cp)s">I2CP interface</a> becomes a single <a href="%(i2npspec)s#struct_GarlicClove">Garlic Clove</a> with its own <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Delivery Instructions</a>, inside a <a href="%(i2npspec)s#msg_Garlic">Garlic Message</a>. Delivery Instructions may specify a Destination, Router, or Tunnel.
es: En la capa por encima de los túneles, I2P entrega mensajes extremo-a-extremo entre <a href="%(commonstructures)s#struct_Destination">Destinos</a>. De igual modo que dentro de un único túnel, para el cifrado usamos <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> (etiqueta de sesión). Cada mensaje de cliente tal como se entrega al router I2P mediante la <a href="%(i2cp)s">interfaz I2CP</a> (protocolo cliente de I2P) se convierte en un único <a href="%(i2npspec)s#struct_GarlicClove">Diente de Ajo</a> (garlic clove) con sus propias <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Instrucciones de Entrega</a>, dentro de un <a href="%(i2npspec)s#msg_Garlic">Mensaje Ajo</a> (garlic message). Las Instrucciones de Entrega pueden especificar un Destino, Router I2P, o Túnel.

source: Generally, a Garlic Message will contain only one clove. However, the router will periodically bundle two additional cloves in the Garlic Message:
es: Generalmente, un mensaje Garlic sólo contiene un clove. Aun así, el ruter agrupa periódicamente dos dientes adicionales en el mensaje Garlic:

source: Garlic Message Cloves
es: Cloves, dientes, de los mensajes Garlic, ajo

source: A <a href="%(i2npspec)s#msg_DeliveryStatus">Delivery Status Message</a>, with <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Delivery Instructions</a> specifying that it be sent back to the originating router as an acknowledgment. This is similar to the "reply block" or "reply onion" described in the references. It is used for determining the success or failure of end to end message delivery. The originating router may, upon failure to receive the Delivery Status Message within the expected time period, modify the routing to the far-end Destination, or take other actions.
es: Un <a href="%(i2npspec)s#msg_DeliveryStatus">Mensaje de Estado de Entrega</a>, con <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Instrucciones de Entrega</a> que especifican que se enviará de vuelta al router I2P originario como un acuse de recibo. Esto es similar al "reply block" (bloque de respuesta) o "reply onion" (cebolla de respuesta) descritos en las referencias. Se usa para determinar el éxito o fracaso de la entrega del mensaje extremo-a-extremo. El router I2P originario puede, tras no recibir el Mensaje de Estado de Entrega dentro del periodo de tiempo de espera, modificar el enrutamiento hacia el Destino del extremo distante, o tomar otras acciones.

source: A <a href="%(i2npspec)s#msg_DatabaseStore">Database Store Message</a>, containing a <a href="%(commonstructures)s#struct_LeaseSet">LeaseSet</a> for the originating Destination, with <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Delivery Instructions</a> specifying the far-end destination's router. By periodically bundling a LeaseSet, the router ensures that the far-end will be able to maintain communications. Otherwise the far-end would have to query a floodfill router for the network database entry, and all LeaseSets would have to be published to the network database, as explained on the <a href="%(netdb)s">network database page</a>.
es: Un <a href="%(i2npspec)s#msg_DatabaseStore">Mensaje del Almacenamiento de la Base de Datos</a>, conteniendo un <a href="%(commonstructures)s#struct_LeaseSet">LeaseSet</a> para el Destino originario, con <a href="%(i2npspec)s#struct_GarlicCloveDeliveryInstructions">Instrucciones de Entrega</a> que especifican el router I2P del destino del extremo remoto. Al empaquetar periódicamente un LeaseSet, el router I2P se asegura de que el extremo remoto podrá mantener las comunicaciones. De otro modo el extremo remoto tendría que preguntar por la entrada en la base de datos de red a un router I2P de inundación (floodfill), y todos los LeaseSets tendrían que ser publicados en la base de datos de red, como se explicó en la <a href="%(netdb)s">página de la base de datos de red</a>.

source: By default, the Delivery Status and Database Store Messages are bundled when the local LeaseSet changes, when additional <a href="%(commonstructures)s#type_SessionTag">Session Tags</a> are delivered, or if the messages have not been bundled in the previous minute. As of release 0.9.2, the client may configure the default number of Session Tags to send and the low tag threshold for the current session. See the <a href="%(i2cp)s#options">I2CP options specification</a> for details. The session settings may also be overridden on a per-message basis. See the <a href="%(i2cpspec)s#msg_SendMessageExpires">I2CP Send Message Expires specification</a> for details.
es: Por defecto, los mensajes de estado de entrega (Delivery Status) y almacenado en base de datos (Database Store) son empaquetados cuando el LeaseSet local (conjunto de túneles al destino local) cambia, cuando se entregan <a href="%(commonstructures)s#type_SessionTag">etiquetas de sesión</a> (Session Tags) adicionales, o si los mensajes no han sido empaquetados en el minuto anterior. Desde la versión 0.9.2, el cliente puede configurar el número de etiquetas de sesión predeterminado a enviar y el umbral de bajo número de etiquetas para la sesión actual. Vea la <a href="%(i2cp)s#options">especificación de opciones I2CP</a> para más detalles. Las preferencias de sesión también pueden ser sustituidas para cada mensaje. Vea la <a href="%(i2cpspec)s#msg_SendMessageExpires">especificación de Expiración de envio de mensaje I2CP</a> para más detalles.

source: Obviously, the additional messages are currently bundled for specific purposes, and not part of a general-purpose routing scheme.
es: Obviamente, los mensajes adicionales son agrupados por un propósito específico, y no son parte del esquema general de rutado.

source: As of release 0.9.12, the Delivery Status Message is wrapped in another Garlic Message by the originator so that the contents are encrypted and not visible to routers on the return path.
es: Desde la versión 0.9.12, el mensaje de estado de entrega está encapsulado en otro mensaje ajo (garlic) por el originador, así que los contenidos están cifrados y no son visibles para los routers I2P en la ruta de retorno.

source: Storage to the Floodfill Network Database
es: Almacenamiento en la base de datos de un FloodFill
