Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: This is very much intentional. jrandom wants a user to "trust" a hosts.txt provider, and as he likes to say, "trust is not a boolean". The configuration step attempts to force users to think about issues of trust in an anonymous network.
es: Esto es intencionado. jrandom quiere que un usuario "confíe" en un proveedor de host.txt, y como a él le gusta decir, "la confianza no es una variable binaria". Los pasos de configuración intenta obligar a los usuarios a pensar sobre los problemas de confianza en una red anónima.

source: As another example, the "Eepsite Unknown" error page in the HTTP Proxy lists some jump services, but doesn't "recommend" any one in particular, and it's up to the user to pick one (or not). jrandom would say we trust the listed providers enough to list them but not enough to automatically go fetch the key from them.
es: Como ejemplo adicional, la página de error "Eepsite desconocido" en el proxy HTTP muestra algunos servicios de salto (jump, de direccionamiento distribuido), pero no "recomienda" ninguno en particular, y queda a discreción del usuario elegir uno (o no). jrandom (desarrollador) diría que confiamos en los proveedores mostrados lo suficiente como para listarlos, pero no para obtener automáticamente la clave desde ellos.

source: How successful this is, I'm not sure. But there must be some sort of hierarchy of trust for the naming system. To treat everyone equally may increase the risk of hijacking.
es: ¿Cómo es de exitoso este sistema?. No estoy seguro. Pero tiene que haber algún tipo de jerarquía de confianza en el sistema de nombres/dominios. El tratar a todo el mundo igual puede aumentar el riesgo de secuestro de dominios.

source: <b>It isn't DNS</b>
es: <b>No es DNS</b>

source: Unfortunately real-time lookups over i2p would significantly slow down web browsing.
es: Desafortunadamente, las búsquedas en tiempo real sobre I2P relentizarían significativamente la navegación web.

source: Also, DNS is based on lookups with limited caching and time-to-live, while i2p keys are permanent.
es: Además, DNS está basado en búsquedas con caché y tiempo de vida limitados, mientras que las claves de i2p son permanentes.

source: Sure, we could make it work, but why? It's a bad fit.
es: Seguro, podríamos hacerlo funcionar, pero ¿para qué? Sería un mal apaño.

source: <b>Not reliable:</b> It depends on specific servers for addressbook subscriptions.
es: <b>No fiable:</b> Depende de servidores específicos para las suscripciones de la libreta de direcciones.

source: Yes it depends on a few servers that you have configured. Within i2p, servers and services come and go. Any other centralized system (for example DNS root servers) would have the same problem. A completely decentralized system (everybody is authoritative) is possible by implementing an "everybody is a root DNS server" solution, or by something even simpler, like a script that adds everybody in your hosts.txt to your addressbook.
es: Si, depende de los pocos servidores que ha configurado. Dentro de i2p, los servidores y los servicios van y vienen. Cualquier otros sistema centralizado (por ejemplo servidores raíz DNS) tendrían los mismos problemas. Un sistema descentralizado completamente (todo el mundo es una autoridad) es posible implementando una solución tipo "todo el mundo es un servidor raíz DNS", o con algo incluso más simple, con un script que añada a todos los que estén en su hosts.txt a su libreta de direcciones.

source: People advocating all-authoritative solutions generally haven't thought through the issues of conflicts and hijacking, however.
es: La gente que defiende la solución de todos-son-autoridad generalmente no han pensado en los conflictos y en los secuestros de dominios.

source: <b>Awkward, not real-time:</b> It's a patchwork of hosts.txt providers, key-add web form providers, jump service providers, eepsite status reporters. Jump servers and subscriptions are a pain, it should just work like DNS.
es: <b>Es embarazoso, pero no es tiempo-real:</b> Es un mejunje de proveedores de hosts.txt, proveedores de formularios web para agregación de claves, proveedores de servicios de salto (jump, direccionamiento distribuido), y webs de información del estado de los eepsites. Los servicios de salto y las suscripciones son un engorro, debería simplemente funcionar como el DNS.

source: See the reliability and trust sections.
es: Vea las secciones de fiabilidad y confianza.

source: So, in summary, the current system is not horribly broken, inefficient, or un-scalable, and proposals to "just use DNS" aren't well thought-through.
es: En resumen, el sistema actual no está terriblemente roto, no es ineficiente, o no es escalable, y las propuestas de "simplemente usemos DNS" no están bien pensadas.

source: Alternatives
es: Alternativas

source: The I2P source contains several pluggable naming systems and supports configuration options to enable experimentation with naming systems.
es: El código de I2P contiene varios sistemas de dominios listos para enchufar, y soporta opciones de configuración para permitir experimentar con sistemas de nombres.

source: <b>Meta</b> - calls two or more other naming systems in order. By default, calls PetName then HostsTxt.
es: <b>Meta</b> - llama a uno o más sistemas de nombres en orden. Por defecto llama a PetName y después a Hosts Txt.

source: <b>PetName</b> - Looks up in a petnames.txt file. The format for this file is NOT the same as hosts.txt.
es: <b>PetName</b> - busca en el archivo petnames.txt. El formato de este archivo NO es el mismo que el de

source: <b>HostsTxt</b> - Looks up in the following files, in order:
es: <b>HostsTxt</b> - Busca en los siguentes archivos en orden:

source: <b>AddressDB</b> - Each host is listed in a separate file in a addressDb/ directory.
es: <b>AddressDB</b> - Cada host es listado en un archivo separado en el directorio addressDb/.

source: <b>Eepget</b> - does an HTTP lookup request from an external server - must be stacked after the HostsTxt lookup with Meta. This could augment or replace the jump system. Includes in-memory caching.
es: <b>Eepget</b> - hace una búsqueda HTTP en un servidor externo - por orden de realización debe colocarse después de la búsqueda en HostsTxt con Meta. Esto podría complementar o reemplazar al sistema de servicios de salto (jump, direccionamiento distribuido). Incluye cacheado en-memoria.

source: <b>Exec</b> - calls an external program for lookup, allows additional experimentation in lookup schemes, independent of java. Can be used after HostsTxt or as the sole naming system. Includes in-memory caching.
es: <b>Exec</b> - llama a un programa externo para las búsquedas, permite experimentación adicional en los esquemas de búsquedas, independientemente de java. Puede ser usado después de HostsTxt o como un sistema de nombres en solitario. Incluye caché en-memoria.

source: <b>Dummy</b> - used as a fallback for Base64 names, otherwise fails.
es: <b>Dummy</b> - usado como apoyo para los nombres BAse64, do otra forma falla.

source: The current naming system can be changed with the advanced config option 'i2p.naming.impl' (restart required). See core/java/src/net/i2p/client/naming for details.
es: El sistema actual de dominios puede ser cambiado en la configuración avanzada 'i2p.naming.impl' (se necesita reiniciar). Vea core/java/src/net/i2p/client/naming para más detalles.

source: Any new system should be stacked with HostsTxt, or should implement local storage and/or the addressbook subscription functions, since addressbook only knows about the hosts.txt files and format.
es: Cualquier sistema nuevo debería usarse con HostsTxt, o debería implementar almacenamiento local o/y las funciones de suscripción de la libreta de direcciones, ya que la libreta de direcciones sólo conoce el archivo hosts.txt y su formato.

source: Certificates
es: Certificados

source: I2P destinations contain a certificate, however at the moment that certificate is always null. With a null certificate, base64 destinations are always 516 bytes ending in "AAAA", and this is checked in the addressbook merge mechanism, and possibly other places. Also, there is no method available to generate a certificate or add it to a destination. So these will have to be updated to implement certificates.
es: Las destinaciones I2P contiene un certificado, aunque hasta el momento ese certificado es siempre vacío, null. Con un certificado nulo, las destinaciones base64 son siempre de 516 bytes y terminan en "AAAA", y esto es comprobado en el mecanismo de unión de la libreta de direcciones, y posiblemente en otros sitios. Además, no hay ningún método disponible para generar un certificado o añadirlo a la destinación. Con lo que este debe ser actualizado para implementar los certificados.

source: One possible use of certificates is for <a href="%(todo)s#hashcash">proof of work</a>.
es: Un posible uso para los certificados sería para la <a href="%(todo)s#hashcash">prueba de trabajo</a>.

source: Another is for "subdomains" (in quotes because there is really no such thing, i2p uses a flat naming system) to be signed by the 2nd level domain's keys.
es: Otro es para que los "subdominios" (entre comillas porque realmente no existe tal cosa, I2P utiliza un sistema de dominios plano) sean firmados por las claves de dominio de segundo nivel .

source: With any certificate implementation must come the method for verifying the certificates. Presumably this would happen in the addressbook merge code. Is there a method for multiple types of certificates, or multiple certificates?
es: Con cualquier tipo de implementación de certificados tiene que venir algún método para verificar los certificados. Probablemente esto debería en al código de unión de la libreta de direcciones. ¿Hay un método para múltiples tipos de certificados, o múltiples certificados?

source: Adding on a certificate authenticating the responses as signed by some centralized certificate authority would address many of the hostile nameserver issues but would leave open replay attacks as well as hostile certificate authority attacks.
es: Añadiendo sobre un certificado, autentificando la respuesta como firmada por alguna autoridad certificada centralizada podría solucionar muchos de los problemas con los servidores de nombres hostiles, pero lo dejaría abierto a ataques de respuesta, al igual que a los ataques desde una autoridad de certificados hostil.

source: ElGamal/AES + SessionTag Encryption
es: Cifrado ElGamal/AES + SessionTag

source: ElGamal/AES+SessionTags is used for end-to-end encryption.
es: ElGamal/AES+SessionTags es usado para los cifrados de fin a fin.

source: As an unreliable, unordered, message based system, I2P uses a simple combination of asymmetric and symmetric encryption algorithms to provide data confidentiality and integrity to garlic messages. As a whole, the combination is referred to as ElGamal/AES+SessionTags, but that is an excessively verbose way to describe the use of 2048bit ElGamal, AES256, SHA256, and 32 byte nonces.
es: Como el sistema basado en mensajes no ordenados y no fiable que es, I2P usa una combinación simple de algoritmos de cifrados simétricos y asimétricos para proporcionar la confidencialidad de los datos y la integridad de los mensajes garlic. En conjunto, la combinación es llamada ElGamal/AES+SessionTags, pero es una forma excesivamente larga de describir el uso de ElGamal de 2048 bits, AES256, SHA256 y nonces (números de un sólo uso) de 32 bytes.

source: The first time a router wants to encrypt a garlic message to another router, they encrypt the keying material for an AES256 session key with ElGamal and append the AES256/CBC encrypted payload after that encrypted ElGamal block. In addition to the encrypted payload, the AES encrypted section contains the payload length, the SHA256 hash of the unencrypted payload, as well as a number of "session tags" - random 32 byte nonces. The next time the sender wants to encrypt a garlic message to another router, rather than ElGamal encrypt a new session key they simply pick one of the previously delivered session tags and AES encrypt the payload like before, using the session key used with that session tag, prepended with the session tag itself. When a router receives a garlic encrypted message, they check the first 32 bytes to see if it matches an available session tag - if it does, they simply AES decrypt the message, but if it does not, they ElGamal decrypt the first block.
es: La primera vez que un ruter quiere cifrar un mensaje para otro ruter, estos cifran las claves para una clave de sesión AES256 con ElGamal y adjunta la payload ya cifrado AES256/CBC después del bloque cifrado ElGamal. Además del payload cifrado, las sección del cifrado AES contiene el tamaño de la carga, el hash SHA256 del payload no cifrado, así como el número de "etiquetas de sesión" - nonces aleatorios de 32 bits. La siguiente vez que el remitente desea cifrar un mensaje garlic para otro ruter, en vez de de cifrar una nueva clave de sesión con ElGamal, simplemente elijen una de las etiquetas enviadas de la sesión anterior y cifran con AES el payload como anteriormente, usando la clave de sesión usada con la etiqueta de la sesión, antepuesto con la misma etiqueta de sesión. Cuando un ruter recibe un mensaje cifrado garlic, comprueba los primeros 32 bytes para ver si coinciden con una etiqueta de sesión disponible - si lo hace, simplemente descifran el mensaje con AES, pero si no, descifran el primer bloque con ElGamal

source: Each session tag can be used only once so as to prevent internal adversaries from unnecessarily correlating different messages as being between the same routers. The sender of an ElGamal/AES+SessionTag encrypted message chooses when and how many tags to deliver, prestocking the recipient with enough tags to cover a volley of messages. Garlic messages may detect the successful tag delivery by bundling a small additional message as a clove (a "delivery status message") - when the garlic message arrives at the intended recipient and is decrypted successfully, this small delivery status message is one of the cloves exposed and has instructions for the recipient to send the clove back to the original sender (through an inbound tunnel, of course). When the original sender receives this delivery status message, they know that the session tags bundled in the garlic message were successfully delivered.
es: Cada etiqueta de sesión puede usarse sólo una vez para evitar que adversarios internos puedan relacionar diferentes mensajes al enviarse estos entre los mismos ruters. El remitente de un mensaje cifrado con etiqueta de sesión + ElGamal/AES elije cuando y cuantas etiquetas a enviar, poniendo a disposición del que recibe suficientes etiquetas para trabajar con un buen número de mensajes. Los mensajes Garlic pueden detectar la llegada exitosas de las etiquetas construyendo un mensaje adicional tipo clove (un "mensaje de estado de entrega") - cuando el mensaje llega al destinatario elegido y es descifrado correctamente, este pequeño mensaje de estado de entrega es uno de los dientes expuestos y tiene instrucciones para el destinatario para que retorne al remitente original (a través de un túnel de entrada, claro). Cuando el remitente original recibe el mensaje de estado de envío, sabe que la etiqueta de sesión incluida en el mensaje garlic ha sido enviada exitosamente.

source: Session tags themselves have a short lifetime, after which they are discarded if not used. In addition, the quantity stored for each key is limited, as are the number of keys themselves - if too many arrive, either new or old messages may be dropped. The sender keeps track whether messages using session tags are getting through, and if there isn't sufficient communication it may drop the ones previously assumed to be properly delivered, reverting back to the full expensive ElGamal encryption. A session will continue to exist until all its tags are exhausted or expire.
es: Las etiquetas de sesión tienen un vida muy corta, después de la cual son descartadas y no se usan más. Además, el número almacenado de ellas por cada clave es limitado, como también está limitado el número de claves - si llegan demasiadas, serán descartados los mensajes nuevos o los viejos. El remitente lleva el seguimiento de los mensajes con etiquetas de sesión que pasan a través suyo, y si no hay comunicación suficiente podría descartar los mensajes supuestamente enviados correctamente, volviendo al costoso cifrado ElGamal. Una sesión continuará existiendo hasta que todas las etiquetas hayan expirado.

source: Sessions are unidirectional. Tags are delivered from Alice to Bob, and Alice then uses the tags, one by one, in subsequent messages to Bob.
es: Las sesiones son unidireccionales. Las etiquetas son enviadas desde Alice a Bob, y Alice entonces utiliza las etiquetas, una a una, en los siguientes mensajes hacia Bob.

source: Sessions may be established between Destinations, between Routers, or between a Router and a Destination. Each Router and Destination maintains its own Session Key Manager to keep track of Session Keys and Session Tags. Separate Session Key Managers prevents correlation of multiple Destinations to each other or a Router by adversaries.
es: Las sesiones puede establecerse entre Destinaciones, entre Ruters o entre Ruters y Destinaciones. Cada ruter y destinación mantiene su administrador de claves de sesión para hacer el seguimiento de las claves de sesión y las etiquetas de sesión. Al haber administradores de claves de sesión separados se previene que los adversarios puedan hacer correlación de las múltiples destinaciones que hay entre cada uno o entre ruters.

source: Message Reception
es: Recepción del Mensaje

source: Each message received has one of two the two possible conditions:</p>
es: Cada mensaje recibido tiene una de estas dos posibles condiciones:</p>

source: It is part of an existing session and contains a Session Tag and an AES encrypted block
es: Es parte de una sesión ya existente y contiene una etiqueta de sesión y un bloque cifrado AES.

source: It is for a new session and contains both ElGamal and AES encrypted blocks
es: Es para una nueva sesión y contiene los bloques cifrados ElGamal y AES.

source: When a router receives a message, it will first assume it is from an existing session and attempt to look up the Session Tag and decrypt the following data using AES. If that fails, it will assume it is for a new session and attempt to decrypt it using ElGamal.
es: Cuando un ruter recibe un mensaje, primero asumirá que es de una sesión ya existente e intentará buscar la etiqueta de sesión y descifrar los datos usando AES. Si esto falla, asumirá que es para una nueva sesión e intentará descifrarlo usando ElGamal.

source: New Session Message Specification
es: Especificaciones de los mensajes de nueva sesión.

source: A New Session ElGamal Message contains two parts, an encrypted ElGamal block and an encrypted AES block.
es: Un mensaje de nueva sesión ElGamal contiene dos partes, un bloque cifrado ElGamal y un bloque cifrado AES.

source: The encrypted message contains:
es: El mensaje cifrado contiene:

source: ElGamal Block
es: Bloque ElGamal

source: The encrypted ElGamal Block is always 514 bytes long.
es: El bloque cifrado ElGamal es siempre de 514 bytes.

source: The unencrypted ElGamal data is 222 bytes long, containing:
es: Los datos no cifrados ElGamal son de 222 bytes de largo, y contienen:

source: The 32-byte <a href="%(commonstructures)s#type_SessionKey">Session Key</a> is the identifier for the session. The 32-byte Pre-IV will be used to generate the IV for the AES block that follows; the IV is the first 16 bytes of the SHA-256 Hash of the Pre-IV.
es: La <a href="%(commonstructures)s#type_SessionKey">clave de sesión</a> de 32 bytes es el identificador de sesión. El Pre-IV de 32 bytes es usado para generar el IV para el bloque AES siguiente; el IV son los primeros 16 bytes del Hash SHA-256 del Pre-IV.

source: The 222 byte payload is encrypted <a href="%(cryptography)s#elgamal">using ElGamal</a> and the encrypted block is 514 bytes long. </p>
es: El payload de 222 bytes es cifrado <a href="%(cryptography)s#elgamal">usando ElGamal</a> y el bloque cifrado es de 514 bytes de largo.

source: AES Block
es: Bloque AES

source: The unencrypted data in the AES block contains the following:
es: Los datos sin cifrar en el bloque AES contienen los siguiente:

source: Minimum length: 48 bytes
es: Tamaño mínimo : 48 bytes

source: The data is then <a href="%(cryptography)s">AES Encrypted</a>, using the session key and IV (calculated from the pre-IV) from the ElGamal section. The encrypted AES Block length is variable but is always a multiple of 16 bytes. </p>
es: Los datos están entonces <a href="%(cryptography)s">Cifrados con AES</a>, usando la clave de sesión y el IV (Vector de Inicialización, calculado con el pre-IV) desde la sección ElGamal. El tamaño del bloque cifrado con AES es variable, pero siempre es un múltiplo de 16 bytes.

source: Actual max payload length, and max block length, is less than 64 KB; see the <a href="%(i2np)s">I2NP Overview</a>.
es: El tamaño de las actuales carga máxima, y tamaño máximo del bloque, es menor de 64 KB; vea la <a href="%(i2np)s">Introducción a I2NP</a>.

source: New Session Key is currently unused and is never present.
es: La nueva clave de sesión actualmente está en desuso y nunca está presente.

source: Existing Session Message Specification
es: Especificación de mensaje de sesión existente.

source: The session tags delivered successfully are remembered for a brief period (15 minutes currently) until they are used or discarded. A tag is used by packaging one in an Existing Session Message that contains only an AES encrypted block, and is not preceded by an ElGamal block.
es: Las etiquetas de sesión entregadas exitosamente son recordadas durante un periodo breve (actualmente 15 minutos) hasta que se usan o se descartan. Se usa una etiqueta empaquetándola en un mensaje de sesión existente que sólo contiene un bloque cifrado con AES, y no está precedido por un bloque ElGamal.

source: The existing session message is as follows:
es: El mensaje de sesión existente es como sigue:

source: The session tag also serves as the pre-IV. The IV is the first 16 bytes of the SHA-256 Hash of the sessionTag.
es: La etiqueta de sesión también sirve como pre-IV. El IV (Vector de Inicialización) son los primeros 16 bytes del hash SHA-256 de la sessionTag (etiqueta de sesión).

source: To decode a message from an existing session, a router looks up the Session Tag to find an associated Session Key. If the Session Tag is found, the AES block is decrypted using the associated Session Key. If the tag is not found, the message is assumed to be a <a href="#new">New Session Message</a>.
es: Para decodificar un mensaje desde una sesión existente, un router consulta la etiqueta de sesión para encontrar una clave de sesión asociada. Si se encuentra la etiqueta de sesión, el bloque AES es descifrado usando la clave de sesión asociada. Si no se encuentra la etiqueta, se asume que el mensaje es un <a href="#new">nuevo mensaje de sesión</a>.

source: Session Tag Configuration Options
es: Opciones de configuración de identificador de sesión
