Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Also note that the various overheads added by lower layers, in particular asymmetric <a href="%(elgamalaes)s">ElGamal/AES</a>, place a large burden on intermittent messages such as used by a Kademlia-over-UDP application. The implementations are currently tuned for frequent traffic using the streaming library. There are a high number of session tags delivered, and a short session tag lifetime, for example. There are currently no configuration parameters available within I2CP to tune the ElGamal Session Tag parameters.
es: Observe también que el variado tráfico de control añadido por las capas inferiores, en particular la asimétrica <a href="%(elgamalaes)s">ElGamal/AES</a>, coloca una gran carga sobre los mensajes intermitentes tales como los usados por una aplicación Kademlia-sobre-UDP. Las implementaciones actualmente se ajustan para tráfico frecuente usando la librería streaming. Por ejemplo, si hay un alto número de etiquetas de sesión entregadas, y una vida corta de etiqueta de sesión. Actualmente no hay parámetros de configuración disponibles dentro de I2CP para ajustar los parametros de la Etiqueta de Sesión ElGamal.

source: I2CP Protocol Number and Ports
es: Número de protocolo y puertos de I2CP

source: The standard I2CP protocol number for datagrams is PROTO_DATAGRAM (17). Applications may or may not choose to set the protocol in the I2CP header. It is not set by default. It must be set to demultiplex datagram and streaming traffic received on the same Destination.
es: El número stadard del protocolo I2CP (Protocolo de Cliente I2P) para datagramas es PROTO_DATAGRAM (17). Las aplicaciones pueden o no elegir establecer el protocolo en la cabecera I2CP. No está establecido por defecto. Debe ser establecido para demultiplexar el datagrama y el tráfico de streaming recibido en el mismo Destino.

source: As datagrams are not connection-oriented, the application may require port numbers to correlate datagrams with particular peers or communications sessions, as is traditional with UDP over IP. Applications may add 'from' and 'to' ports to the I2CP (gzip) header as described in the <a href="%(i2cp)s#format">I2CP page</a>.
es: Como los datagramas no están orientados a la conexión, la aplicación puede requerir números de puerto para correlacionar los datagramas con pares ('peers') concrectos o sesiones de comunicaciones, como es tradicional con UDP sobre IP. Las aplicaciones pueden añadir puertos 'from' (origen) y 'to' (destino) a la cabecera (gzip) I2CP como se describe en la <a href="%(i2cp)s#format">página de I2CP</a>.

source: There is no method within the datagram API to specify whether it is non-repliable (raw) or repliable. The application should be designed to expect the appropriate type. The I2CP protocol number or port should be used by the application to indicate datagram type. The I2CP protocol numbers PROTO_DATAGRAM (signed) and PROTO_DATAGRAM_RAW are defined in the <a href="%(i2psession)s">I2PSession API</a> for this purpose. A common design pattern in client/server datagram applications is to use signed datagrams for a request which includes a nonce, and use a raw datagram for the reply, returning the nonce from the request.
es: No hay método dentro de la API datagram para especificar si es no-respondible (raw (crudo)) o respondible. La aplicación debe ser designada para esperar el tipo apropiado. El número de protocolo I2CP o el puerto debería ser usado por la aplicación para indicar el tipo de datagrama. Los números de protocolo I2CP `PROTO_DATAGRAM_RAW` se definen en la <a href="%(i2psession)s">API I2PSession</a> para este propósito. Un patrón de diseño común en aplicaciones datagrama cliente/servidor es usar datagramas firmados para una petición que incluye un nonce (valor de seguridad de un único uso), y usa un datagrama crudo (`raw`) para la respuesta, devolviendo el nonce desde la petición.

source: The protocols and ports may be set in I2CP's <a href="%(i2psession)s">I2PSession API</a>, as implemented in <a href="%(i2psessionmuxed)s">I2PSessionMuxedImpl</a>.
es: Los protocolos y puertos pueden ser establecidos en la <a href="%(i2psession)s">API I2PSession</a> de I2CP, tal como están implementados en <a href="%(i2psessionmuxed)s">I2PSessionMuxedImpl</a>.

source: Data Integrity
es: Integridad de los datos

source: Data integrity is assured by the gzip CRC-32 checksum implemented in <a href="%(i2cp)s#format">the I2CP layer</a>. There is no checksum field in the datagram protocol.
es: La integridad de los datos está asegurada por el checksum CRC-32 de gzip implementado en <a href="%(i2cp)s#format">la capa I2CP</a>. No hay campo checksum en el protocolo datagram

source: Packet Encapsulation
es: Encapsulado de paquetes

source: Each datagram is sent through I2P as a single message (or as an individual clove in a <a href="%(garlicrouting)s">Garlic Message</a>). Message encapsulation is implemented in the underlying <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a>, and <a href="%(tunnelmessage)s">tunnel message</a> layers. There is no packet delimiter mechanism or length field in the datagram protocol.
es: Cada datagrama se envía a través de I2P como un mensaje único (o como un 'clove' (diente) individual en un `<a href="%(garlicrouting)s">Garlic Message</a>)` (mensaje ajo). La encapsulación del mensaje se implementa en los <a href="%(i2cp)s">I2CP</a>, <a href="%(i2np)s">I2NP</a>, y las capas de <a href="%(tunnelmessage)s">mensaje de túnel</a> subyacentes. No hay mecanismo delimitador de paquetes o campo de tamaño en el protocolo datagram.

source: Specification
es: Especificación

source: See the Datagrams Specification page.
es: Vea la página de Especificaciones de Datagramas.

source: I2PControl - Remote Control Service
es: I2PControl - Servicio de Control Remoto

source: I2P enables a <a href="http://en.wikipedia.org/wiki/JSON-RPC">JSONRPC2</a> interface via the plugin <a href="%(itoopie)s">I2PControl</a>. The aim of the interface is to provide simple way to interface with a running I2P node. A client, itoopie, has been developed in parallel. The JSONRPC2 implementation for the client as well as the plugin is provided by the java libraries <a href="http://software.dzhuvinov.com/json-rpc-2.0.html">JSON-RPC 2.0</a>. A list of implementations of JSON-RPC for various languages can be found at <a href="http://json-rpc.org/wiki/implementations">the JSON-RPC wiki</a>.
es: I2P habilita una interfaz <a href="http://en.wikipedia.org/wiki/JSON-RPC">JSONRPC2</a> a través del plugin <a href="%(itoopie)s">I2PControl</a>. El propósito de la interfaz es proporcionar un camino sencillo a la interacción con un nodo I2P en ejecución. Un cliente, itoopie, ha sido desarrollado en paralelo. La implementación JSONRPC2 para el cliente, así como el plugin, son proporcionados por las librerías Java <a href="http://software.dzhuvinov.com/json-rpc-2.0.html">JSON-RPC 2.0</a>. Una lista de implementaciones de JSON-RPC para diferentes lenguajes puede encontrarse en <a href="http://json-rpc.org/wiki/implementations">el wiki de JSON-RPC</a>.

source: I2PControl is by default listening on https://localhost:7650
es: I2PControl por defecto está escuchando sobre https://localhost:7650

source: API, version 1.
es: API, versión 1.

source: Parameters are only provided in a named way (maps).
es: Los parámetros sólo se proporcionan a través del nombre (mapas).

source: JSON-RPC 2 format
es: Formato JSON-RPC 2

source: Request:
es: Petición:

source: Response:
es: Respuesta:

source: Description
es: Descripción

source: Token used for authenticating every request (excluding the 'Authenticate' RPC method)
es: Muestra usada para autentificar cada petición (excluyendo el método RPC 'Authenticate')

source: Implemented methods
es: Métodos implemetados

source: Creates and returns an authentication token used for further communication.
es: Crea y devuelve un token de autentificación usado para comunicaciones posteriores.

source: The version of the I2PControl API used by the client.
es: La versión del API de I2PControl usada por el cliente.

source: The password used for authenticating against the remote server.
es: La contraseña usada para autentificarse en el servidor remoto.

source: The primary I2PControl API version implemented by the server.
es: Versión del API principal de I2PControl implementado por el servidor.

source: The token used for further communication.
es: La muestra usada para la posterior comunicación.

source: Echoes the value of the echo key, used for debugging and testing.
es: Muestra el valor de la clave eco, se usa para depuración y pruebas.

source: Value will be returned in response.
es: Un valor será devuelto como respuesta.

source: Token used for authenticating the client. Is provided by the server via the 'Authenticate' RPC method.
es: Token usado para autentificar el cliente. Es provisto por el servidor a través del método RPC 'Authenticate'

source: Value of the key 'echo' in the request.
es: Valor de la clave 'echo', clave eco, en la petición.

source: Fetches rateStat from router statManager. Creates stat if not already created.
es: Obtiene el rateStat del StatManager del ruter. Crear el stat si no ha sido creado ya.

source: Determines which rateStat to fetch, see <a href="%(ratestats)s">ratestats</a>.
es: Determina que rateStat debe obtenerse, vea <a href="%(ratestats)s">ratestats</a>.

source: Determines which period a stat is fetched for. Measured in ms.
es: Determina para qué periodo de tiempo se obtendrá el stat. Se mide en ms.

source: Returns the average value for the reuested rateStat and period.
es: Devuelve el valor medio del periodo y del rateStat requerido.

source: Manages I2PControl. Ports, passwords and the like.
es: Administra I2PControl, Puertos, contraseñas y cosas de ese tipo.

source: Sets a new listen address for I2PControl (only 127.0.0.1 and 0.0.0.0 are implemented in I2PControl currently).
es: Cambia la dirección donde escucha I2PControl (sólo se han implementado 127.0.0.1 y 0.0.0.0 para I2PControl hasta ahora).

source: Sets a new password for I2PControl, all Authentication tokens will be revoked.
es: Cambia la contraseña para I2PControl, todos los tokens de autentificación serán revocados.

source: Switches which port I2PControl will listen for connections on.
es: Cambia el puerto en el que I2PControl escuchará por conexiones.

source: Returned if address was changed
es: Devuelto si la dirección fue cambiada

source: Returned if setting was changed
es: Devuelto si la configuración fue cambiada

source: Returns true if any changes were made.
es: Devuelve verdadero si se hizo algún cambio.

source: Returns true if any changes requiring a restart to take effect were made.
es: Devuelve verdadero si se hizo algún cambio que necesite un reinicio para tener efecto.

source: Fetches basic information about the I2P router. Uptime, version etc.
es: Obtiene información básica sobre el ruter I2P. Tiempo encendido, versión, etc.

source: What the status of the router is.
es: cuál es el estado del router.

source: What the uptime of the router is in ms.
es: Cuánto tiempo lleva encendido el ruter en ms.

source: What version of I2P the router is running.
es: Qué versión de I2P está ejecutando el ruter.

source: The 1 second average inbound bandwidth in Bps.
es: Media del ancho de banda de entrada durante 1 segundo, en Bps.

source: The 15 second average inbound bandwidth in Bps.
es: Media del ancho de banda de entrada durante 15 segundos, en Bps.

source: The 1 second average outbound bandwidth in Bps.
es: Media del ancho de banda de salida durante 1 segundo, en Bps.

source: The 15 second average outbound bandwidth in Bps.
es: Media del ancho de banda de salida durante 15 segundos, en Bps.

source: What the current network status is. According to the below enum:
es: Cuál es el estado actual de la red. De acuerdo con la lista:

source: How many tunnels on the I2P net are we participating in.
es: En cuántos túneles estamos participando en la red I2p.

source: How many peers have we communicated with recently.
es: Con cuántos túneles nos hemos comunicado recientemente.

source: How many peers are considered 'fast'.
es: Cuántos pares se consideran como 'rápidos'.

source: How many peers are considered 'high capacity'.
es: Cuántos pares se consideran de 'alta capacidad'

source: Is the router reseeding hosts to its NetDB?
es: ¿El router I2P está resembrando nodos en su NetDB?

source: How many peers are known to us (listed in our NetDB).
es: Cuántos pares conocemos (listados en nuestra NetDB).

source: Manages I2P router restart/shutdown.
es: Maneja el arrancado/apagado del ruter I2P.

source: <b>Blocking</b>. Initiates a search for signed updates.
es: <b>Bloqueando</b>. Inicia una búsqueda para actualizaciones firmadas.

source: Initiates a router reseed, fetching peers into our NetDB from a remote host.
es: Inicia el resembrado de un ruter, obteniendo los pares para nuestra NetDB desde un ordenador remoto.

source: Restarts the router.
es: Reinicia el router.

source: Restarts the router gracefully (waits for participating tunnels to expire).
es: Reinicia el ruter con cuidado (espera a que expiren los túneles participantes).

source: Shuts down the router.
es: Apaga el router.

source: Shuts down the router gracefully (waits for participating tunnels to expire).
es: Apaga el ruter con cuidado (espera a que expiren los túneles participantes).

source: Initiates a router update from signed sources.
es: Inicia una actualización del router I2P desde fuentes firmadas.

source: <b>Blocking</b>. Returns true iff a signed update has been found.
es: <b>Bloqueando</b>. Devuelve verdadero si se ha encontrado una actualización firmada.

source: If requested, verifies that a reseed has been initiated.
es: Si se ha requerido, verifica que el resembrado ha sido iniciado.

source: If requested, verifies that a restart has been initiated.
es: Si se ha requerido, verifica que el reinicio ha sido iniciado.

source: If requested, verifies that a graceful restart has been initiated.
es: Si se ha requerido, verifica que el reinicio con cuidado ha sido iniciado.

source: If requested, verifies that a shutdown has been initiated
es: Si se ha requerido, verifica que el apagado ha sido iniciado.

source: If requested, verifies that a graceful shutdown has been initiated
es: Si se ha requerido, verifica que el apagado con cuidado ha sido iniciado.

source: <b>Blocking</b>. If requested, returns the status of the the update
es: <b>Bloqueando</b>. Si se solicita, devuelve el estado de la actualización

source: Fetches or sets various network related settings. Ports, addresses etc.
es: Obtiene un conjunto de configuraciones relacionadas con la red. Puertos, direcciones, etc.

source: What port is used for the TCP transport. If null is submitted, current setting will be returned.
es: Qué puerto es usado para el transporte TCP. Si se ha enviado null, se devolverá la configuración actual.

source: What hostname is used for the TCP transport. If null is submitted, current setting will be returned.
es: Qué nombre de dominio es usado para el transporte TCP. Si se ha enviado null, se devolverá la configuración actual.

source: Use automatically detected ip for TCP transport. If null is submitted, current setting will be returned.
es: Usar la ip detectada automáticamente para el transporte TCP . Si se ha enciado null, se devolverá la configuración actual.

source: What port is used for the UDP transport. If null is submitted, current setting will be returned.
es: Qué puerto es usado para el transporte UDP. Si se ha enviado null, se devolverá la configuración actual.

source: What hostname is used for the UDP transport. If null is submitted, current setting will be returned.
es: Qué nombre de dominio es usado para el transporte UDP. Si se ha enviado null, se devolverá la configuración actual.

source: Which methods should be used for detecting the ip address of the UDP transport. If null is submitted, current setting will be returned.
es: Qué métodos deben susarse para detectar la dirección ip del transporte UDP. Si se ha enviado null, se devolverá la configuración actual.

source: What ip has been detected by the UDP transport.
es: Qué ip ha sido detectada para el transporte UDP.

source: Is UPnP enabled. If null is submitted, current setting will be returned.
es: Está UPnP activo. Si se ha enviado null, se devolverá la configuración actual.

source: How many percent of bandwidth is usable for participating tunnels. If null is submitted, current setting will be returned.
es: Qué tanto por ciento del ancho de banda es utilizable para los túneles participantes. Si se ha enviado null, se devolverá la configuración actual.

source: How many KB/s of inbound bandwidth is allowed. If null is submitted, current setting will be returned.
es: Cuántos KB/s se permiten para el ancho de banda entrante. Si se ha enviado null, se devolverá la configuración actual.

source: How many KB/s of outbound bandwidth is allowed. If null is submitted, current setting will be returned.
es: Cuántos KB/s se permiten para el ancho de banda de salida. Si se ha enviado null, se devolverá la configuración actual.

source: Is laptop mode enabled (change router identity and UDP port when IP changes ). If null is submitted, current setting will be returned.
es: Si está el modo laptop activado (el cambio de la identidad del ruter cuando cambia la IP). Si se ha enviado null, se devolverá la configuración actual.

source: Token used for authenticating the client. Is provided by the server via the 'Authenticate' RPC method. If null is submitted, current setting will be returned.
es: El identificador (`token`) usado para la autentificación del cliente, es proporcionado por el servidor a través del método 'Authenticate' (autentificar) de RPC. Si se envía vacío ('null'), se devolverá el valor de configuración actual.

source: If requested, returns the port used for the TCP transport.
es: Si se solicita, devuelve el puerto usado para el transporte TCP.

source: If requested, returns the hostname used for the TCP transport.
es: Si se solicita, devuelve el nombre del servidor usado para el transporte TCP.

source: If requested, returns the method used for automatically detecting ip for the TCP transport.
es: Si se solicita, devuelve el método usado para detectar automáticamente la IP para el transporte TCP.

source: If requested, returns the port used for the UDP transport.
es: Si se solicita, devuelve el puerto usado para el transporte UDP.

source: If requested, returns the hostname used for the UDP transport.
es: Si se solicita, devuelve el nombre del servidor usado para el transporte UDP.

source: If requested, returns methods used for detecting the ip address of the UDP transport.
es: Si se solicita, devuelve los métodos usados para detectar la dirección IP del transporte UDP.

source: If requested, returns what ip has been detected by the UDP transport.
es: Si se solicita, devuelve la IP que ha sido detectada por el transporte UDP.

source: If requested, returns the UPNP setting.
es: Si se solicita, devuelve el valor de la configuración UPnP.

source: If requested, returns how many percent of bandwidth is usable for participating tunnels.
es: Si se solicita, devuelve el porcentaje de ancho de banda disponible para los túneles participantes.

source: If requested, returns how many KB/s of inbound bandwidth is allowed.
es: Si se solicita, devuelve el número de KB/s de ancho de banda de entrada que están permitidos.

source: If requested, returns how many KB/s of outbound bandwidth is allowed.
es: Si se solicita, devuelve el número de KB/s de ancho de banda de salida que están permitidos.

source: If requested, returns the laptop mode.
es: Si se solicita, devuelve el valor del modo laptop (portátil).

source: Have the provided settings been saved.
es: Han sido guardadas las configuraciones proporcionadas.

source: Is a restart needed for the new settings to be used.
es: Se necesita un reinicio para que las nuevas configuraciones se usen.

source: denotes an optional value.
es: denota un valor opcional.

source: denotes a possibly occuring return value
es: denota un valor de retorno que posiblemente ocurra

source: Error codes
es: Códigos de error

source: Standard JSON-RPC2 error codes.
es: Códigos de error estándar JSON-RPC2.

source: JSON parse error.
es: Error de procesado JSON.

source: Invalid request.
es: Petición no válida.

source: Method not found.
es: Método no encontrado.

source: Invalid parameters.
es: Parámetros no válidos.

source: Internal error.
es: Error interno.

source: I2PControl specific error codes.
es: Códigos de error específicos de I2PControl.

source: Invalid password provided.
es: Se proporcionó una contraseña no válida.

source: No authentication token presented.
es: No se presentó la credencial (`token`) de autentificación.

source: Authentication token doesn't exist.
es: La credencial (`token`) de autentificación no existe

source: The provided authentication token was expired and will be removed.
es: La credencial (`token`) de identificación ha expirado y será eliminada.

source: The version of the I2PControl API used wasn't specified, but is required to be specified.
es: La versión de la API I2PControl usada no fue especificada, pero se requiere que sea especificada.

source: The version of the I2PControl API specified is not supported by I2PControl.
es: La versión de la API I2PControl especificada no está soportada por I2PControl.

source: I2PTunnel is a tool for interfacing with and providing services on I2P. Destination of an I2PTunnel can be defined using a <a href="%(naming)s">hostname</a>, <a href="%(naming)s#base32">Base32</a>, or a full 516-byte destination key. An established I2PTunnel will be available on your client machine as localhost:port. If you wish to provide a service on I2P network, you simply create I2PTunnel to the appropriate ip_address:port. A corresponding 516-byte destination key will be generated for the service and it will become avaliable throughout I2P. A web interface for I2PTunnel management is avaliable on <a href="http://localhost:7657/i2ptunnel/">localhost:7657/i2ptunnel/</a>.
es: I2PTunnel es una herramienta para intermediar con, y proveer servicios a I2P. El destino de un I2PTunnel puede ser definido usando un <a href="%(naming)s">nombre de servidor</a> <a href="%(naming)s#base32">Base32</a>, o una clave de destino completa de 516-bytes. Un I2PTunnel establecido estará disponible sobre su máquina cliente en localhost:puerto Si desea proporcionar un servicio sobre la red I2P, simplemente cree un I2PTunnel hasta la dirección IP:puerto apropiada. Se generarará una clave de destino de 516-bytes correspondiente para el servicio, y se hará disponible a través de I2P. Una interfaz web para la administración del I2PTunnel está disponible en <a href="http://localhost:7657/i2ptunnel/">localhost:7657/i2ptunnel/</a>.

source: Default Services
es: Servicios predeterminados

source: Server tunnels
es: Túneles de servidor

source: <b>I2P Webserver</b> - A tunnel pointed to a Jetty webserver run on <a href="http://localhost:7658">localhost:7658</a> for convenient and quick hosting on I2P. <br>The document root is:
es: <b>Servidor web I2P</b> - Un túnel apuntando a un servidor web Jetty se ejecuta en <a href="http://localhost:7658">localhost:7658</a> para un hospedaje conveniente y rápido en I2P. <br>El documento raíz es:

source: Client tunnels
es: Túneles de cliente
