Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Simple web browser-based email interface. Configured to use Postman's email service by default.
es: Interfaz web simple para emails. Configurado por defecto para usar el servidor de email Postman.

source: Can be configured to use Postman's email service. See <a href="%(reviews)s">this comparison of MUAs</a>, and configuration settings for <a href="%(smtp)s">SMTP</a> and <a href="%(pop3)s">POP3</a>.
es: Puede configurarse para usar el servicio de email de Postman. Vea <a href="%(reviews)s">esta comparación de MUAs</a>, y las opciones de configuración para <a href="%(smtp)s">SMTP</a> y <a href="%(pop3)s">POP3</a>.

source: I2P's integrated BitTorrent client.
es: Cliente de BitTorrent de I2P integrado.

source: Modified version of I2PSnark.
es: Versión modificada de I2PSnark.

source: A fork of rufus that uses the Basic Open Bridge (BOB) and has many improvements, including using the latest wxwidgets and python. It also supports use of seedless if installed for trackerless torrents and magnet-link like fetching of torrents within I2P.
es: Un fork de rufus que utiliza Basic Open Bridge (BOB), puente básico libre, y tiene muchas mejoras, incluyendo el uso del último wxwidgets y python. También soporta el uso de seedless, sin-emilla, si está instalado, para los torrents sin tracker, y el uso de anlaces imán, magnet-link, para torrents dentro de I2P.

source: Clean, full-featured cross-platform BitTorrent client with official ports for several GUI toolkits.
es: Cliente de BitTorrent completo multi plataforma con varios ports para varios GUIs diferentes.

source: Has a plugin providing I2P support.
es: Contiene un pluguin para usarse con I2P.

source: For a detailed feature comparison of I2P-enabled trackers/indexers, see <a href="http://%(zzz)s/files/trackers.html">here</a>.
es: Para una comparación detallada entre trackers/indexadores en I2P, mire <a href="http://%(zzz)s/files/trackers.html">aquí</a>.

source: The code that powered one of the first major tracker/indexer sites on the Internet. Patched for I2P.
es: El código que que hace funcionar uno de las mayores webs trackers en Internet. Parcheado para I2P.

source: Lightweight tracker/indexer. I2P mod available in the i2p.opentracker branch of the <a href="%(newdevs)s">I2P Monotone repository</a>.
es: Tracker/indexador ligero. Mod para I2P disponible en la rama de i2p.opentracker del <a href="%(newdevs)s">repositorio Monotone de I2P</a>.

source: <a href="http://%(zzz)s/">zzz's</a> Java-based open tracker. More info <a href="http://%(zzz)s/topics/598?page=1#p2085">here</a>.
es: <a href="http://%(zzz)s/">de zzz</a> Tracker libre basado en Java. Más información <a href="http://%(zzz)s/topics/598?page=1#p2085">aquí</a>.

source: I2P port of the aMule ED2K client.
es: Port para I2P del cliente aMule ED2K.

source: Port of the <a href="http://www.phex.org/mambo/">Phex</a> Gnutella client. Website for plugin version <a href="http://%(stats)s/i2p/plugins/">here</a>.
es: Port del cliente Gnutella <a href="http://www.phex.org/mambo/">Phex</a>. La web del pluguin <a href="http://%(stats)s/i2p/plugins/">aquí</a>.

source: Cache for Gnutella peers on I2P. Website for plugin version <a href="http://%(stats)s/i2p/plugins/">here</a>.
es: Caché de los pares de Gnutella en I2P. Web del pluguin <a href="http://%(stats)s/i2p/plugins/">aquí</a>.

source: Unix standard tool for socket relaying. Several clones, ports, and forks have appeared over the years.
es: Herramienta estándar Unix para la manipulación de sockets. Durante los años han aparecido varios clons, ports y forks.

source: Like netcat but more powerful.
es: Igual que netcat pero más potente.

source: Proxy providing simple, transparent SOCKS-ification of network applications.
es: Proxy que proporciona el uso transparente de SOCKS de las palicaciones de la red.

source: Most popular implementation of the Secure Shell (SSH) protocol and related tools.
es: La implementación más popular del protocolo Secure Shell (SSH) y varias herramientas relacionadas.

source: Open source Secure Shell (SSH) client for Windows.
es: Cliente para Windows de Secure Shell (SSH) de código libre.

source: IM client with multiple incarnations.
es: Cliente de mensajería, IM, con múltiples encarnaciones.

source: Many IRC clients leak identifying information to servers or other clients, so I2P's IRC and SOCKS IRC client tunnels filter certain inbound and outbound messages to scrub data such as LAN IP addresses, external IP addresses, local hostnames, and the name and version of the IRC client. Two message types in particular, DCC and CTCP, can't be sufficiently anonymized without changes to the protocols or to IRC client/server code, so they are completely blocked, except for CTCP ACTION (the message emitted by the <code>/me</code> command) which isn't inherently dangerous.
es: Muchos clientes IRC filtran información del usuario a los servidores u otros clientes, por lo que el IRC de I2P y los túneles clientes SOCKS IRC filtran ciertos mensajes de entrada y de salida para limpiar los datos tales como la IP de la LAN, la IP externa, los nombres de host local, y el nombre y la versión de los clientes de IRC. En particular, dos tipos de mensajes, DCC y CTCP, no pueden ser anonimizados sin cambios en el protocolo de los clientes y servidores de IRC, por lo que han sido completamente bloqueados, excepto para CTCP ACTION (el mensaje emitido por el comando <code>/me</code>) que no es peligroso por sí mismo.

source: I2P's IRC filtering may not cover every possible leak — users should also check if their client is sending their real name or local username. Packet sniffers such as <a href="http://www.wireshark.org/">Wireshark</a> are useful here. Eliminating remaining leaks may be as simple as changing the client's default configuration. If that doesn't help, inform the I2P developers; they may be able to solve it via additional filtering.
es: El filtro de IRC de I2P no puede cubrir todas las filtraciones — los usuarios deben comprobar si su cliente envía su nombre real o su nombre local. Los sniffers de paquetes como <a href="http://www.wireshark.org/">Wireshark</a> son muy útiles en estos casos. Para eliminar las filtraciones puede ser tan simple como cambiar la configuración por defecto del cliente IRC. Si eso no ayuda, avise a los desarrolladores de I2P, podrían ser capaces de arreglarlo añadiendo algún filtro adicional.

source: Small Java-based IRC client. Plugin available <a href= "http://%(stats)s/i2p/plugins/">here</a>.
es: Cliente de IRC pequeño en Java. Pluguin disponible <a href= "http://%(stats)s/i2p/plugins/">aquí</a>.

source: Cross-platform graphical IRC client.
es: Cliente de IRC gráfico multi plataforma.

source: Unixy terminal-based IRC client.
es: Cliente de IRC Unix para terminal.

source: Another Unixy terminal-based IRC client.
es: Otro cliente de IRC Unix para terminal.

source: IRC server developed from scratch.
es: Servidor IRC desarrollado desde cero.

source: Most popular IRC server.
es: El servidor IRC más popular.

source: Any website hosted anonymously on I2P, reachable through the I2P router's HTTP proxy.
es: Cualquier web alojada anónimamente en I2P, accesible desde el proxy HTTP del ruter de I2P.

source: Distributed anonymous websites hosted using Tahoe-LAFS-I2P, currently only reachable with Tahoe-LAFS-I2P clients or through the Tahoe-LAFS-I2P HTTP proxy.
es: Webs anónimas distribuidas alojadas usando Tahoe-LAFS-I2P, actualmente sólo accesibles con clientes Tahoe-LAFS-I2P o a través del proxy HTTP Tahoe-LAFS-I2P.

source: Website for <a href="http://%(sponge)s/">sponge's</a> jump service. Source code available.
es: Web para el servicio de saltos (jump, direccionamiento distribuido) de <a href="http://%(sponge)s/">sponge</a>. Código fuente disponible.

source: Another jump service.
es: Otro servicio de saltos.

source: Dynamically updated eepsite index.
es: Índice de eepsites actualizado dinámicamente.

source: Website for <a href="http://%(zzz)s/">zzz's</a> jump service.
es: Web para el servicio de saltos de <a href="http://%(zzz)s/">zzz</a>.

source: SOCKS-enabled caching web proxy with basic filtering capabilities.
es: Web proxy con cacheo activo SOCKS con la capacidad de filtrado básico.

source: Privacy-focused non-caching web proxy with advanced filtering capabilities. Excels at removing ads and other junk.
es: Web proxy sin cacheo enfocado a la privacidad con capacidad de filtrado avanzado. Excelente a la hora de eliminar anuncios y otras mierdas.

source: Venerable caching web proxy.
es: Venerable web proxy con caché.

source: Gateways allowing users on the public Internet to access eepsites.
es: Salidas que permiten a los usuarios en el Internet público acceder a las eepsites en I2P.

source: <a href="http://%(tino)s/">tino's</a> inproxy on the public Internet.
es: Proxy de entrada de <a href="http://%(tino)s/">tino</a> en el Internet público.

source: Another inproxy on the public Internet.
es: Otro proxy de entrada en la Internet abierta.

source: Gateways allowing I2P users to access content hosted on the public Internet.
es: Salidas que permiten a los usuarios de I2P acceder al contenido en el Internet público.

source: Publicly advertised outproxy running Squid, located in Europe.
es: Proxy de salida ejecutando Squid publicitado abiertamente, ubicado en Europa.

source: Lightweight web server and Java servlet container. I2P is tightly integrated with a bundled copy of Jetty which by default is configured to host the <a href="http://127.0.0.1:7658/">user's eepsite</a>. The bundled Jetty also serves the I2P router console and web applications bundled with I2P.
es: Servidor web ligero basado en Java servlet container. I2P está estrechamente integrado con una copia de Jetty incluida, que está configurada por defecto para alojar la <a href="http://127.0.0.1:7658/">eepsite del usuario</a>. La copia de Jetty incluida también sirve la consola del ruter de I2P y las palicaciones web incluidas con I2P.

source: In addition to Jetty, any web server should function over I2P without modification so long as it's HTTP-compliant. Some web servers known to currently serve content on the I2P network are:
es: Además de Jetty, cualquier servidor web debería funcionar con I2P sin modificaciones mientras sea compatible con HTTP. Algunos servidores web usados actualmente para servir contenido en I2P son:

source: Most popular web server on the public WWW.
es: El servidor web más popular en la WWW pública.

source: Web server and Java servlet container. More features than Jetty.
es: Servidor web en Java servlet container. Con mas funciones que Jetty.

source: Fast lightweight web server.
es: Servidor web rápido y ligero

source: High-performance lightweight web server.
es: Servidor web ligero de alto rendimiento.

source: Naming discussion
es: Discusión de nombres

source: NOTE: The following is a discussion of the reasons behind the I2P naming system, common arguments and possible alternatives. See <a href="%(naming)s">the naming page</a> for current documentation.
es: NOTA: La siguiente es una discusión de las razones que hay detrás del sistema de nombres de I2P, argumentos comunes y posibles alternativas. Vea en la <a href="%(naming)s">página de nombres</a> la documentación actual.

source: Discarded alternatives
es: Alternativas descartadas

source: Naming within I2P has been an oft-debated topic since the very beginning with advocates across the spectrum of possibilities. However, given I2P's inherent demand for secure communication and decentralized operation, the traditional DNS-style naming system is clearly out, as are "majority rules" voting systems.
es: Los nombres dentro de I2P han sido un tema a menudo debatido desde el principio mismo, con defensores de todas las posibilidades del espectro. Sin embargo, dada la demanda inherente a I2P de comunicaciones seguras y operaciones descentralizadas, el sistema de nombres tradicional estilo-DNS está claramente desestimado, ya que son sistemas de voto donde la "mayoría manda".

source: I2P does not promote the use of DNS-like services though, as the damage done by hijacking a site can be tremendous - and insecure destinations have no value. DNSsec itself still falls back on registrars and certificate authorities, while with I2P, requests sent to a destination cannot be intercepted or the reply spoofed, as they are encrypted to the destination's public keys, and a destination itself is just a pair of public keys and a certificate. DNS-style systems on the other hand allow any of the name servers on the lookup path to mount simple denial of service and spoofing attacks. Adding on a certificate authenticating the responses as signed by some centralized certificate authority would address many of the hostile nameserver issues but would leave open replay attacks as well as hostile certificate authority attacks.
es: I2P no promociona el uso de servicios tipo-DNS, ya que el daño hecho al secuestrar un sitio puede ser tremedo - y los destinos inseguros no tienen valor. El propio DNSsec aún se respalda sobre los registradores y las autoridades de certificados, mientras que con I2P las solicitudes enviadas a un destino no pueden ser interceptadas, o la respuesta falseada (`spoofed`), ya que están cifradas hasta recibir las claves públicas del destino, y un destino en si mismo es sólo un par de claves públicas y un certificado. Por otra parte, los sistemas estilo-DNS permiten a cualquiera de los servidores de nombres en la ruta de la consulta, montar sencillos ataques de denegación de servicio (DoS) y de falsificación (`spoofing`). Añadir un certificado autentificando las respuestas como firmadas por alguna autoridad centralizada de certificados podría solventar muchos de los problemas con servidores de nombres hostiles, pero también dejaría abiertos los ataques de respuesta así como los ataques de autoridades de certificados hostiles.

source: Voting style naming is dangerous as well, especially given the effectiveness of Sybil attacks in anonymous systems - the attacker can simply create an arbitrarily high number of peers and "vote" with each to take over a given name. Proof-of-work methods can be used to make identity non-free, but as the network grows the load required to contact everyone to conduct online voting is implausible, or if the full network is not queried, different sets of answers may be reachable.
es: El estilo de voto de nombres también es peligroso, especialmente dada la efectividad de ataques Sybil en sistemas anónimos - el atacante simplemente puede crear arbitrariamente un alto número de pares (`peers`) y "votar" con cada uno para conquistar un determinado nombre. Métodos prueba-de-trabajo pueden usarse para hacer la identidad no-gratuita, pero al crecer la red, la carga necesaria para contactar con todos para realizar una votación en línea no es plausible, o si no se consulta a la red completa diferentes grupos de respuestas pueden ser alcanzables.

source: As with the Internet however, I2P is keeping the design and operation of a naming system out of the (IP-like) communication layer. The bundled naming library includes a simple service provider interface which <a href="#alternatives">alternate naming systems</a> can plug into, allowing end users to drive what sort of naming tradeoffs they prefer.
es: Sin embargo, como sucede con Internet, I2P está manteniendo el diseño y las operaciones de un sistema de nombres fuera de la capa de comunicación (al estilo-IP). La librería de nombres empaquetada incluye una interfaz sencilla de proveedor de servicios a la que los <a href="#alternatives">sistemas de nombres alternativos</a> pueden enchufarse, permitiendo a los usuarios finales dirigir la clase de compromisos de equilibrio con los nombres que ellos prefieran.

source: See also <a href="https://zooko.com/distnames.html">Names: Decentralized, Secure, Human-Meaningful: Choose Two</a>.
es: Vea también <a href="http://wayback.archive.org/web/20120204172516/http://zooko.com/distnames.html">Nombres: descentralizados, seguros, con-significado-humano: escoja dos</a>.

source: (adapted from a post in the old Syndie, November 26, 2005)
es: (adaptado desde un post en el antiguo Syndie, 26 de noviembre de 2005)

source: Q: What to do if some hosts do not agree on one address and if some addresses are working, others are not? Who is the right source of a name?
es: P: ¿Qué hacer si algunos servidores no están de acuerdo con una de las direcciones, y si algunas de las direcciones están funcionando y otras no? ¿Quién es la fuente correcta de un nombre?

source: A: You don't. This is actually a critical difference between names on I2P and how DNS works - names in I2P are human readable, secure, but <b>not globally unique</b>. This is by design, and an inherent part of our need for security.
es: R: Tú no. En realidad esta es una diferencia crítica entre los nombres en I2P y como funciona DNS - los nombres en I2P son legibles por humanos, seguros, pero <b>no globalmente únicos</b>. Esto es así por diseño, y una parte inherente de nuestra necesidad de seguridad.

source: If I could somehow convince you to change the destination associated with some name, I'd successfully "take over" the site, and under no circumstances is that acceptable. Instead, what we do is make names <b>locally unique</b>: they are what <i>you</i> use to call a site, just as how you can call things whatever you want when you add them to your browser's bookmarks, or your IM client's buddy list. Who you call "Boss" may be who someone else calls "Sally".
es: Si yo pudiese convencerle de alguna forma de cambiar la destinación asociada a algún nombre, yo habría "tomado control" de la web, y esto no es aceptable bajo ninguna circunstancia. En su lugar, lo que hacemos es hacer que los nombres sean <b>únicos localmente</b>: son lo que <i>usted</i> normalmente llamaría un web, al igual que puede llamar a las cosas como desea cuando las añade los favoritos de su navegador, o a su lista de amigos de su cliente de mensajería. Aquél al que llama "jefe" puede ser alguien llamado "Sally".

source: Names will not, ever, be securely human readable and globally unique.
es: Los nombres no serán, nunca, legibles por humanos con-total-certeza, ni globalmente únicos.

source: The following from zzz is a review of several common complaints about I2P's naming system.
es: Lo siguiente, desde el sitio de zzz, es un compendio de varias quejas comunes acerca del sistema de nombres de I2P.

source: <b>Inefficiency:</b> The whole hosts.txt is downloaded (if it has changed, since eepget uses the etag and last-modified headers). It's about 400K right now for almost 800 hosts.
es: <b>Ineficiencia:</b> El fichero hosts.txt completo se descarga (si ha cambiado, ya que eepget usa la ETag (etiqueta de entidad HTTP) y las últimas cabeceras modificadas). Ahora ocupa alrededor de 400KB para casi 800 servidores.

source: True, but this isn't a lot of traffic in the context of i2p, which is itself wildly inefficient (floodfill databases, huge encryption overhead and padding, garlic routing, etc.). If you downloaded a hosts.txt file from someone every 12 hours it averages out to about 10 bytes/sec.
es: Cierto, pero esto no es mucho tráfico en el contexto de I2P, que en si mismo es salvajemente ineficiente (bases de datos inundadas, enorme tráfico de control por la encriptación y tráfico por esquemas de relleno, enrutado ajo (`garlic`), etc.). Si usted descargó un fichero hosts.txt desde alguien cada 12 horas, esto hace una media de unos 10 bytes/s.

source: As is usually the case in i2p, there is a fundamental tradeoff here between anonymity and efficiency. Some would say that using the etag and last-modified headers is hazardous because it exposes when you last requested the data. Others have suggested asking for specific keys only (similar to what jump services do, but in a more automated fashion), possibly at a further cost in anonymity.
es: Tal y como habitualmente es el caso en I2P, aquí hay un equilibrio fundamental entre anonimato y eficiencia. Alguien diría que usar las cabeceras (HTTP) ETag y de última modificación es arriesgado porque expone la última vez que solicitó los datos. Otros han sugerido pedir sólo claves específicas (de forma similar a lo que hacen los servicios de salto (jump, de direccionamiento distribuido), pero de un modo más automatizado), posiblemente a un coste superior en anonimato.

source: Possible improvements would be a replacement or supplement to addressbook (see <a href="http://%(i2host)s/">%(i2host)sp</a>), or something simple like subscribing to http://example.i2p/cgi-bin/recenthosts.cgi rather than http://example.i2p/hosts.txt. If a hypothetical recenthosts.cgi distributed all hosts from the last 24 hours, for example, that could be both more efficient and more anonymous than the current hosts.txt with last-modified and etag.
es: Posibles mejoras serían un reemplazo o suplemento a la libreta de direcciones (vea <a href="http://%(i2host)s/">%(i2host)sp</a>), o algo sencillo como suscribirse a http://example.i2p/cgi-bin/recenthosts.cgi en lugar de http://example.i2p/hosts.txt, por ejemplo, si hubiera un hipotético recenthosts.cgi desplegado en todos los servidores en las últimas 24 horas, que pudiera ser tanto más eficiente como más anónimo que el actual hosts.txt con las últimas modificaciones y ETag.

source: A sample implementation is on stats.i2p at <a href="%(url)s">%(url)s</a>. This script returns an Etag with a timestamp. When a request comes in with the If-None-Match etag, the script ONLY returns new hosts since that timestamp, or 304 Not Modified if there are none. In this way, the script efficiently returns only the hosts the subscriber does not know about, in an addressbook-compatible manner.
es: Una implementación de ejemplo está en stats.i2p en <a href="%(url)s">%(url)s</a>. Este script devuelve un ETag con marcas de tiempo. Cuando una solicitud entra con el ETag If-None-Match (si ninguno coincide), el script SÓLO devuelve nuevos servidores desde esa marca de tiempo, o `304 No Modificado` si no hay ninguno. De esta manera el script devuelve eficientemente sólo los servidores de los que el suscriptor no tenga conocimiento, de una manera compatible-con-la-libreta-de-direcciones.

source: So the inefficiency is not a big issue and there are several ways to improve things without radical change.
es: Así que la ineficiencia no es un gran problema y hay varias formas de mejorar las cosas sin un cambio radical.

source: <b>Not Scalable:</b> The 400K hosts.txt (with linear search) isn't that big at the moment and we can probably grow by 10x or 100x before it's a problem.
es: <b>No escalable:</b> El fichero hosts.txt de 400KB (con búsqueda lineal) no es tan grande de momento, y probablemente podamos crecer por un factor de 10x o 100x antes de que sea un problema.

source: As far as network traffic see above. But unless you're going to do a slow real-time query over the network for a key, you need to have the whole set of keys stored locally, at a cost of about 500 bytes per key.
es: En cuanto al tráfico de red, vea más arriba. Pero a no ser que vaya a hacer una petición a tiempo real lenta sobre la red para obtener una clave, necesita tener todo el grupo de claves almacenadas localmente, con el coste de unos 500 bytes por clave.

source: <b>Requires configuration and "trust":</b> Out-of-the-box addressbook is only subscribed to http://www.i2p2.i2p/hosts.txt, which is rarely updated, leading to poor new-user experience.
es: <b>Requiere configuración y "confianza":</b> La libreta de direcciones lista para usar sólo está suscrita a http://www.i2p2.i2p/hosts.txt, la cual raramente se actualiza, creando una experiencia pobre para los principiantes.
