Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: The interaction of the routing algorithms with the streaming lib strongly affects performance. In particular, random distribution of messages to multiple tunnels in a pool leads to a high degree of out-of-order delivery which results in smaller window sizes than would otherwise be the case. The router currently routes messages for a single from/to destination pair through a consistent set of tunnels, until tunnel expiration or delivery failure. The router's failure and tunnel selection algorithms should be reviewed for possible improvements.
es: La interacción de los algoritmos de enrutado con la librería streaming afecta fuertemente al rendimiento. En particular, la distribución aleatoria de mensajes a múltiples túneles entre los que están en depósito, lleva a un alto grado de entregas estropeadas que resultan en tamaños de ventana más pequeños de lo que serían en otro caso. Actualmente el router enruta mensajes para un único par desde/hacia el destino a través de un conjunto consistente de túneles, hasta la expiración del túnel o un fallo en la entrega. El fallo del router y los algoritmos de selección del túnel deben ser revisados en busca de posibles mejoras.

source: The data in the first SYN packet may exceed the receiver's MTU.
es: Los datos en el primer paquete SYN (sincronizar) pueden exceder la MTU (Unidad Máxima de Transporte) del receptor.

source: The DELAY_REQUESTED field could be used more.
es: El campo DELAY_REQUESTED (demora requerida) podría ser usado más.

source: Duplicate initial SYNCHRONIZE packets on short-lived streams may not be recognized and removed.
es: Los paquetes iniciales SYNCHRONIZE duplicados sobre streams de vida-corta pueden ser no reconocidos y eliminados.

source: Don't send the MTU in a retransmission.
es: No envía la MTU en una retransmisión.

source: Data is sent along unless the outbound window is full. (i.e. no-Nagle or TCP_NODELAY) Probably should have a configuration option for this.
es: Los datos se envían al recorrido a menos que la ventana de salida esté llena (es decir sin-Nagle o TCP_NODELAY). Probablemente debe haber una opción de configuración para esto.

source: zzz has added debug code to the streaming library to log packets in a wireshark-compatible (pcap) format; Use this to further analyze performance. The format may require enhancement to map more streaming lib parameters to TCP fields.
es: zzz ha añadido código de depuración a la librería streaming para registrar (`log`) paquetes en un formato compatible-wireshark (pcap); utilice esto para analizar el rendimiento con mayor detalle. El formato puede requerir mejoras para mapear más parámetros de librería streaming en campos TCP.

source: There are proposals to replace the streaming lib with standard TCP (or perhaps a null layer together with raw sockets). This would unfortunately be incompatible with the streaming lib but it would be good to compare the performance of the two.
es: Hay propuestas para reemplazar la librería streaming con TCP estándar (o quizá con una capa vacía junto con sockets crudos (`raw`)). Desafortunadamente esto sería incompatible con la librería streaming pero sería bueno para comparar el rendimiento de los dos.

source: May 2014
es: Mayo de 2014

source: There are several bittorrent clients and trackers on I2P. As I2P addressing uses a Destination instead of an IP and port, minor changes are required to tracker and client software for operation on I2P. These changes are specified below. Note carefully the guidelines for compatibility with older I2P clients and trackers.
es: Hay varios clientes bittorrent y trackers sobre I2P. Como el direccionamiento de I2P usa un Destino en lugar de IP y puerto, los cambios que se requieren en los softwares del tracker y del cliente para operar sobre I2P son menores. Estos cambios se especifican debajo. Observe con cuidado las directrices para compatibilidad con anteriores clientes y trackers I2P.

source: This page specifies protocol details common to all clients and trackers. Specific clients and trackers may implement other unique features or protocols.
es: Esta página especifica detalles del protocolo comunes a todos los clientes y trackers. Los clientes y trackers específicos pueden implementar otras características únicas o protocolos.

source: We welcome additional ports of client and tracker software to I2P.
es: Son bienvenidos puertos adicionales de software de cliente y tracker para I2P.

source: Announces
es: Anuncios

source: Clients generally include a fake port=6881 parameter in the announce, for compatibility with older trackers. Trackers may ignore the port parameter, and should not require it.
es: Los clientes generalmente incluyen un parámetro falso port=6881 en el anuncio, por compatibilidad con anteriores trackers. Los trackers pueden ignorar el parámetro port (puerto), y no deberían necesitarlo.

source: The ip parameter is the base 64 of the client's <a href="%(commonstructures)s#struct_Destination">Destination</a>, using the I2P Base 64 alphabet [A-Z][a-z][0-9]-~. <a href="%(commonstructures)s#struct_Destination">Destinations</a> are 387+ bytes, so the Base 64 is 516+ bytes. Clients generally append ".i2p" to the Base 64 Destination for compatibility with older trackers. Trackers should not require an appended ".i2p".
es: El parámetro IP es la base 64 de la <a href="%(commonstructures)s#struct_Destination">Destinación</a> del cliente, usando el alfabeto I2P Base 64 [A-Z][a-z][0-9]-~. Las <a href="%(commonstructures)s#struct_Destination">Destinaciones</a> son de 387+ bytes, con lo que la Base 64 es de 516+ bytes. Los clientes generalmente añaden ".i2p" a la Destinación Base 64 para mantener la compatibilidad con los trackers antiguos. Los trackers no deberían necesitar añadir ".i2p" al final.

source: Other parameters are the same as in standard bittorrent.
es: Otros parámetros son los mismos que en el bittorrent estandar.

source: While all current Destinations for clients are exactly 387 bytes, a tracker should not presume that will always be so. A reasonable maximum to assume, for now, is 475 bytes. As the tracker must decode the Base64 to deliver compact responses (see below), the tracker should probably decode and reject bad Base64 when announced.
es: Aunque todos los Destinos actuales para clientes son exactamente de 387 bytes, un tracker no debería presumir que siempre será así. Un valor máximo razonable a asumir, por ahora, es 475 bytes. Como el tracker debe decodificar la Base64 para entregar respuestas compactas (vea debajo), el tracker probablemente debe decodificar y rechazar las Base64 defectuosas cuando se anuncie.

source: The default response type is non-compact. Clients may request a compact response with the parameter compact=1. A tracker may, but is not required to, return a compact response when requested.
es: La respuesta tipo predeterminada es no-compacta. Los clientes pueden solicitar una respuesta compacta con el parámetro compact=1. Un tracker podría, pero no es un requisito, devolver una respuesta compacta cuando se le solicite.

source: Developers of new I2P clients are strongly encouraged to implemenent announces over their own tunnel rather than the HTTP client proxy at port 4444. Doing so is both more efficient and it allows destination enforcement by the tracker (see below).
es: A los desarrolladores de nuevos clientes I2P se les anima fuertemente a implementar anuncios sobre su propio túnel en lugar de sobre el proxy del cliente HTTP en el puerto 4444. Hacerlo así es tanto más eficiente como a su vez permite al tracker aplicar destinos (vea debajo).

source: There are no known I2P clients or trackers that currently support UDP announce/responses.
es: No hay clientes o trackers I2P conocidos que actualmente soporten anuncios/respuestas UDP.

source: Non-Compact Tracker Responses
es: Respuestas de tracker no-compactas

source: The non-compact response is just as in standard bittorrent, with an I2P "ip".
es: La respuesta no-compacta es como la del bittorrent estándar, con una "ip" I2P.

source: Trackers generally include a fake port key, or use the port from the announce, for compatibility with older clients. Clients must ignore the port parameter, and should not require it.
es: Los trackers generalmente incluyen un clave de puerto falsa, o usan el puerto del anuncio, por compatibilidad con anteriores clientes. Los clientes deben ignorar el parámetro port (puerto), y no deben solicitarlo.

source: The value of the ip key is the base 64 of the client's <a href="%(commonstructures)s#struct_Destination">Destination</a>, as described above. Trackers generally append ".i2p" to the Base 64 Destination if it wasn't in the announce ip, for compatibility with older clients. Clients should not require an appended ".i2p" in the responses.
es: El valor de la clave ip es la base 64 del <a href="%(commonstructures)s#struct_Destination">Destino</a> del cliente, como se describe arriba. Los trackers generalmente añaden ".i2p" al final del Destino Base 64 si no estaba en el ip del anuncio, por compatibilidad con anteriores clientes. Los clientes no deben solicitar un sufijo ".i2p" en las respuestas.

source: Other response keys and values are the same as in standard bittorrent.
es: Otras claves y valores de respuesta son los mismos que en el bittorrent estandar.

source: Compact Tracker Responses
es: Respuestas de tracker compactas

source: In the compact response, the value of the "peers" dictionary key is a single byte string, whose length is a multiple of 32 bytes. This string contains the concatenated <a href="%(commonstructures)s#type_Hash">32-byte SHA-256 Hashes</a> of the binary <a href="%(commonstructures)s#struct_Destination">Destinations</a> of the peers. This hash must be computed by the tracker, unless destination enforcement (see below) is used, in which case the hash delivered in the X-I2P-DestHash or X-I2P-DestB32 HTTP headers may be converted to binary and stored. The peers key may be absent, or the peers value may be zero-length.
es: En la respuesta compacta, el valor de la clave de diccionario de los "peers" (pares) es una única cadena de bytes, cuya longitud es un múltiplo de 32 bytes. Esta cadena contiene los <a href="%(commonstructures)s#type_Hash">Hashes SHA-256 de 32-bytes</a> concatenados del binario <a href="%(commonstructures)s#struct_Destination">Destinos</a> de los pares. Este `hash` (identificador único) debe calcularse por el tracker, a menos que use aplicación en destino (vea debajo), en cuyo caso el identificador (`hash`) entregado en las cabeceras HTTP X-I2P-DestHash o X-I2P-DestB32 puede ser convertido a binario y almacenado. La clave de los pares (`peers`) puede estar ausente, o el valor de los pares puede tener longitud-cero.

source: While compact response support is optional for both clients and trackers, it is highly recommended as it reduces the nominal response size by over 90&#37;.
es: Aunque el soporte para respuesta compacta es opcional para ambos, clientes y trackers, es altamente recomendable ya que reduce el tamaño nominal de respuesta alrededor de un 90&#37;.

source: Destination Enforcement
es: Aplicación en destino

source: Some, but not all, I2P bittorrent clients announce over their own tunnels. Trackers may choose to prevent spoofing by requiring this, and verifying the client's <a href="%(commonstructures)s#struct_Destination">Destination</a> using HTTP headers added by the I2PTunnel HTTP Server tunnel. The headers are X-I2P-DestHash, X-I2P-DestB64, and X-I2P-DestB32, which are different formats for the same information. These headers cannot be spoofed by the client. A tracker enforcing destinations need not require the ip announce parameter at all.
es: Algunos clientes de torrent de I2P, aunque no todos, anuncian sus propios túneles. Los trackers pueden elegir el prevenir engaños exigiéndolos, y verificando la <a href="%(commonstructures)s#struct_Destination">Destinación</a> de los clientes usando las cabeceras añadidas por el túnel servidor HTTP I2PTunnel. Las cabeceras son X-I2P-DestHash, X-I2P-DestB64, y X-I2P-DestB32, que son diferentes formatos para la misma información. Estas cabeceras no pueden ser falseadas por el cliente. Un tracker exigiendo destinaciones no necesita el parámetro de anuncio de la ip para nada.

source: As several clients use the HTTP proxy instead of their own tunnel for announces, destination enforcement will prevent usage by those clients unless or until those clients are converted to announcing over their own tunnel.
es: Como varios clientes usan el proxy HTTP en lugar de sus propios túneles para los anuncios, la aplicación de destino (en el tracker) prevendrá su uso por aquellos clientes a menos que, o hasta que, aquellos clientes se reconviertan para anunciarse sobre sus propios túneles.

source: Unfortunately, as the network grows, so will the amount of maliciousness, so we expect that all trackers will eventually enforce destinations. Both tracker and client developers should anticipate it.
es: Desafortunadamente, al crecer la red, también lo hará la cantidad de maliciosidad, así que esperamos que en su momento todos los trackers apliquen los destinos. Ambos, desarrolladores de trackers y clientes deben anticiparlo.

source: Announce Host Names
es: Nombres de Servidor de Anuncio

source: Announce URL host names in torrent files generally follow the <a href="%(naming)s">I2P naming standards</a>. In addition to host names from address books and ".b32.i2p" Base 32 hostnames, the full Base 64 Destination (with [or without?] ".i2p" appended) should be supported. Non-open trackers should recognize their own host name in any of these formats.
es: Los nombres de servidor de URLs de anuncio en los archivos torrent siguen generalmente los <a href="%(naming)s">estándares de nombres I2P</a>. Además de los nombres de servidor de las libretas de direcciones y los nombre de servidor Base 32 ".b32.i2p", el Destino Base 64 completo (con [¿o sin?] sufijo ".i2p"] debe ser soportado. Los trackers no-abiertos deben reconocer sus propios nombres de servidor en cualquiera de estos formatos.

source: To preserve anonymity, clients should generally ignore non-I2P announce URLs in torrent files.
es: Para preservar el anonimato, los clientes por lo general deben ignorar URLs de anuncio no-I2P en los ficheros torrent.

source: Client Connections
es: Conexiones entre clientes

source: Client-to-client connections use the standard protocol over TCP. There are no known I2P clients that currently support uTP communication.
es: Las conexiones cliente-a-cliente usan el protocolo estándar sobre TCP. Actualmente no hay clientes I2P conocidos que soporten comunicación uTP (Protocol de Transporte utorrent).

source: I2P uses 387+ byte <a href="%(commonstructures)s#struct_Destination">Destinations</a> for addresses, as explained above.
es: I2P usa <a href="%(commonstructures)s#struct_Destination">Destinos</a> de 387+ bytes para direcciones, como se explicó arriba.

source: If the client has only the hash of the destination (such as from a compact response or PEX), it must perform a lookup by encoding it with Base 32, appending ".b32.i2p", and querying the Naming Service, which will return the full Destination if available.
es: Si el cliente tiene sólo el identificador criptográfico (`hash`) del destino (como el de una respuesta compacta o el PEX (protocolo de Intercambio de Pares)), debe realizar una búsqueda codificándolo con Base 32, añadiendo el sufijo ".b32.i2p", y consultando en el Servicio de Nombres, que devolverá el Destino completo si está disponible.

source: If the client has a peer's full Destination it received in a non-compact response, it should use it directly in the connection setup. Do not convert a Destination back to a Base 32 hash for lookup, this is quite inefficient.
es: Si el cliente tiene el Destino completo de un par (`peer`) que recibió en una respuesta no-compacta, debe usarlo directamente en el establecimiento de la conexión. No convierta un Destino de vuelta a un identificador criptográfico (`hash`) Base 32, esto es bastante ineficiente.

source: Cross-Network Prevention
es: Prevención de redes-cruzadas.

source: To preserve anonymity, I2P bittorrent clients generally do not support non-I2P announces or peer connections. I2P HTTP outproxies often block announces. There are no known SOCKS outproxies supporting bittorrent traffic.
es: Para preservar el anonimato, los clientes I2P bittorrent por lo general no soportan anuncios no-I2P, o conexiones de pares (`peers`). Los proxys al exterior (`outproxies`) HTTP de I2P con frecuencia bloquean anuncios. No hay proxys al exterior SOCKS conocidos que soporten tráfico bittorrent.

source: To prevent usage by non-I2P clients via an HTTP inproxy, I2P trackers often block accesses or announces that contain an X-Forwarded-For HTTP header. Trackers should reject standard network announces with IPv4 or IPv6 IPs, and not deliver them in responses.
es: Para prevenir el uso por clientes no-I2P a través de un proxy hacia el interior (`inproxy`) HTTP, los trackers I2P a menudo bloquean accesos o anuncios que contengan una cabecera HTTP X-Forwarded-For. Los trackers deben rechazar anuncios de red estándar con IPs IPv4 o IPv6, y no entregarlos en las respuestas.

source: I2P PEX is based on ut_pex. As there does not appear to be a formal specification of ut_pex available, it may be necessary to review the libtorrent source for assistance. It is an extension message, identified as "i2p_pex" in <a href="http://www.bittorrent.org/beps/bep_0010.html">the extension handshake</a>. It contains a bencoded dictionary with up to 3 keys, "added", "added.f", and "dropped". The added and dropped values are each a single byte string, whose length is a multiple of 32 bytes. These byte strings are the concatenated SHA-256 Hashes of the binary <a href="%(commonstructures)s#struct_Destination">Destinations</a> of the peers. This is the same format as the peers dictionary value in the i2p compact response format specified above. The added.f value, if present, is the same as in ut_pex.
es: El PEX (protocolo de Intercambio de Pares) I2P está basado en ut_pex (utorrent PEX). Como no parece haber una especificación ut_pex formal disponible, puede ser necesario revisar el código fuente de libtorrent para obtener asistencia. Es un mensaje de extensión, identificado como "i2p_pex" en <a href="http://www.bittorrent.org/beps/bep_0010.html">la extensión de toma de contacto (`handshake`)</a>. Contiene un diccionario b-codificado (`bencoded`) con hasta 3 claves, "added" (añadido), "added.f", y "dropped" (descartado). Los valores `added` y `dropped` son cada uno una única cadena de bytes, cuyo tamaño es un múltiplo de 32 bytes. Estas cadenas de bytes son los identificadores criptográficos ('hashes') SHA-256 concatenados del binario <a href="%(commonstructures)s#struct_Destination">Destinos</a> de los pares (`peers`). Este es el mismo formato que el de los valores de diccionario de los pares en el formato de respuesta compacta de I2P especificado arriba. Si está presente, el valor de added.f es el mismo que en ut_pex.

source: DHT support is included in the i2psnark client as of version 0.9.2. Preliminary differences from <a href="http://www.bittorrent.org/beps/bep_0005.html">BEP 5</a> are described below, and are subject to change. Contact the I2P developers if you wish to develop a client supporting DHT.
es: El soporte DHT (tabla de hash dinámica) está incluido en el cliente i2psnark desde la versión 0.9.2. Las diferencias preliminares con la <a href="http://www.bittorrent.org/beps/bep_0005.html">BEP 5</a> (Propuesta de Mejora de Bittorrent 5) están descritas debajo, y están sujetas a cambios. Contacte con los desarrolladores de I2P si quiere desarrollar un cliente con soporte DHT.

source: Unlike standard DHT, I2P DHT does not use a bit in the options handshake, or the PORT message. It is advertised with an extension message, identified as "i2p_dht" in <a href="http://www.bittorrent.org/beps/bep_0010.html">the extension handshake</a>. It contains a bencoded dictionary with two keys, "port" and "rport", both integers.
es: Al contario que DHT (tabla de hash dinámica), I2P DHT no usa bit alguno en las opciones de toma de contacto (`handshake`), o en el mensaje PORT (puerto). Se anuncia con un mensaje de extensión, identificado como "i2p_dht" en <a href="http://www.bittorrent.org/beps/bep_0010.html">la extensión handshake</a>. Contiene un diccionario b-codificado (`bencoded`) con dos claves, "port" y "rport" (puerto de respuesta), ambos enteros.

source: The UDP (datagram) port listed in the compact node info is used to receive repliable (signed) datagrams. This is used for queries, except for announces. We call this the "query port". This is the "port" value from the extension message. Queries use I2CP protocol number 17.
es: Para recibir datagramas respondibles (firmados) se usa el puerto UDP (Protocolo de Datagrama de Usuario) listado en la información del nodo compacto. Este se usa para consultas, excepto para anuncios. Le llamamos el "query port" (puerto de consulta). Es el valor "port" (puerto) del mensaje de extensión. Las consultas usan el protocolo I2CP (Protocolo de Cliente I2P) número 17.

source: In addition to that UDP port, we use a second datagram port equal to the query port + 1. This is used to receive unsigned (raw) datagrams for replies, errors, and announces. This port provides increased efficiency since replies contain tokens sent in the query, and need not be signed. We call this the "response port". This is the "rport" value from the extension message. It must be 1 + the query port. Responses and announces use I2CP protocol number 18.
es: Además de ese puerto UDP, usamos un segundo puerto de datagrama igual al puerto de consulta + 1. Esto se usa para recibir datagramas no firmados (raw (crudos)) para las respuestas, errores, y anuncios. Este puerto proporciona una eficiencia aumentada ya que las respuestas contienen las credenciales (`tokens`) enviadas en la consulta, y no necesitan ser firmadas. Llamamos a esto el "response port" (puerto de respuesta). Este es el valor "rport" del mensaje de extensión. Las respuestas y los anuncios usan el protocolo I2CP número 18.

source: Compact peer info is 32 bytes (32 byte SHA256 Hash) instead of 4 byte IP + 2 byte port. There is no peer port. In a response, the "values" key is a list of strings, each containing a single compact peer info.
es: La información compacta del par (`peer`) son 32 bytes (identificador criptográfico (`hash`) SHA256 de 32 bytes) en lugar de 4 bytes de IP + 2 bytes de puerto. No hay puerto del par. En una respuesta, la clave "values" (valores) es una lista de cadenas, conteniendo cada una la información compacta de un único par.

source: Compact node info is 54 bytes (20 byte SHA1 Hash + 32 byte SHA256 Hash + 2 byte port) instead of 20 byte SHA1 Hash + 4 byte IP + 2 byte port. In a response, the "nodes" key is a single byte string with concatenated compact node info.
es: La información de nodo compacto son 54 bytes (20 bytes de hash SHA1 + 32 bytes de hash SHA256 + 2 bytes de puerto) en lugar de 20 bytes de hash SHA1 + 4 bytes de IP + 2 bytes de puerto. En una respuesta, la clave "nodes" (nodos) es una única cadena de bytes con la información concatenada de nodo compacto.
