Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: From an anonymity perspective, there is much similarity when the core networks are compared. However, there are a few key differences. When dealing with an internal adversary or most external adversaries, I2P's simplex tunnels expose half as much traffic data than would be exposed with Tor's duplex circuits by simply looking at the flows themselves - an HTTP request and response would follow the same path in Tor, while in I2P the packets making up the request would go out through one or more outbound tunnels and the packets making up the response would come back through one or more different inbound tunnels. While I2P's peer selection and ordering strategies should sufficiently address predecessor attacks, should a switch to bidirectional tunnels be necessary, we could simply build an inbound and outbound tunnel along the same routers.
es: Desde el punto de vista del anonimato, cuando comparamos el núcleo de las redes hay muchas similaridades entre ellos. Pero hay unas cuantas diferencias claves. Cuando se trata de lidiar con adversario interno o varios adversarios externos observando los propios flujos de datos, los túneles simples de I2P exponen la mitad de información en el tráfico de lo que exponen los circuitos dobles de Tor - una petición y respuesta HTTP seguirían el mismo camino en Tor, mientras que I2P el paquete que hace la consulta iría a través de uno o más túneles y el paquete con la respuesta regresarían a través de otro o más túneles de entrada diferentes. Mientras que la selección del orden y estrategias por parte del par deberían ser suficientes para enfrentarse a los ataques de predecesor, podríamos simplemente construir un túnel de entrada y de salida a través de los mismos ruters.

source: Another anonymity issue comes up in Tor's use of telescopic tunnel creation, as simple packet counting and timing measurements as the cells in a circuit pass through an adversary's node exposes statistical information regarding where the adversary is within the circuit. I2P's unidirectional tunnel creation with a single message so that this data is not exposed. Protecting the position in a tunnel is important, as an adversary would otherwise be able to mount a series of powerful predecessor, intersection, and traffic confirmation attacks.
es: Otro problema para el anonimato aparece en el uso por parte de Tor de la creación telescópica de túnel, un simple contador y medidor de tiempo de los paquetes que pasan a través de un nodo enemigo puede obtener información estadística sobre la posición de la víctima en el circuito. La creación unidireccional para cada mensaje en I2P hace que esta información no sea expuesta. Ocultar la posición de un túnel es importante, ya que un adversario podría montar una serie de potentes ataques como el de predecesores, intersección y confirmación de tráfico.

source: Tor's support for a second tier of "onion proxies" does offer a non-trivial degree of anonymity while requiring a low cost of entry, while I2P will not offer this topology until <a href="#future.restricted">2.0</a>.
es: El soporte de Tor de un segundo nivel de "onion proxies" ofrece un grado de anonimato nada trivial, mientras que requiere un bajo coste de entrada, mientras que I2P no ofrecerá este tipo de topoligía hasta la versión <a href="#future.restricted">2.0</a>.

source: On the whole, Tor and I2P complement each other in their focus - Tor works towards offering high speed anonymous Internet outproxying, while I2P works towards offering a decentralized resilient network in itself. In theory, both can be used to achieve both purposes, but given limited development resources, they both have their strengths and weaknesses. The I2P developers have considered the steps necessary to modify Tor to take advantage of I2P's design, but concerns of Tor's viability under resource scarcity suggest that I2P's packet switching architecture will be able to exploit scarce resources more effectively.
es: En conjunto, Tor e I2P se complementan el uno al otro - Tor funciona ofreciendo outproxing a Internet de alta velocidad y anónimo, mientras que I2P ofrece una red resistente y descentralizada dentro de sí mismo. En teoría se pueden usar los 2 para obtener los mismos fines, pero dados los limitados recursos de desarrollo, ambos tienen sus ventajas e inconvenientes. Los desarrolladores de I2P han considerado los pasos necesarios para modificar Tor para para la mejora del diseño de I2P, pero preocupaciones sobre la viabilidad de Tor con bajo escasos recursos sugiere que la arquitectura de enrutamiento de paquetes de I2P será capaz de funcionar más eficientemente con recursos escasos.

source: Freenet played a large part in the initial stages of I2P's design - giving proof to the viability of a vibrant pseudonymous community completely contained within the network, demonstrating that the dangers inherent in outproxies could be avoided. The first seed of I2P began as a replacement communication layer for Freenet, attempting to factor out the complexities of a scalable, anonymous and secure point to point communication from the complexities of a censorship resistant distributed data store. Over time however, some of the anonymity and scalability issues inherent in Freenet's algorithms made it clear that I2P's focus should stay strictly on providing a generic anonymous communication layer, rather than as a component of Freenet. Over the years, the Freenet developers have come to see the weaknesses in the older design, prompting them to suggest that they will require a "premix" layer to offer substantial anonymity. In other words, Freenet needs to run on top of a mixnet such as I2P or Tor, with "client nodes" requesting and publishing data through the mixnet to the "server nodes" which then fetch and store the data according to Freenet's heuristic distributed data storage algorithms.
es: Freenet jugó un rol importante en los primeros pasos del diseño de I2P - mostrando pruebas de la viabilidad de una comunidad vibrante completamente dentro de la red, mostrando que los peligros inherentes de los outproxies podían ser evitados. La primera semilla de I2P comenzó como el remplazo de una capa de comunicación para Freenet, al intentar extraer la complejidad de una comunicación de punto a punto segura y anónima de las complicaciones del almacenamiento distribuido resistente a la censura. Aunque la final, algunos de los problemas de escalabilidad y anonimato inherentes a los algoritmos de Freenet dejó claro que debería enfocarse I2P para proveer una capa de comunicación anónima por sí misma en vez de ser un componente de Freenet. A través de los años, los desarrolladores de Freenet se han dado cuenta de las debilidades del viejo diseño, provocando que sugiriese la necesidad de una capa de "pre mezcla" para ofrecer el suficiente anonimato. En otras palabras, Freenet debe ejecutarse sobre una mixnet como I2P o Tor, con "nodos cliente" solicitando y publicando datos a través de la mixnet a los "nodos servidores" los cuales entonces almacenan los datos de acuerdo con la heurística de los algoritmos de almacenamiento de datos distribuidos de Freenet.

source: Freenet's functionality is very complementary to I2P's, as Freenet natively provides many of the tools for operating medium and high latency systems, while I2P natively provides the low latency mix network suitable for offering adequate anonymity. The logic of separating the mixnet from the censorship- resistant distributed data store still seems self-evident from an engineering, anonymity, security, and resource allocation perspective, so hopefully the Freenet team will pursue efforts in that direction, if not simply reusing (or helping to improve, as necessary) existing mixnets like I2P or Tor.
es: Las funcionalidades de Freenet son muy complementarias a las de I2P, ya que Freenet provee nativamente muchas herramientas para operar en sistemas de media y alta latencia, mientras que I2P provee nativamente una red de baja latencia adecuada para ofrecer anonimato. La lógica para separar la mixnet de los datos distribuidos resistentes a censura, son muy evidentes desde la perspectiva del anonimato, seguridad y de la asignación de los recursos, con lo que esperamos que el equipo de Freenet ponga sus esfuerzos en esta dirección, aunque sea reutilizando (o ayudando a mejorar, si es necesario) las redes existentes como I2P y Tor.

source: It is worth mentioning that there has recently been discussion and work by the Freenet developers on a "globally scalable darknet" using restricted routes between peers of various trust. While insufficient information has been made publicly available regarding how such a system would operate for a full review, from what has been said the anonymity and scalability claims seem highly dubious. In particular, the appropriateness for use in hostile regimes against state level adversaries has been tremendously overstated, and any analysis on the implications of resource scarcity upon the scalability of the network has seemingly been avoided. Further questions regarding susceptibility to traffic analysis, trust and other topics do exist, but a more in-depth review of this "globally scalable darknet" will have to wait until the Freenet team makes more information available.
es: Vale la pena mencionar que recientemente ha habido discusiones y trabajos realizados por los desarrolladores de Freenet sobre una "darknet escalable global" usando pares restringidos entre pares de varias confianzas. Mientras que no se ha hecho pública suficiente información sobre como funcionará ese sistema para una revisión completa, pero lo que se ha dicho del anonimato y la escalabilidad parecen ser muy dudoso. En particular, el uso apropiado de su uso contra regímenes hostiles ha sido exagerado, y cualquier análisis de las implicaciones sobre la escasez de recursos sobre la escalabilidad de la red han sido aparentemente evitados. Existen otras preguntas sobre la posibilidad de análisis del tráfico, confianza y otros temas, pero hace falta una revisión más profunda de esta "darknet escalable global", pero deberán esperar hasta que el equipo de Freenet ponga más información a disposición.

source: I2P itself doesn't really do much - it simply sends messages to remote destinations and receives messages targeting local destinations - most of the interesting work goes on at the layers above it. By itself, I2P could be seen as an anonymous and secure IP layer, and the bundled <a href="#app.streaming">streaming library</a> as an implementation of an anonymous and secure TCP layer on top of it. Beyond that, <a href="#app.i2ptunnel">I2PTunnel</a> exposes a generic TCP proxying system for either getting into or out of the I2P network, plus a variety of network applications provide further functionality for end users.
es: En sí, I2p no hace mucho - simplemente envía mensajes a destinaciones remotas y recibe mensajes hacia destinaciones locales - la mayoría del trabajo interesante es sobre las capas que hay sobre I2P. Por sí mismo I2P puede verse como una capa de IP anónima y segura, y la <a href="#app.streaming">librería streaming</a> incluida como una implementación de una capa TCP segura y anónima sobre I2P. Más allá de esto, el <a href="#app.i2ptunnel">I2PTunnel</a> expone un sistema genérico TCP para entrar dentro o salir de la red I2P, más una gran variedad de aplicaciones para proveer más funcionalidades a los usuarios finales.

source: Streaming library
es: Librería de transmisión

source: The I2P streaming library can be viewed as a generic streaming interface (mirroring TCP sockets), and the implementation supports a <a href="http://en.wikipedia.org/wiki/Sliding_Window_Protocol">sliding window protocol</a> with several optimizations, to take into account the high delay over I2P. Individual streams may adjust the maximum packet size and other options, though the default of 4KB compressed seems a reasonable tradeoff between the bandwidth costs of retransmitting lost messages and the latency of multiple messages.
es: La librería de streaming de I2P puede verse como un interfaz genérico de streaming (reflejando sockets TCP), y la implementación soporta el <a href="http://en.wikipedia.org/wiki/Sliding_Window_Protocol">protocolo sliding window</a> con varias optimizaciones, para tener en cuenta los altos retardos en I2P. Los streams individuales pueden ajustar el tamaño máximo de paquetes y otras opciones, aunque la compresión por defecto de 4KB parece una compensación razonable entre el coste de ancho de banda de reenviar los mensajes perdidos y la latencia de múltiples mensajes.

source: In addition, in consideration of the relatively high cost of subsequent messages, the streaming library's protocol for scheduling and delivering messages has been optimized to allow individual messages passed to contain as much information as is available. For instance, a small HTTP transaction proxied through the streaming library can be completed in a single round trip - the first message bundles a SYN, FIN and the small payload (an HTTP request typically fits) and the reply bundles the SYN, FIN, ACK and the small payload (many HTTP responses fit). While an additional ACK must be transmitted to tell the HTTP server that the SYN/FIN/ACK has been received, the local HTTP proxy can deliver the full response to the browser immediately.
es: Además, considerando el alto coste de un mensaje, la librería de streaming para programar y enviar mensajes ha sido optimizada para permitir que los mensajes individuales enviados contengan tanta información como esté disponible. Por ejemplo, una pequeña transacción HTTP enviada a través de la librería de streaming puede ser completada en una simple vuelta - el primer mensaje empaqueta a SYN, FIN y un pequeña carga (normalmente encaja una solicitud HTTP) y la respuesta empaqueta el SYN, FIN, ACK y una pequeña carga (muchas respuestas HTTP encajan). Mientras que el ACK adicional debe ser transmitido para decirle al servido HTTP que el SYN/FIN/ACK ha llegado, el proxy HTTP local puede enviar al navegador inmediatamente la respuesta completa.

source: On the whole, however, the streaming library bears much resemblance to an abstraction of TCP, with its sliding windows, congestion control algorithms (both slow start and congestion avoidance), and general packet behavior (ACK, SYN, FIN, RST, etc).
es: En conjunto, la librería de streaming se parece mucho a una abstracción de TCP, con sus sliding windows, algoritmos de control de congestión (inicio lento e impedimento de congestiones), y comportamiento general de paquetes (ACK, SYN, FIN, RST, etc).

source: Naming library and addressbook
es: Librería de dominios y libreta de direcciones

source: For more information see the <a href="%(naming)s">Naming and Addressbook</a> page.
es: Para más información vea la web <a href="%(naming)s">librería de dominios y libreta de direcciones </a>.

source: Developed by: %(dev)s
es: Desarrolado por: %(dev)s

source: Naming within I2P has been an oft-debated topic since the very beginning with advocates across the spectrum of possibilities. However, given I2P's inherent demand for secure communication and decentralized operation, the traditional DNS-style naming system is clearly out, as are "majority rules" voting systems. Instead, I2P ships with a generic naming library and a base implementation designed to work off a local name to destination mapping, as well as an optional add-on application called the "addressbook". The addressbook is a web-of-trust-driven secure, distributed, and human readable naming system, sacrificing only the call for all human readable names to be globally unique by mandating only local uniqueness. While all messages in I2P are cryptographically addressed by their destination, different people can have local addressbook entries for "Alice" which refer to different destinations. People can still discover new names by importing published addressbooks of peers specified in their web of trust, by adding in the entries provided through a third party, or (if some people organize a series of published addressbooks using a first come first serve registration system) people can choose to treat these addressbooks as name servers, emulating traditional DNS.
es: Los nombres de dominio en I2P han sido debatidos a menudo desde el principio, con defensores para todos los tipos de posibilidades. Sin embargo, y dada la necesidad de comunicaciones seguras y descentralizadas, el sistema tradicional al estilo DNS no es viable, al igual que no lo son los sistemas de votos en los que la "mayoría manda". Por el contrario, I2P incluye una librería genérica para nombres de dominios y una implementación básica diseñados para trabajar con nombres locales y mapearlos, así como un pluguin opcional llamado "addressbook", lista de direcciones. La lista de direcciones es un sistema de dominios distribuido, basado en un sistema de confianza seguro basado en web y legible, sólo sacrificando el hecho de que los dominios puedan ser leídos por los humanos globalmente para ser sólo entendibles localmente. Ya que todos los mensajes en I2P están dirigidos criptográficamente por su destinación, diferentes personas pueden tener entradas en la lista de direcciones para "Alice", pero refiriéndose a destinaciones diferentes. La gente puede descubrir nuevos nombres importando lista de direcciones publicadas por pares específicos de su web de confianza, añadiendo estas entradas a través de una tercera parte, o (si alguien organiza listas de direcciones usando sistema de registro tipo el primero que entra el primero es servido) la gente puede escoger tratar estas lista de direcciones como servidores de dominio, emulando los DNS tradicionales.

source: I2P does not promote the use of DNS-like services though, as the damage done by hijacking a site can be tremendous - and insecure destinations have no value. DNSsec itself still falls back on registrars and certificate authorities, while with I2P, requests sent to a destination cannot be intercepted or the reply spoofed, as they are encrypted to the destination's public keys, and a destination itself is just a pair of public keys and a certificate. DNS-style systems on the other hand allow any of the name servers on the lookup path to mount simple denial of service and spoofing attacks. Adding on a certificate authenticating the responses as signed by some centralized certificate authority would address many of the hostile nameserver issues but would leave open replay attacks as well as hostile certificate authority attacks.
es: I2P no recomienda el uso de servicios tipo DNS, ya que el daño hecho por una web maliciosas puede ser enorme - una destinación insegura no tiene valor. DNSsec sigue apoyándose en autoridades certificadas, mientras que con I2P las solicitudes a una destinación no pueden ser interceptadas o la respuesta suplantada ya que están cifradas con la clave pública de la destinación, y una destinación en sí misma no es más que un par de claves y un certificado. Por otra parte, los sistemas del tipo DNS permiten que cualquiera de los servidores en el camino de búsqueda pueda montar ataques de denegación de servicio o ataques de suplantación. Añadiendo sobre un certificado autentificándose la respuesta firmada por alguna autoridad centralizada de certificados, podría solucionar muchos de los problemas con los servidores de dominio hostiles, pero lo dejaría abierto a ataques de respuesta y a ataques de autoridad certificada hostil.

source: Voting style naming is dangerous as well, especially given the effectiveness of Sybil attacks in anonymous systems - the attacker can simply create an arbitrarily high number of peers and "vote" with each to take over a given name. Proof-of-work methods can be used to make identity non-free, but as the network grows the load required to contact everyone to conduct online voting is implausible, or if the full network is not queried, different sets of answers may be reachable.
es: El sistema de dominios por votos también es peligroso, sobre todo por la efectividad de los ataques Sybil en sistemas anónimos- el atacante puede simplemente crear un número aleatorio muy grande de pares y "votar" con cada uno para apoderarse de un dominio cualquiera. Existen métodos que pueden usarse para hacer que crear una identidad no sea gratis, pero a medida que la red crece la carga que se necesita para contactar a todos y hacer votación online es enorme, o si no hace falta la red completa, se podrían encontrar otras soluciones.

source: As with the Internet however, I2P is keeping the design and operation of a naming system out of the (IP-like) communication layer. The bundled naming library includes a simple service provider interface which alternate naming systems can plug into, allowing end users to drive what sort of naming tradeoffs they prefer.
es: Aún así, al igual que con Internet, I2P mantiene el diseño y funcionamiento de un sistema de dominios aparte de la capa de comunicación (como IP). La librería de dominios incluye un interfaz simple de servicio al cual puede conectarse cualquier sistema de dominios, permitiendo a los usuarios finales elegir qué tipo de sistema de dominios prefieren.

source: The old Syndie bundled with I2P has been replaced by the new Syndie which is distributed separately. For more information see the <a href="http://syndie.i2p2.de/">Syndie</a> pages.
es: El viejo Syndie incluido con I2P ha sido reemplazado con un nuevo Syndie, el cual es distribuido aparte. Para más información vea la web de <a href="http://syndie.i2p2.de/">Syndie</a>.

source: Syndie is a safe, anonymous blogging / content publication / content aggregation system. It lets you create information, share it with others, and read posts from those you're interested in, all while taking into consideration your needs for security and anonymity. Rather than building its own content distribution network, Syndie is designed to run on top of existing networks, syndicating content through eepsites, Tor hidden services, Freenet freesites, normal websites, usenet newsgroups, email lists, RSS feeds, etc. Data published with Syndie is done so as to offer pseudonymous authentication to anyone reading or archiving it.
es: Syndie es un sistema seguro y anónimo de blogueo / publicación de contenidos / agregación de contenidos. Le permite crear información, compartirla con otros, y leer lo que publican aquellas personas en las que esté interesado, y todo mientras se tiene en cuenta sus necesidades de seguridad y anonimato. En lugar de construir su propia red de distribución de contenidos, Syndie está diseñado para ejecutarse sobre redes ya existentes, sindicando el contenido a través de eepsites, servicios ocultos de Tor, freesites de Freenet, sitios webs normales, grupos de noticias (news) de usenet, listas de correo, suscripciones RSS (feeds), etc. Con los datos publicados con Syndie se hace así para ofrecer autentificación con pseudónimo a cualquiera que lea o archive datos.
