Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: I2P initially began in Feb 2003 as a proposed modification to <a href="http://freenetproject.org">Freenet</a> to allow it to use alternate transports, such as <a href="%(jms)s">JMS</a>, then grew into its own as an 'anonCommFramework' in April 2003, turning into I2P in July, with code being written in earnest starting in August '03. I2P is currently under development, following the <a href="%(roadmap)s">roadmap</a>.
es: I2P comenzó inicialmente en 2003 como una propuesta de modificar <a href="http://freenetproject.org">Freenet</a> para permitir el uso de transportes alternativos, como puede ser <a⏎ href="%(jms)s">JMS</a> , después se desarrolló con identidad propia como una 'anonCommFramework' en Abril de 2003, convirtiéndose en I2P en Julio y comenzando a escribir código seriamente en Agosto de 2003. I2P está actualmente bajo desarrollo siguendo la <a href="%(roadmap)s">hoja de ruta</a>.

source: Who?
es: ¿Quiénes?

source: We have a small <a href="%(team)s">team</a> spread around several continents, working to advance different aspects of the project. We are very open to other developers who want to get involved and anyone else who would like to contribute in other ways, such as critiques, peer review, testing, writing I2P enabled applications, or documentation. The entire system is open source - the router and most of the SDK are outright public domain with some BSD and Cryptix licensed code, while some applications like I2PTunnel and I2PSnark are GPL. Almost everything is written in Java (1.5+), though some third party applications are being written in Python and other languages. The code works on <a href="http://java.com/en/">Sun Java SE</a> and other Java Virtual Machines.
es: Tenemos un pequeño <a href="%(team)s">equipo</a> desperdigado por varios continentes y trabajando en el avance de diferentes aspectos del proyecto. Estamos abiertos a otros desarrolladores que deseen involucrarse en el proyecto, y a cualquier otra persona que quiera contribuir de cualquier forma, como críticas, revisión de pares, pruebas, programación de aplicaciones compatibles I2P, o documentación. El sistema completo es código abierto - el ruter y la mayor parte del SDK tienen licencia de dominio público con algo de código licenciado con BSD y Cryptix, mientras que aplicaciones como I2PTunnel e I2PSnark son GPL. Casi todo está escrito en Java (1.5+), aunque algunas aplicaciones de terceros están siendo escritas en Python u otros lenguajes. El código funciona en <a href="http://java.com/en/">Sun Java SE</a> y otras máquinas virtuales Java.

source: Where?
es: ¿Dónde?

source: Anyone interested should join us on the IRC channel #i2p-dev (hosted concurrently on irc.freenode.net, irc.postman.i2p, irc.echelon.i2p, irc.dg.i2p and irc.oftc.net). There are currently no scheduled development meetings, however <a href="%(meetings)s">archives are available</a>.
es: Cualquier interesado debe unirse a nosotros en el IRC en el canal #i2p-dev (alojado concurrentemente en irc.freenode.net, irc.postman.i2p, irc.echelon.i2p, irc.dg.i2p and irc.oftc.net). Actualmente no hay reuniones de desarrollo programadas, sin embargo <a href="%(meetings)s">los archivos están disponibles</a>.

source: The current source is available in <a href="%(monotone)s">monotone</a>.
es: El código actual está disponible en <a href="%(monotone)s">monotone</a>.

source: See <a href="%(docs)s">the Index to Technical Documentation</a>.
es: Vea <a href="%(docs)s">el índice de la documentacón técnica</a>.

source: The Network Database
es: La base de datos de la red

source: I2P's netDb is a specialized distributed database, containing just two types of data - router contact information (<b>RouterInfos</b>) and destination contact information (<b>LeaseSets</b>). Each piece of data is signed by the appropriate party and verified by anyone who uses or stores it. In addition, the data has liveliness information within it, allowing irrelevant entries to be dropped, newer entries to replace older ones, and protection against certain classes of attack.
es: La netDb de I2P es una base de datos distribuida especializada que contiene 2 tipos de datos - información de contacto del ruter y la información de contacto de la destinación. Cada parte de los datos es firmada por la parte apropiada y verificada por cualquiera que las use o las almacene. Además, los datos tienen información cambiante, permitiendo que las entradas irrelevantes sean desechadas, que nuevas entradas puedan reemplazar las antiguas y protección contra cierto tipos de ataques.

source: The netDb is distributed with a simple technique called "floodfill", where a subset of all routers, called "floodfill routers", maintains the distributed database.
es: La netDb se distribuye con una técnica simple llamada "FloodFill", donde un subconjunto de ruters, llamados ruters "floodfill", mantienen la base de datos distribuida.

source: When an I2P router wants to contact another router, they need to know some key pieces of data - all of which are bundled up and signed by the router into a structure called the "RouterInfo", which is distributed with the SHA256 of the router's identity as the key. The structure itself contains:
es: Cuando un ruter I2P quiere contactar con otro ruter, necesitan conocer algunas partes claves de los datos - estas partes están agrupadas y firmadas por el ruter dentro de una estructura llamda "RouterInfo", que es distribuida con el hash SHA256 de la identidad del ruter como una clave de cifrado. La estructura en sí misma contiene:

source: The router's identity (a 2048bit ElGamal encryption key, a signing key, and a certificate)
es: La identidad del router (una clave de cifrado ElGamal de 2048 bits, una clave de firmado, y un certificado)

source: The contact addresses at which it can be reached (e.g. TCP: example.org port 4108)
es: La dirección de contacto en la que puede ser accedida (por ejemplo TCP: example.org puerto 4108)

source: When this was published
es: Cuándo fue publicada.

source: A set of arbitrary text options
es: Un conjunto de opciones de texto arbitrarias

source: The signature of the above, generated by the identity's signing key
es: La firma de lo anterior, generada por la clave de firmado de la identidad.

source: The following text options, while not strictly required, are expected to be present:
es: Las siguientes opciones de texto, que aunque no son requeridas explicitamente se espera que esten presentes:

source: Capabilities flags - used to indicate floodfill participation, approximate bandwidth, and perceived reachability
es: Datos de capacidad - usados para indicar si se participa como floodfill, ancho de banda aproximado y la accesibilidad observada.

source: Hidden
es: Oculto

source: Under %(amount)s shared bandwidth
es: Por debajo del %(amount)s de ancho de banda compartido

source: %(amount)s shared bandwidth
es: %(amount)s de ancho de banda compartido

source: default
es: predeterminado

source: Reachable
es: Alcanzable

source: Unreachable
es: No alcanzable

source: Over %(amount)s shared bandwidth
es: Por encima del %(amount)s de ancho de banda compartido

source: The core library version, always the same as the router version
es: La versión de la librería del núcleo, siempre la misma que la versión del ruter

source: Basic network compatibility - A router will refuse to communicate with a peer having a different netId
es: Compatibilidad básica de la red - Un ruter no se comunicará con un par que tenga un netId diferente

source: Used to determine compatibility with newer features and messages
es: Se utiliza para determinar la compatibilidad con las nuevas características y mensajes.

source: These values are used by other routers for basic decisions. Should we connect to this router? Should we attempt to route a tunnel through this router? The bandwidth capability flag, in particular, is used only to determine whether the router meets a minimum threshold for routing tunnels. Above the minimum threshold, the advertised bandwidth is not used or trusted anywhere in the router, except for display in the user interface and for debugging and network analysis.
es: Estos valores pueden ser usados por otros ruters para tomar decisiones básicas. ¿Deberíamos conectar con este ruter? ¿Deberíamos intentar rutar un túnel a través de ese ruter? En particular, la opción de la capacidad de ancho de banda sólo se usa para determinar cuando el ruter cumple un umbral para poder rutar túneles. Por encima del umbral mínimo el ancho de banda anunciado no es usado o confiable en ningún sitio del ruter, excepto para mostrar en el interfaz del usuario para depurar y para el análisis de tráfico.

source: Additional text options include a small number of statistics about the router's health, which are aggregated by sites such as <a href="http://%(stats)s/">%(stats)s</a> for network performance analysis and debugging. These statistics were chosen to provide data crucial to the developers, such as tunnel build success rates, while balancing the need for such data with the side-effects that could result from revealing this data. Current statistics are limited to:
es: La opciones de texto adicionales incluyen un pequeño número de estadísticas sobre la salud de los ruters, que son añadidas por las webs como <a href="http://%(stats)s/">%(stats)s</a>, estadísticas, para el análisis del rendimiento de la red y su depuración. Estas estadísticas fueron elegidas para proporcionar datos importantes a los desarrolladores, como la tasa de éxito al construir los túneles, mientras se hace un balanceo de los posibles daños causados por la revelación de estos datos y necesidad de obtenerlos. Estas estadísticas están limitadas a:

source: Exploratory tunnel build success, reject, and timeout rates
es: Tasas de creación de túneles exploratorios exitosos, rechazados y con periodo de espera agotado

source: 1 hour average number of participating tunnels
es: Media del número de túneles participantes en 1 hora

source: Floodfill routers publish additional data on the number of entries in their network database.
es: Los routers de inundación (floodfill) publican datos adicionales sobre el número de entradas en sus base de datos de red.

source: The data published can be seen in the router's user interface, but is not used or trusted within the router. As the network has matured, we have gradually removed most of the published statistics to improve anonymity, and we plan to remove more in future releases.
es: Los datos publicados pueden verse en en interfaz del ruter,, pero el ruter no los usa ni confía en ellos. Según madura la red, hemos eliminado la mayoría de las estadísticas publicadas para mejorar el anonimato, y tenemos planeado eliminar más en las próximas versiones.

source: RouterInfo Expiration
es: Caducidad de RouterInfo

source: RouterInfos have no set expiration time. Each router is free to maintain its own local policy to trade off the frequency of RouterInfo lookups with memory or disk usage. In the current implementation, there are the following general policies:
es: RouterInfo no tienen tiempo de caducidad. Cada ruter puede mantener su propia política local a la hora de controlar la frecuencia de las búsquedas de RouterInfo y el uso de memoria y espacio en le disco. En la implementación actual, estas son las políticas generales:

source: There is no expiration during the first hour of uptime, as the persistent stored data may be old.
es: No existe vencimiento durante la primera hora encendido, ya que los datos almacenados podrían ser viejos.

source: There is no expiration if there are 25 or less RouterInfos.
es: No existe vencimiento si hay 25 o menos menos routerInfos

source: As the number of local RouterInfos grows, the expiration time shrinks, in an attempt to maintain a reasonable number RouterInfos. The expiration time with less than 120 routers is 72 hours, while expiration time with 300 routers is around 30 hours.
es: Según aumenta el número de RouterInfos, el tiempo de espiración disminuye, en el intento de mantener un número razonable de RouterInfos . El número de espiración con menos de 120 ruters es de 72 horas, mientras que el tiempo de caducidad con 300 ruters es de 30 horas.

source: RouterInfos containing <a href="%(ssu)s">SSU</a> introducers expire in about an hour, as the introducer list expires in about that time.
es: Los RoutersInfos que contienen introductores <a href="%(ssu)s">SSU</a> expiran en 1 hora más o menos, ya que la lista del introductor expiran en ese mismo tiempo.

source: Floodfills use a short expiration time (1 hour) for all local RouterInfos, as valid RouterInfos will be frequently republished to them.
es: Los FloodFills tienen un tiempo de expiración corto (1 hora) para todos los RoutersInfos locales, ya que como RoutersInfos válidos serán re publicados.

source: RouterInfo Persistent Storage
es: Almacenamiento persistente de RouterInfo

source: RouterInfos are periodically written to disk so that they are available after a restart.
es: Los RoutersInfos son periodicamente escritos en el disco duro para que estén disponibles después de reiniciar.

source: RouterInfo specification
es: Especifiaciones de RouterInfo

source: RouterInfo Javadoc
es: Javadoc de RouterInfo

source: The second piece of data distributed in the netDb is a "LeaseSet" - documenting a group of <b>tunnel entry points (leases)</b> for a particular client destination. Each of these leases specify the following information:
es: La segunda parte de los datos distribuidos en la netDb es un "LeaseSet" - el cual documenta un conjunto de <b>puntos de entradas de túnel (leases o contratos)</b> para una destinación de un cliente en particular. Cada uno de estos leases especifica la siguiente información:

source: The tunnel gateway router (by specifying its identity)
es: La puerta de salida de túnel del ruter (especificando su identidad)

source: The tunnel ID on that router to send messages with (a 4 byte number)
es: El ID del túnel con los que el túnel envía mensajes (un número de 4 bytes)

source: When that tunnel will expire.
es: Cuando expirará ese túnel.

source: The LeaseSet itself is stored in the netDb under the key derived from the SHA256 of the destination.
es: El propio LeaseSet es almacenado en la netDb bajo la clave derivada del hash SHA256 de la destinación.

source: In addition to these leases, the LeaseSet includes:
es: Además de estos leases, el LeaseSet incluye:

source: The destination itself (a 2048bit ElGamal encryption key, a signing key and a certificate)
es: El propio destino (una clave de cifrado ElGamal de 2048 bits, una clave de firmado, y un certificado)

source: Additional encryption public key: used for end-to-end encryption of garlic messages
es: Una clave pública de cifrado adicional: usada para el cifrado de fin a fin de los mensajes garlic

source: Additional signing public key: intended for LeaseSet revocation, but is currently unused.
es: Una clave de firma pública adicional: para la revocación del LeaseSet, pero actualmente no se usa.

source: Signature of all the LeaseSet data, to make sure the Destination published the LeaseSet.
es: La firma de toda la información del LeaseSet, para asegurarse de que la Destinación publicó ese LeaseSet.

source: Lease specification
es: Especificaciones del Lease

source: LeaseSet specification
es: Especificaciones del LeaseSet

source: Lease Javadoc
es: Javadoc del Lease

source: LeaseSet Javadoc
es: Javadoc del LeaseSet

source: Unpublished LeaseSets
es: LeaseSets no publicados

source: A LeaseSet for a destination used only for outgoing connections is <i>unpublished</i>. It is never sent for publication to a floodfill router. "Client" tunnels, such as those for web browsing and IRC clients, are unpublished. Servers will still be able to send messages back to those unpublished destinations, because of <a href="#leaseset_storage_peers">I2NP storage messages</a>.
es: Una destinación LeaseSet sólo usada para conexiones de salida que <i>no será publicada</i>. Nunca será enviada para publicarse en los ruters floodfill. Los túneles "Cliente", como aquellos que se usan para navegarse o para los clientes IRC, nunca se publican. Los servidores podrán todavía enviar mensajes a esas destinaciones no publicadas, gracias a los <a href="#leaseset_storage_peers">mensajes de almacenamiento I2NP</a>.

source: Revoked LeaseSets
es: LeaseSets Revocados

source: A LeaseSet may be <i>revoked</i> by publishing a new LeaseSet with zero leases. Revocations must be signed by the additional signing key in the LeaseSet. Revocations are not fully implemented, and it is unclear if they have any practical use. This is the only planned use for that signing key, so it is currently unused.
es: Un LeaseSet puede ser <i>revocado</i> publicando un nuevo LeaseSet sin leases. Las revocaciones tienen que ser firmadas por la clave de firmado adicional del LeaseSet. La revocación no está completamente implementada, y no está claro si tiene algún uso práctico. Este es el único uso planeado para la clave de firmado, por lo cual no se usa.

source: Encrypted LeaseSets
es: LeaseSets Cifrados

source: In an <i>encrypted</i> LeaseSet, all Leases are encrypted with a separate key. The leases may only be decoded, and thus the destination may only be contacted, by those with the key. There is no flag or other direct indication that the LeaseSet is encrypted. Encrypted LeaseSets are not widely used, and it is a topic for future work to research whether the user interface and implementation of encrypted LeaseSets could be improved.
es: En un LeaseSet <i>cifrado</i>, todos los leases (túneles) están cifrados con una clave aparte. Los leases sólo pueden ser decodificados, y por tanto el destino sólo puede ser contactado, por aquellos con la clave. No hay ninguna señal ni otro tipo de indicación directa de que el LeaseSet esté cifrado. Los LeaseSets cifrados no son ampliamente usados, y es un asunto a trabajar en el futuro investigar si la interfaz de usuaro y la implementación de LeaseSets cifrados se podría mejorar.

source: LeaseSet Expiration
es: Expiración del LeaseSet

source: All Leases (tunnels) are valid for 10 minutes; therefore, a LeaseSet expires 10 minutes after the earliest creation time of all its Leases.
es: Todos los Leases (túneles) son válidos sólo durante 10 minutos; por lo tanto, un LeaseSet expira 10 minutos más tarde que el tiempo de creación de todos sus Leases.

source: LeaseSet Persistent Storage
es: Almacenamiento persistente del LeaseSet

source: There is no persistent storage of LeaseSet data since they expire so quickly.
es: No existe el almacenamiento persistente de LeaseSets ya que expiran muy rápido.

source: Bootstrapping
es: Secuencia de arranque

source: The netDb is decentralized, however you do need at least one reference to a peer so that the integration process ties you in. This is accomplished by "reseeding" your router with the RouterInfo of an active peer - specifically, by retrieving their <code>routerInfo-$hash.dat</code> file and storing it in your <code>netDb/</code> directory. Anyone can provide you with those files - you can even provide them to others by exposing your own netDb directory. To simplify the process, volunteers publish their netDb directories (or a subset) on the regular (non-i2p) network, and the URLs of these directories are hardcoded in I2P. When the router starts up for the first time, it automatically fetches from one of these URLs, selected at random.
es: La netDb (base de datos de red) es descentralizada, aún así necesita al menos una referencia a un par (peer) para que el proceso de integración le una a la red. Esto se consigue "resembrando" el router I2P con la RouterInfo de un par activo - específicamente, obteniendo su fichero <code>routerInfo-$hash.dat</code> y almacenándolo en su directorio <code>netDb/</code>. Cualquiera puede proporcionarle estos ficheros - incluso usted puede proporcionárselos a otros exponiendo su propio directorio netDb. Para simplificar el proceso, hay voluntarios que publican sus directorios netDb (o un subconjunto) en Internet (fuera de I2P), y las URLs de estos directorios están codificadas dentro de la aplicación I2P. Cuando el router I2P arranca por primera vez, descarga automáticamente el fichero de una de estas URLs seleccionada de forma aleatoria.

source: The floodfill netDb is a simple distributed storage mechanism. The storage algorithm is simple: send the data to the closest peer that has advertised itself as a floodfill router. Then wait 10 seconds, pick another floodfill router and ask them for the entry to be sent, verifying its proper insertion / distribution. If the verification peer doesn't reply, or they don't have the entry, the sender repeats the process. When the peer in the floodfill netDb receives a netDb store from a peer not in the floodfill netDb, they send it to a subset of the floodfill netDb-peers. The peers selected are the ones closest (according to the <a href="#kademlia_closeness">XOR-metric</a>) to a specific key.
es: El floodfill netDb is simplemente un mecanismo de almacenamiento distribuido. El algoritmo de almacenamiento es simple: envía los datos al par más cercano que se haya anunciado como floodfill. Espera 10 segundos, alije otro ruter floodfill y le pregunta por la entrada a enviar, verificando su propia introducción / distribución. Si el par de verificación no responde, o no tienen la entrada pedida, el transmisor repite el proceso. Cuando un par de la netDb floodfill recibe un almacenamiento netDb de un par que no está en la netDb floodfill, lo envía a un subconjunto del los pares floodfill netDb. Los pares seleccionados son los más cercanos a una clave especificada (de acuerdo con el <a href="#kademlia_closeness">XOR-metric</a>).

source: Determining who is part of the floodfill netDb is trivial - it is exposed in each router's published routerInfo as a capability.
es: Determinar quien es parte del floodfill netDb es algo trivial - se muestra en el routerinfo publicado de cada ruter como una capacidad.

source: Floodfills have no central authority and do not form a "consensus" - they only implement a simple DHT overlay.
es: Los flodfill no tienen inguna autoridad central y no forman ningún "consenso" - sólo implementan una capa DHT.

source: Floodfill Router Opt-in
es: Convertirse en un ruter floodfill

source: Unlike Tor, where the directory servers are hardcoded and trusted, and operated by known entities, the members of the I2P floodfill peer set need not be trusted, and change over time.
es: Al contrario que en Tor, donde los servidores están incluidos y son de confianza, y operados por identidades conocidas, los miembros de los pares floodfill de I2P no necesitas ser de confianza, y cambian con el tiempo.

source: To increase reliability of the netDb, and minimize the impact of netDb traffic on a router, floodfill is automatically enabled only on routers that are configured with high bandwidth limits. Routers with high bandwidth limits (which must be manually configured, as the default is much lower) are presumed to be on lower-latency connections, and are more likely to be available 24/7. The current minimum share bandwidth for a floodfill router is 128 KBytes/sec.
es: Para incrementar la fiabilidad de la netDb, y minimizar el impacto del tráfico de la netDb en un ruter, floodfill solo está activo por defecto en los routers configurados para compartir un gran ancho de banda. Los routers con límites grandes de compartición de ancho de banda (lo que se puede configurar manualmente, ya que por defecto es mucho más bajo) presuntamente tienen conexiones de baja latencia, y es más probable que estén disponibles 24/7. El ancho de banda mínimo a compartir para convertirse en floodfill es de 128 KBytes/sec.
