Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: If the router fails to resolve the hostname, the HTTP proxy returns an error page to the user with links to several "jump" services. See below for details.
es: Si el router I2P falla al resolver el nombre del servidor, el proxy HTTP devuelve una página de error al usuario con enlaces a varios servicios de salto (jump, direccionamiento distribuido). Más detalles debajo.

source: Addressbook
es: Libreta de direcciones

source: Incoming Subscriptions and Merging
es: Suscripciones entrantes y fusionado

source: The addressbook application periodically retrieves other users' hosts.txt files and merges them with the local hosts.txt, after several checks. Naming conflicts are resolved on a first-come first-served basis.
es: La aplicación de la libreta de direcciones obtiene periódicamente los ficheros hosts.txt de otros usuarios y los fusiona con el fichero hosts.txt local tras varias comprobaciones. Los conflictos de nombres se resuelven en base al criterio `el primero en venir es el primero en ser servido`.

source: Subscribing to another user's hosts.txt file involves giving them a certain amount of trust. You do not want them, for example, 'hijacking' a new site by quickly entering in their own key for a new site before passing the new host/key entry to you.
es: Suscribirse al fichero hosts.txt de otros usuarios implica darles un cierto nivel de confianza. No querrá que ellos, por ejemplo, 'secuestren' un sitio nuevo introduciendo rápidamente su propia clave para el nuevo sitio antes de pasarle el nuevo servidor/clave a usted.

source: For this reason, the only subscription configured by default is <code>http://i2p-projekt.i2p/hosts.txt (http://udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p/hosts.txt)</code>, which contains a copy of the hosts.txt included in the I2P release. Users must configure additional subscriptions in their local addressbook application (via subscriptions.txt or <a href="#susidns">SusiDNS</a>).
es: Por esta razón, el único suscriptor configurado por defecto es <code>http://i2p-projekt.i2p/hosts.txt (http://udhdrtrcetjm5sxzskjyr5ztpeszydbh4dpl3pl4utgqqw2v4jna.b32.i2p/hosts.txt)</code>, que contiene una copia del hosts.txt incluido en la versión de I2P. Los usuarios tienen que configurar suscripciones adicionales en sus aplicaciones de libreta de direcciones (vía suscriptions.txt o <a href="#susidns">SusiDNS</a>).

source: Some other public addressbook subscription links:
es: Algunos enlaces extra de suscripciones públicas a libretas de direcciones:

source: The operators of these services may have various policies for listing hosts. Presence on this list does not imply endorsement.
es: Los operadores de estos servicios pueden tener diferentes políticas para listar servidores. La presencia en esta lista no implica su respaldo.

source: Naming Rules
es: Reglas de nombres

source: While there are hopefully not any technical limitations within I2P on host names, the addressbook enforces several restrictions on host names imported from subscriptions. It does this for basic typographical sanity and compatibility with browsers, and for security. The rules are essentially the same as those in RFC2396 Section 3.2.2. Any hostnames violating these rules may not be propagated to other routers.
es: Aunque afortunadamente no hay limitación técnica alguna en I2P para los nombres de servidor, la libreta de direcciones impone varias restricciones sobre los nombres de servidor importados desde suscripciones. Hace esto por higiene tipográfica básica y compatibilidad con navegadores, y por seguridad. Las reglas son esencialmente las mismas que aquellas de la Sección 3.2.2. en el RFC2396. Cualquier nombre de servidor que viole esas reglas puede no ser propagado a otros routers.

source: Names are converted to lower case on import.
es: Los nombres se convierten a minúsculas al importarlos.

source: Names are checked for conflict with existing names in the existing userhosts.txt and hosts.txt (but not privatehosts.txt) after conversion to lower case.
es: Se comprueban los conflictos entre los nombres y los nombres existentes en userhosts.txt y hosts.txt (pero no privatehosts.txt) tras su conversión a minúsculas.

source: Must contain only [a-z] [0-9] '.' and '-' after conversion to lower case.
es: Sólo deben contener [a-z] [0-9] '.' y '-' tras su conversión a minúsculas.

source: Must not start with '.' or '-'.
es: No deben comenzar con '.' o '-'.

source: Must end with '.i2p'.
es: Debe terminar en «.i2p».

source: 67 characters maximum, including the '.i2p'.
es: Máximo 67 caracteres, incluyendo el '.i2p'.

source: Must not contain '..'.
es: No puede contener «..».

source: Must not contain '.-' or '-.' (as of 0.6.1.33).
es: No deben contener '.-' o '-.' (a partir de la 0.6.1.33).

source: Must not contain '--' except in 'xn--' for IDN.
es: No deben contener '--' excepto en 'xn--' para IDN.

source: Base32 hostnames (*.b32.i2p) are reserved for base 32 use and so are not allowed to be imported.
es: Los nombres de equipo Base32 (*.b32.i2p) están reservados para el uso de base 32 y por tanto no está permitida su importación.

source: Certain hostnames reserved for project use are not allowed (proxy.i2p, router.i2p, console.i2p, *.proxy.i2p, *.router.i2p, *.console.i2p, and others)
es: Ciertos nombres de servidor reservados para uso del proyecto no están autorizados (proxy.i2p, router.i2p, console.i2p, *.proxy.i2p, *.router.i2p, *.console.i2p, y otros)

source: Keys are checked for base64 validity.
es: Se comprueba la validez base64 de las claves.

source: Keys are checked for conflict with existing keys in hosts.txt (but not privatehosts.txt).
es: Se comprueba si las claves tienen conflictos con claves existentes en hosts.txt (pero no privatehosts.txt).

source: Minimum key length 516 bytes.
es: La longitud mínima de clave es 516 bytes.

source: Maximum key length 616 bytes (to account for certs up to 100 bytes).
es: La longitud máxima de clave es 616 bytes (para contar con certificados de hasta 100 bytes).

source: Any name received via subscription that passes all the checks is added via the local naming service.
es: Cualquier nombre recibido vía suscripción que pase todas las comprobaciones, se añade a través del servicio de nombres local.

source: Note that the '.' symbols in a host name are of no significance, and do not denote any actual naming or trust hierarchy. If the name 'host.i2p' already exists, there is nothing to prevent anybody from adding a name 'a.host.i2p' to their hosts.txt, and this name can be imported by others' addressbook. Methods to deny subdomains to non-domain 'owners' (certificates?), and the desirability and feasibility of these methods, are topics for future discussion.
es: Observe que los símbolos '.' en el nombre de servidor no tienen significado, y no denotan jerarquía de confianza o de nombres alguna. Si el nombre 'host.i2p' ya existe, no hay nada que evite que alguien añada un nombre 'a.host.i2p' a su(s) hosts.txt, y este nombre pueda ser importado por las libretas de direcciones de otros. Los métodos para denegar subdominios a propietarios de no-dominios (¿certificados?), y lo deseable y factible de estos métodos, son temas para futura discusión.

source: International Domain Names (IDN) also work in i2p (using punycode 'xn--' form). To see IDN .i2p domain names rendered correctly in Firefox's location bar, add 'network.IDN.whitelist.i2p (boolean) = true' in about:config.
es: Los Nombres de Dominio Internacionales (IDN) también funcionan con I2P (usando la forma punycode 'xn--'). Para ver nombres de dominio .i2p IDN correctamente formados en la barra de direcciones de Firefox, añada 'network.IDN.whitelist.i2p (boolean) = true' en about:config

source: As the addressbook application does not use privatehosts.txt at all, in practice this file is the only place where it is appropriate to place private aliases or "pet names" for sites already in hosts.txt.
es: Como la aplicación libreta de direcciones no usa privatehosts.txt para nada, en la práctica este fichero es el único lugar donde es apropiado emplazar alias privados o "nombres de mascota" para sitios ya existentes en hosts.txt

source: Outgoing Subscriptions
es: Suscripciones salientes

source: Addressbook will publish the merged hosts.txt to a location (traditionally hosts.txt in the local eepsite's home directory) to be accessed by others for their subscriptions. This step is optional and is disabled by default.
es: La libreta de direcciones publicará el hosts.txt fusionado hacia un emplazamiento (tradicionalmente el hosts.txt del directorio home del eepsite) para que sea accesible para las suscripciones de otros. Este paso es opcional y está deshabilitado por defecto.

source: The addressbook application, together with eepget, saves the Etag and/or Last-Modified information returned by the web server of the subscription. This greatly reduces the bandwidth required, as the web server will return a '304 Not Modified' on the next fetch if nothing has changed.
es: La aplicación libreta de direcciones, junto con eepget, previene que la información del Etag y/o la de Última-modificación sea devuelta por el servidor web de la suscripción. Esto reduce enormemente el ancho de banda requerido ya que el servidor web devolverá un '304 No Modificado' en la la siguiente toma de datos (`fetch`) si nada ha cambiado.

source: However the entire hosts.txt is downloaded if it has changed. See below for discussion on this issue.
es: Sin embargo, si ha cambiado se descarga el hosts.txt completo. Mire debajo las discusiones sobre este asunto.

source: Hosts serving a static hosts.txt or an equivalent CGI application are strongly encouraged to deliver a Content-Length header, and either an Etag or Last-Modified header. Also ensure that the server delivers a '304 Not Modified' when appropriate. This will dramatically reduce the network bandwidth, and reduce chances of corruption.
es: Se recomienda que los servidores que sirven un archivo host.txt o una aplicación CGI equivalente, lleven una cabecera con el tqmaño del contenido, Content-Length header, y una Etag o la última cabecera modificada, Last-Modified header. Además asegúrese de que el servidor muestra el aviso '304 Not Modified' cuando sea apropiado. Esto reducirá dramáticamente el ancho de banda usado, y reducirá las posibilidades de corrupción.

source: Host Add Services
es: Servicio de gestión de dominios

source: A host add service is a simple CGI application that takes a hostname and a Base64 key as parameters and adds that to its local hosts.txt. If other routers subscribe to that hosts.txt, the new hostname/key will be propagated through the network.
es: Un servicio de gestión de dominios es una aplicación CGI simple que toma un nombre de dominio y una clave Base64 como parámetros y loa añade a su hosts.txt local. SI otros ruters se suscriben a ese host.txt, el nuevo nombre de domino/clave serán propagados a través de la red.

source: It is recommended that host add services impose, at a minimum, the restrictions imposed by the addressbook application listed above. Host add services may impose additional restrictions on hostnames and keys, for example:
es: Se recomienda que los servicios de gestión de dominios impongan, como mínimo, las restricciones impuestas por la aplicación libreta de direcciones listadas anteriormente. Los servicios de gestión de dominios deben imponer restricciones adicionales en los nombres de dominio y en las claves, por ejemplo:

source: A limit on number of 'subdomains'.
es: Un 'límite' en el número de 'subdominios'.

source: Authorization for 'subdomains' through various methods.
es: Autorización para los 'subdominios' a través de varios métodos.

source: Hashcash or signed certificates.
es: Hashcash o certificados firmados.

source: Editorial review of host names and/or content.
es: Revisión editorial de los nombres de dominio y/o su contenido.

source: Categorization of hosts by content.
es: Clasificación de los dominios según su contenido.

source: Reservation or rejection of certain host names.
es: Reserva o rechazo de ciertos dominios.

source: Restrictions on the number of names registered in a given time period.
es: Restricciones en el número de dominios registrados en un determinado periodo de tiempo.

source: Delays between registration and publication.
es: Intervalos entre los registros y las publicaciones.

source: Requirement that the host be up for verification.
es: Exigir que el servidor esté funcionando para su verificaión.

source: Expiration and/or revocation.
es: Expiración y/o revocación.

source: IDN spoof rejection.
es: Denegación de IDN spoof.

source: Jump Services
es: Servicios de salto (jump)

source: A jump service is a simple CGI application that takes a hostname as a parameter and returns a 301 redirect to the proper URL with a <code>?i2paddresshelper=key</code> string appended. The HTTP proxy will interpret the appended string and use that key as the actual destination. In addition, the proxy will cache that key so the address helper is not necessary until restart.
es: Un servicio de salto (jump), es una simple aplicación CGI que toma un nombre de servidor como parámetro y devuelve un redireccionamiento 301 hacia la URL adecuada con una cadena de texto <code>?i2paddresshelper=clave</code> anexa. El proxy HTTP interpretará la cadena de texto anexa y usará esa clave como el destino I2P de facto. Además, el proxy guardará en caché esa clave de forma que el ayudante de direccionamiento (address helper) no sea necesario hasta reiniciar.

source: Note that, like with subscriptions, using a jump service implies a certain amount of trust, as a jump service could maliciously redirect a user to an incorrect destination.
es: Dese cuenta que, al igual que con las suscripciones, usar un servicio de salto (jum p, direccionamiento distribuido) implica una cierta dosis de confianza, ya que un servicio de salto podría redirigir maliciosamente a un usuario a un destino I2P incorrecto.

source: To provide the best service, a jump service should be subscribed to several hosts.txt providers so that its local host list is current.
es: Para proporcionar el mejor servicio, un servicio de salto (jump, direccionamiento distribuido) debe estar suscrito a varios proveedores de ficheros hosts.txt para que su lista local de servidores esté al día.

source: SusiDNS is simply a web interface front-end to configuring addressbook subscriptions and accessing the four addressbook files. All the real work is done by the 'addressbook' application.
es: SusiDNS es simplemente un interfaz web para configurar las suscripciones a la libreta de direcciones, y con acceso a los cuatro archivos de libretas de direcciones. Todo el trabajo duro es realizado por la aplicación 'addressbook', 'libreta de direcciones'.

source: Currently, there is little enforcement of addressbook naming rules within SusiDNS, so a user may enter hostnames locally that would be rejected by the addressbook subscription rules.
es: Actualmente, hay poco control sobre las reglas de creación de los nombres de dominio dentro de SusiDNS, por lo que un usuario puede añadir nombres de dominios localmente que serían rechazados por las reglas de suscripción de la libreta de direcciones.

source: Base32 Names
es: Dominios Base32

source: I2P supports Base32 hostnames similar to Tor's .onion addresses. Base32 addresses are much shorter and easier to handle than the full 516-character Base64 Destinations or addresshelpers. Example: <code>ukeu3k5oycgaauneqgtnvselmt4yemvoilkln7jpvamvfx7dnkdq.b32.i2p</code>
es: I2P soporta nombres de dominios Base32 similares a las direcciones .onion de Tor. Las direcciones Base32 son mucho más fáciles de manejar y mucho más cortas que los addresshelpers o las Destinaciones Base64 de 516 caracteres. Ejemplo: <code>ukeu3k5oycgaauneqgtnvselmt4yemvoilkln7jpvamvfx7dnkdq.b32.i2p</code>

source: In Tor, the address is 16 characters (80 bits), or half of the SHA-1 hash. I2P uses 52 characters (256 bits) to represent the full SHA-256 hash. The form is {52 chars}.b32.i2p. Tor has recently published a <a href="https://blog.torproject.org/blog/tor-weekly-news-%E2%80%94-december-4th-2013">proposal</a> to convert to an identical format of {52 chars}.onion for their hidden services. Base32 is implemented in the naming service, which queries the router over I2CP to lookup the LeaseSet to get the full Destination. Base32 lookups will only be successful when the Destination is up and publishing a LeaseSet. Because resolution may require a network database lookup, it may take significantly longer than a local address book lookup.
es: En Tor, la dirección es de 16 caracteres (80 bits), o la mitad del (identificador criptográfico) hash SHA-1. I2P usa 52 caracteres (256 bits) para representar el hash SHA-256 completo. La la forma es {52 chars}.b32.i2p . Tor ha publicado recientemente una <a href="https://blog.torproject.org/blog/tor-weekly-news-%E2%80%94-december-4th-2013">propuesta</a> para convertirlas a un formato idéntico de {52 chars}.onion para sus servicios ocultos. Base32 está implementado en el servicio de nombres, que realiza peticiones al router sobre I2CP para buscar el LeaseSet para obtener el destino completo. Las búsquedas Base32 sólo serán exitosas cuando el destino esté activo y publicando un LeaseSet. A causa de que la resolución puede requerir una búsqueda en la base de datos de red, puede llevar significativamente más tiempo que una búsqueda en la libreta de direcciones local.

source: Base32 addresses can be used in most places where hostnames or full destinations are used, however there are some exceptions where they may fail if the name does not immediately resolve. I2PTunnel will fail, for example, if the name does not resolve to a destination.
es: Las direcciones Base32 pueden ser usadas en la mayoría de sitios donde se puedan usar los nombres de dominios o la Destinación completa, aunque hay algunas excepciones donde podría fallar sin el dominio no se resuelve inmediatamente, Por ejemplo, I2PTunnel fallará si el domino no resuelve una destinación.

source: Plugins
es: Complementos

source: June 2012
es: Junio de 2012

source: General Information
es: Información general

source: I2P includes a plugin architecture to support easy development and installation of additional software.
es: I2P incluye una arquitectura de pluguins para dar soporte a la instalación fácil y desarrollo fácil de aplicaciones adicionales.

source: There are now plugins available that support distributed email, blogs, IRC clients, distributed file storage, wikis, and more.
es: Ahora hay plugins disponibles que soportan email distribuido, blogs, clientes IRC, almacenamiento de ficheros distribuido, wikis y más.

source: Benefits to i2p users and app developers:
es: Los beneficios para los usuarios de I2P y los desarrolladores de aplicaciones son:

source: Easy distribution of applications
es: Fácil distribución de aplicaciones

source: Allows innovation and use of additional libraries without worrying about increasing the size of <code>i2pupdate.sud</code>
es: Permite la innovación y el uso de librerías adicionales sin preocuparse por el incremento de tamaño de <code>i2pupdate.sud</code>

source: Support large or special-purpose applications that would never be bundled with the I2P installation
es: Soporta aplicaciones grandes o de proposito-especial que nunca serían empaquetadas con la instalación de I2P

source: Cryptographically signed and verified applications
es: Aplicaciones criptográficamente firmadas y verificadas

source: Automatic updates of applications, just like for the router
es: Actualizaciones automáticas de aplicaciones, igual que para el router

source: Separate initial install and update packages, if desired, for smaller update downloads
es: Paquetes separados para la instalación inicial y las actualizaciones, si se desea, para tener descargas de actualizaciones más pequeñas

source: One-click installation of applications. No more asking users to modify <code>wrapper.config</code> or <code>clients.config</code>
es: Instalación de aplicaciones en un-sólo-clic. Sin preguntar más al usuario para modificar <code>wrapper.config</code> o <code>clients.config</code>

source: Isolate applications from the base <code>$I2P</code> installation
es: Aplicaciones aisladas desde la instalación base de <code>$I2P</code>

source: Automatic compatibility checking for I2P version, Java version, Jetty version, and previous installed application version
es: Comprobación automática de compatibilidad para la versión de I2P, la versión de Java, la versión de Jetty, y versiones de la aplicación previamente instaladas

source: Automatic link addition in console
es: Añadido automático de enlaces en la consola

source: Automatic startup of application, including modifying classpath, without requiring a restart
es: Inicio automático de la aplicación, incluyendo modificación de la ruta de clases (`classpath`), sin requerir un reinicio

source: Automatic integration and startup of webapps into console Jetty instance
es: Integración automática e inicio de aplicaciones web en la instancia de consola Jetty

source: Facilitate creation of 'app stores' like the one at <a href="http://%(pluginsite)s">%(pluginsite)s</a>
es: Facilita la creación de 'app stores' (tiendas de aplicaciones) como la de <a href="http://%(pluginsite)s">%(pluginsite)s</a>

source: One-click uninstall
es: Desinstalación en un-sólo-clic

source: Language and theme packs for the console
es: Paquetes de idioma y de temas para la consola

source: Bring detailed application information to the router console
es: Trae información detallada de la aplicación a la consola del router

source: Non-java applications also supported
es: Las aplicaciones no-Java también están soportadas

source: Required I2P version
es: Versión de I2P requerida

source: 0.7.12 or newer.
es: 0.7.12 o superior.

source: Installation
es: Instalación

source: To install and start a plugin, copy the <code>.xpi2p</code> install link to the form at the bottom of <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp in your router console</a> and click the "install plugin" button. After a plugin is installed and started, a link to the plugin will usually appear at the top of your summary bar.
es: Para instalar e iniciar un plugin, copie el enlace de instalación <code>.xpi2p</code> en el formulario al final de <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp en la consola de su router</a> y haga clic en el botón "instalar plugin". Después de que un plugin sea instalado e iniciado, un enlace al plugin aparecerá normalmente en la parte superior de su barra de resumen.

source: To update a plugin to the latest version, just click the update button on <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp</a>. There is also a button to check if the plugin has a more recent version, as well as a button to check for updates for all plugins. Plugins will be checked for updates automatically when updating to a new I2P release (not including dev builds).
es: Para actualizar un plugin a la última versión, tan solo haga clic en el botón de actualización sobre <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp</a>. También hay un botón para comprobar si el plugin tiene una versión más reciente, así como un botón para buscar actualizaciones para todos los plugins. Se comprobará si hay actualizaciones para los plugins automáticamente cuando se actualice a una nueva versión de I2P (sin incluir las versiones de desarrollo).

source: Development
es: Desarrollo
