Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: <b>tunnel encryption key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for encrypting messages and instructions to the next hop
es: <b>Clave de cifrado de túnel</b> - una <a href="%(commonstructures)s#type_SessionKey">clave privada AES</a> para cifrar los mensajes, y las instrucciones para el siguiente salto.

source: <b>tunnel IV key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for double-encrypting the IV to the next hop
es: <b>Clave IV del túnel</b> - Una <a href="%(commonstructures)s#type_SessionKey">clave privada AES</a> para cifrar doblemente el IV hasta el siguiente salto.

source: <b>reply key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES public key</a> for encrypting the reply to the tunnel build request
es: <b>Clave de repuesta</b> - Una <a href="%(commonstructures)s#type_SessionKey">clave privada AES</a> para cifrar la respuesta a la petición de construcción del túnel.

source: <b>reply IV</b> - the IV for encrypting the reply to the tunnel build request
es: <b>IV de respuesta</b> - El IV para cifrar la respuesta de la petición de construcción del túnel.

source: <b>tunnel id</b> - 4 byte integer (inbound gateways only)
es: <b>ID del túnel</b> - In entero de 4 bytes (sólo para las puertas de salida de entrada)

source: <b>next hop</b> - what router is the next one in the path (unless this is a 0-hop tunnel, and the gateway is also the endpoint)
es: <b>Siguiente salto</b> - Cual es el siguiente ruter en el camino (a no ser que sea un túnel de 0 saltos, y la puerta de salida sea también el punto final)

source: <b>next tunnel id</b> - The tunnel ID on the next hop
es: <b>ID del túnel siguiente</b> - La ID del túnel en el siguiente salto

source: All intermediate tunnel participants get:
es: Todos los túneles intermedios participantes obtienen:

source: <b>tunnel id</b> - 4 byte integer
es: <b>ID del túnel</b> - Un entero de 4 bytes

source: <b>next hop</b> - what router is the next one in the path
es: <b>Siguiente salto</b> - cuál es el siguiente ruter en el camino

source: The tunnel endpoint gets:
es: El túnel punto final obtiene:

source: <b>tunnel encryption key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for encrypting messages and instructions to the the endpoint (itself)
es: <b>Una clave de cifrado de túnel</b> - una <a href="%(commonstructures)s#type_SessionKey">clave privada AES</a> para cifrar los mensajes e instrucciones para el punto final (para sí mismo)

source: <b>tunnel IV key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES private key</a> for double-encrypting the IV to the endpoint (itself)
es: <b>Una clave IV de túnel</b> - una <a href="%(commonstructures)s#type_SessionKey">clave privada AES</a> para cifrar dos veces el IV para el punto final (en sí mismo)

source: <b>reply key</b> - an <a href="%(commonstructures)s#type_SessionKey">AES public key</a> for encrypting the reply to the tunnel build request (outbound endpoints only)
es: <b>IV de respuesta</b> - una <a href="%(commonstructures)s#type_SessionKey">clave privada AES</a> para cifrar la respuesta para la petición de construcción del túnel (sólo para los puntos finales de salida)

source: <b>reply IV</b> - the IV for encrypting the reply to the tunnel build request (outbound endpoints only)
es: <b>IV de respuesta</b> - el IV para cifrar la respuesta para la petición de construcción del túnel (sólo para los puntos finales de salida)

source: <b>tunnel id</b> - 4 byte integer (outbound endpoints only)
es: <b>ID del túnel</b> - Un entero de 4 bytes (sólo para los puntos finales de salida)

source: <b>reply router</b> - the inbound gateway of the tunnel to send the reply through (outbound endpoints only)
es: <b>Ruter de respuesta</b> - para enviar la respuesta a través de la puerta de salida del túnel de entrada (sólo puntos finales de salida)

source: <b>reply tunnel id</b> - The tunnel ID of the reply router (outbound endpoints only)
es: <b>ID del túnel de respuesta</b> - El ID del túnel del ruter de respuesta (sólo para puntos finales de salida)

source: Details are in the <a href="%(tunnelcreation)s">tunnel creation specification</a>.
es: Los detalles están en las <a href="%(tunnelcreation)s">especificaciones de creación de túneles</a>.

source: Tunnel pooling
es: Agrupación de túneles

source: Several tunnels for a particular purpose may be grouped into a "tunnel pool", as described in the <a href="%(tunnelimpl)s#tunnel.pooling">tunnel specification</a>. This provides redundancy and additional bandwidth. The pools used by the router itself are called "exploratory tunnels". The pools used by applications are called "client tunnels".
es: Varios túneles pueden ser agrupados en un "grupo de túneles" para algún fin en particular como se describe en las <a href="%(tunnelimpl)s#tunnel.pooling">especificaciones de túneles</a>. Los grupos de túneles usados por el ruter mismo se llaman "túneles exploratorios". Los grupos de túneles usados por las aplicaciones se llaman "túneles cliente".

source: Tunnel length
es: Tamaño del túnel

source: As mentioned above, each client requests that their router provide tunnels to include at least a certain number of hops. The decision as to how many routers to have in one's outbound and inbound tunnels has an important effect upon the latency, throughput, reliability, and anonymity provided by I2P - the more peers that messages have to go through, the longer it takes to get there and the more likely that one of those routers will fail prematurely. The less routers in a tunnel, the easier it is for an adversary to mount traffic analysis attacks and pierce someone's anonymity. Tunnel lengths are specified by clients via <a href="%(i2cp)s#options">I2CP options</a>. The maximum number of hops in a tunnel is 7.
es: Como se menciona arriba, a cada una de los solicitudes de cliente a las que sus routers proporcionan túneles, incluyen al menos un cierto número de saltos. La decisión acerca del número de routers a tener en los túneles de entrada y salida del cliente, tiene un efecto importante en la latencia, la eficiencia, la fiabilidad, y el anonimato proporcionados por I2P - cuantos más pares (`peers`) tengan que atravesar los mensajes, más tardarán en llegar allí y más probable será que uno de esos routers falle prematuramente. Cuantos menos routers en un túnel, más fácil es para un adversario montar ataques de análisis de tráfico y socavar el anonimato de alguien. Las longitudes de los túneles se especifican por los clientes a través de las <a href="%(i2cp)s#options">opciones I2CP</a>. El número máximo de saltos en un túnel es 7.

source: 0-hop tunnels
es: Túneles de 0-saltos

source: With no remote routers in a tunnel, the user has very basic plausible deniability (since no one knows for sure that the peer that sent them the message wasn't simply just forwarding it on as part of the tunnel). However, it would be fairly easy to mount a statistical analysis attack and notice that messages targeting a specific destination are always sent through a single gateway. Statistical analysis against outbound 0-hop tunnels are more complex, but could show similar information (though would be slightly harder to mount).
es: Sin routers remotos en un túnel, el usuario tiene una denegabilidad plausible muy básica (ya que ninguno de nosotros sabe con seguridad si el par que les envió el mensaje no estaba simplemente reenviándolo al formar parte del túnel). Sin embargo, sería realmente fácil montar un ataque de análisis estadístico y observar que los mensajes apuntando a un destino específico siempre son enviados a través de una única pasarela (`gateway`). El análisis estadístico contra túneles de salida de 0-saltos son más complejos, pero podrían mostrar una información similar (aunque sería ligeramente más difícil de montar).

source: 1-hop tunnels
es: Túneles de 1-salto

source: With only one remote router in a tunnel, the user has both plausible deniability and basic anonymity, as long as they are not up against an internal adversary (as described on <a href="%(threatmodel)s">threat model</a>). However, if the adversary ran a sufficient number of routers such that the single remote router in the tunnel is often one of those compromised ones, they would be able to mount the above statistical traffic analysis attack.
es: Con sólo un router remoto en un túnel, el usuario tiene tanto denegabilidad plausible como anonimato básico, siempre que no se esté enfrentando a un adversario interno (como se describe en el <a href="%(threatmodel)s">modelo de amenaza</a>). Sin embargo, si el adversario está ejecutando un número suficiente de routers de forma que el único router remoto del túnel sea con frecuencia uno de aquellos comprometidos, será capaz de montar el ataque de análisis estadístico de tráfico descrito anteriormente.

source: 2-hop tunnels
es: Túneles de 2-saltos

source: With two or more remote routers in a tunnel, the costs of mounting the traffic analysis attack increases, since many remote routers would have to be compromised to mount it.
es: Con dos o más routers remotos en un túnel, los costes de montar el ataque de análisis de tráfico aumentan, ya que muchos routers remotos tendrían que estar comprometidos para montarlo.

source: 3-hop (or more) tunnels
es: Túneles de 3 (o más)-saltos

source: To reduce the susceptibility to <a href="%(url)s">some attacks</a>, 3 or more hops are recommended for the highest level of protection. <a href="%(url)s">Recent studies</a> also conclude that more than 3 hops does not provide additional protection.
es: Para reducir la susceptibilidad a <a href="%(url)s">algunos ataques</a>, se recomiendan 3 o más saltos para el mayor nivel de protección. Además, <a href="%(url)s">estudios recientes</a> concluyen que más de 3 saltos no proporcionan protección adicional.

source: Tunnel default lengths
es: Longitudes predeterminadas de los túneles

source: The router uses 2-hop tunnels by default for its exploratory tunnels. Client tunnel defaults are set by the application, using <a href="%(i2cp)s#options">I2CP options</a>. Most applications use 2 or 3 hops as their default.
es: El router usa túneles de 2-saltos de forma predeterminada para sus túneles exploratorios. Las configuraciones por defecto de los túneles de cliente son establecidas por la aplicación usando las <a href="%(i2cp)s#options">opciones I2CP</a>. La mayoría de las aplicaciones usa 2 o 3 saltos como su configuración por defecto.

source: Tunnel testing
es: Comprobación de túneles

source: All tunnels are periodically tested by their creator by sending a DeliveryStatusMessage out an outbound tunnel and bound for another inbound tunnel (testing both tunnels at once). If either fails a number of consecutive tests, it is marked as no longer functional. If it was used for a client's inbound tunnel, a new leaseSet is created. Tunnel test failures are also reflected in the <a href="%(peerselection)s#capacity">capacity rating in the peer profile</a>.
es: Todos los túneles son probados periódicamente por sus creadores mediante la transmisión de un DeliveryStatusMessage (mensaje de estado de entrega) sobre un túnel de salida, ligado a otro túnel de entrada (probando ambos túneles a la vez). Si falla un número concreto de pruebas consecutivas, se marca como no funcional. Si se usó para un túnel de entrada de cliente, se crea un nuevo LeaseSet (grupo de túneles hacia un destino). Además, los fallos en las pruebas de túneles se reflejan en el <a href="%(peerselection)s#capacity">ratio de capacidad en el perfil del par (`peer`)</a>.

source: Tunnel creation
es: Creación de túneles

source: Tunnel creation is handled by <a href="%(garlicrouting)s">garlic routing</a> a Tunnel Build Message to a router, requesting that they participate in the tunnel (providing them with all of the appropriate information, as above, along with a certificate, which right now is a 'null' cert, but will support hashcash or other non-free certificates when necessary). That router forwards the message to the next hop in the tunnel. Details are in the <a href="%(tunnelcreation)s">tunnel creation specification</a>.
es: La creación de túneles se realiza mediante el <a href="%(garlicrouting)s">enrutamiento garlic</a> (ajo) de un mensaje de construcción de túnel hacia un router, requiriendole que participe en el túnel (proporcionándole toda la información necesaria, como la anteriormente descrita, junto con un certificado, que ahora mismo es un certificado 'null' (vacío), pero que soportará hashcash (un sistema de prueba de trabajo) u otros certificados no-gratuitos cuando sea necesario). Ese router reenvía el mensaje al siguiente salto en el túnel. Los detalles están en las <a href="%(tunnelcreation)s">especificaciones de creación de túneles</a>.

source: Multi-layer encryption is handled by <a href="%(garlicrouting)s">garlic encryption</a> of tunnel messages. Details are in the <a href="%(tunnelimpl)s">tunnel specification</a>. The IV of each hop is encrypted with a separate key as explained there.
es: El cifrado multi-capa es realizado por el <a href="%(garlicrouting)s">cifrado garlic</a> (ajo) de los mensajes de túnel. Los detalles están en la <a href="%(tunnelimpl)s">especificación de túneles</a>. El IV (vector de inicialización) de cada salto está cifrado con una clave aparte, como se explica allí.

source: Other tunnel test techniques could be used, such as garlic wrapping a number of tests into cloves, testing individual tunnel participants separately, etc.
es: Podrían usarse otras técnicas de evaluación de túneles, tales como la envoltura garlic (`ajo`) de un número de pruebas en forma de dientes (`cloves`, del ajo), comprobando separadamente a los participantes individuales en los túneles, etc.

source: Move to 3-hop exploratory tunnels defaults.
es: Cambiar a configuración predeterminada de túneles de 3-saltos.

source: In a distant future release, options specifying the pooling, mixing, and chaff generation settings may be implemented.
es: En una versión de un futuro lejano, opciones especificando las configuraciones de depositado, mezclado y generación de datos de relleno criptográficamente descartables,`chaff,` podrían ser implementadas.

source: In a distant future release, limits on the quantity and size of messages allowed during the tunnel's lifetime may be implemented (e.g. no more than 300 messages or 1MB per minute).
es: En una versión de un futuro lejano, límites en la cantidad y tamaño de los mensajes permitidos durante la vida del túnel podrían ser implementados (ej. no más de 300 mensajes o 1 MB por minuto).

source: Tunnel specification
es: Especificación de túneles

source: Tunnel creation specification
es: Especificación de creación de túneles

source: Unidirectional tunnels
es: Túneles unidireccionales

source: Tunnel message specification
es: Especificación de mensajes de túnel

source: ElGamal/AES+SessionTag
es: ElGamal/AES+SessionTag (etiqueta de sesión)

source: I2CP options
es: Opciones de I2CP

source: The I2P Client Protocol (I2CP) exposes a strong separation of concerns between the router and any client that wishes to communicate over the network. It enables secure and asynchronous messaging by sending and receiving messages over a single TCP socket. With I2CP, a client application tells the router who they are (their "destination"), what anonymity, reliability, and latency tradeoffs to make, and where to send messages. In turn the router uses I2CP to tell the client when any messages have arrived, and to request authorization for some tunnels to be used.
es: El Protocolo de Cliente de I2P (I2CP) presenta una fuerte compartimentalización de los asuntos entre el router I2P y cualquier cliente que quiera comunicarse a través de la red. Habilita mensajería segura y asíncrona mediante el envío y recepción de mensajes sobre un único socket TCP. Con I2CP una aplicación cliente le dice al router quiénes son ellos (sus "destinos"), qué anonimato, fiabilidad, y latencia tienen los intercambios a realizar, y a dónde enviar los mensajes. A la contra el router usa I2CP para decirle al cliente cuándo llega cualquier mensaje, y para pedirle autorización para que se usen algunos túneles.

source: The protocol itself is implemented in Java, to provide the <a href="%(url)s">Client SDK</a>. This SDK is exposed in the i2p.jar package, which implements the client-side of I2CP. Clients should never need to access the router.jar package, which contains the router itself and the router-side of I2CP. There is also a <a href="%(libi2cp)s">C library implementation</a>. A non-Java client would also have to implement the <a href="%(streaming)s">streaming library</a> for TCP-style connections.
es: El protocolo en si mismo está implementado en Java, para proporcionar el <a href="%(url)s">SDK del cliente</a>. Este SDK (kit de desarrollo de software) se presenta en el paquete i2p.jar que implementa el lado-del-cliente de I2CP. Los clientes no deberían necesitar nunca acceder al paquete router.jar que contiene al propio router I2P y el lado-del-router de I2CP. También hay una <a href="%(libi2cp)s">implementación en librería C</a>. Un cliente no-Java también tendría que implementar la <a href="%(streaming)s">librería de streaming</a> para conexiones estilo-TCP.

source: Applications can take advantage of the base I2CP plus the <a href="%(streaming)s">streaming</a> and <a href="%(datagrams)s">datagram</a> libraries by using the <a href="%(sam)s">Simple Anonymous Messaging</a> or <a href="%(bob)s">BOB</a> protocols, which do not require clients to deal with any sort of cryptography. Also, clients may access the network by one of several proxies - HTTP, CONNECT, and SOCKS 4/4a/5. Alternatively, Java clients may access those libraries in ministreaming.jar and streaming.jar. So there are several options for both Java and non-Java applications.
es: Las aplicaciones pueden aprovecharse de la base I2CP además de las librerías <a href="%(streaming)s">streaming</a> y <a href="%(datagrams)s">datagram</a> mediante el uso de los protocolos <a href="%(sam)s">Mensajería Anónima Simple</a> (SAM) o <a href="%(bob)s">BOB</a>, que no requieren clientes para tratar con cualquier clase de criptografía. Además, los clientes pueden acceder a la red por uno de los varios proxys - HTTP, CONNECT, y SOCKS 4/4a/5. A modo de alternativa, los clientes Java pueden acceder a esas librerías en ministreaming.jar y streaming.jar. Así que hay varias opciones para aplicaciones tanto Java como no-Java.

source: Client-side end-to-end encryption (encrypting the data over the I2CP connection) was disabled in I2P release 0.6, leaving in place the <a href="%(elgamalaes)s">ElGamal/AES end-to-end encryption</a> which is implemented in the router. The only cryptography that client libraries must still implement is <a href="%(cryptography)s#DSA">DSA public/private key signing</a> for <a href="%(i2cp)s#msg_CreateLeaseSet">LeaseSets</a> and <a href="%(i2cp)s#struct_SessionConfig">Session Configurations</a>, and management of those keys.
es: El cifrado extremo-a-extremo del lado-del-cliente (cifrando los datos sobre la conexión I2CP) fue deshabilitado en la versión 0.6 de I2P, dejando en su lugar un <a href="%(elgamalaes)s">cifrado extremo-a-extremo ElGamal/AES</a> que está implementado en el router. La única criptografía que las librerías del cliente todavía deben implementar es la <a href="%(cryptography)s#DSA">firma de la clave publico/privada DSA</a> (algoritmo de firma digital) para <a href="%(i2cp)s#msg_CreateLeaseSet">LeaseSets</a> (grupo de túneles para un destino) y <a href="%(i2cp)s#struct_SessionConfig">Configuraciones de sesión</a>, y la gestión de esas claves.

source: In a standard I2P installation, port 7654 is used by external java clients to communicate with the local router via I2CP. By default, the router binds to address 127.0.0.1. To bind to 0.0.0.0, set the router advanced configuration option <tt>i2cp.tcp.bindAllInterfaces=true</tt> and restart. Clients in the same JVM as the router pass messages directly to the router through an internal JVM interface.
es: En una instalación I2P estándar, el puerto 7654 es usado por clientes de Java externos para comunicarse con el router local vía I2CP. Por defecto, el router se liga a la dirección 127.0.0.1. Para ligarse a 0.0.0.0, establezca la opción de la configuración avanzada del router <tt>i2cp.tcp.bindAllInterfaces=true</tt> y reinicie. Los clientes en la misma JVM (Máquina Virtual Java), pasan los mensajes directamente al router a través de una interfaz JVM interna.

source: The router also supports external connections over SSL. While SSL is not the default, it is strongly recommended for any traffic that may be exposed to the open Internet. The authorization user/password (if any), the <a href="%(commonstructures)s#type_PrivateKey">Private Key</a> and <a href="%(commonstructures)s#type_SigningPrivateKey">Signing Private Key</a> for the <a href="%(commonstructures)s#struct_Destination">Destination</a> are all transmitted in-the-clear unless SSL is enabled.
es: El router I2P también soporta conexiones externas sobre SSL. Aunque SSL no está habilitado por defecto, se recomienda encarecidamente para cualquier tráfico que pueda estar expuesto a la Internet abierta. La autorización usuario/contraseña (si la hay), la <a href="%(commonstructures)s#type_PrivateKey">clave privada</a> y la <a href="%(commonstructures)s#type_SigningPrivateKey">clave privada firmante</a> para el <a href="%(commonstructures)s#struct_Destination">destino</a>, son todas transmitidas tal-cual a menos que SSL esté habilitado.

source: I2CP Protocol Specification
es: Especificación del protocolo I2CP

source: Now on the <a href="%(i2cp)s">I2CP Specification page</a>.
es: Ahora sobre la página de la <a href="%(i2cp)s">Especificación I2CP</a>.

source: I2CP Initialization
es: Inicialización I2CP

source: When a client connects to the router, it first sends a single protocol version byte (0x2A). Then it sends a <a href="%(i2cp)s#msg_GetDate">GetDate Message</a> and waits for the <a href="%(i2cp)s#msg_SetDate">SetDate Message</a> response. Next, it sends a <a href="%(i2cp)s#msg_CreateSession">CreateSession Message</a> containing the session configuration. It next awaits a <a href="%(i2cp)s#msg_RequestLeaseSet">RequestLeaseSet Message</a> from the router, indicating that inbound tunnels have been built, and responds with a CreateLeaseSetMessage containing the signed LeaseSet. The client may now initiate or receive connections from other I2P destinations.
es: Cuando un cliente conecta con el router, primero envía un único byte de versión de protocolo (0x2A). Entonces envía un <a href="%(i2cp)s#msg_GetDate">mensaje GetDate</a> (obtener fecha) y espera la respuesta del <a href="%(i2cp)s#msg_SetDate">mensaje SetDate</a> (configurar fecha). A continuación, envía un <a href="%(i2cp)s#msg_CreateSession">mensaje CreateSession</a> (crear sesión) conteniendo la sesión de configuración. Seguidamente espera un <a href="%(i2cp)s#msg_RequestLeaseSet">RequestLeaseSet Message</a> (mensaje de solicitud de LeaseSet) desde el router, indicando que los túneles de entrada han sido erigidos y responden con un CreateLeaseSetMessage (mensaje de creación de LeaseSet) conteniendo el LeaseSet firmado. El cliente puede ahora iniciar o recibir conexiones desde otros destinos I2P.

source: I2CP Options
es: Opciones de I2CP

source: Router-side Options
es: Opciones del lado-del-router
