Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Tunnel IDs are 4 byte numbers used at each hop - participants know what tunnel ID to listen for messages with and what tunnel ID they should be forwarded on as to the next hop, and each hop chooses the tunnel ID which they receive messages on. Tunnels themselves are short-lived (10 minutes). Even if subsequent tunnels are built using the same sequence of peers, each hop's tunnel ID will change.
es: Los identificadores (`IDs`) de túnel tienen números de 4 bytes usados en cada salto - los participantes saben con qué identificadores (`ID`) de túnel escuchar mensajes y sobre qué túneles deben ser reenviados hacia el siguiente salto, y cada salto elije el identificador (`ID`) de túnel sobre el cual recibe los mensajes. Los propios túneles son de vida-corta (10 minutos). Incluso si los subsiguientes túneles se erigen usando la misma secuencia de pares (`peers`), el identificador (`ID`) de túnel de cada salto cambiará.

source: To prevent adversaries from tagging the messages along the path by adjusting the message size, all tunnel messages are a fixed 1024 bytes in size. To accommodate larger I2NP messages as well as to support smaller ones more efficiently, the gateway splits up the larger I2NP messages into fragments contained within each tunnel message. The endpoint will attempt to rebuild the I2NP message from the fragments for a short period of time, but will discard them as necessary.
es: Para evitar que los adversarios marquen los mensajes a través de la ruta ajustando el tamaño del mensaje, todos los mensajes de túnel tienen un tamaño fijo de 1024 bytes. Para acomodar mensajes I2NP (protocolo de red I2P) más grandes así como para dar soporte a los más pequeños de forma más eficiente, la pasarela (`gateway`) divide los mensajes I2NP más grandes en fragmentos contenibles en cada mensaje de túnel. El extremo del túnel intentará reconstruir el mensaje I2NP partiendo de los fragmentos durante un corto periodo de tiempo, pero los descartará cuando sea necesario.

source: Details are in the <a href="%(tunnelmessage)s">tunnel message specification</a>.
es: Los detalles están en la <a href="%(tunnelmessage)s">especificación de mensaje de túnel</a>.

source: Gateway Encryption
es: Cifrado de la pasarela (`gateway`)

source: After the preprocessing of messages into a padded payload, the gateway builds a random 16 byte IV value, iteratively encrypting it and the tunnel message as necessary, and forwards the tuple {tunnelID, IV, encrypted tunnel message} to the next hop.
es: Después del preprocesado de mensajes hacia una carga con datos de relleno, la pasarela (`gateway`) construye un valor de IV (vector de inicialización) aleatorio de 16 bytes, cifrando a este y al mensaje de túnel iterativamente tanto como se necesite, y reenvía la tupla { tunnelID, IV, mensaje de túnel cifrado } al siguiente salto.

source: How encryption at the gateway is done depends on whether the tunnel is an inbound or an outbound tunnel. For inbound tunnels, they simply select a random IV, postprocessing and updating it to generate the IV for the gateway and using that IV along side their own layer key to encrypt the preprocessed data. For outbound tunnels they must iteratively decrypt the (unencrypted) IV and preprocessed data with the IV and layer keys for all hops in the tunnel. The result of the outbound tunnel encryption is that when each peer encrypts it, the endpoint will recover the initial preprocessed data.
es: Cómo se hace el cifrado en la pasarela (`gateway`) depende de si el túnel es de entrada o de salida. Para los túneles entrantes, simplemente eligen un IV (vector de inicialización) aleatorio, posprocesándolo y actualizándolo para generar el IV para la pasarela y usar ese IV junto con su propia clave de capa para cifrar los datos preprocesados. Para túneles salientes deben descifrar iterativamente el (no cifrado) IV y los datos preprocesados, con el IV y las claves de capa para todos los saltos en el túnel. El resultado del cifrado del túnel de salida es que cuando cada par (`peer`) lo cifra, el extremo recuperará los datos preprocesados iniciales.

source: Participant Processing
es: Procesado de los participantes

source: When a peer receives a tunnel message, it checks that the message came from the same previous hop as before (initialized when the first message comes through the tunnel). If the previous peer is a different router, or if the message has already been seen, the message is dropped. The participant then encrypts the received IV with AES256/ECB using their IV key to determine the current IV, uses that IV with the participant's layer key to encrypt the data, encrypts the current IV with AES256/ECB using their IV key again, then forwards the tuple {nextTunnelId, nextIV, encryptedData} to the next hop. This double encryption of the IV (both before and after use) help address a certain class of confirmation attacks.
es: Cuando un par (`peer`) recibe un mensaje de túnel, comprueba que el mensaje venga desde el mismo salto previo que antes (inicializado cuando el primer mensaje atraviesa el túnel). Si el par previo está en un router diferente, o si el mensaje ha sido visto ya, el mensaje es descartado. Entonces el participante cifra el IV (vector de inicialización) recibido con AES256/ECB usando su clave IV para determinar el IV actual, usa ese IV con la clave de capa del participante para cifrar los datos, cifra el actual IV con AES256/ECB usando la clave IV otra vez, y luego reenvía la tupla {nextTunnelId, nextIV, encryptedData} (siguiente identificador de túnel, siguiente IV, datos cifrados) al siguiente salto. Este doble cifrado del IV (tanto antes como después de su uso) ayuda a afrontar una cierta clase de ataques de confirmación.

source: Duplicate message detection is handled by a decaying Bloom filter on message IVs. Each router maintains a single Bloom filter to contain the XOR of the IV and the first block of the message received for all of the tunnels it is participating in, modified to drop seen entries after 10-20 minutes (when the tunnels will have expired). The size of the bloom filter and the parameters used are sufficient to more than saturate the router's network connection with a negligible chance of false positive. The unique value fed into the Bloom filter is the XOR of the IV and the first block so as to prevent nonsequential colluding peers in the tunnel from tagging a message by resending it with the IV and first block switched.
es: La detección de mensajes duplicados es gestionada por un filtro Bloom decadente (en el tiempo) sobre los IVs (vectores de inicialización) de los mensajes. Cada router mantiene un único filtro Bloom para guardar el XOR del IV con el primer bloque del mensaje recibido para todos los túneles en los que está participando, modificado (decadencia) para descartar entradas vistas después de 10-20 minutos (cuando los túneles habrán expirado). El tamaño del filtro Bloom y los parámetros usados son suficientes para más que saturar la conexión de red del router con una insignificante posibilidad de falso positivo. El único valor añadido en el filtro Bloom es el XOR del IV y el primer bloque como forma de prevenir que pares (`peers`) compinchados no secuenciales en el túnel, marquen un mensaje reenviándolo con el IV y el primer bloque cambiados.

source: Endpoint Processing
es: Procesado en el extremo

source: After receiving and validating a tunnel message at the last hop in the tunnel, how the endpoint recovers the data encoded by the gateway depends upon whether the tunnel is an inbound or an outbound tunnel. For outbound tunnels, the endpoint encrypts the message with its layer key just like any other participant, exposing the preprocessed data. For inbound tunnels, the endpoint is also the tunnel creator so they can merely iteratively decrypt the IV and message, using the layer and IV keys of each step in reverse order.
es: Después de recibir y validar un mensaje de túnel en el último salto del túnel, la forma en la que el extremo recupera los datos codificados por la pasarela (`gateway`) depende de si el túnel es de entrada o de salida. Para túneles salientes, el extremo cifra el mensaje con su clave de capa tal como lo hace cualquier otro participante (en el túnel), exponiendo los datos preprocesados. Para túneles entrantes, el extremo también es el creador del túnel, así que pueden meramente descifrar iterativamente el IV (vector de inicialización) y el mensaje usando las claves de capa e IV de cada paso en orden inverso.

source: At this point, the tunnel endpoint has the preprocessed data sent by the gateway, which it may then parse out into the included I2NP messages and forwards them as requested in their delivery instructions.
es: En este punto, el extremo del túnel tiene los datos preprocesados enviados por la pasarela (`gateway`), que pueden entonces ser separados en los mensajes I2NP incluidos, y reenviarlos tal como se requería en sus instrucciones de entrega.

source: Tunnel Building
es: Construcción del túnel

source: When building a tunnel, the creator must send a request with the necessary configuration data to each of the hops and wait for all of them to agree before enabling the tunnel. The requests are encrypted so that only the peers who need to know a piece of information (such as the tunnel layer or IV key) has that data. In addition, only the tunnel creator will have access to the peer's reply. There are three important dimensions to keep in mind when producing the tunnels: what peers are used (and where), how the requests are sent (and replies received), and how they are maintained.
es: Cuando se construye un túnel, el creador debe enviar una solicitud con los datos de configuración necesarios a cada uno de los saltos, y esperar que todos ellos accedan antes de habilitar el túnel. Las solicitudes se cifran de forma que sólo los pares (`peers`) que necesiten conocer un pedazo de la información (tales como las claves de capa del túnel o de IV (vector de inicialización)) tienen esos datos. Además, sólo el creador del túnel tendrá acceso a la respuesta del par. Hay tres dimensiones importantes a tener en cuenta al generar los túneles: qué pares se usan (y dónde), cómo se envían las solicitudes (y las respuestas recibidas), y cómo son mantenidas.

source: Beyond the two types of tunnels - inbound and outbound - there are two styles of peer selection used for different tunnels - exploratory and client. Exploratory tunnels are used for both network database maintenance and tunnel maintenance, while client tunnels are used for end to end client messages.
es: Más allá de los dos tipos de túneles - entrante y saliente - hay dos estilos de selección del par (`peer`) usados por diferentes túneles - exploratorio y cliente. Los túneles exploratorios se usan tanto para el mantenimiento de la base de datos de red como para el mantenimiento del túnel, mientras los túneles de cliente se usan para mensajes de cliente extremo-a-extremo.

source: Exploratory tunnel peer selection
es: Selección de par de túnel exploratorio

source: Exploratory tunnels are built out of a random selection of peers from a subset of the network. The particular subset varies on the local router and on what their tunnel routing needs are. In general, the exploratory tunnels are built out of randomly selected peers who are in the peer's "not failing but active" profile category. The secondary purpose of the tunnels, beyond merely tunnel routing, is to find underutilized high capacity peers so that they can be promoted for use in client tunnels.
es: Los túneles exploratorios son construidos de una selección de pares aleatorios de un subconjunto de la red. Los subconjuntos varían en cada ruter local y según sean las necesidades de ese túnel. En general, los túneles exploratorios se construyen a partir de pares seleccionados aleatoriamente que están en categoría del perfil de par 'no se cae, está activo' . El segundo fin de los túneles, además de simplemente enrutar, es encontrar pares de alta capacidad libres para poder usarlos para los túneles clientes.

source: Exploratory peer selection is discussed further on the <a href="%(peerselection)s">Peer Profiling and Selection page</a>.
es: La selección de pares exploratorios se discute más en la <a href="%(peerselection)s">página de perfil del par y selección</a>.

source: Client tunnel peer selection
es: Selección del par para el túnel cliente

source: Client tunnels are built with a more stringent set of requirements - the local router will select peers out of its "fast and high capacity" profile category so that performance and reliability will meet the needs of the client application. However, there are several important details beyond that basic selection that should be adhered to, depending upon the client's anonymity needs.
es: Los túneles cliente son construidos con unos requerimientos más rigurosos - el ruter local selecciona los pares de la categoría de perfil "rápidos y de gran capacidad" para que el rendimiento y la fiabilidad se ajusten a las necesidades de la aplicación cliente. Aunque hay varios detalles importantes más allá de la selección básica que deben ser tomados en cuenta, dependiendo de las necesidades de anonimato que necesite el cliente.

source: Client peer selection is discussed further on the <a href="%(peerselection)s">Peer Profiling and Selection page</a>.
es: La selección del par cliente se discute más profundamente en la <a href="%(peerselection)s">página de perfil del par y selección</a>.

source: Peer Ordering within Tunnels
es: Orden de los pares dentro del túnel

source: Peers are ordered within tunnels to deal with the <a href="%(pdf)s">predecessor attack</a> <a href="%(pdf2008)s">(2008 update)</a>.
es: Los pares son ordenados dentro de los túneles para evitar el <a href="%(pdf)s">ataque del predecesor</a> <a href="%(pdf2008)s">(2008 update)</a>.

source: To frustrate the predecessor attack, the tunnel selection keeps the peers selected in a strict order - if A, B, and C are in a tunnel for a particular tunnel pool, the hop after A is always B, and the hop after B is always C.
es: Para evitar el ataque del predecesor, la selección del túnel mantiene a los pares seleccionados en estricto orden - si A, B, y C están en un túnel determinado para un grupo de túneles en particular, el salto después de A es siempre B, y el salto después de B siempre es C.

source: Ordering is implemented by generating a random 32-byte key for each tunnel pool at startup. Peers should not be able to guess the ordering, or an attacker could craft two router hashes far apart to maximize the chance of being at both ends of a tunnel. Peers are sorted by XOR distance of the SHA256 Hash of (the peer's hash concatenated with the random key) from the random key
es: El orden está implementado generando una clave aleatoria de 32 bytes para cada grupo de túneles al inicio. Los pares no deberían ser capaces de adivinar el orden, un atacante podría elaborar aparte dos hashes de ruter para maximizar las posibilidades de ser las dos puntas del túnel. Los pares están ordenados por la distancia XOR del hash SHA256 de (el hash del par concatenado con la clave aleatoria) de la clave aleatoria .

source: Because each tunnel pool uses a different random key, ordering is consistent within a single pool but not between different pools. New keys are generated at each router restart.
es: Ya que cada grupo de túneles utiliza una clave aleatoria diferente, el orden es consistente dentro de un mismo grupo pero no entre grupos. Las claves son generadas al reinicio de cada ruter.

source: Request delivery
es: Solicitud de entrega

source: A multi-hop tunnel is built using a single build message which is repeatedly decrypted and forwarded. In the terminology of <a href="%(pdf)s">Hashing it out in Public</a>, this is "non-interactive" telescopic tunnel building.
es: Un túnel multi-salto es construido usando un solo mensaje de construcción que es descifrado y enviado repetidamente. En la terminología de <a href="%(pdf)s">Hashing it out in Public</a>, esto es una construcción de túnel telescópica "no interactiva".

source: This tunnel request preparation, delivery, and response method is <a href="%(tunnelcreation)s">designed</a> to reduce the number of predecessors exposed, cuts the number of messages transmitted, verifies proper connectivity, and avoids the message counting attack of traditional telescopic tunnel creation. (This method, which sends messages to extend a tunnel through the already-established part of the tunnel, is termed "interactive" telescopic tunnel building in the "Hashing it out" paper.)
es: Este método de preparación, envío y respuesta de la solicitud de túnel está <a href="%(tunnelcreation)s">diseñado</a> para reducir el número de predecesores expuestos, cortar el número de mensajes transmitidos, verificar que la conectividad es apropiada y evitar el ataque clásico de conteo en la creación telescópica de los túneles tradicionales. (Este método, que envía mensajes para extender un túnel a través de la parte del túnel ya establecido, es llamado construcción de túnel telescópico "interactivo" en el estudio "Hashing it out")

source: The details of tunnel request and response messages, and their encryption, <a href="%(tunnelcreation)s">are specified here</a>.
es: Los detalles de los mensajes de peticiones y respuestas, y su cifrado, <a href="%(tunnelcreation)s">se especifican aquí</a>.

source: Peers may reject tunnel creation requests for a variety of reasons, though a series of four increasingly severe rejections are known: probabilistic rejection (due to approaching the router's capacity, or in response to a flood of requests), transient overload, bandwidth overload, and critical failure. When received, those four are interpreted by the tunnel creator to help adjust their profile of the router in question.
es: Los pares pueden denegar las peticiones de creación de túnel por varias razones, a través de una serie de cuatro rechazos cada vez más graves: rechazo propabilístico (debido a que le ruter se acerca al límite de su capacidad, o en respuesta de una riada de peticiones), sobrecarga transitoria, sobrecarga del ancho de banda, y fallo crítico. Cundo son recibidos, estos cuatro son interpretados por el creador del túnel para ayudar a ajustar su perfil a la petición del ruter.

source: For more information on peer profiling, see the <a href="%(peerselection)s">Peer Profiling and Selection page</a>.
es: Para más información sobre los perfiles del par, vea la <a href="%(peerselection)s">página de perfil del par y selección</a>.

source: Tunnel Pools
es: Grupos de túneles

source: To allow efficient operation, the router maintains a series of tunnel pools, each managing a group of tunnels used for a specific purpose with their own configuration. When a tunnel is needed for that purpose, the router selects one out of the appropriate pool at random. Overall, there are two exploratory tunnel pools - one inbound and one outbound - each using the router's default configuration. In addition, there is a pair of pools for each local destination - one inbound and one outbound tunnel pool. Those pools use the configuration specified when the local destination connects to the router via <a href="%(i2cp)s">I2CP</a>, or the router's defaults if not specified.
es: Para permitir un funcionamiento eficiente, el ruter mantiene una serie de grupos de túneles, cada uno manteniendo un conjunto de túneles usados para un fin específico con su propia configuración. Cuando un túnel se necesita para ese fin, el ruter selecciona aleatoriamente uno del grupo apropiado. En total, hay dos grupos de túneles exploratorios - uno de entrada y uno de salida - cada uno usando la configuración por defecto del túnel. Además, hay un par de grupos para cada destinación local - un grupo de entrada y un grupo de salida. Estos grupos usan la configuración especificada elegida cuando la destinación local conecta al ruter vía <a href="%(i2cp)s">I2CP</a>, o si el ruter no especifica una por defecto.

source: Each pool has within its configuration a few key settings, defining how many tunnels to keep active, how many backup tunnels to maintain in case of failure, how long the tunnels should be, whether those lengths should be randomized, as well as any of the other settings allowed when configuring individual tunnels. Configuration options are specified on the <a href="%(i2cp)s">I2CP page</a>.
es: Cada grupo tiene dentro de su configuración unas pocas opciones clave, que definen cuantos túneles se mantienen activos, cuantos túneles de respaldo se mantienen en caso de fallo, cuanto debe durar el túnel, si esos tamaños deben ser aleatorrizados, y también definen cualquier otra configuración permitida cuando se configuran los túneles individuales. Las opciones de configuración son especificadas en la <a href="%(i2cp)s">página de I2CP</a>.

source: Tunnel Lengths and Defaults
es: Longitud de los túneles y valores por defecto

source: On the tunnel overview page
es: En la página de introducción al túnel

source: Anticipatory Build Strategy and Priority
es: Estrategia de construcción anticipatoria y prioridad

source: Tunnel building is expensive, and tunnels expire a fixed time after they are built. However, when a pool that runs out of tunnels, the Destination is essentially dead. In addition, tunnel build success rate may vary greatly with both local and global network conditions. Therefore, it is important to maintain an anticipatory, adaptive build strategy to ensure that new tunnels are successfully built before they are needed, without building an excess of tunnels, building them too soon, or consuming too much CPU or bandwidth creating and sending the encrypted build messages.
es: La construcción de un túnel es cara, y los túneles expiran después de un tiempo fijo de haber sido creados. Sin embargo, el éxito de construcción de túnel puede variar enormemente según las condiciones de la red local y global. Por esto, es importante mantener una estrategia de construcción anticipatoria y adaptativa para asegurarse de que los túneles nuevos, antes de ser usados, son construidos exitosamente, no se construyen en exceso, no se construyen demasiado pronto, o consumen demasiada CPU o ancho de banda al crear y enviar los mensajes de construcción cifrados.

source: For each tuple {exploratory/client, in/out, length, length variance} the router maintains statistics on the time required for a successful tunnel build. Using these statistics, it calculates how long before a tunnel's expiration it should start attempting to build a replacement. As the expiration time approaches without a successful replacement, it starts multiple build attempts in parallel, and then will increase the number of parallel attempts if necessary.
es: Por cada tupla {esploratorio/cliente, entrada/salida, longitud, diferencia de longitud} el ruter mantiene estadísticas del tiempo necesario para la construcción con éxito de un túnel. Usando estas estadísticas, calcula cuando debe comenzar a intentar crear un reemplazo antes de la expiración del túnel. Cuando el tiempo de expiración se acerca sin un reemplazo exitoso, comienza a hacer múltiples intentos de construcción en paralelo, y entonces aumentará el número de intentos en paralelo si es necesario.
