Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: The choice of specific peers to pass on messages as well as their particular ordering is important to understanding both I2P's anonymity and performance characteristics. While the network database (below) has its own criteria for picking what peers to query and store entries on, tunnel creators may use any peers in the network in any order (and even any number of times) in a single tunnel. If perfect latency and capacity data were globally known, selection and ordering would be driven by the particular needs of the client in tandem with their threat model. Unfortunately, latency and capacity data is not trivial to gather anonymously, and depending upon untrusted peers to provide this information has its own serious anonymity implications.
es: La elección de los pares específicos par pasar los mensajes al igual que su orden es importante para entender el anonimato y el rendimiento de I2P. Mientras que la base de datos de la red (debajo) tiene su propio criterio al elegir en qué pares consultar y almacenar entradas, los creadores de los túneles pueden usar cualquier par en la red y en cualquier orden (e incluso cualquier número de veces) en un solo túnel. Si se conocen globalmente la latencia exacta y capacidad de datos, la selección del orden vendrá dada por las necesidades particulares del cliente y su modelo de seguridad. Desafortunadamente, no es trivial obtener anónimamente la latencia y la capacidad de datos, y al dependerse de pares no confiables para obtener esta información crea serios problemas en el anonimato.

source: From an anonymity perspective, the simplest technique would be to pick peers randomly from the entire network, order them randomly and use those peers in that order for all eternity. From a performance perspective, the simplest technique would be to pick the fastest peers with the necessary spare capacity, spreading the load across different peers to handle transparent failover, and to rebuild the tunnel whenever capacity information changes. While the former is both brittle and inefficient, the later requires inaccessible information and offers insufficient anonymity. I2P is instead working on offering a range of peer selection strategies, coupled with anonymity aware measurement code to organize the peers by their profiles.
es: Desde la perspectiva del anonimato, la técnica más simple sería elegir pares aleatoriamente de toda la red, ordenarlos aleatoriamente y usar esos pares en ese orden eternamente. Desde la perspectiva del rendimiento, la técnica más simple sería elegir los pares más rápidos con la capacidad necesaria, repartiendo la carga entre varios pares para manejar transparentemente los fallos, y para reconstruir el túnel cuando cambie la información sobre la capacidad disponible. Mientras que el primer modelo es frágil y deficiente, el segundo necesita información no accesible y no ofrece suficiente anonimato. I2P en cambio funciona ofreciendo un amplio abanico de estrategias de selección de pares, junto con código que tienen en cuenta el nivel de anonimato para organizar los pares y sus perfiles.

source: As a base, I2P is constantly profiling the peers with which it interacts with by measuring their indirect behavior - for instance, when a peer responds to a netDb lookup in 1.3 seconds, that round trip latency is recorded in the profiles for all of the routers involved in the two tunnels (inbound and outbound) through which the request and response passed, as well as the queried peer's profile. Direct measurement, such as transport layer latency or congestion, is not used as part of the profile, as it can be manipulated and associated with the measuring router, exposing them to trivial attacks. While gathering these profiles, a series of calculations are run on each to summarize its performance - its latency, capacity to handle lots of activity, whether they are currently overloaded, and how well integrated into the network they seem to be. These calculations are then compared for active peers to organize the routers into four tiers - fast and high capacity, high capacity, not failing, and failing. The thresholds for those tiers are determined dynamically, and while they currently use fairly simple algorithms, alternatives exist.
es: Por defecto I2P está constantemente comprobando los pares con los que interactúa y midiendo su comportamiento - por ejemplo, cuando un par responde a una búsqueda de netBD en 1,3 segundos, la latencia de vuelta es guardada en los perfiles de todos los ruters implicados en los 2 túneles (de entrada y de salida) por los que la respuesta ha pasado, así como el perfil del par consultado. Las mediciones directas, como el retardo de la capa de transporte o la congestión, no se usan como parte del perfil, ya que puede manipularse y ser asociada con el ruter que está midiendo, exponiéndolo a ataques triviales. Mientras se calculan estos perfiles, una serie de cálculos se ejecutan en cada uno para resumir su rendimiento - su latencia, su capacidad para manejar la pérdida de actividad, si está saturado, y cómo de bien está integrado dentro de la red. Estos cálculos son entonces comparados por los pares activos para organizar los ruters en 4 niveles - rápido y con gran capacidad, gran capacidad, sin caídas y con caídas. Los umbrales de estos niveles son determinados dinámicamente, y mientras que se usan algoritmos bastantes sencillos también existen otras alternativas.

source: Using this profile data, the simplest reasonable peer selection strategy is to pick peers randomly from the top tier (fast and high capacity), and this is currently deployed for client tunnels. Exploratory tunnels (used for netDb and tunnel management) pick peers randomly from the "not failing" tier (which includes routers in 'better' tiers as well), allowing the peer to sample routers more widely, in effect optimizing the peer selection through randomized hill climbing. These strategies alone do however leak information regarding the peers in the router's top tier through predecessor and netDb harvesting attacks. In turn, several alternatives exist which, while not balancing the load as evenly, will address the attacks mounted by particular classes of adversaries.
es: Usando este perfil, la estrategia de selección de par más razonable es coger los pares aleatoriamente del nivel más alto (rápido y con gran capacidad), que es los que se hace para los túneles clientes. Para los túneles de exploración (usados por netDB y la administración de túneles) se toman túneles aleatorios del nivel "sin fallos" (lo que incluye también a los túneles en los "mejores" niveles), permitiendo a los ruters tomar muestras más ampliamente, lo que tiene el efecto de optimizar la selección de pares a través de la escalada aleatoria. Sin embargo estas estrategias solas filtran información de los pares que están en el nivel más alto a causa de sus predecesores y a causa de ataques de 'cosechado' en la netDB. A su vez, existen otras alternativas, las cuales, aunque no reparten la carga igualitariamente, resistirán ciertos ataques usados habitualmente.

source: By picking a random key and ordering the peers according to their XOR distance from it, the information leaked is reduced in predecessor and harvesting attacks according to the peers' failure rate and the tier's churn. Another simple strategy for dealing with netDb harvesting attacks is to simply fix the inbound tunnel gateway(s) yet randomize the peers further on in the tunnels. To deal with predecessor attacks for adversaries which the client contacts, the outbound tunnel endpoints would also remain fixed. The selection of which peer to fix on the most exposed point would of course need to have a limit to the duration, as all peers fail eventually, so it could either be reactively adjusted or proactively avoided to mimic a measured mean time between failures of other routers. These two strategies can in turn be combined, using a fixed exposed peer and an XOR based ordering within the tunnels themselves. A more rigid strategy would fix the exact peers and ordering of a potential tunnel, only using individual peers if all of them agree to participate in the same way each time. This varies from the XOR based ordering in that the predecessor and successor of each peer is always the same, while the XOR only makes sure their order doesn't change.
es: Tomando una clave aleatoria y ordenando los pares de acuerdo a su distancia XOR de ella, la información expuesta es reducida en los ataques del predecesor y de cosechado conforme a la velocidad de fallo del par y de su mezcla de niveles. Otra estrategia simple para tratar con el ataque del cosechado de la netDB es simplemente fijando la puerta de salida(s) de túnel de entrada, ya sea aleatorizando los pares más lejos o en los túneles. Para tratar con el ataque del predecesor por adversarios con los que contacta el cliente, los puntos finales del túnel de salida deberían permanecer también fijos. Para seleccionar que par fijar en el punto más expuesto se necesitará, por supuesto, un límite de duración ya que todos los pares fallan más tarde o más temprano, con lo cual podría ser ajustado de manera reactiva o evitado de manera activa, para imitar el tiempo medio de los fallos de otros ruters. Estas 2 estrategias pueden ser combinadas en turnos, usando un par expuesto fijo y un orden basado en XOR dentro de los propios túneles. Una estrategia más rígida sería fijar los pares justos y ordenarlos en un túnel potencial, sólo usando pares individuales si todos están de acuerdo en participar de la misma forma cada vez. Esto varía del ordenado basado en XOR en que el predecesor y sucesor de cada par es siempre el mismo, mientras que el XOR asegura que el orden no cambie.

source: As mentioned before, I2P currently (release 0.8) includes the tiered random strategy above, with XOR-based ordering. A more detailed discussion of the mechanics involved in tunnel operation, management, and peer selection can be found in the <a href="%(tunnelimpl)s">tunnel spec</a>.
es: Como se ha mencionado anteriormente, actualmente I2P (versión 0.8) incluye la estrategia anterior de nivelado aleatorio, con ordenado basado en XOR. Una discusión más detallada en los mecanismos de la utilización, administración y selección de los pares de los túneles puede ser encontrada en las <a href="%(tunnelimpl)s">especificaciones del túnel</a>.

source: As mentioned earlier, I2P's netDb works to share the network's metadata. This is detailed in <a href="%(netdb)s">the network database</a> page, but a basic explanation is available below.
es: Como se ha dicho antes, las netDB de I2P trabaja para compartir los metadatos de la red. Esto se detalla en <a href="%(netdb)s">the network database</a>, pero una explicación básica está disponible debajo.

source: A percentage of I2P users are appointed as 'floodfill peers'. Currently, I2P installations that have a lot of bandwidth and are fast enough, will appoint themselves as floodfill as soon as the number of existing floodfill routers drops too low.
es: Un porcentaje de los usuarios de I2P son designados como 'pares floodfill'. Actualmente, las instalaciones de I2P que tienen un gran ancho de banda y son suficientemente rápidas se designarán ellas mismas como floodfills tan pronto como el número de de ruters floodfill existentes decrezca demasiado.

source: Other I2P routers will store their data and lookup data by sending simple 'store' and 'lookup' queries to the floodfills. If a floodfill router receives a 'store' query, it will spread the information to other floodfill routers using the <a href="http://en.wikipedia.org/wiki/Kademlia">Kademlia algorithm</a>. The 'lookup' queries currently function differently, to avoid an important <a href="%(netdb)s#lookup">security issue</a>. When a lookup is done, the floodfill router will not forward the lookup to other peers, but will always answer by itself (if it has the requested data).
es: Otros rutes I2P almacenarán sus datos y sus datos de búsqueda simplemente enviando consultas 'store' y 'lookup' a los floodfills. Si un floodfill recibe una consulta 'store', este difundirá la información a otros ruters floodfill usando el <a href="http://en.wikipedia.org/wiki/Kademlia">algoritmo Kademlia</a>. Las consultas 'lookup' funcionan de manera diferente para evitar un <a href="%(netdb)s#lookup">problema de seguridad</a> importante. Cuando se hace una búsqueda, el ruter floodfill no re enviará la búsqueda a otros pares, pero siempre responderá él mismo (si tiene la información requerida).

source: Two types of information are stored in the network database.
es: En la base de datos de la red se almacenan dos tipos de información.

source: A <b>RouterInfo</b> stores information on a specific I2P router and how to contact it
es: <b>RouterInfo</b> almacena información sobre un ruter I2P determinado y como contactar con él.

source: A <b>LeaseSet</b> stores information on a specific destination (e.g. I2P website, e-mail server...)
es: <b>LeaseSet</b> almacena información sobre una destinación específica (e.g. web I2P, servidor de correo...)

source: All of this information is signed by the publishing party and verified by any I2P router using or storing the information. In addition, the data contains timing information, to avoid storage of old entries and possible attacks. This is also why I2P bundles the necessary code for maintaining the correct time, occasionally querying some SNTP servers (the <a href="http://www.pool.ntp.org/">pool.ntp.org</a> round robin by default) and detecting skew between routers at the transport layer.
es: Toda esta información es firmada par la parte publicadora y verificada por cualquier ruter I2P que use o almacene la información. Además, los datos contienen información de la hora para evitar el almacenamiento de entradas antiguas y posibles ataques. Esto es por que I2P empaqueta el código necesario para mantener la fecha correcta, a veces consultando algunos servidores SNTP (por defecto <a href="http://www.pool.ntp.org/">pool.ntp.org</a>) y detectando diferencias entre los ruters y la capa de transporte.

source: Some additional remarks are also important.
es: Hay algunos comentarios adicionales que también son importantes:

source: Unpublished and encrypted leasesets:
es: Leasesets cifrados y no publicados:

source: One could only want specific people to be able to reach a destination. This is possible by not publishing the destination in the netDb. You will however have to transmit the destination by other means. An alternative are the 'encrypted leaseSets'. These leaseSets can only be decoded by people with access to the decryption key.
es: Uno puede desear que sólo determinada gente sea capaz de alcanzar una destinación. Esto es posible si no publica su destinación en la netDB. Pero entonces deberá transmitir la destinación de alguna otra forma. Una alternativa son los 'leaseSets' cifrados. Estos leaseSets' sólo pueden ser decodificados por la gente con acceso a la clave de descrifrado.

source: Bootstrapping:
es: Obteniendo los pares iniciales o Bootstrapping:

source: Bootstrapping the netDb is quite simple. Once a router manages to receive a single routerInfo of a reachable peer, it can query that router for references to other routers in the network. Currently, a number of users post their routerInfo files to a website to make this information available. I2P automatically connects to one of these websites to gather routerInfo files and bootstrap.
es: Bootstrapping en la netDB es muy simple. Una vez que un ruter recibe un routerInfo de un par accesible, puede consultar a ese ruter por referencias de otros ruters en la red. Actualmente varios usuarios comparten sus archivos routerInfo en una web para hacer que la información esté disponible. I2P se conecta automáticamente a una de estas webs para obtener los archivos routerInfo y obtener los primeros pares, bootstrap.

source: Lookup scalability:
es: Escalabilidad de las búsquedas:

source: Lookups in the I2P network are not forwarded to other netDb routers. Currently, this is not a major problem, since the network is not very large. However, as the network grows, not all routerInfo and leaseSet files will be present on each netDb router. This will cause a deterioration of the percentage of successful lookups. Because of this, refinements to the netDb will be done in the next releases.
es: Las búsquedas en la red I2P no son enviadas a otras netDBs de otros ruters. Actualmente no hay ningún problema ya que la red no es muy grande. Aún así, según vaya creciendo la red no todos los routerInfos y leaseSets estarán presentes en cada netDB de cada ruter. Esto causaría un deterioro en el porcentaje de búsquedas con éxito. A causa de esto en las prósimas versiones se mejorará la netDB.

source: Communication between routers needs to provide confidentiality and integrity against external adversaries while authenticating that the router contacted is the one who should receive a given message. The particulars of how routers communicate with other routers aren't critical - three separate protocols have been used at different points to provide those bare necessities.
es: La comunicación entre ruters necesita proporcionar confidencialidad e integridad contra cualquier adversario externo mientras se autentifica que el ruter contactado es el que debe recibir el mensaje. Los detalles de como se comunican los ruters con otros ruters no son críticos - se han usado tres protocolos diferentes en varios puntos para suplir estas necesidades.

source: I2P started with a TCP-based protocol which has since been disabled. Then, to accommodate the need for high degree communication (as a number of routers will end up speaking with many others), I2P moved from a TCP based transport to a <a href="%(ssu)s">UDP-based one</a> - "Secure Semireliable UDP", or "SSU".
es: I2P comenzó con un protocolo basado en TCP que ha sido deshabilitado. Luego, para adaptarse a las necesidades de comunicaciones de alto nivel (ya que un cierto número de routers I2P terminarán hablando con otros muchos), I2P cambió de un transporte basado en TCP a uno <a href="%(ssu)s">basado en UDP</a> - "Secure Semireliable UDP" (UDP seguro semifiable) o "SSU".

source: As described in the <a href="%(ssu)s">SSU spec</a>:
es: Como se describe en la <a href="%(ssu)s">especificación de SSU</a>:

source: The goal of this protocol is to provide secure, authenticated, semireliable and unordered message delivery, exposing only a minimal amount of data easily discernible to third parties. It should support high degree communication as well as TCP-friendly congestion control and may include PMTU detection. It should be capable of efficiently moving bulk data at rates sufficient for home users. In addition, it should support techniques for addressing network obstacles, like most NATs or firewalls.
es: La meta de este protocolo es proporcionar la entrega de mensajes de forma segura, con autentificación, semifiable y no ordenada, revelando sólo una pequeña cantidad de datos fácilmente discernible para terceras partes. Debe soportar comunicaciones de alto nivel así como sistemas de control de congestión adaptados-a-TCP, y puede incluir también detección de PMTU (máxima unidad de transferencia de la red). Debe ser capaz de mover eficientemente un gran volumen de datos a velocidades suficientes para los usuarios domésticos. Además debe soportar técnicas para afrontar los obstáculos en la red, como la mayoría de NATs (traductores de direcciones de red) o de cortafuegos (firewalls).

source: Following the introduction of SSU, after issues with congestion collapse appeared, a new NIO-based TCP transport called <a href="%(ntcp)s">NTCP</a> was implemented. It is enabled by default for outbound connections only. Those who configure their NAT/firewall to allow inbound connections and specify the external host and port (dyndns/etc is ok) on /config.jsp can receive inbound connections. As NTCP is NIO based, so it doesn't suffer from the 1 thread per connection issues of the old TCP transport.
es: Tras la introducción de SSU, y después de aparecer algunos problemas de congestión, se implementó un nuevo transporte TCP basado en NIO llamado <a href="%(ntcp)s">NTCP</a>. Está activado por defecto sólo para las conexiones de salida. Aquellos que configuran sus NAT/firewall para permitir conexiones de entrada y especifican el puerto y host externo (dyndns/etc es válido) en /config.jsp pueden recibir conexiones de entrada. Al estar NTPC basado en NIO no sufre del problema de "1 hilo por conexión" del viejo protocolo de transporte TCP.

source: I2P supports multiple transports simultaneously. A particular transport for an outbound connection is selected with "bids". Each transport bids for the connection and the relative value of these bids assigns the priority. Transports may reply with different bids, depending on whether there is already an established connection to the peer.
es: I2P soporta simultáneamente varios tipos de transportes. Para conexiones de salida se selecciona un determinado tipo de transporte a través de "pujas". Cada tipo de transporte puja por la conexión y el valor relativo de esa puja asignará la prioridad. Los transportes pueden responder con varias apuestas, dependiendo de si ya hay una conexión establecida con el par.

source: The current implementation ranks NTCP as the highest-priority transport for outbound connections in most situations. SSU is enabled for both outbound and inbound connections. Your firewall and your I2P router must be configured to allow inbound NTCP connections. For further information see the <a href="%(ntcp)s">NTCP page</a>.
es: La implementación actual clasifica en la mayoría de las situaciones a NTPC como el sistema de transporte de mayor prioridad para conexiones de salida. SSU está activo para las conexiones de entrada y de salida. Su cortafuegos y su ruter I2P tienen estar configurados para permitir conexiones de entrada NTCP. Para más información vea la <a href="%(ntcp)s">ṕagina de NTCP</a>.

source: A bare minimum set of cryptographic primitives are combined together to provide I2P's layered defenses against a variety of adversaries. At the lowest level, inter router communication is protected by the transport layer security - SSU encrypts each packet with AES256/CBC with both an explicit IV and MAC (HMAC-MD5-128) after agreeing upon an ephemeral session key through a 2048bit Diffie-Hellman exchange, station-to-station authentication with the other router's DSA key, plus each network message has their own hash for local integrity checking. <a href="#op.tunnels">Tunnel</a> messages passed over the transports have their own layered AES256/CBC encryption with an explicit IV and verified at the tunnel endpoint with an additional SHA256 hash. Various other messages are passed along inside "garlic messages", which are encrypted with ElGamal/AES+SessionTags (explained below).
es: Un conjunto mínimo de cifrados son combinados para proveer a I2P defensas contra varios adversarios. En el nivel más bajo la comunicación entre ruters es protegida por la capa de seguridad de transporte - SSU cifra cada paquete con AES256/CBC incluyendo un IV explícito y MAC (HMAC-MD5-128), después de haber acordado una clave de sesión efímera a través de un intercambio Diffie-Hellman de 2048bit, autenticación de estación a estación con la clave DSA de los otros ruters, y además cada mensaje de red tiene su propio hash para comprobar la integridad local. Los mensajes de <a href="#op.tunnels">túnel</a> ya transportados tienen su propio cifrado por capas AES256/CBC con un IV explícito verificado en el punto final del túnel con un hash adicional SHA256. Otros ciertos mensajes son pasados dentro del "mensaje garlic" y son cifrados con ElGamal/AES+Etiquetas de sesión (explicado más abajo).
