Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: The <a href="%(comparisons)s">network comparisons</a> and <a href="%(garlicrouting)s">"garlic" terminology</a> pages may also be helpful to review.
es: Vale la pena re leer las páginas <a href="%(comparisons)s">comparación entre redes</a> y <a href="%(garlicrouting)s">"terminología garlic</a> sobre el tema.

source: A brute force attack can be mounted by a global passive or active adversary, watching all the messages pass between all of the nodes and attempting to correlate which message follows which path. Mounting this attack against I2P should be nontrivial, as all peers in the network are frequently sending messages (both end to end and network maintenance messages), plus an end to end message changes size and data along its path. In addition, the external adversary does not have access to the messages either, as inter-router communication is both encrypted and streamed (making two 1024 byte messages indistinguishable from one 2048 byte message).
es: Un ataque por fuerza bruta puede ser montado por adversarios pasivos o activos, observando todos los mensajes que pasan entre todos los nodos e intentarlo averiguar que mensaje sigue qué camino. Montar este ataque sobre I2P no debería ser trivial, ya que todos los pares en la red envían mensajes frecuentemente (de fin a fin y mensajes de mantenimiento de la red), además un mensaje de fin a fin cambia su tamaño y datos a lo largo de su camino. Además, un adversario externo tampoco tiene acceso al mensaje, ya que la comunicación interna entre ruters está cifrada y después enviada (haciendo que un mensaje de 1024 bytes sea indistinguible de un mensaje de 2048 bytes)

source: However, a powerful attacker can use brute force to detect trends - if they can send 5GB to an I2P destination and monitor everyone's network connection, they can eliminate all peers who did not receive 5GB of data. Techniques to defeat this attack exist, but may be prohibitively expensive (see: <a href="http://citeseer.ist.psu.edu/freedman02tarzan.html">Tarzan</a>'s mimics or constant rate traffic). Most users are not concerned with this attack, as the cost of mounting it are extreme (and often require illegal activity). However, the attack is still possible, for example by an observer at a large ISP or an Internet exchange point. Those who want to defend against it would want to take appropriate countermeasures, such as setting low bandwidth limits, and using unpublished or encrypted leasesets for eepsites. Other countermeasures, such as nontrivial delays and restricted routes, are not currently implemented.
es: Aún así, un atacante poderoso podría usar la fuerza bruta para detectar tendencias - si puede enviar 5GB a una destinación I2P y monitorizar las conexiones de red de todos, podría eliminar a todos los pares que no recibieron los 5Gb de datos. Existen técnicas para evitar este ataque, pero pueden ser prohibitivamente caras (vea <a href="http://citeseer.ist.psu.edu/freedman02tarzan.html">Tarzan</a>). A la mayoría de los usuarios no les debería preocupar este ataque, ya que el coste de montarlo es enorme (y normalmente ilegal). Aún así, el ataque es plausible, por ejemplo, para un observador en un ISP o en un punto de cambio de Internet. Los que deseen protegerse de este ataque deben tomar las medidas necesarias, como poner límites bajos al ancho de banda, y usar leasesets cifrados o no publicados para las eepsites. Otras medidas, como retardos no triviales y rutas restringidas no se han implementado.

source: As a partial defense against a single router or group of routers trying to route all the network's traffic, routers contain limits as to how many tunnels can be routed through a single peer. As the network grows, these limits are subject to further adjustment. Other mechanisms for peer rating, selection and avoidance are discussed on the <a href="%(peerselection)s">peer selection page</a>.
es: Como una defensa parcial contra un ruter o varios tratando de enrutar todo el tráfico de la red, los ruters contienen límites como el número de túneles que puede pasar por un único ruter. Según crezca la red, estos límites serán ajustados. Otros mecanismos como la clasificación, selección y anulación de los ruters son discutidos en la <a href="%(peerselection)s">página de selección de ruters</a>.

source: I2P's messages are unidirectional and do not necessarily imply that a reply will be sent. However, applications on top of I2P will most likely have recognizable patterns within the frequency of their messages - for instance, an HTTP request will be a small message with a large sequence of reply messages containing the HTTP response. Using this data as well as a broad view of the network topology, an attacker may be able to disqualify some links as being too slow to have passed the message along.
es: Los mensajes de I2P son unidireccionales, y no implican necesariamente que se enviará una respuesta. Aún así, las aplicaciones sobre I2P tienen patrones reconocibles dentro de las frecuencias de sus mensajes - por ejemplo, una petición HTTP tendrá un pequeño mensaje con una secuencia larga de mensajes de respuesta conteniendo las respuestas HTTP. Utilizando esta información y teniendo una vista general de la topología de la red, un atacante podría inhabilitar algunos enlaces como mensajes demasiado lentos como para ser pasados.

source: This sort of attack is powerful, but its applicability to I2P is non obvious, as the variation on message delays due to queuing, message processing, and throttling will often meet or exceed the time of passing a message along a single link - even when the attacker knows that a reply will be sent as soon as the message is received. There are some scenarios which will expose fairly automatic replies though - the streaming library does (with the SYN+ACK) as does the message mode of guaranteed delivery (with the DataMessage+DeliveryStatusMessage).
es: Este tipo de taques es poderoso, pero su aplicación a I2P no es obvia. Debido a la variación de los retardos de los mensajes en las colas, procesamiento de los mensajes y estrechamientos, a menudo excederán el tiempo para pasar un mensaje a través de un enlace - incluso cuando un atacante sabe que una respuesta será enviada tan pronto como el mensaje llegue. Aunque hay varios escenarios en los cuales se exponen respuestas casi automáticas - la librería de streaming lo hace (con el SYN+ACK) al igual que que el modo de mensaje de la garantía del envío (con el DataMessage+DeliveryStatusMessage).

source: Without protocol scrubbing or higher latency, global active adversaries can gain substantial information. As such, people concerned with these attacks could increase the latency (using <a href="%(todo)s#stop">nontrivial delays</a> or <a href="%(todo)s#batching">batching strategies</a>), include protocol scrubbing, or other advanced tunnel routing <a href="%(todo)s#batching">techniques</a>, but these are unimplemented in I2P.
es: Sin la depuración del protocolo y unas mayores latencias, adversarios globales pueden obtener bastante información. Por eso, la gente preocupada por estos ataques puede aumentar la latencia (usando <a href="%(todo)s#stop">retardos no triviales</a> o <a href="%(todo)s#batching">estrategias de procesado por lotes</a>), incluyendo la depuración del protocolo, o las <a href="%(todo)s#batching">técnicas</a> de enrutado avanzado de túneles, pero estas no están implementadas en I2P.

source: References: <a href="%(pdf)s">Low-Resource Routing Attacks Against Anonymous Systems</a>
es: Referencias: <a href="%(pdf)s">Low-Resource Routing Attacks Against Anonymous Systems</a>

source: Intersection attacks against low latency systems are extremely powerful - periodically make contact with the target and keep track of what peers are on the network. Over time, as node churn occurs the attacker will gain significant information about the target by simply intersecting the sets of peers that are online when a message successfully goes through. The cost of this attack is significant as the network grows, but may be feasible in some scenarios.
es: Los ataques de intersección contra los sistemas de baja latencia son realmente poderosos - contactando con el objetivo periódicamente y llevando el registro de los pares que hay en la red. Con el tiempo, y con el movimiento, el atacante obtendrá bastante información sobre el objetivo simplemente observando los pares que hay online cuando un mensaje pasa a través. El costo de este ataque aumenta según aumenta el tamaño de la red, pero puede ser válido en varios escenarios.

source: In summary, if an attacker is at both ends of your tunnel at the same time, he may be successful. I2P does not have a full defense to this for low latency communication. This is an inherent weakness of low-latency onion routing. Tor provides a <a href="%(url)s">similar disclaimer</a>.
es: En resumen, si un atacante está al inicio y al final de tu túnel al mismo tiempo podría tener éxito. I2P no tiene defensa contra este ataque en una comunicación de baja latencia. Esto es una debilidad inherente del enrutado onion de baja latencia. Tor proporciona una <a href="%(url)s">aclaración similar</a>.

source: Partial defenses implemented in I2P:
es: Defensa parcialmente implementada en I2P:

source: <a href="%(tunnelimpl)s#ordering">strict ordering</a> of peers
es: <a href="%(tunnelimpl)s#ordering">orden estricto</a> de pares

source: <a href="%(peerselection)s">peer profiling and selection</a> from a small group that changes slowly
es: <a href="%(peerselection)s">selección y perfiles de los pares</a> de un pequeño grupo que cambia lentamente

source: Limits on the number of tunnels routed through a single peer
es: Límite en el número de túneles rutados a través de un solo par

source: Prevention of peers from the same /16 IP range from being members of a single tunnel
es: Prevención de pares del mismo rango /16 de IPs por ser miembros del mismo único túnel.

source: For eepsites or other hosted services, we support simultaneous hosting on multiple routers, or <a href="#intersection">multihoming</a>
es: Para eepsites y otros servicios hospedados, damos soporte para el alojamiento simultáneo redundante en múltiples routers I2P, o <a href="#intersection">multihoming</a>

source: Even in total, these defenses are not a complete solution. Also, we have made some design choices that may significantly increase our vulnerability:
es: Incluso usando todas ellas, estas defensas no son una solución completa. Además, hemos hecho algunas elecciones de diseño que podrían incrementar las vulnerabilidades:

source: We do not use low-bandwidth "guard nodes"
es: No utilizamos "nodos guardianes" de bajo ancho de banda

source: We use tunnel pools comprised of several tunnels, and traffic can shift from tunnel to tunnel.
es: Usamos grupos de túneles compuestos de varios túneles, y el tráfico puede pasar de túnel a túnel.

source: Tunnels are not long-lived; new tunnels are built every 10 minutes.
es: Los túneles no son de larga duración; los túneles se recrean cada 10 minutos.

source: Tunnel lengths are configurable. While 3-hop tunnels are recommended for full protection, several applications and services use 2-hop tunnels by default.
es: El tamaño de los túneles es configurable. Aunque se recomienda 3 saltos por túnel para protección total, algunas aplicaciones y servicios usan túneles de 2 saltos por defecto.

source: In the future, it could for peers who can afford significant delays (per <a href="%(todo)s#stop">nontrivial delays</a> and <a href="%(todo)s#batching">batching strategies</a>). In addition, this is only relevant for destinations that other people know about - a private group whose destination is only known to trusted peers does not have to worry, as an adversary can't "ping" them to mount the attack.</p>
es: En el futuro, esto podría ocurrir para los cares que puedan permitirse retardos significativos (por <a href="%(todo)s#stop">retardos no triviales</a> y <a href="%(todo)s#batching">estrategias de procesado por lotes</a>). Además, esto sólo es relevante para las destinaciones que pueden ser conocidas por otra gente - un grupo privado cuya destinación es sólo conocida por pares de confianza no tiene de que preocuparse, ya que un adversario no puede contactarles,"ping" them, para montar el ataque.

source: Reference: <a href="%(oce)s">One Cell Enough</a>
es: Referencia: <a href="%(oce)s">One Cell Enough</a>

source: There are a whole slew of denial of service attacks available against I2P, each with different costs and consequences:
es: Hay un montón de ataques de denegación de servicio disponibles contra I2P, cada cual con sus costes y consecuencias:

source: <b>Greedy user attack:</b> This is simply people trying to consume significantly more resources than they are willing to contribute. The defense against this is:
es: <b>Ataque del usuario codicioso:</b> Esto es simplemente gente intentando consumir muchas más recursos de los que están dispuestos a compartir. La defensa contra este ataque es:

source: Set defaults so that most users provide resources to the network. In I2P, users route traffic by default. In sharp distinction to <a href="%(comparisons)s">other networks</a>, over 95&#37; of I2P users relay traffic for others.
es: Establezca las configuraciones por defecto de forma que la mayoría de los usuarios proporcionen recursos a la red. En I2P, los usuarios enrutan tráfico por defecto. En clara distinción con <a href="%(comparisons)s">otras redes</a>, más del 95&#37; de los usuarios de I2P repiten tráfico para otros.

source: Provide easy configuration options so that users may increase their contribution (share percentage) to the network. Display easy-to-understand metrics such as "share ratio" so that users may see what they are contributing.
es: Proporcionar opciones de configuración fáciles para que los usuarios puedan incrementar su contribución (porcentaje de lo que se comparte) a la red. Mostrar medidas fáciles de entender como "el ratio de lo que se comparte" para que los usuarios puedan ver lo que contribbuyen.

source: Maintain a strong community with blogs, forums, IRC, and other means of communication.
es: Manteniendo una comunidad fuerte con blogs, foros, IRC y otras formas de comunicación.

source: <b>Starvation attack:</b> A hostile user may attempt to harm the network by creating a significant number of peers in the network who are not identified as being under control of the same entity (as with Sybil). These nodes then decide not to provide any resources to the network, causing existing peers to search through a larger network database or request more tunnels than should be necessary. Alternatively, the nodes may provide intermittent service by periodically dropping selected traffic, or refusing connections to certain peers. This behavior may be indistinguishable from that of a heavily-loaded or failing node. I2P addresses these issues by maintaining <a href="%(peerselection)s">profiles</a> on the peers, attempting to identify underperforming ones and simply ignoring them, or using them rarely. We have significantly enhanced the ability to recognize and avoid troublesome peers; however there are still significant efforts required in this area.
es: <b>Ataque por 'hambruna':</b> Un usuario hostil puede intentar dañar la red creando un gran número de pares en la red ocultando que están bajo el control de la misma persona (como con Sybil). Esos nodos deciden entonces no dar recursos a la red , haciendo que los pares existentes tengan que buscar una base de datos de red más grande o crear más túneles de los necesarios. Además, los nodos pueden ofrecer servicio intermitente eliminando periódicamente el tráfico elegido, o negando las conexiones a ciertos pares,. Este funcionamiento puede no diferenciarse del de un nodo saturado y con fallos. I2P soluciona este problema manteniendo <a href="%(peerselection)s">perfiles</a> de los pares, intentando identificar los que funciona mal e ignorándolos , o usándolos raramente. Hemos hechos grandes avances en el reconocimiento de los pares problemáticos; aún así todavía se requieren grandes esfuerzos en este área.

source: <b>Flooding attack:</b> A hostile user may attempt to flood the network, a peer, a destination, or a tunnel. Network and peer flooding is possible, and I2P does nothing to prevent standard IP layer flooding. The flooding of a destination with messages by sending a large number to the target's various inbound tunnel gateways is possible, but the destination will know this both by the contents of the message and because the tunnel's tests will fail. The same goes for flooding just a single tunnel. I2P has no defenses for a network flooding attack. For a destination and tunnel flooding attack, the target identifies which tunnels are unresponsive and builds new ones. New code could also be written to add even more tunnels if the client wishes to handle the larger load. If, on the other hand, the load is more than the client can deal with, they can instruct the tunnels to throttle the number of messages or bytes they should pass on (once the <a href="%(todo)s#batching">advanced tunnel operation</a> is implemented).
es: <b>Ataque por inundación, flooding:</b> Un usuario hostil puede intentar inundar o saturar, la red, un par, una destinación o un túnel. La saturación de la red y de los pares es factible, e I2P no hace nada por prevenir la saturación de la capa de IP. Es posible saturar una destinación enviando un gran número de mensajes a las puertas de salida de los túneles de entrada, pero el destinatario tendrá conocimiento del ataque por los contenidos de los mensajes y porque las pruebas de los túneles fallarán. Lo mismo ocurre con la saturación de un solo túnel. I2P no tiene defensas para el ataque a la red por inundación. Para el ataque por inundación de una destinación o un túnel, el objetivo identifica cuales túneles no responden y crea unos nuevos. Se podría añadir nuevo código para aumentar el número de túneles por si el cliente desease manejar la sobrecarga. Si, por otra parte, la carga es mayor de lo que el cliente puede soportar, puede instruir a los túneles para acelerar el número de mensajes o bytes que deben ser pasados (una vez que se implemente el <a href="%(todo)s#batching">funcionamiento avanzad de los túneles</a>).

source: <b>CPU load attack:</b> There are currently some methods for people to remotely request that a peer perform some cryptographically expensive operation, and a hostile attacker could use these to flood that peer with a large number of them in an attempt to overload the CPU. Both using good engineering practices and potentially requiring nontrivial certificates (e.g. HashCash) to be attached to these expensive requests should mitigate the issue, though there may be room for an attacker to exploit various bugs in the implementation.
es: <b>Ataque de carga de CPU:</b> Hay algunos métodos que pueden hacer que algún usuario remoto solicite que un par haga operaciones de cifrados muy costosas, y un usuario hostil puede usar esto para saturar el par con un gran número de solicitudes e intentar saturar la CPU. Usando buenas prácticas de ingeniería y exigiendo certificados no triviales (por ejemplo HashCash) puede mitigarse el problema, aunque hay posibilidad también de que un atacante explote algún error en la implementación.

source: <b>Floodfill DOS attack:</b> A hostile user may attempt to harm the network by becoming a floodfill router. The current defenses against unreliable, intermittent, or malicious floodfill routers are poor. A floodfill router may provide bad or no response to lookups, and it may also interfere with inter-floodfill communication. Some defenses and <a href="%(peerselection)s">peer profiling</a> are implemented, however there is much more to do. For more information see the <a href="%(netdb)s#threat">network database page</a>.
es: <b>Ataque floodfill de denegación de servicio:</b> Un usuario hostil puede intentar dañar la red convirtiéndose en un ruter floodfill. Las defensas actuales contra los ruters floodfill no fiables, intermitentes o maliciosos son pobres. Un ruter floodfill puede dar respuestas falsas o no darlas a las búsquedas, y puede también interferir en las comunicaciones entre floodfills. Se han implementado algunas defensas y el <a href="%(peerselection)s">control de perfiles</a>, aún así hay mucho por hacer todavía. Para más información vea la <a href="%(netdb)s#threat">web de la base de datos de la red</a>.

source: Tagging attacks - modifying a message so that it can later be identified further along the path - are by themselves impossible in I2P, as messages passed through tunnels are signed. However, if an attacker is the inbound tunnel gateway as well as a participant further along in that tunnel, with collusion they can identify the fact that they are in the same tunnel (and prior to adding <a href="%(todo)s#tunnelId">unique hop ids</a> and other updates, colluding peers within the same tunnel can recognize that fact without any effort). An attacker in an outbound tunnel and any part of an inbound tunnel cannot collude however, as the tunnel encryption pads and modifies the data separately for the inbound and outbound tunnels. External attackers cannot do anything, as the links are encrypted and messages signed.
es: Los ataques de etiquetado - modificando un mensaje de tal forma que más tarde pueda ser identificado en el camino - son imposibles en I2P, ya que los mensajes enviados a través de los túneles están firmados. Aún así, si un atacante es la puerta de salida del túnel de entrada y es también un participante en otro lugar del mismo túnel, puede identificar el hecho de que están en el mismo túnel (y antes de añadir el <a href="%(todo)s#tunnelId">id único del salto</a> y otros cambios, los pares coincidentes dentro del mismo túnel pueden reconocer este hecho sin ningún esfuerzo). Pero un atacante en el túnel de salida y en cualquier otra parte de un túnel de entrada no puede hacer nada, ya que el cifrado del túnel codifica la información de diferente forma en los túneles de entrada y en los de salida. Los atacantes externos tampoco pueden hacer nada, ya que los enlaces están cifrados y los mensajes firmados.
