Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: At a minimum you will need i2p.jar, router.jar, streaming.jar, and mstreaming.jar. You may omit the two streaming jars for a datagram-only app. Some apps may need more, e.g. i2ptunnel.jar or addressbook.jar. Don't forget jbigi.jar, or a subset of it for the platforms you support, to make the crypto much faster. We are currently building them for Java 6, as of 0.9.14. The source is mostly compatible with Java 5 if you want to do your own compile, but we may start using Java 6 features at any time without notice. We plan to migrate to Java 7 in 2015. If you're building Debian / Ubuntu packages, you should require the I2P package from our PPA instead of bundling it. You almost certainly do not need susimail, susidns, the router console, and i2psnark, for example.
es: Como mínimo necesitará i2p.jar, router.jar, streaming.jar, y mstreaming.jar. Puede omitir los dos ficheros jar de transporte streaming para una aplicación de sólo-datagramas. Algunas aplicaciones puede que necesiten más, ej. i2ptunnel.jar o addressbook.jar. No olvide jbigi.jar, o un subconjunto de este para las plataformas que soporte, para hacer la criptografía mucho más rápida. Actualmente estamos compilándolos para Java 6, desde la 0.9.14. La fuente es en su mayoría compatible con Java 5 si quiere hacer su propia compilación, pero puede que comencemos a usar las características de Java 6 en cualquier momento sin avisar. Planeamos migrar a Java7 en 2015. Si está compilando paquetes Debian / Ubuntu, debe pedir el paquete I2P a nuestro archivo PPA en lugar de empaquetarlo. Casi seguro que no necesita susimail, susidns, la consola del router I2P, e i2psnark, por ejemplo.

source: The following files should be included in the I2P installation directory, specified with the "i2p.dir.base" property. Don't forget certificates/reseed and certificates/ssl, required for reseeding, and blocklist.txt for IP validation. The geoip directory is optional, but recommended so the router can make decisions based on location. The hosts.txt file may be necessary, you may modify it to include any hosts your application uses. You may add a router.config file to the base directory to override initial defaults.
es: Los siguientes ficheros se deben incluir en el directorio de instalación de I2P, especificado con la propiedad "i2p.dir.base". No olvide certificates/reseed y certificates/ssl requeridos para el resembrado, ni blocklist.txt para la validación IP. El directorio geoip es opcional, pero está recomendado para que el router I2P pueda tomar decisiones basándose en la ubicación. El fichero hosts.txt puede ser necesario, puede modificarlo para incluir cualquier fichero hosts que use su aplicación. Puede añadir un fichero router.config al directorio base para superponerse a la configuración inicial predeterminada.

source: License requirements may require you to include the LICENSES.txt file and the licenses directory.
es: Los condicionantes de la licencia pueden requerir que incluya el fichero LICENSES.txt y el directorio de licencias.

source: You may also wish to bundle a hosts.txt file.
es: Puede que también quiera empaquetar un fichero hosts.txt.

source: Be sure to specify a Java 6 bootclasspath if compiling with Java 8.
es: Asegúrese de especificar una bootclasspath de Java 6 si compila con Java 8.

source: Datagram (DHT) considerations
es: Consideraciones de datagrama (DHT)

source: If your application is using I2P datagrams, e.g. for a DHT, there's lots of advanced options available to reduce overhead and increase reliability. This may take some time and experimentation to get working well. Be aware of size/reliability tradeoffs. Talk to us for help. It is possible - and recommended - to use Datagrams and Streaming on the same Destination. Don't create separate Destinations for this. Don't try to store your unrelated data in the existing network DHTs (iMule, bote, bittorrent, and router). Build your own. If you are hardcoding seed nodes, we recommend that you have several.
es: Si su aplicación está usando datagramas I2P, ej. para una DHT (tabla de hashes distribuida), hay montones de opciones avanzadas disponibles para reducir le tráfico de control e incrementar la fiabilidad. Esto puede llevar algún tiempo y experimentación para lograr que funcione bien. Tenga en cuenta los equilibrios tamaño/fiabilidad. Hable con nosotros para obtener ayuda. Es posible - y está recomendado - usar datagramas y transporte streaming para el mismo destino. No cree destinos separados para esto. No trate de almacenar sus datos sin relación en los DHTs existentes en la red (iMule, bote, bittorrent, y el router I2P). Construya el suyo propio. Si está integrando nodos semilla en el código, recomendamos que incluya varios.

source: Comarketing
es: Marketing colaborativo

source: Let's work together. Don't wait until it's done. Give us your Twitter handle and start tweeting about it, we will return the favor.
es: Trabajemos juntos. No espere hasta que esté hecho. Denos su identificador de Twitter y comience a twitear acerca de ello, devolveremos el favor.

source: Please don't use I2P for evil. It could cause great harm both to our network and our reputation.
es: Por favor, no use I2P para el mal. Podría causar un gran daño tanto a nuestra red como a nuestra reputación.

source: Join Us
es: Únase a nosotros

source: This may be obvious, but join the community. Run I2P 24/7. Start an eepsite about your project. Hang out in IRC #i2p-dev. Post on the forums. Spread the word. We can help get you users, testers, translators, or even coders.
es: Esto puede ser obvio, pero únase a la comunidad. Ejecute I2P 24/7. Comience un eepsite acerca de su proyecto. Déjese caer por #i2p-dev en el IRC. Publique en los foros. Corra la voz. Podemos ayudar a conseguirle usuarios, probadores, traductores, o incluso programadores.

source: Application Examples
es: Ejemplos de la aplicación

source: You may wish to install and play with the I2P Android app, and look at its code, for an example of an application that bundles the router. See what we expose to the user and what we hide. Look at the state machine we use to start and stop the router. Other examples are: Vuze, the Nightweb Android app, iMule, TAILS, iCloak, and Monero.
es: Puede que desee instalar y jugar con la aplicación I2P Android, y echar un vistazo a su código en busca de un ejemplo de aplicación que empaqueta el router I2P. Vea lo que exponemos al usuario y lo que ocultamos. Mire la máquina de estado que usamos para iniciar y detener el router I2P. Otros ejemplos son: Vuze, la aplicación Nightweb Android, iMule, TAILS, iCloak, y Monero.

source: Code Example
es: Ejemplo de código

source: None of the above actually tells you how to write your code to bundle the Java router, so following is a brief example.
es: Nada de lo anterior le cuenta en realidad cómo escribir su código para empaquetar el router I2P Java, así que a continuación tiene un breve ejemplo.

source: This code is for the case where your application starts the router, as in our Android app. You could also have the router start the application via the clients.config and i2ptunnel.config files, together with Jetty webapps, as is done in our Java packages. As always, state management is the difficult part.
es: Este código es para el caso en que su aplicación inicia el router I2P, como en nuestra aplicación Android. También podría disponer que el router I2P inicie la aplicación mediante los ficheros clients.config e i2ptunnel.config, junto con las aplicaciones web Jetty, tal como se hizo en nuestros paquetes Java. Como siempre, la gestión del estado es la parte difícil.

source: February 2014
es: Febrero de 2014

source: Clients may be started directly by the router when they are listed in the <a href="%(configspec)s">clients.config</a> file. These clients may be "managed" or "unmanaged". This is handled by the ClientAppManager. Additionally, managed or unmanaged clients may register with the ClientAppManager so that other clients may retrieve a reference to them. There is also a simple Port Mapper facility for clients to register an internal port that other clients may look up.
es: Los clientes pueden ser iniciados directamente por el router I2P cuando estén listados en el fichero <a href="%(configspec)s">clients.config</a>. Estos clientes pueden ser "gestionados" o "no gestionados". Esto es manejado por el ClientAppManager (gestor de aplicaciones cliente). Adicionalmente, gestionados o no, los clientes pueden registrarse con el ClientAppManager de forma que otros clientes puedan obtener referencias hacia ellos. También hay una funcionalidad de Mapeador de Puertos para que los clientes registren un puerto interno por el que otros clientes pueden buscar.

source: As of release 0.9.4, the router supports managed clients. Managed clients are instantiated and started by the ClientAppManager. The ClientAppManager maintains a reference to the client and receives updates on the client's state. Managed clients are preferred, as it is much easier to implement state tracking and to start and stop a client. It also is much easier to avoid static references in the client code which could lead to excessive memory usage after a client is stopped. Managed clients may be started and stopped by the user in the router console, and are stopped at router shutdown.
es: Desde la versión 0.9.4, el router I2P soporta clientes gestionados. Los clientes gestionados son invocados e iniciados por el ClientAppManager. El ClientAppManager mantiene una referencia hacia el cliente y recibe actualizaciones sobre su estado. Se prefieren los clientes gestionados, ya que es mucho más fácil implementar el rastreo del estado e iniciar y detener un cliente. También es mucho más fácil evitar referencias estáticas en el código del cliente que podrían llevar a un uso excesivo de memoria después de que un cliente sea detenido. Los clientes gestionados pueden ser iniciados y detenidos por el usuario en la consola del router I2P, y son detenidos en el apagado del router.

source: Managed clients implement either the net.i2p.app.ClientApp or net.i2p.router.app.RouterApp interface. Clients implementing the ClientApp interface must provide the following constructor:
es: Los clientes gestionados implementan o bien la interfaz net.i2p.app.ClientApp o bien net.i2p.router.app.RouterApp . Los clientes que implementan la interfaz ClientApp deben proporcionar el siguiente constructor:

source: Clients implementing the RouterApp interface must provide the following constructor:
es: Los clientes que implementan la interfaz RouterApp deben proporcionar el siguiente constructor:

source: The arguments provided are specified in the clients.config file.
es: Los argumentos proporcionados se especifican en el fichero clients.config .

source: Unmanaged Clients
es: Clientes no gestionados

source: If the main class specified in the clients.config file does not implement a managed interface, it will be started with main() with the arguments specified, and stopped with main() with the arguments specified. The router does not maintain a reference, since all interactions are via the static main() method. The console cannot provide accurate state information to the user.
es: Si la clase principal especificada en el fichero clients.config no implementa una interfaz gestionada, será iniciada con main() con los argumentos especificados, y detenida con main() con los argumentos especificados. El router I2P no mantiene una referencia, ya que todas las interacciones se realizan mediante el método main(). La consola no puede proporcionar información de estado precisa al usuario.

source: Registered Clients
es: Clientes registrados

source: Clients, whether managed or unmanaged, may register with the ClientAppManager so that other clients may retrieve a reference to them. Registration is by name. Known registered clients are:
es: Los clientes, tanto si son gestionados como si no, pueden registrarse con el ClientAppManger de forma que los demás clientes pueden obtener una referencia hacia ellos. El registro es por nombre. Son clientes registrados conocidos:

source: Port Mapper
es: Mapeador de puertos

source: The router also provides a simple mechanism for clients to find an internal socket service, such as the HTTP proxy. This is provided by the Port Mapper. Registration is by name. Clients that register generally provide an internal emulated socket on that port.
es: El router I2P también proporciona un mecanismo simple para que los clientes encuentren un servicio de socket interno (conexión entre procesos), como el proxy HTTP. Esto es proporcionado por el Mapeador de Puertos. El registro es por nombre. Los clientes que se registran generalmente proporcionan un socket emulado interno sobre ese puerto.

source: Supported Applications
es: Aplicaciones soportadas

source: Blogging, Forums, and Wikis
es: Blogs, Foros y Wikis

source: Decentralized File Storage
es: Almacenamiento de archivos descentralizado

source: Development Tools
es: Herramientas de desarrollo

source: Version control
es: Control de versiones

source: Domain Naming
es: Nombres de Dominios

source: Email
es: Correo-e

source: File Sharing
es: Compartición de archivos

source: BitTorrent clients
es: Clientes de BitTorrent

source: BitTorrent trackers and indexers
es: Trackers e indexadores de BitTorrent

source: Network Administration
es: Administración de red

source: General-purpose socket utilities
es: Utilidades para sockets de uso general

source: Real-time Chat
es: Chat en tiempo real

source: Instant messaging clients
es: Clientes de mensajería instatánea

source: IRC clients
es: Clientes iRC

source: IRC servers
es: Servidores iRC

source: Web Browsing
es: Navegación web

source: Anonymous websites
es: Webs anónimas

source: Proxy software
es: Aplicaciones de Proxy

source: Inproxies
es: Proxies de entrada

source: Outproxies
es: Proxies de salida

source: Website Hosting
es: Alojamiento web

source: Web servers
es: Servidores web

source: This is intended to be a comprehensive listing of applications used with I2P. If you know of something that's missing please submit a ticket on <a href="%(trac)s">Trac</a>, and be sure to select the “www” component in the submission form.
es: Esto pretende ser una lista precisa de las aplicaciones usadas en I2P. Si conoce alguna que falte, por favor cree un ticket en el <a href="%(trac)s">Trac</a>, y asegúrese de seleccionar el componente "www" en el formulario.

source: Supported applications are tagged with one or more of the following:
es: Las aplicaciones soportadas tienen una de las siguientes etiquetas:

source: bundled
es: incluida

source: <em>Bundled application</em> — I2P ships with a few officially supported applications that let new users take immediate advantage of some of I2P's more useful capabilities.
es: <em>Aplicación incluida</em> — I2P vienen con algunas aplicaciones incluidas oficialmente que permiten a los nuevos usuarios usar inmediatamente algunas de las capacidades mas útiles de i2P.

source: plugin
es: pluguin

source: <em>Third-party plugin</em> — I2P's plugin system provides convenient deployment of I2P-enabled applications and allows tighter integration with the router. Plugins are [reviewed by the community](<a href= "http://%(plugins)s">http://%(plugins)s</a>) to identify security and anonymity issues.
es: <em> Pluguins de terceras partes</em> — el sistema de pluguins de I2P provee el despliegue de aplicaciones para I2P y permite una integración más estrecha con el ruter. Los pluguins son [revisados por la comunidad] (<a href="http://%(plugins)s">http://%(plugins)s</a>) para identificar problemas de seguridad y anonimato.

source: standalone
es: independiente

source: standalone/mod
es: independiente/mod

source: <em>Third-party standalone application</em> — Many standard network applications only require careful setup and configuration to communicate anonymously over I2P. These are tagged with <em>standalone</em>. Some applications, tagged with <em>standalone/mod</em>, require patching to function properly over I2P or to prevent inadvertent disclosure of identifying information such as the user's hostname or external IP address.
es: <em>Aplicaciones independientes de terceras partes</em> — Muchas de las aplicaciones de red sólo necesitan una configuración cuidadosa para poder ser usadas anónimamente sobre I2P. Estas están etiquetadas como <em>independientes</em>. Algunas aplicaciones etiquetadas como <em>independientes/mod</em>, requieren ser parcheadas para funcionar bien sobre I2P, o para evitar la revelación no intencionada de información tal como el hostname o la IP externa.

source: service
es: servicio

source: <em>Third-party essential network service</em> — Services which on the I2P network are analogous to those provided on the public Internet by hosting providers, ISPs, and Google: eepsite indexes and jump services, search engines, email, DNS-style name services, hosting, proxies, etc. These services focus on boosting the usefulness of the network as a whole, and making network content more discoverable.
es: <em>Servicios esenciales de red de terceros</em> — Son servicios que estando en la red I2P son análogos a aquellos proporcionados en Internet por proveedores de alojamiento, ISPs, y Google: índices de eepsites y servicios de salto (jump), motores de búsqueda, correo electrónico, servicios de nombres estilo-DNS, alojamiento, proxys, etc. Estos servicios se centran en impulsar la usabilidad la red en general, y hacer que los contenidos de la red sean más fáciles de descubrir.

source: unmaintained
es: sin mantenimiento

source: <em>Unmaintained</em> — This is used to tag plugins, applications, and services which appear to be unmaintained and may be removed from this listing in the future.
es: <em>Sin mantenimiento</em> — Es usado para etiquetar los pluguins, aplicaciones y servicios que no son actualizados o mantenidos y serán removidos de la lista en el futuro.

source: Warning: Using an application, plugin, or service with I2P doesn't automatically protect your anonymity. I2P is merely a set of tools which can help you mitigate certain <a href="%(threatmodel)s">identified threats to anonymity</a>. We do not and cannot make any guarantees about the safety of the applications, plugins, and services listed below. Most applications and plugins must be properly configured, and some will need to be patched — and even then your anonymity might not be assured. Similarly, services could put your anonymity at risk, either by design or through carelessness on their part or your own.
es: Aviso: Usar un programa, pluguin o servicio en I2P no protege automáticamente su anonimato. I2P no es más que un conjunto de herramientas que pueden ayudarle a mitigar ciertos <a href="%(threatmodel)s">peligros conocidos para su anonimato</a>. No damos ni podríamos darle ninguna garantía sobre la seguridad de las aplicaciones, pluguins o servicios listados abajo. La mayoría de las aplicaciones y pluguins deben ser configurados adecuadamente, y algunos necesitan ser parcheados — e incluso así su anonimato podría no estar asegurado. Igualmente, los servicios podrían poner su anonimato en riesgo, ya sea por diseño o por una configuración deficiente del servicio o de usted mismo.

source: If you have doubts about the suitability of an application, plugin, or service for use with I2P, you are urged to inquire about privacy issues with its maintainers, to search its mailing lists and bug tracker if one exists, and consult trusted, knowledgeable members of the I2P community.
es: Si tiene dudas sobre una aplicación, pluguin o servicio a la hora de usarlo con I2P, le recomendamos que consulte sobre sus posibles problemas con la privacidad a sus programadores, buscando en su listas o en los servidores de errores, si existen, y consultando a miembros de la comunidad de i2p conocidos y de confianza.

source: Take responsibility for your own anonymity and safety — always seek expert advice, educate yourself, practice good judgment, be mindful of disclosing personally identifying information, and don't take shortcuts.
es: Tome responsabilidad por su propia seguridad y anonimato — busque siempre asesoramiento experto, edúquese usted mismo, use su buen juicio, sea consciente de si revela información personal, y no tome atajos.

source: Lightweight forum software.
es: Aplicación de foros ligera.

source: Another lightweight blogging platform.
es: Otra plataforma para blogs ligera.

source: Most popular open source forum software.
es: La aplicación libre de foros más pupular.

source: Distributed forums software, originally developed by jrandom.
es: Sistema de foros distribuido, originalmente creado por jrandom.

source: A Java-based MediaWiki clone. No external database needed. Plugin available <a href="http://%(plugins)s/plugins/jamwiki">here</a>.
es: Un clon en Java de MediaWiki. Sin necesidad de base de datos externa. Pluguin disponible <a href="http://%(plugins)s/plugins/jamwiki">aquí</a>.

source: Port of the <a href="http://tahoe-lafs.org/"><strong>Tahoe-LAFS</strong></a> distributed file system to the I2P network. Controller plugin <a href= "http://%(stats)s/i2p/plugins/">here</a>.
es: Port del sistema de archivos distribuido <a href="http://tahoe-lafs.org/"><strong>Tahoe-LAFS</strong></a> para la red I2P. El pluguin de control <a href="http://%(stats)s/i2p/plugins/">aquí</a>.

source: Most popular distributed version control system.
es: El sistema distribuido de control de versiones más popular.

source: Another distributed version control system. Currently <a href="%(monotone)s">used in I2P development</a>.
es: Otro sistema distribuido de control de versiones. Actualmente <a href="%(monotone)s">usado para el desarrollo de I2P</a>.

source: Provides management of addressbooks, which are part of a simple, user-controlled <a href="%(naming)s">I2P naming system</a> somewhat analogous to the Internet's Domain Name System (DNS). Addressbooks map Base64 destinations to short, usually human-readable “domain” names ending with a .i2p suffix which the I2P router's HTTP client can resolve back to Base64 addresses. (<em>Note:</em> While Base64 destinations are globally unique, addressbook “domain” names only resolve to unique destinations locally.)
es: Proporciona control sobre la listas de direcciones, que son parte de un sistema sencillo controlado por el usuario del <a href="%(naming)s">sistema de dominios de I2P</a>, de alguna forma análogo al Sistema de Nombres de Internet(DNS). La lista de direcciones convierte las destinaciones Base64 a nombres de dominio cortos, normalmente comprensibles para los humanos, con el sufijo .i2p, los cuales pueden ser traducidos de vuelta por el cliente HTTP del ruter de I2P a sus direcciones Base64. (<em>Nota:</em> Mientras que las destinaciones Base64 son únicas globalmente, los nombres de "domino" de la lista de direcciones sólo son resueltos por destinaciones locales únicas.)

source: Serverless peer-to-peer email application using a distributed hash table (DHT) for secure mail storage.
es: Sistema de email p2p sin servidores que usa una tabla distribuida de hashes (DHT) para el almacenaje seguro de emails.

source: Provides email service within the I2P network via @mail.i2p addresses, and email gateway service between the I2P network and the public Internet via @i2pmail.org addresses. One of the oldest continuous services on I2P.
es: Proporciona servicio de email dentro de I2P a través de direcciones @mail.i2p, y un servicio de salida de emails entre la red I2P y el Internet público a través de las direcciones @i2pmail.org. Es uno de los sistemas continuados más viejo de I2P.
