Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: In the future, several I2P protocols and data structures support securely padding messages to arbitrary sizes, so messages could be made constant size or garlic messages could be modified randomly so that some cloves appear to contain more subcloves than they actually do. At the moment, however, garlic, tunnel, and end to end messages include simple random padding.
es: En el futuro varios protocolos y estructuras de datos de I2P soportarán el rellenado seguro de mensajes con tamaños arbitrarios, con lo que los mensajes serán de un tamaño constante o los mensajes garlic podrán ser modificados aleatoriamente con lo cual algunas partes parecerán contener más subpartes de lo que realmente tienen. Hasta el momento los túneles garlic y los mensajes de fin a fin utilizan un simple relleno aleatorio.

source: Floodfill Anonymity attacks
es: Ataques de anonimato FloodFill

source: In addition to the floodfill DOS attacks described <a href="#ffdos">above</a>, floodfill routers are uniquely positioned to learn about network participants, due to their role in the netDb, and the high frequency of communication with those participants. This is somewhat mitigated because floodfill routers only manage a portion of the total keyspace, and the keyspace rotates daily, as explained on the <a href="%(netdb)s#threat">network database page</a>. The specific mechanisms by which routers communicate with floodfills have been <a href="%(netdb)s#delivery">carefully designed</a>. However, these threats should be studied further. The specific potential threats and corresponding defenses are a topic for future research.
es: Además de los ataques DOS FloodFill ya descritos <a href="#ffdos">arriba</a>, los ruters floodfill tienen una posición ventajosa a la hora de aprender sobre los participantes en la red, debido a su rol en la netDb y de la alta frecuencia de las comunicaciones con otros participantes. Esto es mitigado en parte ya que los ruters FloodFill sólo administran una parte de todo el espacio de claves, y el espacio de claves rota diariamente, como se explica en la <a href="%(netdb)s#threat">web de la base de datos de la red</a>. Los mecanismos específicos con los que los ruters se comunican con los FloodFills han sido <a href="%(netdb)s#delivery">diseñados cuidadosamente</a>. Aún así, estos peligros deben estudiarse más profundamente. Los ataques específicos potenciales y sus defensas deberán ser discutidos en estudios futuros.

source: A hostile user may attempt to harm the network by creating one or more floodfill routers and crafting them to offer bad, slow, or no responses. Several scenarios are discussed on the <a href="%(netdb)s#threat">network database page</a>.
es: Un usuario hostil podría intentar dañar la red creando uno o más ruters FloodFill y haciendo que den respuestas malas, lentas o incluso que no respondan. Varios escenarios como este han sido discutidos en la <a href="%(netdb)s#threat">web de la base de datos de la red</a>.

source: Central Resource Attacks
es: Ataque de Recurso Central

source: There are a few centralized or limited resources (some inside I2P, some not) that could be attacked or used as a vector for attacks. The absence of jrandom starting November 2007, followed by the loss of the i2p.net hosting service in January 2008, highlighted numerous centralized resources in the development and operation of the I2P network, most of which are now distributed. Attacks on externally-reachable resources mainly affect the ability of new users to find us, not the operation of the network itself.
es: Hay varios recursos centralizados o limitados (algunos dentro de I2P, algunos no) que pueden ser atacados o usados como vectores para ataques. La desaparición de jrandom en Noviembre del 2007, seguida de la pérdida del servicio de alojamiento de i2p.net en enero del 2008, mostraron que muchos servicios estaban centralizados en el desarrollo y funcionamiento de la red I2P, aunque actualmente la mayoría están descentralizados. Los ataques a los servicios externos afectan mayormente a cómo los nuevos usuarios pueden encontrarnos, no en la operación de la red en sí misma.

source: The <a href="%(site)s">website</a> is mirrored and uses DNS round-robin for external public access.
es: La <a href="%(site)s">web</a> tiene copias en varios lugares y usa round-robin DNS para el acceso público externo.

source: Routers now support <a href="%(faq)s#reseed">multiple external reseed locations</a>, however more reseed hosts may be needed, and the handling of unreliable or malicious reseed hosts may need improvement.
es: Los roters I2P ahora soportan <a href="%(faq)s#reseed">múltiples ubicaciones de resembrado externas</a>, aún así se necesitarían más routers I2P de resembrado, y la gestión de los equipos de resembrado no fiables o maliciosos puede precisar mejora.

source: Routers now support multiple update file locations. A malicious update host could feed a huge file, need to limit the size.
es: Los ruters soportan ahora la actualización desde múltiples localizaciones. Un ruter malicioso de actualizaciones podría enviar un archivo enorme, se necesita limitar el tamaño.

source: Routers now support multiple default trusted update signers.
es: Los ruters ahora soportan múltiples actualizaciones de confianza firmadas.

source: Routers now better handle <a href="#ffdos">multiple unreliable floodfill peers</a>. Malicious floodfills <a href="#ffdos">needs</a> <a href="#floodfill">more</a> study.
es: Los routers I2P ahora gestionan mejor <a href="#ffdos">múltiples pares de inundación (floodfills) no fiables</a>. Los routers I2P de inundación maliciosos <a href="#ffdos">precisan</a> <a href="#floodfill">mayor</a> estudio.

source: The code is now stored in a <a href="%(monotone)s">distributed source control system</a>.
es: El cóodigo está ahora almacenado en un <a href="%(monotone)s">sistema distribuido de control de código fuente</a>.

source: Routers rely on a single news host, but there is a hardcoded backup URL pointing to a different host. A malicious news host could feed a huge file, need to limit the size.
es: Los routers I2P confían en un solo servidor de novedades de consola, pero hay una URL de respaldo incluida en el código, apuntando a un servidor distinto. Un servidor de novedades de consola malicioso podría enviar un fichero enorme, es necesario limitar el tamaño.

source: <a href="%(naming)s">Naming system services</a>, including addressbook subscription providers, add-host services, and jump services, could be malicious. Substantial protections for subscriptions were implemented in release 0.6.1.31, with additional enhancements in subsequent releases. However, all naming services require some measure of trust, see <a href="%(naming)s">the naming page</a> for details.
es: Los <a href="%(naming)s">servicios del sistema de nombres</a> (de servidores), incluyendo los proveedores de suscripción a libreta de direcciones, los servicios de agregación de servidores, y los servicios de salto (jump, direccionamiento distribuido), podrían ser maliciosos. Se implementaron protecciones sustanciales para las suscripciones en la versión 0.6.1.31, con mejoras adicionales en las versiones subsiguientes. No obstante, todos los servicios de nombres requieren una cierta dosis de confianza, vea <a href="%(naming)s">la página de nombres</a> para más detalles.

source: We remain reliant on the DNS service for i2p2.de, losing this would cause substantial disruption in our ability to attract new users, and would shrink the network (in the short-to-medium term), just as the loss of i2p.net did.
es: Continuamos confiando en el servicio DNS para i2p2.de, perder esto causaría bastante trastorno en nuestra capacidad de atraer nuevos usuarios, y encogería la red (de corto a medio plazo), al igual que lo hizo la pérdida de i2p.net.

source: These attacks aren't directly on the network, but instead go after its development team by either introducing legal hurdles on anyone contributing to the development of the software, or by using whatever means are available to get the developers to subvert the software. Traditional technical measures cannot defeat these attacks, and if someone threatened the life or livelihood of a developer (or even just issuing a court order along with a gag order, under threat of prison), we would have a big problem.
es: Estos ataques no son a la red, en cambio van detrás del equipo de desarrolladores ya sea poniendo obstáculos legales a cualquiera contribuyendo al desarrollo, o usando cualquier método disponible para hacer que los desarrolladores boicoteen el software. Las medidas técnicas tradicionales no pueden derrotare estos ataques, y si alguien amenaza la vida o el sustento de un desarrollador (simplemente poniendo una denuncia con secreto de sumario para que no pueda contarlo, con amenaza de cárcel), podríamos tener un gran problema.

source: However, two techniques help defend against these attacks:
es: Sin embargo, estas técnicas ayudan a defenderse contra estos ataques:

source: All components of the network must be open source to enable inspection, verification, modification, and improvement. If a developer is compromised, once it is noticed the community should demand explanation and cease to accept that developer's work. All checkins to our <a href="%(monotone)s">distributed source control system</a> are cryptographically signed, and the release packagers use a trust-list system to restrict modifications to those previously approved.
es: Todos los componentes de la red deben ser de código libre para permitir su inspección, verificación, modificación y mejora. Si algún desarrollador ha sido comprometido, una vez notificado, la comunidad debe exigir una explicación y su cese para aceptar el trabajo de ese desarrollador. Todos los cambios en nuestro <a href="%(monotone)s">sistema de control de código distribuido</a> están criptográficamente firmados, y los empaquetadores de versiones usan una sistema de listas de confianza para restringir las modificaciones a sólo aquellos que han sido aprovados.

source: Development over the network itself, allowing developers to stay anonymous but still secure the development process. All I2P development can occur through I2P - using a <a href="%(monotone)s">distributed source control system</a>, a distributed source control system, IRC chat, public web servers, discussion forums (forum.i2p), and the software distribution sites, all available within I2P.
es: El desarrollo de la red permitiendo a los desarrolladores permanecer anónimos pero aun así seguros. Todo el desarrollo de I2P puede hacerso dentro de I2P - usando un <a href="%(monotone)s">sistema de control distribuido de código</a>, IRC chat, servidores web públicos , foros de discusión (forum.i2p), y webs de distribución de las aplicaciones, todo disponible dentro de I2P.

source: We also maintain relationships with various organizations that offer legal advice, should any defense be necessary.
es: También mantenemos relaciones con organizaciones que ofrecen consejo legal, en caso de que fuese necesario algún tipo de defensa legal.

source: Implementation attacks (bugs)
es: Ataques de implementación (errores de programación)

source: Try as we might, most nontrivial applications include errors in the design or implementation, and I2P is no exception. There may be bugs that could be exploited to attack the anonymity or security of the communication running over I2P in unexpected ways. To help withstand attacks against the design or protocols in use, we publish all designs and documentation and solicit review and criticism with the hope that many eyes will improve the system. We do not believe in <a href="http://www.haystacknetwork.com/">security through obscurity</a>.
es: Por mucho que nos esforcemos, incluso las aplicaciones más simples tienen errores de diseño, e I2P no es una excepción. Pueden existir bugs inesperados que pudieran ser explotados para atacar el anonimato o la seguridad de las comunicaciones ejecutándose sobre I2P. Para evitar estos ataques contra el diseño de los protocolos usados, publicamos todos los diseños y documentación y solicitamos revisión y crítica con la esperanza de que usando muchos ojos se mejorará el sistema. No creemos en <a href="http://www.haystacknetwork.com/">la seguridad por oscuridad</a>.

source: In addition, the code is being treated the same way, with little aversion towards reworking or throwing out something that isn't meeting the needs of the software system (including ease of modification). Documentation for the design and implementation of the network and the software components are an essential part of security, as without them it is unlikely that developers would be willing to spend the time to learn the software enough to identify shortcomings and bugs.
es: Además, el código es tratado de la misma forma, sin muchos problemas para volver a hacer el trabajo o tirar trabajo ya hecho que no cumpla las necesidades del sistema (incluida su fácil modificación). La documentación del diseño y de la implementación de la red y de los componentes de software es una parte esencial de la seguridad, ya que sin ella sería raro que los programadores gastasen tanto tiempo en aprenderse el software como para identificar deficiencias y errores.

source: Our software is likely, in particular, to contain bugs related to denial of service through out-of-memory errors (OOMs), cross-site-scripting (XSS) issues in the router console, and other vulnerabilities to non-standard inputs via the various protocols.
es: En partucular, es probable que nuestras aplicaciones contengan errores relacionados con la denegación de servicio a través de errores de llenado de memoria (OOMS), cross-site-scripting (XSS) en la consola del ruter, y otras vulnerabilidades no tan normales a causa de varios protocolos.

source: I2P is still a small network with a small development community and almost no interest from academic or research groups. Therefore we lack the analysis that <a href="https://torproject.org/">other anonymity networks</a> may have received. We continue to recruit people to <a href="%(volunteer)s">get involved</a> and help.
es: I2P aún es una red pequeña con una comunidad de programadores pequeña y casi sin interés por parte de académicos y grupos de investigación. A causa de eso nos faltan los análisis que pueden tener <a href="https://torproject.org/">otras redes de anonimato</a>. Continuamos reclutando gente para <a href="%(volunteer)s">que se involucre</a> y ayude.

source: Blocklists
es: Blocklists, lista de bloqueos

source: To some extent, I2P could be enhanced to avoid peers operating at IP addresses listed in a blocklist. Several blocklists are commonly available in standard formats, listing anti-P2P organizations, potential state-level adversaries, and others.
es: Hasta cierto punto I2P puede ser mejorada haciendo que los pares con IPs en la blocklist dejen de operar. Varias blocklists están disponibles en varios formatos estándar, con listados de organizaciones contrarias a I2P, estados potencialmente peligrosos, y otros.

source: To the extent that active peers actually do show up in the actual blocklist, blocking by only a subset of peers would tend to segment the network, exacerbate reachability problems, and decrease overall reliability. Therefore we would want to agree on a particular blocklist and enable it by default.
es: En la medida en que pares activos aparecen en la lista de bloqueo actual, bloquear sólo una parte de los pares tendería a segmentar la red, exacerbando los problemas de alcanzabilidad, y reduciendo la fiabilidad del conjunto. Por tanto querríamos acordar una lista de bloqueo concreta y activarla por defecto.

source: Blocklists are only a part (perhaps a small part) of an array of defenses against maliciousness. In large part the profiling system does a good job of measuring router behavior so that we don't need to trust anything in netDb. However there is more that can be done. For each of the areas in the list above there are improvements we can make in detecting badness.
es: Las listas de bloqueo sólo son una parte (quizás una pequeña parte) del conjunto de defensas contra la malicia. En gran parte el sistema de perfiles hace un buen trabajo controlando el comportamiento de los ruters y hace que no necesitemos confiar en nada dentro de la netDb. Aún así hay más cosas que se pueden hacer. En cualquiera de las áreas de la lista de arriba hay mejoras que se pueden implementar para detectar la malicia.

source: If a blocklist is hosted at a central location with automatic updates the network is vulnerable to a <a href="#central">central resource attack</a>. Automatic subscription to a list gives the list provider the power to shut the i2p network down. Completely.
es: Si la blocklist está hospedada en una localización central con actualizaciones automáticas la red sería vulnerable al <a href="#central">ataque del recurso centralizado</a>. Las suscripciones automáticas a una lista ofrecen al proveedor la capacidad de apagar toda la red i2p. Completamente.

source: Currently, a default blocklist is distributed with our software, listing only the IPs of past DOS sources. There is no automatic update mechanism. Should a particular IP range implement serious attacks on the I2P network, we would have to ask people to update their blocklist manually through out-of-band mechanisms such as forums, blogs, etc.
es: Actualmente se distribuye con nuestro software una blocklist por defecto, listando solamente las IPs que han sido fuente de ataques DOS. No hay mecanismo de actualizaciones automáticas. En caso de que un rango de IP en particular hiciese un ataque serio a la red I2P, tendríamos que pedirle a la gente que actualizasen su blocklist manualmente a través de algún mecanismo externo como foros, blogs, etc.

source: Tunnel Routing
es: Enrutamiento de túnel

source: July 2011
es: Julio de 2011

source: This page contains an overview of I2P tunnel terminology and operation, with links to more technical pages, details, and specifications.
es: Esta página contiene una introducción a la terminología y funcionamiento de los túneles I2P, con enlaces a páginas más técnicas, detalles y especificaciones.

source: As briefly explained in the <a href="%(intro)s">introduction</a>, I2P builds virtual "tunnels" - temporary and unidirectional paths through a sequence of routers. These tunnels are classified as either inbound tunnels (where everything given to it goes towards the creator of the tunnel) or outbound tunnels (where the tunnel creator shoves messages away from them). When Alice wants to send a message to Bob, she will (typically) send it out one of her existing outbound tunnels with instructions for that tunnel's endpoint to forward it to the gateway router for one of Bob's current inbound tunnels, which in turn passes it to Bob.
es: Como se ha explicado brevemente en el class="marksource tag"><a href="class="marksource var">%(intro)s">introductionclass="marksource tag"></a>, I2P construye "túneles" virtuales -class="marksource newline" title="New line"> caminos temporales y unidireccionales a través de una secuencia de ruters. Estos class="marksource newline" title="New line"> túneles estan clasificados como túneles de entrada (sonde todo class="marksource newline" title="New line"> va hacia el creador del túnel) o túneles de salida class="marksource newline" title="New line"> (donde el creador del túnel envía los mensajes lejos de él). Cuando Alice class="marksource newline" title="New line"> quiere enviar un mensaje a Bob, ella (normalmente) lo envía a uno de lass="marksource newline" title="New line"> sus túneles de salida ya existentes con las instrucciones para el punto final de ese túnel class="marksource newline" title="New line"> para que sea enviado al ruter gateway hasta los túneles de entrada de Bob class="marksource newline" title="New line">, que por turnos lo llevarán hasta Bob.

source: Alice connecting through her outbound tunnel to Bob via his inbound tunnel
es: Alice conectando a través de su túnel de salida hacia Bob vía su túnel de entrada

source: Outbound Gateway
es: Gateway de salida

source: Outbound Participant
es: Participante de salida

source: Outbound Endpoint
es: Punto final de salida

source: Inbound Gateway
es: Puerta de salida de entrada

source: Inbound Participant
es: Participante de entrada

source: Inbound Endpoint
es: Punto final de entrada

source: Tunnel vocabulary
es: Vocabulario de los túneles

source: <b>Tunnel gateway</b> - the first router in a tunnel. For inbound tunnels, this is the one mentioned in the LeaseSet published in the <a href="%(netdb)s">network database</a>. For outbound tunnels, the gateway is the originating router. (e.g. both A and D above)
es: <b>Túnel puerta de salida, gateway</b> - el primer ruter en un túnel. Para los túneles de entrada, este es el mencionado en el LeaseSet publicado en la <a href="%(netdb)s">base de datos de la red</a>. Para los túneles de salida, la gateway es el ruter original (ej, A y D arriba)

source: <b>Tunnel endpoint</b> - the last router in a tunnel. (e.g. both C and F above)
es: <b>Túnel punto final, endpoint</b> - el último ruter en un túnel (ej, C y F arriba)

source: <b>Tunnel participant</b> - all routers in a tunnel except for the gateway or endpoint (e.g. both B and E above)
es: <b>Túnel participante</b> - todos los ruters en un túnel excepto la puerta de salida o el punto final (ej, B y E arriba)

source: <b>n-Hop tunnel</b> - a tunnel with a specific number of inter-router jumps, e.g.:
es: <b>Túnel de n-saltos</b> - un túnel con un número específico de saltos entre routers I2P, ej.:

source: <b>0-hop tunnel</b> - a tunnel where the gateway is also the endpoint
es: <b>Túnel de 0 saltos</b> - un túnel donde la puerta de salida, gateway, es también el punto final, endpoint.

source: <b>1-hop tunnel</b> - a tunnel where the gateway talks directly to the endpoint
es: <b>Túnel de 1 salto</b> - un túnel donde la puerta de salida habla directamente con el punto final.

source: <b>2-(or more)-hop tunnel</b> - a tunnel where there is at least one intermediate tunnel participant. (the above diagram includes two 2-hop tunnels - one outbound from Alice, one inbound to Bob)
es: <b>Túnel de 2 (o más) saltos</b> - un túnel donde hay al menos un túnel intermedio participante, (el diagrama de arriba incluye dos túneles de 2 saltos - uno de salida desde Alice, uno de entrada hacia Bob)

source: <b>Tunnel ID</b> - A <a href="%(commonstructures)s#type_TunnelId">4 byte integer</a> different for each hop in a tunnel, and unique among all tunnels on a router. Chosen randomly by the tunnel creator.
es: <b>ID del túnel</b> - Un <a href="%(commonstructures)s#type_TunnelId">entero de 4 bytes</a> diferente para cada salto en un túnel, y único a lo largo de todos los túneles en un ruter. Elegido aleatoriamente por el creador del túnel.

source: Tunnel Build Information
es: Infomación de la construcción del túnel

source: Routers performing the three roles (gateway, participant, endpoint) are given different pieces of data in the initial <a href="%(tunnelcreation)s">Tunnel Build Message</a> to accomplish their tasks:
es: A los ruters con los tres roles (puerta de salida, participante, punto final) le son dadas diferentes piezas de información en el <a href="%(tunnelcreation)s">mensaje de creación de túnel</a> inicial para poder lleva a cabo sus tareas:

source: The tunnel gateway gets:
es: El túnel puerta de salida obtiene:
