Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Index to Technical Documentation
es: Índice de la Documentación técnica

source: Following is an index to the technical documentation for I2P.
es: A continuación hay in índice de la documentación técnica de I2P.

source: This index is ordered from the highest to lowest layers. The higher layers are for "clients" or applications; the lower layers are inside the router itself. The interface between applications and the router is the I2CP (I2P Control Protocol) API.
es: Este índice está ordenado desde la capa más alta a la más baja. Las capas más altas son para las aplicaciones "clientes"; Las capas menores son las que están dentro del propio ruter. El interfaz entre las aplicaciones y el ruter es el API I2CP (Protocolo de Control de I2P).

source: The I2P Project is committed to maintaining accurate, current documentation. If you find any inaccuracies in the documents linked below, please <a href="%(trac)s">enter a ticket identifying the problem</a>.
es: El proyecto I2P está comprometido a mantener una documentación precisas y actual. Si encuentra alguna inexactitud en los documentos enlazados más abajo, por favor <a href="%(trac)s">cree un ticket identificando el problema</a>.

source: Overview
es: Vista general

source: Technical Introduction
es: Introducción técnica

source: A Less-Technical Introduction
es: Una introducción no tan técnica

source: Threat model and analysis
es: Modelo de amenazas y análisis

source: Comparisons to other anonymous networks
es: Comparación con otras redes anónimas.

source: Protocol stack chart
es: Gráfica de la pila del protocolo

source: Papers on I2P
es: Estudios sobre I2P

source: Presentations, articles, tutorials, videos, and interviews
es: Presentaciones, artículos, tutoriales, vídeos y entrevistas

source: <a href="%(pdf)s">Invisible Internet Project (I2P) Project Overview</a> August 28, 2003 (pdf)
es: <a href="%(pdf)s">Vista general del Proyecto para un Internet Invisible (I2P)</a> 28 de Agosto del 2003 (pdf)

source: Application-Layer Topics
es: Temas de la capa de aplicaciones

source: Naming and Addressbook
es: Nombres de dominios y libreta de direcciones

source: Plugins Overview
es: Resumen de pluguins

source: Plugin Specification
es: Especificaciones de los pluguins

source: Managed Clients
es: Clientes gestionados

source: Embedding the router in your application
es: Empotrado del router I2P en su aplicación

source: Bittorrent over I2P
es: Bittorrent sobre I2P

source: I2PControl Plugin API
es: API del pluguin I2PControl

source: hostsdb.blockfile Format
es: Formato de hostsdb.blockfile

source: Configuration File Format
es: Formato del archivo de configuración

source: Application Layer API and Protocols
es: Protocolos y API de la capa de aplicación

source: High-level, easy-to-use APIs for applications written in any language to send and receive data.
es: API de alto nivel y fácil de usar para enviar y recibir datos para aplicaciones escritas en cualquier lenguaje.

source: Application Development Overview and Guide
es: Resumen y guía del desarrollo de aplicaciones

source: I2PTunnel Configuration
es: Configuración de I2PTunnel

source: SAM Protocol
es: Protocolo SAM

source: SAMv2 Protocol
es: Protocolo SAMv2

source: SAMv3 Protocol
es: Protocolo SAMv3

source: BOB Protocol
es: Protocolo BOB

source: End-to-End Transport API and Protocols
es: Protocolos y API del transporte de fin a fin.

source: The end-to-end protocols used by clients for reliable and unreliable communication.
es: Los protocolos extremo a extremo usados por los clientes para comunicación fiable y no fiable.

source: Streaming Library
es: Librería de srteaming

source: Streaming Protocol Specification
es: Especificación de protocolo de streaming

source: Streaming Javadoc
es: Javadoc del streaming

source: Datagrams
es: Datagramas

source: Datagram Javadoc
es: Javadoc del datagrama

source: Client-to-Router Interface API and Protocol
es: Protocolo y API del interfaz cliente-a-ruter

source: The lowest-level API used for clients (applications) to send and receive traffic to a router. Traditionally used only by Java applications and higher-level APIs.
es: El API de menor nivel usado por los clientes (aplicaciones) para enviar y recibir tráfico a un ruter. Tradicionalmente usado sólo por aplicaciones en Java y APIs de mayor nivel.

source: I2CP - I2P Control Protocol / API overview
es: I2CP - Protocolo de control de I2P / Resumen del API

source: I2CP Specification
es: Especificación I2CP

source: I2CP API Javadoc
es: Javadoc del API de I2CP

source: Common data structures specification
es: Especificaciones de las estructuras de datos más usadas.

source: Data Structures Javadoc
es: Javadoc de las estructuras de datos

source: End-to-End Encryption
es: Cifrado de fin a fin

source: How client messages are end-to-end encrypted by the router.
es: Cómo son cifrados por el ruter los mensajes de fin a fin.

source: ElGamal/AES+SessionTag encryption
es: Cifrado ElGamal/AES+SessionTag

source: ElGamal and AES cryptography details
es: Detalles criptográficos de ElGamal y AES

source: Network Database
es: Base de datos de la red

source: Distributed storage and retrieval of information about routers and clients.
es: Almacenamiento distribuido y obtención de información sobre los ruters y los clientes.

source: Network database overview, details, and threat analysis
es: Vista general, detalles y análisis de amenazas de la base de datos de la red

source: Cryptographic hashes
es: Hashes de cifrados

source: Cryptographic signatures
es: Firmas de cifrados

source: Router reseed specification
es: Especificación de resembrado del router I2P

source: Router Message Protocol
es: Protocolo de los mensajes del ruter

source: I2P is a message-oriented router. The messages sent between routers are defined by the I2NP protocol.
es: I2P es un ruter orientado a mensajes. Los mensajes que se envían entre los ruters son definidos por el protocolo I2NP.

source: I2NP - I2P Network Protocol Overview
es: I2NP - Vista general del protocolo de red de I2P

source: I2NP Specification
es: Especificación I2NP

source: I2NP Javadoc
es: Javadoc de I2NP

source: Tunnels
es: Túneles

source: Selecting peers, requesting tunnels through those peers, and encrypting and routing messages through these tunnels.
es: Seleccionando pares, solicitando túneles a través de esos pares, y cifrando y enrutando mensajes a través de esos túneles.

source: Peer profiling and selection
es: Perfiles y selección de pares

source: Tunnel routing overview
es: Vista general del túnel de enrutado

source: Garlic routing and "garlic" terminology
es: Rutado Garlic y terminología "garlic"

source: Tunnel building and encryption
es: Cifrado y construcción de los túneles

source: for build request encryption
es: para cifrado de solicitudes de construcción (`build`, de túneles)

source: Tunnel building specification
es: Especificaciones para la creación de túneles

source: Low-level tunnel message specification
es: Especificaciones de los mensajes de túnel de bajo nivel

source: Unidirectional Tunnels
es: Túneles unidireccionales

source: Peer Profiling and Selection in the I2P Anonymous Network
es: Perfiles y selección de pares en la red anónima I2P

source: 2009 paper (pdf), not current but still generally accurate
es: Estudio del 2009 (pdf), no es muy actual pero es bastante exacto

source: Transport Layer
es: Capa de transporte

source: The protocols for direct (point-to-point) router to router communication.
es: Los protocolos para las comunicaciones directas (punto a punto) de ruter a ruter.

source: Transport layer overview
es: Visión general de la capa de transporte

source: TCP-based transport overview and specification
es: Especificaciones y vista general de los transportes basados en TCP

source: UDP-based transport overview
es: Vista general de los transportes basados en UDP

source: SSU specification
es: Especificación SSU

source: NTCP transport encryption
es: Cifrado del transporte de NTCP

source: SSU transport encryption
es: Cifrado del transporte de SSU

source: Transport Javadoc
es: Jacadoc del transporte

source: NTCP Javadoc
es: Javadoc de NTCP

source: SSU Javadoc
es: Jacadoc de SSU

source: Other Router Topics
es: Otros temas sobre el Ruter

source: Router software updates
es: Actualizaciones de software del ruter

source: Native BigInteger Library
es: Librería BigInteger nativa

source: Time synchronization and NTP
es: NTP y sincronización de la fecha

source: Performance
es: Rendimiento

source: Developer's Guides and Resources
es: Recursos y guías para desarrolladores

source: New Developer's Guide
es: Guía para nuevos desarrolladores

source: New Translator's Guide
es: La nueva guía de los traductores

source: Monotone Guide
es: Guía de Monotone

source: Developer Guidelines
es: Directrizes para los desarrolladores

source: Javadocs on the standard internet:
es: Jacadocs en el Internet normal:

source: Server %(num)s
es: Servidor %(num)s

source: Note: always verify that javadocs are current by checking the release number.
es: Nota: verifique siempre que los Javadocs son actuales comprobando los números de versiones.

source: Javadocs inside I2P:
es: Javadocs en I2P:

source: Ports used by I2P
es: Ports usados por I2P

source: Automatic updates to development builds inside I2P
es: Actualizaciones automáticas y compilaciones de desarrollo dentro de I2P

source: Updating the wrapper manually
es: Actualizando el wrapper manualmente

source: User forum
es: Foro para usuarios

source: Developer forum inside I2P
es: Foro para desarrolladores en I2P

source: Viewmtn inside I2P
es: Viewmtn en I2P

source: I2P Source exported to GitHub
es: El código de I2P exportado a GitHub

source: I2P Source Git Repo inside I2P
es: Repositorio Git del código de I2P en I2P

source: Source translation at Transifex
es: Fuentes para traducir en Transifex

source: To Do List
es: Por hacer

source: not current
es: no actual

source: April 2014
es: Abril de 2014

source: I2P ships with a generic naming library and a base implementation designed to work off a local name to destination mapping, as well as an add-on application called the <a href="#addressbook">addressbook</a>. I2P also supports <a href="#base32">Base32 hostnames</a> similar to Tor's .onion addresses.
es: I2P viene con una librería genérica de asignación de nombres y una implementación base diseñada para entregar un mapeado desde nombre local a destino, además de una aplicación add-on llamada <a href="#addressbook">libreta de direcciones</a> (`adressbook`). I2P también soporta <a href="#base32">nombres de servidor Base32</a> similares a las direcciones .onion de Tor.

source: The addressbook is a web-of-trust driven secure, distributed, and human readable naming system, sacrificing only the call for all human readable names to be globally unique by mandating only local uniqueness. While all messages in I2P are cryptographically addressed by their destination, different people can have local addressbook entries for "Alice" which refer to different destinations. People can still discover new names by importing published addressbooks of peers specified in their web of trust, by adding in the entries provided through a third party, or (if some people organize a series of published addressbooks using a first come first serve registration system) people can choose to treat these addressbooks as name servers, emulating traditional DNS.
es: La libreta de direcciones es un sistema de nombres asegurado mediante web-of-trust, distribuido, y legible por humanos, que tan solo sacrifica el que los nombres sean globalmente únicos, obligando a que sólo lo sean localmente. Mientras todos los mensajes en I2P son criptográficamente direccionados por su destino, diferentes personas puede tener diferentes entradas "Alice" en sus libros de direcciones locales que se refieran a diferentes destinos. El público aún puede descubrir nuevos nombres importando libros de direcciones publicados, de pares (`peers`) especificados en sus web-of-trust, incorporando las entradas provistas por terceros, o (si algunas personas organizan series de libros de direcciones publicados usando un sistema de registro tipo `primero en venir primero en ser servido`) la gente puede elegir tratar estos libros de direcciones como servidores de nombres, emulando al tradicional DNS.

source: NOTE: For the reasoning behind the I2P naming system, common arguments against it and possible alternatives see the <a href="%(namingdiscussion)s">naming discussion</a> page.
es: NOTA: Para encontrar las razones detrás del sistema de nombres de I2P, los argumentos habituales contra él y las posibles alternativas, vea la página de <a href="%(namingdiscussion)s">discusión sobre el sistema de nombres</a>.

source: Naming System Components
es: Componentes del sistema de nombres

source: There is no central naming authority in I2P. All hostnames are local.
es: No hay una autoridad central de nombres en I2P. Todos los nombres de servidor están en local.

source: The naming system is quite simple and most of it is implemented in applications external to the router, but bundled with the I2P distribution. The components are:
es: El sistema de nombres es bastante simple, y la mayoria de él está implementado en aplicaciones externas al router pero empaquetadas con la distribución I2P. Los componentes son:

source: The local <a href="#lookup">naming service</a> which does lookups and also handles <a href="#base32">Base32 hostnames</a>.
es: El <a href="#lookup">servicio de nombres</a> local que hace búsquedas y también maneja los <a href="#base32">nombres de equipos Base32</a>.

source: The <a href="#httpproxy">HTTP proxy</a> which asks the router for lookups and points the user to remote jump services to assist with failed lookups.
es: El <a href="#httpproxy">proxy HTTP</a> que realiza consultas al router I2P y dirige al usuario a servicios de salto (jump, de direccionamiento distribuido) remotos para asistirle con las consultas fallidas.

source: HTTP <a href="#add-services">host-add forms</a> which allow users to add hosts to their local hosts.txt
es: <a href="#add-services">Formularios de añadido de servidores</a> HTTP que permiten a los usuarios añadir servidores a su hosts.txt local.

source: HTTP <a href="#jump-services">jump services</a> which provide their own lookups and redirection.
es: <a href="#jump-services">Servicios de salto (jump)</a> HTTP que proporcionan sus propias búsquedas y redireccionamiento distribuido.

source: The <a href="#addressbook">addressbook</a> application which merges external host lists, retrieved via HTTP, with the local list.
es: La aplicación de <a href="#addressbook">libreta de direcciones</a> que fusiona listas externas de servidores, con la lista local.

source: The <a href="#susidns">SusiDNS</a> application which is a simple web front-end for addressbook configuration and viewing of the local host lists.
es: La aplicación <a href="#susidns">SusiDNS</a> que es un sencillo frontal web para la configuración de la libreta de direcciones y el visionado de las listas locales de servidores.

source: Naming Services
es: Servicios de nombres

source: All destinations in I2P are 516-byte (or longer) keys. (To be more precise, it is a 256-byte public key plus a 128-byte signing key plus a null certificate, which in Base64 representation is 516 bytes. <a href="%(namingdiscussion)s#certificates">Certificates</a> are not used now, if they are, the keys will be longer. One possible use of certificates is for <a href="%(todo)s#hashcash">proof of work</a>.)
es: Todos los destinos en I2P son claves de 516-bytes (o más largas). (Para ser más precisos, es una clave pública de 256-bytes más una clave de firmado de 128-bytes más un certificado vacío, lo que en representación Base64 son 516 byles. Los <a href="%(namingdiscussion)s#certificates">certificados</a> no se usan ahora, si se usaran, las claves serían más largas. Un posible uso de certificados es como <a href="%(todo)s#hashcash">prueba de trabajo</a>.)

source: If an application (i2ptunnel or the HTTP proxy) wishes to access a destination by name, the router does a very simple local lookup to resolve that name.
es: Si una aplicación (i2ptunnel o el proxy HTTP) quiere acceder a un destino mediante el nombre, el router hace una búsqueda local muy simple para resolver ese nombre.

source: Hosts.txt Naming Service
es: Servicio de nombres hosts.txt

source: The hosts.txt Naming Service does a simple linear search through text files. This naming service was the default until release 0.8.8 when it was replaced by the Blockfile Naming Service. The hosts.txt format had become too slow after the file grew to thousands of entries.
es: El servicio de nombres hosts.txt hace una búsqueda lineal simple a través de ficheros de texto. Este servicio de nombres fue la norma hasta la versión 0.8.8 cuando fue reemplazado por el servicio de nombres blockfile (fichero de bloques). El formato de hosts.txt ha llegado a ser demasiado lento después de que el fichero creciera hasta las miles de entradas.

source: It does a linear search through three local files, in order, to look up host names and convert them to a 516-byte destination key. Each file is in a simple <a href="%(configuration)s">configuration file format</a>, with hostname=base64, one per line. The files are:
es: Realiza una búsqueda lineal a través de tres ficheros locales, en orden, para buscar nombres de equipos y convertirlos a claves de destinos de 516-bytes. Cada fichero está en un <a href="%(configuration)s">formato de fichero de configuración</a> simple, con (nombre de equipo) hostname=base64, uno por línea. Los ficheros son:

source: Blockfile Naming Service
es: Servicio de nombres blockfile

source: The Blockfile Naming Service stores multiple "addressbooks" in a single database file named hostsdb.blockfile. This Naming Service is the default since release 0.8.8.
es: El servicio de nombres blockfile (fichero de bloques) almacena múltiples "addressbooks" (libretas de direcciones) en un único fichero de base de datos llamado hostsdb.blockfile. Este servicio de nombres es el predeterminado desde la versión 0.8.8.

source: A blockfile is simply on-disk storage of multiple sorted maps (key-value pairs), implemented as skiplists. The blockfile format is specified on the <a href="%(blockfile)s">Blockfile page</a>. It provides fast Destination lookup in a compact format. While the blockfile overhead is substantial, the destinations are stored in binary rather than in Base 64 as in the hosts.txt format. In addition, the blockfile provides the capability of arbitrary metadata storage (such as added date, source, and comments) for each entry to implement advanced addressbook features. The blockfile storage requirement is a modest increase over the hosts.txt format, and the blockfile provides approximately 10x reduction in lookup times.
es: Un blockfile (fichero de bloques) es simplemente un almacenamiento en-disco de múltiples mapeados (pares clave-valor) ordenados implementados como listas por saltos ('skiplists'). El formato blockfile está especificado en la <a href="%(blockfile)s">página de Blockfile</a>. Proporciona búsqueda rápida de destinos en un formato compacto. Aunque el tráfico de control de blockfile es sustancial, los destinos están almacenados en binario en lugar de en Base 64 como en el formato hosts.txt . Además, blockfile proporciona la posibilidad de almacenar metadatos arbitrarios (tales como fecha añadida, fuente, y comentarios) por cada entrada, para implementar características avanzadas de libreta de direcciones. El requisito para el almacenamiento blockfile es un modesto incremento sobre el tamaño del formato hosts.txt, y el blockfile proporcionará una reducción en los tiempos de búsqueda por un factor aproximado de 10x.

source: On creation, the naming service imports entries from the three files used by the hosts.txt Naming Service. The blockfile mimics the previous implementation by maintaining three maps that are searched in-order, named privatehosts.txt, userhosts.txt, and hosts.txt. It also maintains a reverse-lookup map to implement rapid reverse lookups.
es: Al crearse, el servicio de nombres importa entradas desde los tres ficheros usados por el servicio de nombres hosts.txt. El blockfile imita la anterior implementación al mantener tres mapeados que se buscan en-orden, llamados privatehosts.txt, userhosts.txt, y hosts.txt. También mantiene un mapeado de búsqueda-inversa para implementar búsquedas inversas rápidas.

source: Other Naming Service Facilities
es: Otras infraestructuras de servicio de nombres

source: The lookup is case-insensitive. The first match is used, and conflicts are not detected. There is no enforcement of naming rules in lookups. Lookups are cached for a few minutes. Base 32 resolution is <a href="#base32">described below</a>. For a full description of the Naming Service API see the <a href="%(nsjavadocs)s">Naming Service Javadocs</a>. This API was significantly expanded in release 0.8.7 to provide adds and removes, storage of arbitrary properties with the hostname, and other features.
es: La búsqueda distingue mayúsculas/minúsculas. Se usa la primera coincidencia, y no se detectan los conflictos. No se hace aplicación de las reglas de nombres en las búsquedas. Las búsquedas se guardan en caché durante unos pocos minutos. La resolución Base32 se <a href="#base32">describe debajo</a>. Para una descripción completa de la API del servicio de nombres vea los <a href="%(nsjavadocs)s">Javadocs del servicio de nombres</a>. Esta API fue expandida significativamente en la versión 0.8.7 para proporcionar adiciones y eliminaciones, almacenamiento de propiedades arbitrarias junto al el nombre del equipo, y otras características.

source: Alternatives and Experimental Naming Services
es: Alternativas y servicios de nombres experimentales

source: The naming service is specified with the configuration property <tt>i2p.naming.impl=class</tt>. Other implementations are possible. For example, there is an experimental facility for real-time lookups (a la DNS) over the network within the router. For more information see the <a href="%(namingdiscussion)s#alternatives">alternatives on the discussion page</a>.
es: El servicio de nombres se especifica con la propiedad de configuración <tt>i2p.naming.impl=class</tt>. Otras implementaciones son posibles. Por ejemplo, hay una infraestructura experimental para búsquedas en tiempo-real (estilo DNS) sobre la red interior al router. Para más información vea la <a href="%(namingdiscussion)s#alternatives">página de discusión sobre alternativas</a>.

source: The HTTP proxy does a lookup via the router for all hostnames ending in '.i2p'. Otherwise, it forwards the request to a configured HTTP outproxy. Thus, in practice, all HTTP (eepsite) hostnames must end in the pseudo-Top Level Domain '.i2p'.
es: El proxy HTTP hace una consulta vía router para todos los nombres de servidores terminados en `.i2p`. De otra manera este reenvía la solicitud hacia un proxy HTTP configurado de salida (`outproxy`). Así, en la práctica, todos los nombres de servidores HTTP (eepsites) deben terminar en un pseudo-dominio-de-primer-nivel `.i2p`.

source: We have <a href="%(i2ptld)s">applied to reserve the .i2p TLD</a> following the procedures specified in <a href="%(rfc6761)s">RFC 6761</a>.
es: Tenemos <a href="%(i2ptld)s">solicitada la reserva del TLD (dominio de primer nivel) .i2p</a> siguiendo los procedimientos especificados en la <a href="%(rfc6761)s">RFC 6761</a>.
