Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Secure node ID requirement: To make various DHT attacks more difficult, the first 4 bytes of the Node ID must match the first 4 bytes of the destination Hash, and the next two bytes of the Node ID must match the next two bytes of the destination hash exclusive-ORed with the port.
es: Requisito de identificador (`ID`) de nodo seguro: Para hacer más difíciles diferentes ataques DHT (tabla de hash distribuida) los primeros 4 bytes del identificador de nodo (`ID`) deben coincidir con los primeros 4 bytes del identificador criptográfico (`hash`) del destino, y los siguientes 2 bytes del identificador de nodo deben coincidir con los siguientes 2 bytes del resultado de la operación OR-exclusivo del hash del destino con el puerto.

source: In a torrent file, the trackerless torrent dictionary "nodes" key is TBD. It could be a list of 32 byte binary strings (SHA256 Hashes) instead of a list of lists containing a host string and a port integer. Alternatives: A single byte string with concatenated hashes, or a list of strings alone.
es: En un fichero torrent, la clave "nodos" del diccionario de un torrent sin tracker ha de ser determinada. Podría ser una lista de cadenas binarias de 32 bytes (hashes SHA256) en lugar de una lista de listas que contengan una cadena de servidor y un valor entero de puerto. Alternativas: Una única cadena de bytes con hashes concatenados, o una lista de cadenas por si solas.

source: Datagram (UDP) Trackers
es: Trackers de datagramas (UDP)

source: UDP tracker support in clients and trackers is not yet available. Preliminary differences from <a href="http://www.bittorrent.org/beps/bep_0015.html">BEP 15</a> are described below, and are subject to change. Contact the I2P developers if you wish to develop a client or tracker supporting datagram announces.
es: Aún no está disponible para clientes y trackers (rastreadores bittorrent) el soporte para trackers UDP. Las diferencias preliminares con la (propuesta de mejora de bittorrent) <a href="http://www.bittorrent.org/beps/bep_0015.html">BEP 15</a> están descritas debajo, y son susceptibles de cambiar. Contacte con los desarrolladores de I2P si desea desarrollar un cliente o un tracker que soporte anuncios sobre datagramas.

source: A UDP tracker listens on two ports. The "query port" is the advertised port, and is used to receive repliable (signed) datagrams, for the connect request only. The "response port" is used to receive unsigned (raw) datagrams, and is the source port for all replies. The response port is arbitrary. A client sends and receives on a single port only. It receives only unsigned (raw) datagrams. Raw datagrams provides increased efficiency for replies since they contain tokens sent in the query, and need not be signed.
es: Un tracker UDP escucha en 2 puertos. El "puerto de petición" es el puerto publicitado, y se usa para recibir datagramas respondibles (firmados), únicamente para la solicitud de conexión. El "puerto de respuesta" se usa para recibir datagramas sin firmar (raw, en crudo), y es el puerto fuente para todas las respuestas. El puerto de respuesta es arbitrario. Un cliente envía y recibe exclusivamente en un único puerto. Únicamente recibe datagramas sin firmar (raw). Los datagramas raw proporcionan una mayor eficiencia para las respuestas, ya que contienen credenciales enviadas en la petición, y no necesitan estar firmados.

source: In the announce request, the 4-byte IP is replaced by a 32-byte hash, and the port is still present, although it may be ignored by the tracker. In the announce response, each 4-byte IP and 2-byte port is replaced by a 32-byte hash (compact peer info), and no port is present. The client sends the announce request and scrape request to the source port in the announce response packet. The connect request, connect response, scrape request, scrape response, and error response are the same as in BEP 15.
es: En la solicitud de anuncio, la IP de 4-bytes es reemplazada por un hash de 32-bytes, y el puerto todavía está presente, aunque puede ser ignorado por el tracker. En la respuesta de anuncio, cada IP de 4-bytes y puerto de 2-bytes, es reemplazado por un hash (información compacta del par) de 32-bytes, sin presentar ningún puerto. El cliente envía la solicitud de anuncio, y la solicitud de scrape (rascado, estadísticas del torrent) al puerto fuente del paquete de respuesta de anuncio. La petición de conexión, la respuesta de conexión, la petición de scrape, la respuesta de scrape, y la respuesta de error, son los mismos que en la (proposición de mejora de bittorrent) BEP 15.

source: Source addresses in I2P cannot be spoofed, so it is possible to use a simplified protocol with 2 packets instead of 4, omitting the connect request and response. In this case, the announce request would be a repliable datagram sent to the tracker's query port, and the tracker would not require a response port. While this is more efficient, it would be more difficult to modify an existing tracker to support this mode. The URL for the 4-packet-mode tracker would use standard "udp://" prefix. The URL for a modified 2-packet-mode tracker would require a different prefix if both modes are supported in I2P.
es: Las direcciones fuente en I2P no pueden ser falsificadas, así que es posible usar un protocolo simplificado con 2 paquetes en lugar de 4, omitiendo la solicitud y la respuesta de conexión. En este caso, la solicitud de anuncio sería un datagrama respondible enviado al puerto de petición del tracker, y el tracker no requeriría un puerto de respuesta. Aunque esto es más eficiente, sería más difícil modificar un tracker existente para que soportara este modo. La URL para el tracker en modo-de-4-paquetes usaría el prefijo estandar "udp://". La URL para un tracker modificado en modo-de-2-paquetes requeriría un prefijo diferente si ambos modos están soportados en I2P.

source: Additional Information
es: Información adicional

source: I2P bittorrent standards are generally discussed on <a href="http://%(zzz)s/">%(zzz)s</a>.
es: Los estandares bittorrent I2P se discuten generalmente en <a href="http://%(zzz)s/">%(zzz)s</a>.

source: A chart of current tracker software capabilities is <a href="http://%(zzz)s/files/trackers.html">also available there</a>.
es: Una gráfica con las capacidades del actual software de tracker también está <a href="http://%(zzz)s/files/trackers.html">disponible allí</a>.

source: The <a href="http://%(forum)s/viewtopic.php?t=2068">I2P bittorrent FAQ</a>
es: El <a href="http://%(forum)s/viewtopic.php?t=2068">FAQ del bittorrent I2P</a>

source: <a href="http://%(zzz)s/topics/812">DHT on I2P discussion</a>
es: <a href="http://%(zzz)s/topics/812">Discusión de DHT sobre I2P</a>

source: Embedding I2P in your Application
es: Incrustando I2P en su aplicación

source: April 2015
es: Abril de 2015

source: This page is about bundling the entire I2P router binary with your application. It is not about writing an application to work with I2P (either bundled or external).
es: Esta página trata acerca del empaquetamiento del binario completo del router I2P junto a su aplicación. No trata sobre escribir una aplicación para que funcione con I2P (tanto empaquetándola como de forma externa).

source: Lots of projects are bundling, or talking about bundling, I2P. That's great if done right. If done wrong, it could cause real harm to our network. The I2P router is complex, and it can be a challenge to hide all the complexity from your users. This page discusses some general guidelines.
es: Montones de proyectos están empaquetando, o discutiendo acerca de empaquetar, I2P. Esto es estupendo si se hace bien. Si se hace mal, podría causar un verdadero daño a su red. El router I2P es complejo, y puede ser un reto ocultar toda la complejidad a sus usuarios. Esta página trata algunas directrices técnicas.

source: Talk to us
es: Hable con nosotros

source: Start a dialog. We're here to help. Applications that embed I2P are the most promising - and exciting - opportunities for us to grow the network and improve anonymity for everyone.
es: Inicie un debate. Estamos aquí para ayudar. Las aplicaciones que incrustan I2P son las oportunidades más prometedoras - y excitantes - para nosotros, de hacer crecer la red y mejorar el anonimato para todos.

source: Choose your router wisely
es: Elija su router I2P sabiamente

source: If your application is in Java or Scala, it's an easy choice - use the Java router. If in C/C++, we recommend i2pd. The development of i2pcpp has stopped. For apps in other languages, best to use SAM or BOB or SOCKS and bundle the Java router as a separate process. Some of the following only applies to the Java router.
es: Si su aplicación está escrita en Java o Scala, es una elección fácil - use el router I2P Java. Si lo está en C/C++, recomendamos i2pd. El desarrollo de i2pcpp se ha detenido. Para aplicaciones en otros idiomas, lo mejor es usar SAM, o BOB, o SOCKS, y empaquetar el router I2P Java como un proceso aparte. Algunas de las siguientes sólo se aplican al router I2P Java.

source: Licensing
es: Licenciamiento

source: Ensure you meet the license requirements of the software you are bundling.
es: Asegúrese de cumplir con los requerimientos de la licencia del software que está empaquetando.

source: Verify default configuration
es: Verifique la configuración por defecto

source: A correct default configuration is crucial. Most users will not change the defaults. The defaults for your application may need to be different than the defaults for the router you are bundling. Override the router defaults if necessary.
es: Una configuración por defecto correcta es crucial. La mayoría de usuarios no cambiará la configuración predeterminada.

source: Some important defaults to review: Max bandwidth, tunnel quantity and length, max participating tunnels. A lot of this depends on the expected bandwidth and usage patterns of your app.
es: Algunas configuraciones predeterminadas importantes a revisar: Ancho de banda máximo, cantidad y longitud de túneles, número máximo de túneles participantes. Esto depende en gran medida del ancho de banda esperado y los patrones de uso de su aplicación.

source: Configure enough bandwidth and tunnels to allow your users to contribute to the network. Consider disabling external I2CP, as you probably don't need it and it would conflict with any other running I2P instance. Also look at the configs for disabling killing of the JVM on exit, for example.
es: Configure suficiente ancho de banda y túneles para permitir contribuir a la red a sus usuarios. Considere deshabilitar I2CP (protocolo cliente de I2P), ya que probablemente no lo necesitará y entraría en conflicto con cualquier otra instancia de I2P en marcha. Mire también en la configuración para deshabilitar la fulminación (kill) de la JVM al salir, por ejemplo.

source: Participating Traffic Considerations
es: Consideraciones de tráfico participante

source: It may be tempting for you to disable participating traffic. There's several ways to do this (hidden mode, setting max tunnels to 0, setting shared bandwidth below 12 KBytes/sec). Without participating traffic, you don't have to worry about graceful shutdown, your users don't see bandwidth usage not generated by them, etc. However, there's lots of reasons why you should allow participating tunnels.
es: Podría ser tentador para usted deshabilitar el tráfico partipante. Hay varias formas de hacer esto (modo oculto, establecer el nº máximo de túneles a 0, establecer el ancho de banda compartido por debajo de 12 KBytes/seg). Sin tráfico participante, no tiene que preocuparse por que se efectúe un cierre ordenado, sus usuarios no ven el uso de ancho de banda no generado por ellos mismos, etc. Sin embargo, hay montones de razones por las que debería permitir túneles participantes.

source: First of all, the router doesn't work that well if it doesn't have a chance to "integrate" with the network, which is helped tremendously by others building tunnels through you.
es: Lo primero de todo, el router I2P no funciona tan bien si no tiene una oportunidad de "integrarse" con la red, algo a lo que otros contribuyen tremendamente estableciendo túneles a través de usted.

source: Secondly, over 90&#37; of the routers in the current network allow participating traffic. It's the default in the Java router. If your application doesn't route for others and it gets really popular, then it's a leech on the network, and it upsets the balance we have now. If it gets really big, then we become Tor, and spend our time begging for people to enable relaying.
es: En segundo lugar, más del 90&#37; de los routers I2P en la red actual permiten tráfico participante. Es la configuración por defecto en el router I2P Java. Si su aplicación no enruta para otros y se vuelve realmente popular, entonces es una sanguijuela (leech) en la red, y perturba el equilibrio que tenemos ahora. Si su impacto se vuelve realmente grande, entonces nos convertimos en Tor, y pasamos nuestro tiempo rogando a la gente que habilite la repetición de tráfico.

source: Thirdly, participating traffic is cover traffic that helps your users' anonymity.
es: En tercer lugar, el tráfico participante es tráfico de cobertura y contribuye al anonimato de sus usuarios.

source: We strongly discourage you from disabling participating traffic by default. If you do this and your application gets hugely popular, it could break the network.
es: Le recomendamos firmemente que no deshabilite el tráfico participante de forma predeterminada. Si hace esto y su aplicación se vuelve inmensamente popular, podría fracturar la red.

source: Persistence
es: Persistencia

source: You must save the router's data (netdb, configuration, etc.) between runs of the router. I2P does not work well if you must reseed each startup, and that's a huge load on our reseed servers, and not very good for anonymity either. Even if you bundle router infos, I2P needs saved profile data for best performance.
es: Debe guardar los datos del router I2P (netdb, configuración, etc.) entre las ejecuciones de este. I2P no funciona bien si tiene que resembrar a cada inicio, y eso supone una enorme carga sobre nuestros servidores de resembrado, y tampoco es muy bueno para el anonimato. Incluso si empaqueta las informaciones de los routers I2P (router infos), I2P precisa datos guardados de perfiles para lograr el mejor rendimiento.

source: Configurability
es: Configurabilidad

source: Give your users a way to change the configuration of the important settings. We understand that you will probably want to hide most of I2P's complexity, but it's important to show some basic settings. In addition to the defaults above, some network settings such as UPnP, IP/port may be helpful.
es: Proporcione a sus usuarios una forma de cambiar los valores de las configuraciones importantes. Comprendemos que probablemente querrá ocultar la mayoría de la complejidad de I2P, pero es importante mostrar algunas configuraciones básicas. Además de las configuraciones por defecto anteriores, algunas configuraciones de red tales como UPnP o IP/puerto pueden ser útiles.

source: Floodfill Considerations
es: Consideraciones de routers I2P de inundación (floodfill)

source: Above a certain bandwidth setting, and meeting other health criteria, your router will become floodfill, which may cause a large increase in connections and memory usage (at least with the Java router). Think about whether that's OK. You can disable floodfill, but then your fastest users aren't contributing what they could. It also depends on the typical uptime for your application.
es: Por encima de un cierto valor de ancho de banda, y respondiendo a otros criterios de salubridad, su router I2P se convertirá en router I2P de inundación (floodfill), lo que puede causar un gran incremento del número de conexiones y del uso de memoria (al menos con el router I2P Java). Piense en si eso es aceptable. Puede deshabilitar la característica floodfill, pero después sus usuarios más rápidos no estarán contribuyendo todo lo que podrían. También depende de la tiempo medio de ejecución continuada de su aplicación.

source: Reseeding
es: Resembrado

source: Decide if you are bundling router infos or using our reseed hosts. The Java reseed host list is in the source code, so if you keep your source up to date, the host list will be also. Be aware of possible blocking by hostile governments.
es: Decida si va a empaquetar las informaciones de los routers I2P (router infos) o si va a usar nuestros nodos de resembrado. La lista de nodos de resembrado Java está en el código fuente, así que si se mantiene actualizado, la lista de nodos también lo estará. Esté alerta ante un posible bloqueo por parte de gobiernos hostiles.

source: Reduce Network Resource Usage
es: Reduzca el uso de recursos de red

source: Consider setting your application tunnels to delay-open, reduce-on-idle and/or close-on-idle. This is straightforward if using i2ptunnel but you'll have to implement some of it yourself if using I2CP directly. See i2psnark for code that reduces tunnel count and then closes the tunnel, even in the presence of some background DHT activity.
es: Considere configurar los túneles de su aplicación a retardar-apertura (hasta necesitarlos), reducir-en-inactividad y/o cerrar-en-inactividad. Esto es algo directo si está usando i2ptunnel, pero tendrá que implementar algo de esto usted mismo si está usando I2CP directamente. Vea i2psnark para código que reduzca el número de túneles y cierre después el túnel, incluso en presencia de cierta actividad DHT (tabla de hash distribuida) en segundo plano.

source: Updatability
es: Actualizabilidad

source: Have an auto-update feature if at all possible, or at least auto-notification of a new version. Our biggest fear is a huge number of routers out there that can't be updated. We have about 6-8 releases a year of the Java router, and it's critical to the health of the network that the users keep up. We usually have over 80&#37; of the network on the latest release within 6 weeks after the release, and we'd like to keep it that way. You don't need to worry about disabling the router's built-in auto-update function, as that code is in the router console, which you presumably are not bundling.
es: Incluya una característica de auto-actualización si de algún modo es posible, o al menos de auto-notificación de nueva versión. Nuestro mayor temor es un enorme número de routers I2P ahí fuera que no se puedan actualizar. Tenemos en torno a 6-8 versiones al año del router I2P Java, y es crítico para la salud de la red que los usuarios se mantengan al día. Normalmente tenemos más del 80&#37; de la red en la última versión tras 6 semanas de la publicación de la versión, y nos gustaría continuar así. No tiene que preocuparse de deshabilitar la función integrada de auto-actualización del router I2P, ya que ese código está en la consola de este, la cual presumiblemente no está empaquetando.

source: Rollout
es: Despliegue

source: Have a gradual rollout plan. Don't overwhelm the network all at once. We currently have approximately 25K unique users per day and 40K uniques per month. We are probably able to handle growth of 2-3X per year without too much issue. If you anticipate a faster rampup than that, OR the bandwidth distribution (or uptime distribution, or any other significant characteristic) of your userbase is significantly different from our current userbase, we really need to have a discussion. The bigger your growth plans, the more important everthing else in this checklist is.
es: Elabore un plan de despliegue gradual. No empuje a toda la red a la vez. Actualmente tenemos aproximadamente 25K usuarios únicos al día y 40K únicos al mes. Probablemente podemos manejar un crecimiento de 2-3X por año sin demasiados problemas. Si anticipa una escalada más rápida que esa, - O - la distribución del ancho de banda (o la del tiempo de actividad o cualquier otro rasgo relevante) de su base de usuarios es significativamente diferente a la de nuestra base de usuarios actual, verdaderamente debemos tener una charla. Cuanto más grandes sean sus planes de crecimiento, más importantes serán el resto de cosas en esta lista de comprobación.

source: Design for and Encourage Long Uptimes
es: Diseñe por, e incite a, tiempos de actividad largos

source: Tell your users that I2P works best if it keeps running. It may be several minutes after startup before it works well, and even more after first install. If your average uptime is less than an hour, I2P is probably the wrong solution.
es: Explique a sus usuarios que I2P logra su mejor funcionamiento si se mantiene en ejecución. Pueden pasar varios minutos tras el inicio antes de que funcione bien, e incluso más tras la primera instalación. Si su tiempo medio en activo es menos de una hora, I2P probablemente es una mala solución.

source: Show Status
es: Muestre el estado

source: Provide some indication to the user that the application tunnels are ready. Encourage patience.
es: Proporcione alguna indicación al usuario de que los túneles de la aplicación están listos. Aliente a tener paciencia.

source: Graceful Shutdown
es: Cierre ordenado

source: If possible, delay the shutdown until your participating tunnels expire. Don't let your users break tunnels easily, or at least ask them to confirm.
es: Si es posible, retrase el cierre hasta que sus túneles participantes expiren. No deje que sus usuarios rompan los túneles fácilmente, o al menos pídales que confirmen.

source: Education and Donation
es: Educación y Donación

source: It would be nice if you give your users links to learn more about I2P and to donate.
es: Estaría bien si provee a sus usuarios enlaces para conocer más acerca de I2P y para donar.

source: External Router Option
es: Opción para router I2P externo

source: Depending on your user base and application, it may be helpful to provide an option or a separate package to use an external router.
es: Dependiendo de su base de usarios y la aplicación, puede ser útil proporcionar una opción o un paquete aparte para usar un router I2P externo.

source: Use of other Common Services
es: Uso de otros servicios comunes

source: If you plan to use or link to other common I2P services (news feeds, hosts.txt subscriptions, trackers, outproxies, etc.), make sure you aren't overloading them, and talk to the people who are running them to make sure it's ok.
es: Si planea usar un enlace a otros servicios comunes de I2P (suscripciones (feeds) de noticias, suscripciones a hosts.txt, trackers (bittorrent), proxys de salida, etc.), asegúrese de que no está sobrecargándolos, y hable con la gente que los ejecuta para asegurarse de que no les está perjudicando.

source: Time / NTP Issues
es: Tiempo / Problemas NTP

source: I2P includes an SNTP client. I2P requires correct time to operate. It will compensate for a skewed system clock but this may delay startup. You may disable I2P's SNTP queries, but this isn't advised unless your application makes sure the system clock is correct.
es: I2P incluye un cliente SNTP. I2P requiere la hora correcta para operar. Compensará un reloj de sistema desfasado, pero esto puede retrasar el inicio. Puede deshabilitar las peticiones SNTP de I2P, pero no se aconseja esto a menos que su aplicación se asegure de que el reloj de sistema está correcto.

source: Choose What and How you Bundle
es: Escoja Qué empaqueta y Cómo
