Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Garlic messages
es: Mensajes Garlic

source: Garlic messages are an extension of "onion" layered encryption, allowing the contents of a single message to contain multiple "cloves" - fully formed messages alongside their own instructions for delivery. Messages are wrapped into a garlic message whenever the message would otherwise be passing in cleartext through a peer who should not have access to the information - for instance, when a router wants to ask another router to participate in a tunnel, they wrap the request inside a garlic, encrypt that garlic to the receiving router's 2048bit ElGamal public key, and forward it through a tunnel. Another example is when a client wants to send a message to a destination - the sender's router will wrap up that data message (alongside some other messages) into a garlic, encrypt that garlic to the 2048bit ElGamal public key published in the recipient's leaseSet, and forward it through the appropriate tunnels.
es: Los mensajes Garlic son una extensión de la capa de cifrado "onion", permitiendo que el contenido de un simple mensaje contenga múltiples "dientes" - mensajes formados completamente y con sus propias instrucciones para el envío. Los mensajes son envueltos dentro de un mensaje Garlic ya que de otra forma deberían enviarse en texto plano a través de un par que no tiene que por que tener acceso a esa información - por ejemplo, cuando un ruter quiere preguntar a otro ruter si participa en un túnel, envuelven la solicitud dentro del garlic, y lo envían a través de un túnel. Otro ejemplo es cuando un cliente quiere enviar un mensaje a una destinación - el ruter del remitente envolverá los datos del mensaje (junto con otros mensajes) dentro de un garlic, cifrará ese garlic con la clave pública de 2048bit ElGamal publicada en el leaseSet del beneficiario, y lo enviará a través de los túneles apropiados.

source: The "instructions" attached to each clove inside the encryption layer includes the ability to request that the clove be forwarded locally, to a remote router, or to a remote tunnel on a remote router. There are fields in those instructions allowing a peer to request that the delivery be delayed until a certain time or condition has been met, though they won't be honored until the <a href="#future.variablelatency">nontrivial delays</a> are deployed. It is possible to explicitly route garlic messages any number of hops without building tunnels, or even to reroute tunnel messages by wrapping them in garlic messages and forwarding them a number of hops prior to delivering them to the next hop in the tunnel, but those techniques are not currently used in the existing implementation.
es: Las "instrucciones" adjuntas a cada diente, 'clove', dentro de la capa de cifrado incluyen la habilidad de solicitar que el diente sea enviado localmente a un ruter remoto, o a un túnel remoto en un ruter remoto. Hay campos en esas instrucciones que permiten a un par solicitar que el envío sea retrasado un cierto tiempo o hasta que se cumpla cierta condición, pero no funcionará hasta que los <a href="#future.variablelatency">retardos no triviales</a> funcionen en estas versiones. Es posible enrutar explícitamente mensajes garlic de cualquier número de saltos sin construir túneles, o incluso re enrutar mensajes de túnel envolviéndolos en un mensaje garlic y enviándolos por unos cuantos saltos antes de enviarlos al siguiente salto en el túnel, pero estas técnicas no se usan en en las implementaciones existentes.

source: Session tags
es: Etiquetas de sesión

source: As an unreliable, unordered, message based system, I2P uses a simple combination of asymmetric and symmetric encryption algorithms to provide data confidentiality and integrity to garlic messages. As a whole, the combination is referred to as ElGamal/AES+SessionTags, but that is an excessively verbose way to describe the simple use of 2048bit ElGamal, AES256, SHA256 and 32 byte nonces.
es: Como el sistema basado en mensajes no ordenados y no fiables que es, I2P usa una simple combinación de algoritmos de cifrado simétricos y asimétricos para proporcionar la confidencialidad de los datos y la integridad de los mensajes garlic. En conjunto, a la combinación se le llama ElGamal/AES+SessionTags, pero es una forma excesivamente larga de describir el uso del 2048bit ElGamal, AES256, SHA256 y nonces (números de único uso) de 32 bytes.

source: Session tags themselves have a very short lifetime, after which they are discarded if not used. In addition, the quantity stored for each key is limited, as are the number of keys themselves - if too many arrive, either new or old messages may be dropped. The sender keeps track whether messages using session tags are getting through, and if there isn't sufficient communication it may drop the ones previously assumed to be properly delivered, reverting back to the full expensive ElGamal encryption.
es: Las etiquetas de sesión tienen un vida muy corta, después de la cual son descartadas y no se usan más. Además, el número almacenado de ellas por cada clave es limitado, como también está limitado el número de claves - si llegan demasiadas, serán descartados los mensajes nuevos o los viejos. El remitente lleva el seguimiento de los mensajes con etiquetas de sesión que pasan a través suyo, y si no hay comunicación suficiente podría descartar los mensajes supuestamente enviados correctamente, volviendo al costoso cifrado ElGamal.

source: One alternative is to transmit only a single session tag, and from that, seed a deterministic PRNG for determining what tags to use or expect. By keeping this PRNG roughly synchronized between the sender and recipient (the recipient precomputes a window of the next e.g. 50 tags), the overhead of periodically bundling a large number of tags is removed, allowing more options in the space/time tradeoff, and perhaps reducing the number of ElGamal encryptions necessary. However, it would depend upon the strength of the PRNG to provide the necessary cover against internal adversaries, though perhaps by limiting the amount of times each PRNG is used, any weaknesses can be minimized. At the moment, there are no immediate plans to move towards these synchronized PRNGs.
es: Una alternativa sería transmitir sólo una etiqueta de sesión, y desde ahí sembrar un PRNG determinista para determinar que etiquetas usar o esperar. Manteniendo este PRNG bien sincronizado entre el remitente y el receptor (el receptor precalcula por ejemplo las siguiente 50 etiquetas) se evita la saturación de tener que calcular un gran número de etiquetas, permitiendo más opciones en ese espacio/tiempo de intercambio, y quizás reduciendo el número de cifrados necesarios de ElGamal. Sin embargo, dependerá de la fortaleza de PRNG de proteger contra adversarios internos, quizás limitando las veces que se usa cada PRNG se podrían limitar las debilidades. Hasta el momento no hay planes inmediatos para cambiar a estos PRNGs sincronizados.

source: Future
es: El futuro

source: While I2P is currently functional and sufficient for many scenarios, there are several areas which require further improvement to meet the needs of those facing more powerful adversaries as well as substantial user experience optimization.
es: Mientras que I2P es suficientemente funcional en mucho escenarios, hay varias áreas en las que requiere mejoras, como cubrir las necesidades de aquellos que se enfrentan a adversarios poderosos o mejorar la experiencia del usuario.

source: Restricted route operation
es: Funcionamiento restringido del ruter

source: I2P is an overlay network designed to be run on top of a functional packet switched network, exploiting the end to end principle to offer anonymity and security. While the Internet no longer fully embraces the end to end principle (due to the usage of NAT), I2P does require a substantial portion of the network to be reachable - there may be a number of peers along the edges running using restricted routes, but I2P does not include an appropriate routing algorithm for the degenerate case where most peers are unreachable. It would, however work on top of a network employing such an algorithm.
es: I2P es una red designada para ejecutarse sobre una red conmutada de paquetes funcionales, usando el principio de fin a fin para ofrecer anonimato y seguridad. Mientras que Internet ya no abraza el principio de fin a fin (por el uso de NAT), I2P necesita tener a su disposición una gran parte de la red - puede haber algunos pares ejecutándose en los bordes usando ruters restringidos no accesibles, pero I2P no incluye un algoritmo apropiado de enrutamiento para el extraño caso de que la mayoría de los pares no sean accesibles. Aún así podría funcionar sobre una red que utilizase dicho algoritmo.

source: Restricted route operation, where there are limits to what peers are reachable directly, has several different functional and anonymity implications, dependent upon how the restricted routes are handled. At the most basic level, restricted routes exist when a peer is behind a NAT or firewall which does not allow inbound connections. This was largely addressed in I2P 0.6.0.6 by integrating distributed hole punching into the transport layer, allowing people behind most NATs and firewalls to receive unsolicited connections without any configuration. However, this does not limit the exposure of the peer's IP address to routers inside the network, as they can simply get introduced to the peer through the published introducer.
es: El funcionamiento restringido del ruter, donde hay límites en el número de ruters que son accesibles directamente, tiene varias funciones e implicaciones en el anonimato dependiendo do como sean manejados los ruters restringidos. En el nivel más básico los ruters restringidos existen cuando un par está tras un NAT o cortafuegos que no permiten conexiones entrantes. Esto fue solucionado en I2P 0.6.0.6 al integrar "perforación" distribuida en la capa de transporte, permitiendo a la gente tras NATs o cortafuegos recibir conexiones no solicitadas sin ninguna configuración. Aún así esto no limita la exposición de la IP de lo pares a los ruters dentro de la red, ya que estos pueden presentarse a sí mismos al par a través del introductor ya publicado.

source: Beyond the functional handling of restricted routes, there are two levels of restricted operation that can be used to limit the exposure of one's IP address - using router-specific tunnels for communication, and offering 'client routers'. For the former, routers can either build a new pool of tunnels or reuse their exploratory pool, publishing the inbound gateways to some of them as part of their routerInfo in place of their transport addresses. When a peer wants to get in touch with them, they see those tunnel gateways in the netDb and simply send the relevant message to them through one of the published tunnels. If the peer behind the restricted route wants to reply, it may do so either directly (if they are willing to expose their IP to the peer) or indirectly through their outbound tunnels. When the routers that the peer has direct connections to want to reach it (to forward tunnel messages, for instance), they simply prioritize their direct connection over the published tunnel gateway. The concept of 'client routers' simply extends the restricted route by not publishing any router addresses. Such a router would not even need to publish their routerInfo in the netDb, merely providing their self signed routerInfo to the peers that it contacts (necessary to pass the router's public keys). Both levels of restricted route operation are planned for I2P 2.0.
es: Más allá del manejo funcional de ruters restringidos hay 2 niveles de operaciones restringidas que pueden usarse para limitar la exposición de la dirección IP - usando túneles específicos para la comunicación y ofreciendo 'ruters cliente'. En el primer caso, los ruters pueden, o construir un nuevo conjunto de túneles o reutilizar su conjunto de túneles publicando la gateway de entrada a algunos de ellos como parte de su routerInfo en lugar de su dirección de transporte. Cuando un par quiere ponerse en contacto con él, puede ver esas puertas de salida de los túneles en la netDb y simplemente enviar el mensaje a través de uno de los túneles publicados. Si el par detrás del ruter restringido quiere conectarse, puede hacerlo directamente (si desea exponer su IP al otro par) o indirectamente a trabés de sus túneles de salida. Cuando los ruters con los tienen conexión directa quieren contactarlo (por ejemplo para enviar mensajes de túnel), simplemente prioriza su conexión directa sobre la puerta la puerta de salida del túnel ya publicada. El concepto de 'ruters cliente' simplemente amplía la ruta restringida no publicando ninguna dirección de ruter. Este tipo de ruters ni siquiera necesita publicar si routerInfo en la netDb, simplemente proveyendo su routerInfo firmado por sí mismo al par con el que contacta (esto es necesario para pasar las claves públicas del ruter). Ambos niveles de operaciones restringidas del ruter están planeadas para la versión 2.0 de I2P.

source: There are tradeoffs for those behind restricted routes, as they would likely participate in other people's tunnels less frequently, and the routers which they are connected to would be able to infer traffic patterns that would not otherwise be exposed. On the other hand, if the cost of that exposure is less than the cost of an IP being made available, it may be worthwhile. This, of course, assumes that the peers that the router behind a restricted route contacts are not hostile - either the network is large enough that the probability of using a hostile peer to get connected is small enough, or trusted (and perhaps temporary) peers are used instead.
es: Existen inconvenientes para aquellos detrás de ruters restringidos ya que participarán menos frecuentemente en los túneles de otra gente, y los ruters a los que está conectado podrían ser capaces de descubrir patrones en el tráfico que de otra forma no podrían verse. Por otro lado, si el coste de exponer esos patrones es menor que el coste de de hacer que la IP esté disponible, puede valer la pena. Esto, por supuesto, suponiendo que los pares de los ruters con los que contacta el ruter restringido no son hostiles - o por que la red es suficientemente grande como para que la probabilidad de conectarse a un ruter hostil sea muy pequela, o porque se usan pares de confianza (y quizás temporales).

source: Variable latency
es: Latencia variable

source: Even though the bulk of I2P's initial efforts have been on low latency communication, it was designed with variable latency services in mind from the beginning. At the most basic level, applications running on top of I2P can offer the anonymity of medium and high latency communication while still blending their traffic patterns in with low latency traffic. Internally though, I2P can offer its own medium and high latency communication through the garlic encryption - specifying that the message should be sent after a certain delay, at a certain time, after a certain number of messages have passed, or another mix strategy. With the layered encryption, only the router that the clove exposed the delay request would know that the message requires high latency, allowing the traffic to blend in further with the low latency traffic. Once the transmission precondition is met, the router holding on to the clove (which itself would likely be a garlic message) simply forwards it as requested - to a router, to a tunnel, or, most likely, to a remote client destination.
es: Incluso aunque la mayoría de los esfuerzos iniciales han sido para que I2P tenga una comunicación de baja latencia, fue diseñado desde el principio para servicios de latencia variable. Al nivel más básico, las aplicaciones corriendo sobre I2P pueden ofrecer anonimato en comunicaciones de media y alta latencia mientras mezcla su tráfico con tráfico de baja latencia. Sin embargo, internamente I2P puede ofrecer sus comunicaciones de media y alta latencia a través de su cifrado garlic - especificando que el mensaje debe ser enviado después de un cierto retraso, en un determinado momento, después de que hayan pasado cierto número de mensajes o cualquier otra estrategia de mezclado. Con el cifrado por capas sólo el ruter que hizo la petición de retraso sabrá que el mensaje requiere alta latencia, permitiendo que el tráfico se mezcle más con el tráfico de baja latencia. Una vez que la condición de transmisión se cumple, el ruter que mantiene el 'clove' (que en sí mismo podría ser como un mensaje garlic) simplemente envía su petición - a un ruter, a un túnel, o, lo más probable, a una destinación cliente remota.

source: There are a substantial number of ways to exploit this capacity for high latency comm in I2P, but for the moment, doing so has been scheduled for the I2P 3.0 release. In the meantime, those requiring the anonymity that high latency comm can offer should look towards the application layer to provide it.
es: Hay un número bastante grande de formas de explotar esta capacidad de comunicación de alta latencia en I2P, por el momento, hacerlo se ha postergado hasta la versión 3.0 de I2P. Mientras tanto, aquellos que requieran el anonimato que las comunicaciones de alta latencia pueden ofrecer deben mirar en la capa de aplicación para obtenerlo.

source: Open questions
es: Preguntas sin resolver

source: How to get rid of the timing constraint?
es: ¿Cómo deshacerse de la restricción de tiempo?

source: Can we deal with the sessionTags more efficiently?
es: ¿Podemos manejar más eficientemente las etiquetas de sesión?

source: What, if any, batching/mixing strategies should be made available on the tunnels?
es: ¿Cuales, si hay alguna, estrategias de mezclado deberían estar disponibles en los túneles?

source: What other tunnel peer selection and ordering strategies should be available?
es: ¿Qué otras estrategias de selección de túneles de pares deberian estar disponibles?

source: Similar systems
es: Sistemas similares

source: I2P's architecture builds on the concepts of message oriented middleware, the topology of DHTs, the anonymity and cryptography of free route mixnets, and the adaptability of packet switched networking. The value comes not from novel concepts of algorithms though, but from careful engineering combining the research results of existing systems and papers. While there are a few similar efforts worth reviewing, both for technical and functional comparisons, two in particular are pulled out here - Tor and Freenet.
es: La arquitectura de I2P está basada en el concepto de software orientado a mensajes, la topología de DHTs, el cifrado y anonimato de redes de mezcla libres, y la adaptabilidad de las redes conmutadas de paquetes. Su valor no reside en nuevos conceptos o algoritmos, sino en la cuidadosa combinación de resultados de investigación de trabajos y sistemas ya existentes. Mientras que hay varios esfuerzos similares a los que vale la pena echar un ojo, se han elegido 2 en particular para comparaciones técnicas y funcionales - Tor y Freenet.

source: See also the <a href="%(comparisons)s">Network Comparisons Page</a>.
es: Ver también la <a href="%(comparisons)s">web de comparación entre redes</a>.

source: website
es: página web

source: At first glance, Tor and I2P have many functional and anonymity related similarities. While I2P's development began before we were aware of the early stage efforts on Tor, many of the lessons of the original onion routing and ZKS efforts were integrated into I2P's design. Rather than building an essentially trusted, centralized system with directory servers, I2P has a self organizing network database with each peer taking on the responsibility of profiling other routers to determine how best to exploit available resources. Another key difference is that while both I2P and Tor use layered and ordered paths (tunnels and circuits/streams), I2P is fundamentally a packet switched network, while Tor is fundamentally a circuit switched one, allowing I2P to transparently route around congestion or other network failures, operate redundant pathways, and load balance the data across available resources. While Tor offers the useful outproxy functionality by offering integrated outproxy discovery and selection, I2P leaves such application layer decisions up to applications running on top of I2P - in fact, I2P has even externalized the TCP-like streaming library itself to the application layer, allowing developers to experiment with different strategies, exploiting their domain specific knowledge to offer better performance.
es: A primera vista, Tor e I2P tienen muchas similitudes en lo que se refiere a funcionamiento y anonimato. Aunque I2P se empezó a desarrollar antes eramos conscientes de los esfuerzos hechos al inicio de Tor, muchas de las lecciones aprendidas de la red onion original y ZKS fueron integradas en el diseño de I2P. En vez de construir un sistema centralizado y de confianza con servidores de directorios, I2P tiene su propia base de datos de red auto organizable en la que cada par toma la responsabilidad de acceder al perfil de otros ruters para determinar como aprovechar los recursos disponibles. Otra diferencia básica es que mitras I2P y Tor usan rutas ordenadas y en capas (túneles y circuitos/streams), I2P es fundamentalmente una red conmutada de paquetes, mientras que Tor es fundamentalmente un circuito conmutado, permitiendo a I2P enrutar evitando congestiones y otros fallos de la red transparentemente , operar en vías redundantes, y hacer balance de carga de los datos a través de los recursos disponibles. Mientras que Tor ofrece una funcionalidad tan útil como el outproxy ofreciendo el descubrimiento y selección de outproxy integrado, I2P deja esas decisiones sobre la capa de aplicación a las aplicaciones ejecutándose sobre I2P - de hecho, I2P incluso ha exteriorizado la librería de streaming tipo TCP a la capa de aplicación, permitiendo a los desarrolladores el experimentar con diferentes estrategias, usando el conocimiento específico de dominio para ofrecer mejores rendimientos.
