Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: This doesn't have much to do with floodfill, but see the <a href="%(peerselection)s">peer selection page</a> for a discussion of the vulnerabilities of peer selection for tunnels.
es: Esto no tiene mucho que ver con los floodfill, pero vea la <a href="%(peerselection)s">página de selección de pares</a> para ver una discusión de las vulnerabilidades de la selección de los pares para los túneles.

source: Information Leaks
es: Fugas de información

source: (Reference: <a href="%(pdf)s">In Search of an Anonymous and Secure Lookup</a> Section 3)
es: (Referencia: <a href="%(pdf)s">In Search of an Anonymous and Secure Lookup</a> Sección 3)

source: This paper addresses weaknesses in the "Finger Table" DHT lookups used by Torsk and NISAN. At first glance, these do not appear to apply to I2P. First, the use of DHT by Torsk and NISAN is significantly different from that in I2P. Second, I2P's network database lookups are only loosely correlated to the <a href="%(peerselection)s">peer selection</a> and <a href="%(tunnelrouting)s">tunnel building</a> processes; only previously-known peers are used for tunnels. Also, peer selection is unrelated to any notion of DHT key-closeness.
es: Este estudio soluciona la debilidad en las búsquedas DHT "Finger Table" usadas por Torks y NISAN. A primera vista, estos parecen que no se apliquen a I2P. Primero, el uso que hacen Torks y NISAN del DHT es bastante diferente que su uso en I2P. Segundo, las búsquedas en la base de datos de red de I2P sólo están un poco relacionadas con los procesos de <a href="%(peerselection)s">selección de pares</a> y de <a href="%(tunnelrouting)s">construcción de túneles</a>; sólo los pares previamente conocidos son usados para los túneles. Además, la selección de pares no tiene relación con la noción de cercanía de claves DHT.

source: Some of this may actually be more interesting when the I2P network gets much larger. Right now, each router knows a large proportion of the network, so looking up a particular Router Info in the network database is not strongly indicative of a future intent to use that router in a tunnel. Perhaps when the network is 100 times larger, the lookup may be more correlative. Of course, a larger network makes a Sybil attack that much harder.
es: Algunos de estos serán más interesantes cuando la red I2P sea mucho más grande. Ahora mismo, cada ruter conoce una gran porción de la red, con lo que mirando por un RouterInfo en particular en la base de datos de la red no indica que ese ruter se vaya a usar en un túnel. Quizás cuando la red sea 100 veces más grande, la búsqueda sea correlativa. Por supuesto, una red más grande hace que un ataque Sybil sea mucho más difícil.

source: However, the general issue of DHT information leakage in I2P needs further investigation. The floodfill routers are in a position to observe queries and gather information. Certainly, at a level of <i>f</i> = 0.2 (20&#37; malicious nodes, as specifed in the paper) we expect that many of the Sybil threats we describe (<a href="%(threatmodel)s#sybil">here</a>, <a href="#sybil">here</a> and <a href="#sybil-partial">here</a>) become problematic for several reasons.
es: Sin embargo, el problema general de la filtración de información DHT (tabla de identificadores criptográficos (hash) dinámica) en I2P necesita posterior investigación. Los routers de inundacion (`floodfill`) están en posición de observar peticiones y reunir información. Ciertamente, a un nivel de <i>f</i> = 0.2 (20&#37; nodos maliciosos, tal como detalla la especificación) esperamos que muchas de las amenazas Sybil que describimos (<a href="%(threatmodel)s#sybil">aquí</a>, <a href="#sybil">aquí</a> y <a href="#sybil-partial">aquí</a>) se volverán problemáticas por varios motivos.

source: Moved to the netdb discussion page
es: Movido a la página de discusión de la netdb

source: End-to-end encryption of additional netDb lookups and responses.
es: Cifrado de fin a fin de las búsquedas y respuestas adicionales en la netDb.

source: Better methods for tracking lookup responses.
es: Mejores métodos de seguimiento de las respuestas de las búsquedas.

source: Peer Profiling and Selection
es: Perfilado y selección de pares

source: July 2010
es: Julio de 2010

source: Peer Profiling
es: Perfiles de los pares

source: <b>Peer profiling</b> is the process of collecting data based on the <b>observed</b> performance of other routers or peers, and classifying those peers into groups. Profiling does <b>not</b> use any claimed performance data published by the peer itself in the <a href="%(netdb)s">network database</a>.
es: La <b>creación de perfiles de los pares, profiling</b> es el proceso de recolectar datos basados en el rendimiento <b>observado</b> de otros ruters o pares. La creación de estos perfiles <b>no</b> usa los datos de rendimiento publicados por el par mismo en la <a href="%(netdb)s">base de datos de la red</a>.

source: Profiles are used for two purposes:
es: Los perfiles se usan con dos fines:

source: Selecting peers to relay our traffic through, which is discussed below
es: Para seleccionar pares para enviar nuestro tráfico a través, lo que se discute más abajo.

source: Choosing peers from the set of floodfill routers to use for network database storage and queries, which is discussed on the <a href="%(netdb)s">network database</a> page
es: Para elegir pares de un conjunto de ruters floodfill para usar los servicios de almacenamiento y consultas de la base de datos de la red, lo que se discute en la página de la <a href="%(netdb)s">base de datos de la red</a>

source: Peer Selection
es: Selección de pares

source: <b>Peer selection</b> is the process of choosing which routers on the network we want to relay our messages to go through (which peers will we ask to join our tunnels). To accomplish this, we keep track of how each peer performs (the peer's "profile") and use that data to estimate how fast they are, how often they will be able to accept our requests, and whether they seem to be overloaded or otherwise unable to perform what they agree to reliably.
es: La <b>selección de pares</b> es el proceso de escoger qué routers de la red queremos para pasar nuestros mensajes a través (o a cuales pares les pedimos permiso para unir nuestros túneles). Para llevar esto acabo, llevamos el seguimiento de como funciona cada par (el "perfil" del par) y usamos estos datos para estimar cómo son de rápidos, cuando serán capaces de aceptar nuestras peticiones y de saber cuando están sobrecargados o cuando no son capaces de hacer con fiabilidad lo que acordaron.

source: Unlike some other anonymous networks, in I2P, claimed bandwidth is untrusted and is <b>only</b> used to avoid those peers advertising very low bandwidth insufficient for routing tunnels. All peer selection is done through profiling. This prevents simple attacks based on peers claiming high bandwidth in order to capture large numbers of tunnels. It also makes <a href="%(threatmodel)s#timing">timing attacks</a> more difficult.
es: A diferencia de otras redes anónimas, en I2P el ancho de banda indicado no es de fiar y es <b>sólo</b> usado para evitar que esos pares anuncien anchos de banda insuficientes para rutar los túneles. Toda la selección de los pares se hace a través de lso perfiles. Esto evita ataques simples basados en pares que indican un gran ancho de banda para intentar capturar un gran número de túneles. También hace más difíciles los <a href="%(threatmodel)s#timing">ataques de sincronización</a>.

source: Peer selection is done quite frequently, as a router may maintain a large number of client and exploratory tunnels, and a tunnel lifetime is only 10 minutes.
es: La selección de pares se hace frecuentemente, ya que el ruter mantiene un gran número de túneles clientes y exploratorios, y la vida de un túnel es de sólo 10 minutos.

source: Further Information
es: Información futura

source: For more information see the paper <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a> presented at <a href="%(url)s">PET-CON 2009.1</a>. See <a href="#notes">below</a> for notes on minor changes since the paper was published.
es: Para más información vea el artículo <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a> presentado en el <a href="%(url)s">PET-CON 2009.1</a>. Mire <a href="#notes">más abajo</a> para ver los cambios menores o las notas desde que el artículo fue publicado.

source: Profiles
es: Perfiles

source: Each peer has a set of data points collected about them, including statistics about how long it takes for them to reply to a network database query, how often their tunnels fail, and how many new peers they are able to introduce us to, as well as simple data points such as when we last heard from them or when the last communication error occurred. The specific data points gathered can be found in the <a href="%(url)s">code</a>.
es: Cada par tiene un conjunto de datos recogidos sobre ellos, incluyendo estadísticas sobre cuánto tardan en responder a una petición a la base de datos de la red, con qué frecuencia fallan sus túneles, y cuántos nuevos pares son capaces de presentarnos, y también datos simples como cuándo supimos de ellos por última vez o cuándo fue el uĺtimo error de comunicación. Los datos obtenidos específicos pueden encontrarse en el <a href="%(url)s">código</a>.

source: Profiles are fairly small, a few KB. To control memory usage, the profile expiration time lessens as the number of profiles grows. Profiles are kept in memory until router shutdown, when they are written to disk. At startup, the profiles are read so the router need not reinitialize all profiles, thus allowing a router to quickly re-integrate into the network after startup.
es: Los perfiles son bastante pequeños, unos pocos KB. Para controlar el uso de la memoria usada, el tiempo de expiración de los perfiles disminuye cuando el número de perfiles aumenta. Los perfiles se mantienen en la memoria hasta que el ruter se apaga, entonces se escriben al disco duro. Al inicio, los perfiles son leídos para que el ruter no necesite reiniciar todos los perfiles, permitiendo al ruter integrarse rápidamente en la red después del arranque.

source: Peer Summaries
es: Resúmenes de los pares

source: While the profiles themselves can be considered a summary of a peer's performance, to allow for effective peer selection we break each summary down into four simple values, representing the peer's speed, its capacity, how well integrated into the network it is, and whether it is failing.
es: Aunque los perfiles por sí mismos puede considerarse un resumen del rendimiento de los pares, para tener una selección efectiva de los pares partimos cada resumen en cuatro valores simples, indicando la velocidad del par, su capacidad, cómo de bien está integrado en la red y cuándo fallan.

source: Speed
es: Velocidad

source: The speed calculation simply goes through the profile and estimates how much data we can send or receive on a single tunnel through the peer in a minute. For this estimate it just looks at performance in the previous minute.
es: El cálculo de la velocidad se hace simplemente mirando el perfil y calculando cuantos datos podemos enviar o recibir a través de túnel de un par durante un minuto. Para esta estimación simplemente mira el rendimiento en el minuto anterior.

source: Capacity
es: Capacidad

source: The capacity calculation simply goes through the profile and estimates how many tunnels the peer would agree to participate in over a given time period. For this estimate it looks at how many tunnel build requests the peer has accepted, rejected, and dropped, and how many of the agreed-to tunnels later failed. While the calculation is time-weighted so that recent activity counts more than later activity, statistics up to 48 hours old may be included.
es: El cálculo de la capacidad simplemente mira en el perfil y estima el número de túneles en los que aceptará participar en un periodo de tiempo dado. Para esta estimación mira cuantos peticiones de construcción de túneles ha aceptado, denegado y tirado, y cuantos túneles de los aceptados han fallado después. Las actividades recientes importan más que las demás, pueden ser incluidas hasta estadísticas de hasta 48 horas de viejas.

source: Recognizing and avoiding unreliable and unreachable peers is critically important. Unfortunately, as the tunnel building and testing require the participation of several peers, it is difficult to positively identify the cause of a dropped build request or test failure. The router assigns a probability of failure to each of the peers, and uses that probability in the capacity calculation. Drops and test failures are weighted much higher than rejections.
es: Reconocer y evitar los pares no fiables e inalcanzables es de importancia crítica. Desafortunadamente, ya que la creación de los túneles requiere la participación de varios pares, es difícil identificar positivamente la causa de una petición caída o un fallo en la prueba. El router asigna una probabilidad de fallo a cada par, y usa esa probabilidad en el cálculo de la capacidad. Las caídas y los fallos de prueba pesan mucho más que las denegaciones.

source: Peer organization
es: Organización de los pares

source: As mentioned above, we drill through each peer's profile to come up with a few key calculations, and based upon those, we organize each peer into three groups - fast, high capacity, and standard.
es: Como se ha mencionado arriba, nos sumergimos en el perfil de cada par para hacer unos pocos cálculos, y basado en esos cálculos, organizamos cada par dentro de estos tres grupos - rápido, con capacidad y estándar.

source: The groupings are not mutually exclusive, nor are they unrelated:
es: Los grupos no se excluyen mutuamente, y están relacionados entre ellos:

source: A peer is considered "high capacity" if its capacity calculation meets or exceeds the median of all peers.
es: Un par es considerado de "alta capacidad" si los cálculos cumplen o exceden la media de todos los pares.

source: A peer is considered "fast" if they are already "high capacity" and their speed calculation meets or exceeds the median of all peers.
es: Un par es considerado "rápido" si ya es de "alta capacidad", y los cálculos de velocidad cumplen o exceden la media de todos los pares.

source: A peer is considered "standard" if it is not "high capacity"
es: Un par es considerado "estándar/normal" si no es de "alta capacidad"

source: These groupings are implemented in the router's <a href="%(url)s">ProfileOrganizer</a>.
es: Estas agrupaciones están implementadas en el <a href="%(url)s">ProfileOrganizer</a> del ruter.

source: Group size limits
es: Límites del tamaño de los grupos

source: The size of the groups may be limited.
es: El tamaño de los grupos puede estar limitado.

source: The fast group is limited to 30 peers. If there would be more, only the ones with the highest speed rating are placed in the group.
es: El grupo rápido está limitado a 30 pares. Si hubiese más, sólo los que tuviesen las mayores velocidades permanecerían en el grupo.

source: The high capacity group is limited to 75 peers (including the fast group) If there would be more, only the ones with the highest capacity rating are placed in the group.
es: El grupo de alta capacidad está limitado a 75 pares (incluido el grupo rápido). Si hubiese más, sólo los que tuviesen las mayores capacidades permanecerían en el grupo.

source: The standard group has no fixed limit, but is somewhat smaller than the number of RouterInfos stored in the local network database. On an active router in today's network, there may be about 1000 RouterInfos and 500 peer profiles (including those in the fast and high capacity groups)
es: El grupo estándar no tiene un límite fijado, pero de alguna forma es menor que el número de RouterInfos almacenados en la base de datos de la red local. En un ruter activo de la red actual, puede haber como 1000 RouterInfoes y 500 perfiles de pares (incluyendo auqellos en los grupos rápidos y de alta capacidad)

source: Recalculation and Stability
es: Nuevos cálculos y estabilidad

source: Summaries are recalculated, and peers are resorted into groups, every 45 seconds.
es: Cada 45 segundos, los resúmenes son re-calculados, y los pares son recolocados en grupos.

source: The groups tend to be fairly stable, that is, there is not much "churn" in the rankings at each recalculation. Peers in the fast and high capacity groups get more tunnels build through them, which increases their speed and capacity ratings, which reinforces their presence in the group.
es: Los grupos tienden a ser bastante estables, esto es, no hay mucha "agitación" en las clasificaciones tras cada nuevo cálculo.

source: The router selects peers from the above groups to build tunnels through.
es: Los ruters seleccionan pares de los grupos anteriores para construir túneles a través de ellos.

source: Peer Selection for Client Tunnels
es: Selección de pares para los túneles cliente

source: Client tunnels are used for application traffic, such as for HTTP proxies and web servers.
es: Los túneles cliente se usan para el tráfico de las aplicaciones, como los proxies HTTP y los servidores web.

source: To reduce the susceptibility to <a href="http://blog.torproject.org/blog/one-cell-enough">some attacks</a>, and increase performance, peers for building client tunnels are chosen randomly from the smallest group, which is the "fast" group. There is no bias toward selecting peers that were previously participants in a tunnel for the same client.
es: Para reducir la propensión a <a href="http://blog.torproject.org/blog/one-cell-enough">algunos ataques</a>, e incrementar el rendimiento, los pares para la construcción de los túneles cliente se eligen aleatoriamente del grupo más pequeño, el cual es el grupo "rápido". No existe una tendencia hacia la selección de pares que anteriormente hayan participado en un túnel para el mismo cliente.

source: Peer Selection for Exploratory Tunnels
es: Selección de pares para los túneles exploratorios

source: Exploratory tunnels are used for router administrative purposes, such as network database traffic and testing client tunnels. Exploratory tunnels are also used to contact previously unconnected routers, which is why they are called "exploratory". These tunnels are usually low-bandwidth.
es: Los túneles exploratorios son usados para propósitos administrativos del ruter, como el tráfico de la base de datos de la red y los túneles cliente de prueba. También son usados para contactar con ruters anteriormente no contactados, que es por lo que se llaman "exploratorios". Estos túneles son normalmente de bajo ancho de banda.

source: Peers for building exploratory tunnels are generally chosen randomly from the standard group. If the success rate of these build attempts is low compared to the client tunnel build success rate, the router will select a weighted average of peers randomly from the high capacity group instead. This helps maintain a satisfactory build success rate even when network performance is poor. There is no bias toward selecting peers that were previously participants in an exploratory tunnel.
es: Los pares para construir los túneles exploratorios son elegidos normalmente aleatoriamente del grupo estándar. En su lugar, si la tasa de éxito de esos intentos de construcción es baja comparada con la tasa de éxito exitosa de construcción, el ruter seleccionará un promedio balanceado aleatoriamente de pares del grupo de alta capacidad.

source: As the standard group includes a very large subset of all peers the router knows about, exploratory tunnels are essentially built through a random selection of all peers, until the build success rate becomes too low.
es: Ya que el grupo estándar incluye una gran parte de todos los pares que el ruter conoce, los túneles exploratorios son construidos esencialmente a través de una selección aleatoria de todos los pares, hasta que la tasa de éxito de construcción sea demasiada baja.

source: Restrictions
es: Restricciones

source: To prevent some simple attacks, and for performance, there are the following restrictions:
es: Para prevenir algunos ataques simples, y para mejorar el rendimiento, existen las siguientes restricciones:

source: Two peers from the same /16 IP space may not be in the same tunnel.
es: Dos pares en el mismo espacio de IPs /16 no deben estar en el mismo túnel.

source: A peer may participate in a maximum of 33&#37; of all tunnels created by the router.
es: Un par (`peer`) puede participar en un máximo de 33&#37; de todos los túneles creados por el router.

source: Peers with extremely low bandwidth are not used.
es: Los pares con el ancho de banda extremadamente bajo no son usados.

source: Peers for which a recent connection attempt failed are not used.
es: Los pares para los que un intento de conexión reciente ha fallado no son usados.

source: Peer Ordering in Tunnels
es: Orden de los pares en los túneles

source: Peers are ordered within tunnels to to deal with the <a href="%(pdf)s">predecessor attack</a> <a href="%(pdf2008)s">(2008 update)</a>. More information is on the <a href="%(tunnelimpl)s#ordering">tunnel page</a>.
es: Los pares son ordenados dentro de los túneles para hacer frente al <a href="%(pdf)s">ataque del predecesor</a> <a href="%(pdf2008)s">(actualización del 2008)</a>. Hay más información en la <a href="%(tunnelimpl)s#ordering">página del túnel</a>.

source: Continue to analyze an tune speed and capacity calculations as necessary
es: Continuar analizando y afinando los cálculos de capacidad y velocidad según las necesidades.

source: Implement a more aggressive ejection strategy if necessary to control memory usage as the network grows
es: Implementar una estrategia de expulsión más agresiva si se necesita para controlar el uso de memoria según crezca la red.

source: Evaluate group size limits
es: Evaluar el tamaño de los límites de los grupos

source: Use GeoIP data to include or exclude certain peers, if configured
es: Usar datos GeoIP para incluir o excluir ciertos pares, si se configura

source: For those reading the paper <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a>, please keep in mind the following minor changes in I2P since the paper's publication:
es: Para aquellos leyendo el estudio <a href="%(pdf)s">Peer Profiling and Selection in the I2P Anonymous Network</a>, por favor, tengan en cuenta los siguientes cambios menores en I2P desde la publicación de dicho estudio.

source: The Integration calculation is still not used
es: Todavía no se usa el cálculo de integración

source: In the paper, "groups" are called "tiers"
es: En el estudio, a los "grupos" se les llama "tiers"/"niveles"

source: The "Failing" tier is no longer used
es: El nivel "Fallando" no se usa más.

source: The "Not Failing" tier is now named "Standard"
es: El nivel "no fallando" se llama ahora "estándar"

source: One Cell Enough
es: Una célula basta

source: Tor Entry Guards
es: Entry Guards de Tor

source: Murdoch 2007 Paper
es: Estudio Murdoch 2007

source: Tune-up for Tor
es: Ajustes para Tor

source: Low-resource Routing Attacks Against Tor
es: Ataques de enrutado de bajo recurso contra Tor

source: I2P: A scalable framework for anonymous communication
es: I2P: Un sistema escalable para las comunicaciones anónimas

source: Introduction
es: Introducción

source: I2P Operation
es: Como funciona I2P

source: Transport protocols
es: Protocolos de transporte

source: Cryptography
es: Cifrado
