Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: In addition, a router must pass several additional tests for health (outbound message queue time, job lag, etc.) before floodfill operation is automatically enabled.
es: Además, un ruter debe pasar varios pruebas adiciones para comprobar su salud (tiempo de espera de los mensajes de salida, retraso de los trabajos, etc) antes de que se active automáticamente como un floodfill.

source: With the current rules for automatic opt-in, approximately 6&#37; of the routers in the network are floodfill routers.
es: Con las reglas actuales para la aceptación automática, aproximadamente el 6&#37; de los routers en la red son routers floodfill.

source: While some peers are manually configured to be floodfill, others are simply high-bandwidth routers who automatically volunteer when the number of floodfill peers drops below a threshold. This prevents any long-term network damage from losing most or all floodfills to an attack. In turn, these peers will un-floodfill themselves when there are too many floodfills outstanding.
es: Mientras que algunos pares se configuran manualmente para ser floodfill, otros son simplemente ruters con gran ancho de banda que son automáticamente convertidos en floodfill cuando el número de pares floodfill baja de un límite. Esto evita el daño por un tiempo largo cuando se pierden la mayoría de los ruters floodfill a causa de un ataque. A su vez, estos pares dejarán de ser floodfill cuando ya haya suficientes floodfills activos.

source: Floodfill Router Roles
es: El papel del ruter floodfill

source: A floodfill router's only services that are in addition to those of non-floodfill routers are in accepting netDb stores and responding to netDb queries. Since they are generally high-bandwidth, they are more likely to participate in a high number of tunnels (i.e. be a "relay" for others), but this is not directly related to their distributed database services.
es: Los únicos servicios que tienen de más los ruters floodfill que no tienen los ruters no floodfill es aceptar almacenamientos en la netDb y el responder a las solicitudes de la netDb. Ya que normalmente tienen un gran ancho de banda, es más usual que participen en un gran número de túneles (por ejemplo como un "relay" para otros), pero esto no está relacionado directamente con sus servicios distribuidos de la base de datos.

source: Kademlia Closeness Metric
es: Medida de cercanía Kademlia

source: The netDb uses a simple Kademlia-style XOR metric to determine closeness. The SHA256 hash of the key being looked up or stored is XOR-ed with the hash of the router in question to determine closeness. A modification to this algorithm is done to increase the costs of <a href="#sybil-partial">Sybil attacks</a>. Instead of the SHA256 hash of the key being looked up of stored, the SHA256 hash is taken of the 32-byte binary search key appended with the UTC date represented as an 8-byte ASCII string yyyyMMdd, i.e. SHA256(key + yyyyMMdd). This is called the "routing key", and it changes every day at midnight UTC. Only the search key is modified in this way, not the floodfill router hashes. The daily transformation of the DHT is sometimes called "keyspace rotation", although it isn't strictly a rotation.
es: La base de datos de red (netDb) utiliza una métrica XOR estilo-Kademlia sencilla para determinar la cercanía. El identificador criptográfico (hash) SHA256 de la clave que se está buscando, o almacenando XOReada con el identificador criptográfico del router en cuestión para determinar la cercanía. Se ha realizado una modificación en este algoritmo para incrementar el coste de los <a href="#sybil-partial">ataques Sybil</a>. En lugar del hash SHA256 de la clave que se está buscando o almacenando, el identificador criptográfico SHA256 se toma de la clave de búsqueda binaria de 32-bytes sufijada con la fecha UTC representada como una cadena ASCII de 8-bytes aaaaMMdd, es decir SHA256(clave + aaaaMMdd). A esto se le llama "clave de enrutado", y cambia cada día a la medianoche UTC. Sólo la clave de búsqueda es modificada de esta forma, no los identificadores criptográficos de los routers de inundación. A la transformación diaria de la DHT (tabla dinámica de hashes) a veces se le llama "rotación del espacio de claves" (keyspace rotation), aunque no es estrictamente una rotación.

source: Routing keys are never sent on-the-wire in any I2NP message, they are only used locally for determination of distance.
es: Las claves de enrutado nunca se envían por-el-cable en ninguno de los mensajes I2NP, sólo se usan localmente para determinar la distancia.

source: Storage, Verification, and Lookup Mechanics
es: Mecanismos de almacenaje, verificación y bloqueo

source: RouterInfo Storage to Peers
es: Almacenamiento del RouterInfo en los pares

source: <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages containing the local RouterInfo are exchanged with peers as a part of the initialization of a <a href="%(ntcp)s">NTCP</a> or <a href="%(ssu)s">SSU</a> transport connection.
es: Los mensajes <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages que contienen el RouterInfo local son intercambiados con pares como parte de la inicialización de una conexión de transporte <a href="%(ntcp)s">NTCP</a> o <a href="%(ssu)s">SSU</a>.

source: LeaseSet Storage to Peers
es: Almacenamiento del LeaseSet en los pares

source: <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages containing the local LeaseSet are periodically exchanged with peers by bundling them in a garlic message along with normal traffic from the related Destination. This allows an initial response, and later responses, to be sent to an appropriate Lease, without requiring any LeaseSet lookups, or requiring the communicating Destinations to have published LeaseSets at all.
es: Los mensajes <a href="%(i2np)s">I2NP</a> DatabaseStoreMessages que contienen el LeaseSet local son intercambiados periódicamente con pares agrupándolos en un mensaje garlic junto con el tráfico normal desde la Destinación relacionada. Esto permite enviar una respuesta inicial, y una respuesta posterior, al Lease apropiado, sin necesidad de hacer búsquedas de LeaseSet, o tener que comunicarse con las Destinaciones para publicar los LeaseSets.

source: The DatabaseStoreMessage should be sent to the floodfill that is closest to the current routing key for the RouterInfo or LeaseSet being stored. Currently, the closest floodfill is found by a search in the local database. Even if that floodfill is not actually closest, it will flood it "closer" by sending it to multiple other floodfills. This provides a high degree of fault-tolerance.
es: El DatabaseStoreMessage (mensaje de almacén de base de datos) debe enviarse al router de inundación (`floodfill`, extienden la red I2P al desplegarse en inundación portando la base de datos distribuida netDb) más cercano al lugar donde se esté guardando la clave de enrutado actual para el RouterInfo o el LeaseSet. Actualmente el router floodfill más cercano se obtiene mediante una búsqueda en la base de datos local. Incluso si ese router floodfill no es en realidad el más cercano, lo inundará "hacia si" enviándo el mensaje a otros múltiples routers de inundación. Esto proporciona un alto grado de tolerencia a fallos.

source: In traditional Kademlia, a peer would do a "find-closest" search before inserting an item in the DHT to the closest target. As the verify operation will tend to discover closer floodfills if they are present, a router will quickly improve its knowledge of the DHT "neighborhood" for the RouterInfo and LeaseSets it regularly publishes. While I2NP does not define a "find-closest" message, if it becomes necessary, a router may simply do an iterative search for a key with the least significant bit flipped (i.e. key ^ 0x01) until no closer peers are received in the DatabaseSearchReplyMessages. This ensures that the true closest peer will be found even if a more-distant peer had the netdb item.
es: En el Kademlia tradicional, un par (`peer`) haría una búsqueda "find-closest" (encuentra al más cercano) antes de insertar un elemento en la DHT (tabla de hash dinámica) hacia el objetivo más cercano. Como la operación de verificación tenderá a descubrir los routers floodfills más cercanos si están presentes, un router mejorará rápidamente su conocimiento del "vecindario" de la DHT para el RouterInfo (información para contactar routers) y los LeaseSets (información para contactar destinos) que publica regularmente. Aunque I2NP no define un mensaje "find-closest", si fuera necesario un router simplemente podría hacer una búsqueda iterativa de la clave con el bit menos significativo invertido (es decir, la clave ^ 0x01) hasta que no se reciban pares más cercanos en los DatabaseSearchReplyMessages (mensajes de respuesta de búsqueda de la base de datos). Esto asegura que se encontrará al verdadero par más cercano incluso si un par más-distante tiene el elemento netDb.

source: RouterInfo Storage to Floodfills
es: Almacenamiento de RouterInfo en los Floodfills

source: A router publishes its own RouterInfo by directly connecting to a floodfill router and sending it a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage with a nonzero Reply Token. The message is not end-to-end garlic encrypted, as this is a direct connection, so there are no intervening routers (and no need to hide this data anyway). The floodfill router replies with a <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, with the Message ID set to the value of the Reply Token.
es: Un ruter publica su propia RouterInfo conectándose directamente a un ruter Floodfill y enviando un <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage con un token de respuesta no vacío. Este mensaje está cifrado de fin a fin como Garlic, y es una conexión directa, con lo cual no hay ruters en medio (no se necesita ocultar ninguna información). El ruter floodfill responde con un <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, con el ID del mensaje puesto en el valor del token de respuesta.

source: LeaseSet Storage to Floodfills
es: Almacenamiento de LeaseSet en los Floodfills

source: Storage of LeaseSets is much more sensitive than for RouterInfos, as a router must take care that the LeaseSet cannot be associated with the router.
es: El almacenamiento de los LeaseSets es mucho más sensible que el de los RouterInfos, ya que un ruter debe de tener cuidad de que el LeaseSet no pueda ser asociado con el ruter.

source: A router publishes a local LeaseSet by sending a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage with a nonzero Reply Token over an outbound client tunnel for that Destination. The message is end-to-end garlic encrypted using the Destination's Session Key Manager, to hide the message from the tunnel's outbound endpoint. The floodfill router replies with a <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, with the Message ID set to the value of the Reply Token. This message is sent back to one of the client's inbound tunnels.
es: Un ruter publica un LeaseSet local enviando un <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage con un token de respuesta no vacío sobre un túnel cliente de salida desde esa Destinación. Este mensaje es cifrado de fin a fin con Garlic usando el administrador de claves de la sesión de la Destinación, para ocultar el mensaje en el punto final del túnel de salida. El ruter floodfill responde con un <a href="%(i2np)s">I2NP</a> DeliveryStatusMessage, con el ID del mensaje puesto como el token de respuesta. Este mensaje es enviado de vuelta a los túneles de entrada del cliente.

source: Flooding
es: Inundación

source: After a floodfill router receives a DatabaseStoreMessage containing a valid RouterInfo or LeaseSet which is newer than that previously stored in its local NetDb, it "floods" it. To flood a NetDb entry, it looks up several (currently %(floodsize)s) floodfill routers closest to the routing key of the NetDb entry. (The routing key is the SHA256 Hash of the RouterIdentity or Destination with the date (yyyyMMdd) appended.) By flooding to those closest to the key, not closest to itself, the floodfill ensures that the storage gets to the right place, even if the storing router did not have good knowledge of the DHT "neighborhood" for the routing key.
es: Después de que un router floodfill (de inundación) reciba un DatabaseStoreMessage conteniendo un RouterInfo (información para contactar con un router) o LeaseSet (información para contactar con un Destino) que esté más actualizado que el guardado previamente en su NetDb local, lo "inunda". Para inundar una entrada NetDb, busca varios (actualmente %(floodsize)s) routers floodfill más próximos a la clave de enrutamiento de la entrada NetDb. (La clave de enrutamiento es el (identificador criptográfico) Hash SHA256 de la RouterIdentity o Destino con la fecha (aaaaMMdd) como sufijo). Mediante la inundación a aquellos más próximos a la clave, no los más próximos a si mismos, el router flloodfill asegura que el almacenamiento llega al lugar adecuado, incluso si el router almacenante no tenía un buen conocimiento del "vecindario" DHT (tabla de hash distribuida) de la clave de enrutamiento.

source: The floodfill then directly connects to each of those peers and sends it a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage with a zero Reply Token. The message is not end-to-end garlic encrypted, as this is a direct connection, so there are no intervening routers (and no need to hide this data anyway). The other routers do not reply or re-flood, as the Reply Token is zero.
es: El router floodfill conecta entonces directamente a cada uno de esos pares y les envía un DatabaseStoreMessage <a href="%(i2np)s">I2NP</a> con una credencial (`token`) de respueta cero. El mensaje no está cifrado extremo-a-extremo con garlic (ajo), ya que esta es una conexión directa, así que no hay routers intervinientes (y de todas formas no hay necesidad de esconder este dato). Los otros routers no responden ni re-inundan, ya que la credencial de respuesta es cero.

source: RouterInfo and LeaseSet Lookup
es: Búsquedas de RouterInfo y LeaseSet

source: The <a href="%(i2np)s">I2NP</a> DatabaseLookupMessage is used to request a netdb entry from a floodfill router. Lookups are sent out one of the router's outbound exploratory tunnels. The replies are specified to return via one of the router's inbound exploratory tunnels.
es: El DatabaseLookupMessage (mensaje de consulta a la base de datos) de <a href="%(i2np)s">I2NP</a> se usa para solicitar una entrada netDb desde un router floodfill. Las consultas se transmiten por uno de los túneles exploratorios de salida del router. Las respuestas están definidas para volver a través de uno de los túneles exploratorios de entrada del router.

source: Lookups are generally sent to the two "good" (the connection doesn't fail) floodfill routers closest to the requested key, in parallel.
es: Las consultas generalmente se envían a los dos routers floodfill "buenos" (en los que la conexión no falla) más próximos a la clave solicitada, en paralelo.

source: If the key is found locally by the floodfill router, it responds with a <a href="%(i2np)s">I2NP</a> DatabaseStoreMessage. If the key is not found locally by the floodfill router, it responds with a <a href="%(i2np)s">I2NP</a> DatabaseSearchReplyMessage containing a list of other floodfill routers close to the key.
es: Si el router floodfill encuentra la clave localmente, responde con un DatabaseStoreMessage (mensaje de almacenaje en la base de datos) de <a href="%(i2np)s">I2NP</a>. Si el router floodfill no encontró la clave localmente, responde con un DatabaseSearchReplyMessage (mensaje de respuesta a búsqueda en la base de datos) de <a href="%(i2np)s">I2NP</a> conteniendo una lista de otros routers floodfill próximos a la clave.

source: LeaseSet lookups are garlic encrypted end-to-end as of release 0.9.5. RouterInfo lookups are not encrypted and thus are vulnerable to snooping by the outbound endpoint (OBEP) of the client tunnel. This is due to the expense of the ElGamal encryption. RouterInfo lookup encryption may be enabled in a future release.
es: Las consultas de LeaseSet (información para contactar destinos) están cifradas extremo-a-extremo con garlic (ajo) desde la versión 0.9.5. Las consultas de RouterInfo (información para contactar routers) no están cifradas y por tanto son vulnerables a espionaje por el extremo exterior (outbound endpoint, OBEP) del túnel cliente. Esto es debido a lo caro del cifrado ElGamal. El cifrado de la consulta RouterInfo puede que sea habilitado en una futura versión.

source: As of release 0.9.7, replies to a LeaseSet lookup (a DatabaseStoreMessage or a DatabaseSearchReplyMessage) will be encrypted by including the session key and tag in the lookup. This hides the reply from the inbound gateway (IBGW) of the reply tunnel. Responses to RouterInfo lookups will be encrypted if we enable the lookup encryption.
es: Desde la versión 0.9.7 las respuestas a una consulta de LeaseSet (un DatabaseStoreMessage o un DatabaseSearchReplyMessage) estarán cifradas mediante la inclusión de la clave de sesión y la etiqueta en la consulta. Esto esconde la respuesta desde la pasarela de entrada (inbound gateway, IBGW) del túnel de respuesta. Las respuestas a consultas a de RouterInfo serán cifradas si se habilita el cifrado de consultas.

source: (Reference: <a href="%(pdf)s">Hashing it out in Public</a> Sections 2.2-2.3 for terms below in italics)
es: (Referencia: <a href="%(pdf)s">Hashing it out in Public</a> (Discutiéndolo en público [juego de palabras]) Secciones 2.2-2.3 para los términos en itálica de debajo)

source: Due to the relatively small size of the network and the flooding redundancy of 8x, lookups are usually O(1) rather than O(log n) -- a router is highly likely to know a floodfill router close enough to the key to get the answer on the first try. In releases prior to 0.8.9, routers used a lookup redundancy of two (that is, two lookups were performed in parallel to different peers), and neither <i>recursive</i> nor <i>iterative</i> routing for lookups was implemented. Queries were sent through <i>multiple routes simultaneously</i> to <i>reduce the chance of query failure</i>.
es: Debido al relativamente pequeño tamaño de la red y la redundancia de la inundación por un factor 8x, las consultas son habitualmente O(1) más bien que O(log n) -- un router es altamente probable que conozca un router floodfill suficientemente cercano a la clave para obtener la respuesta en el primer intento. En versiones anteriores a la 0.8.9, los routers usaban una redundancia de consulta de dos (esto es, se realizaban dos consultas en paralelo a direferentes pares), y ni el enrutado <i>recursivo</i> ni el <i>iterativo</i> estaba implementado para las consultas. Las peticiones se enviaban a través de <i>múltiples rutas simultáneamente</i> para <i>reducir la posibilidad de fallo de consulta</i>.

source: As of release 0.8.9, <i>iterative lookups</i> are implemented with no lookup redundancy. This is a more efficient and reliable lookup that will work much better when not all floodfill peers are known, and it removes a serious limitation to network growth. As the network grows and each router knows only a small subset of the floodfill peers, lookups will become O(log n). Even if the peer does not return references closer to the key, the lookup continues with the next-closest peer, for added robustness, and to prevent a malicious floodfill from black-holing a part of the key space. Lookups continue until a total lookup timeout is reached, or the maximum number of peers is queried.
es: Desede la versión 0.8.9 las <i>consultas iterativas</i> se implementaron sin redundancia en la consulta. Esta es una consulta más eficiente y fiable, que funcionará mucho mejor cuando no sean conocidos todos los pares de inundación (`floodfill peers`), y elimina una seria limitación al crecimiento de la red. Al crecer la red y que cada router conozca sólo un pequeño subconjunto de los pares de inundación, las consultas llegarán a ser O(log n). Incluso si los pares no devuelven referencias más cercanas a la clave, la consulta continúa con el par más-próximo-a-continuación, para añadir robustez, y para prevenir que un par de inundación malicioso acapare (`black-holing`) una parte del espacio de la clave. Las consultas continúan hasta que se alcance el total del tiempo límite de la consulta o se haya consultado al número de pares máximo.

source: <i>Node IDs</i> are <i>verifiable</i> in that we use the router hash directly as both the node ID and the Kademlia key. Incorrect responses that are not closer to the search key are generally ignored. Given the current size of the network, a router has <i>detailed knowledge of the neighborhood of the destination ID space</i>.
es: Los <i>identificadores (`IDs`) de nodos</i> son <i>verificables</i> en aquellos [nodos] en los que usamos el identificador criptográfico del router (`hash`) directamente tanto como identificador (`ID`) de nodo y como clave Kademlia. Las respuestas incorrectas que no sean más cercanas a la clave de búsqueda son ignoradas por lo general. Dado el actual tamaño de la red, un router tiene <i>conocimiento detallado del vecindario del espacio del identicador (`ID`) del destino</i>.

source: RouterInfo Storage Verification
es: Verificación del almacenamiento de la RouterInfo

source: Note: RouterInfo verification is disabled as of release 0.9.7.1 to prevent the attack described in the paper <a href="%(egger2013)s">Practical Attacks Against the I2P Network</a>. It is not clear if verification can be redesigned to be done safely.
es: Nota: La verificación del RouterInfo (información para contactar con un router) está deshabilitada desde la versión 0.9.7.1 para prevenir el ataque descrito en el ensayo (ataques prácticos contra la red I2P) <a href="%(egger2013)s">Practical Attacks Against the I2P Network</a>. No está claro si la verificación puede rediseñarse para ser realizada de forma segura.

source: To verify a storage was successful, a router simply waits about 10 seconds, then sends a lookup to another floodfill router close to the key (but not the one the store was sent to). Lookups sent out one of the router's outbound exploratory tunnels. Lookups are end-to-end garlic encrypted to prevent snooping by the outbound endpoint(OBEP).
es: Para verificar que un almacenamiento fue exitoso, un router simplemente espera cerca de 10 segundos, entonces envía una consulta a otro router de inundación (`floodfill`) cercano a la clave (pero no al que se envió el almacenamiento). Las consultas establecieron uno de los túneles exploratorios de salida del router. Las consultas están cifradas extremo-a-extremo con garlic (ajo) para prevenir la vigilancia en el extremo exterior (OutBound End Point, OBEP).

source: LeaseSet Storage Verification
es: Verificación del almacenamiento del LeaseSet
