Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: A HTTP proxy used for browsing I2P and the regular internet anonymously through I2P. Browsing internet through I2P uses a random proxy specified by the "Outproxies:" option.
es: Un proxy HTTP usado para navegar por I2P y la Internet regular de forma anónima a través de I2P. La navegación por Internet a través de I2P usa un proxy aleatorio especificado por la opción "Outproxies:" (proxys de salida).

source: An IRC tunnel to the default anonymous IRC network, Irc2P.
es: Un túnel IRC hasta la red IRC anónima por defecto, Irc2P.

source: The anonymous <a href="%(monotone)s">monotone</a> sourcecode repository for I2P
es: El repositorio de código fuente <a href="%(monotone)s">monotone</a> anónimo para I2P

source: A SMTP service provided by postman at <a href="http://%(postman)s/?page_id=16">%(postman)s</a>
es: Un servicio SMTP proporcionado por postman en <a href="http://%(postman)s/?page_id=16">%(postman)s</a>

source: The accompanying POP sevice of postman at <a href="http://%(postman)s/?page_id=16">%(postman)s</a>
es: El servicio POP acompañante de postman en <a href="http://%(postman)s/?page_id=16">%(postman)s</a>

source: Configuration
es: Configuración

source: Client Modes
es: Modos de cliente

source: Standard
es: Estándar

source: Opens a local TCP port that connects to a service (like HTTP, FTP or SMTP) on a destination inside of I2P. The tunnel is directed to a random host from the comma seperated (", ") list of destinations.
es: Abre un puerto TCP local que conecta con un servicio (como HTTP, FTP o SMTP) en un destino dentro de I2P. El túnel es dirigido a un servidor aleatorio desde la lista de destinos separados por comas (", ").

source: A HTTP-client tunnel. The tunnel connects to the destination specified by the URL in a HTTP request. Supports proxying onto internet if an outproxy is provided. Strips HTTP connections of the following headers:
es: Un túnel de cliente-HTTP. El túnel conecta con el destino especificado por la URL en una petición HTTP. Soporta proxificación en Internet si se proporciona un proxy externo (`outproxy`). Desnuda las conexiones HTTP de las siguientes cabeceras:

source: Depending on if the tunnel is using an outproxy or not it will append the following User-Agent:
es: Dependiendo de si el túnel está usando un proxy externo (`outproxy`) o no, adherirá el siguiente Agente de Usuario (`User-Agent`):

source: Outproxy:
es: Proxy de salida:

source: Internal I2P use:
es: Uso interno de I2P:

source: Creates a connection to a random IRC server specified by the comma seprated (", ") list of destinations. Only a whitelisted subset of IRC commands are allowed due to anonymity concerns.
es: Crea una conexión a un servidor IRC aleatorio especificado por una lista de destinos separados por coma (", "). Sólo un subconjunto de comandos IRC de la lista blanca están permitidos debido a cuestiones de anonimato.

source: Whitelist:
es: Lista blanca:

source: Enables using the I2P router as a SOCKS proxy.
es: Habilita el uso del router I2P como un proxy SOCKS.

source: Enables using the I2P router as a SOCKS proxy with the command whitelist specified by <a href="#client-mode-irc">IRC</a> client mode.
es: Habilita el uso de un router I2P como un proxy SOCKS con la lista blanca de comandos especificada por el modo cliente del <a href="#client-mode-irc">IRC</a>.

source: Creates a HTTP tunnel and uses the HTTP request method "CONNECT" to build a TCP tunnel that usually is used for SSL and HTTPS.
es: Crea un túnel HTTP y usa el método de petición HTTP "CONNECT" para construir un túnel TCP que normalmente se usa para SSL y HTTPS.

source: Creates a UDP-server attached to a Streamr client I2PTunnel. The streamr client tunnel will subscribe to a streamr server tunnel.
es: Crea un servidor-UDP adosado a un I2PTunnel de cliente `Streamr`. El túnel del cliente streamr se suscribirá a un túnel de servidor streamr.

source: Server Modes
es: Modos de servidor

source: Creates a destination to a local ip:port with an open TCP port.
es: Crea un destino hacia una dirección IP:puerto local con un puerto TCP abierto.

source: Creates a destination to a local HTTP server ip:port. Supports gzip for requests with Accept-encoding: x-i2p-gzip, replies with Content-encoding: x-i2p-gzip in such a request.
es: Crea un destino a un servidor HTTP local IP:puerto Soporta gzip para las peticiones con `Accept-encoding: x-i2p-gzip`, responde con `Content-encoding: x-i2p-gzip` a tal petición.

source: Functions as both a I2PTunnel HTTP Server, and a I2PTunnel HTTP client with no outproxying capabilities. An example application would be a web application that does client-type requests, or loopback-testing an eepsite as a diagnostic tool.
es: Funciona tanto como un I2PTunnel de servidor HTTP, como un I2PTunnel de cliente HTTP sin capacidades de proxificación externa (`outproxying`). Una aplicación de ejemplo sería una aplicación web que realice peticiones tipo-cliente, o que realice pruebas-loopback a un eepsite a modo de herramienta de diagnóstico.

source: Creates a destination that filters the reqistration sequence of a client and passes the clients destination key as a hostname to the IRC-server.
es: Crea un destino que filtra la secuencia de registro de un cliente y pasa la clave de destino de los clientes como un nombre de servidor al servidor-IRC.

source: A UDP-client that connects to a media server is created. The UDP-Client is coupled with a Streamr server I2PTunnel.
es: Se crea un cliente-UDP que conecta a los servidores de medios. El cliente-UDP está emparejado con el I2PTunnel de servidor Streamr.

source: Ministreaming Library
es: Librería ministreaming

source: Note
es: Nota

source: The ministreaming library has been enhanced and extended by the "full" <a href="%(streaming)s">streaming library</a>. Ministreaming is deprecated and is incompatible with today's applications. The following documentation is old. Also note that streaming extends ministreaming in the same Java package (net.i2p.client.streaming), so the current <a href="%(api)s">API documentation</a> contains both. Obsolete ministreaming classes and methods are clearly marked as deprecated in the Javadocs.
es: La librería ministreaming ha sido mejorada y extendida por la <a href="%(streaming)s">librería streaming</a>"completa". Ministreaming está desechada y es incompatible con las aplicaciones actuales. La siguiente documentación es antigua. Observe también que esa libreria streaming extiende la ministreaming en el mismo paquete Java (net.i2p.client.streaming), así que la <a href="%(api)s">documentation de la API</a> actual contiene ambas. Las obsoletas clases y métodos de ministreaming están claramente marcados como desechados en los Javadocs.

source: The ministreaming library is a layer on top of the core <a href="%(i2cp)s">I2CP</a> that allows reliable, in order, and authenticated streams of messages to operate across an unreliable, unordered, and unauthenticated message layer. Just like the TCP to IP relationship, this streaming functionality has a whole series of tradeoffs and optimizations available, but rather than embed that functionality into the base I2P code, it has been factored off into its own library both to keep the TCP-esque complexities separate and to allow alternative optimized implementations.
es: La librería ministreaming es una capa sobre el corazón de <a href="%(i2cp)s">I2CP</a> que permite flujos (streams) fiables, ordenados y autentificados de mensajes para operar a través de una capa de mensajes no fiable, desordenada y no autentificada. Justo como la relación de TCP hacia IP, esta funcionalidad streaming tiene un completo conjunto de equilibrios y optimizaciones disponibles, pero en lugar de integrar esa funcionalidad en el código base de I2P, ha sido desgajado en su propia librería, tanto para mantener separadas las complejidades propias de TCP como para permitir implementaciones optimizadas alternativas.

source: The ministreaming library was written by mihi as a part of his <a href="%(i2ptunnel)s">I2PTunnel</a> application and then factored out and released under the BSD license. It is called the "mini"streaming library because it makes some simplifications in the implementation, while a more robust streaming library could be further optimized for operation over I2P. The two main issues with the ministreaming library are its use of the traditional TCP two phase establishment protocol and the current fixed window size of 1. The establishment issue is minor for long lived streams, but for short ones, such as quick HTTP requests, the impact can be <a href="%(minwww)s">significant</a>. As for the window size, the ministreaming library doesn't maintain any ID or ordering within the messages sent (or include any application level ACK or SACK), so it must wait on average twice the time it takes to send a message before sending another.
es: La librería ministream fue escrita por mihi como parte de su aplicación <a href="%(i2ptunnel)s">I2PTunnel</a> y después fue desgajada y publicada bajo la licencia BSD. Se la llama librería "mini"streaming porque hace algunas simplificaciones en la implementación, mientras una librería streaming más robusta podría seguir siendo optimizada para operar sobre I2P. Los dos principales problemas con la librería ministreaming son su uso del tradicional protocolo TCP de establecimiento en dos fases, y el actual tamaño fijo de ventana (TCP) de 1. El problema del establecimiento es menor para streams de vida larga, pero para los de corta, tales como las peticiones HTTP rápidas, el impacto puede ser <a href="%(minwww)s">significativo</a>. Y en cuanto al tamaño de ventana (TCP), la librería ministreaming no mantiene identificador u orden alguno (o no incluye ACK o SACK de nivel aplicación alguno) junto con los mensajes enviados. así que, de media, debe esperar el doble de tiempo del que tarda en enviar un mensaje antes de enviar otro.

source: Even with those issues, the ministreaming library performs quite well in many situations, and its <a href="%(api)s">API</a> is both quite simple and capable of remaining unchanged as different streaming implementations are introduced. The library is deployed in its own ministreaming.jar. Developers in Java who would like to use it can access the API directly, while developers in other languages can use it through <a href="%(samv3)s">SAM</a>'s streaming support.
es: Incluso con esos problemas, la librería ministreaming se comporta bastante bien en muchas situaciones, y su <a href="%(api)s">API</a> es tanto bastante simple como capaz de mantenerse invariante mientras se introducen diferentes implementaciones streaming. La librería se despliega en su propio `ministreaming.jar`. Los desarrolladores en Java a los que les gustaría usarla pueden acceder directamente a la API, mientras que los desarrolladores en otros lenguajes pueden usarla a través del soporte streaming de <a href="%(samv3)s">SAM</a>.

source: SOCKS and SOCKS proxies
es: Proxies SOCKS y SOCKS

source: The SOCKS proxy is working as of release 0.7.1. SOCKS 4/4a/5 are supported. Enable SOCKS by creating a SOCKS client tunnel in i2ptunnel. Both shared-clients and non-shared are supported. There is no SOCKS outproxy so it is of limited use.
es: El proxy SOCKS está funcionando desde la versión `0.7.1`. SOCKS 4/4a/5 están soportados. Habilite SOCKS mediante la creación de un túnel de cliente SOCKS en I2PTunnel. Ambos clientes-compartidos están soportados. No hay proxy externo (`outproxy`) SOCKS, así que es de uso limitado.

source: As it says on the <a href="%(faq)s#socks">FAQ</a>:
es: Como lo dice en las <a href="%(faq)s#socks">FAQ</a>:

source: Many applications leak sensitive information that could identify you on the Internet. I2P only filters connection data, but if the program you intend to run sends this information as content, I2P has no way to protect your anonymity. For example, some mail applications will send the IP address of the machine they are running on to a mail server. There is no way for I2P to filter this, thus using I2P to 'socksify' existing applications is possible, but extremely dangerous.
es: Muchas aplicaciones filtran información sensible que podría identificarle en Internet. I2P sólo filtra la conexión de datos, pero si el programa que usted intenta ejecutar envía esta información como contenido, I2P no tiene manera de proteger su anonimato. Por ejemplo, algunas aplicaciones de correo enviarán la dirección IP de la máquina sobre la que estén ejecutando el servidor de correo. No hay forma de I2P filtre esto, por lo que usar I2P para socksificar ('socksify') aplicaciones existentes es posible, pero extremadamente peligroso.

source: And quoting from a 2005 email:
es: Y citando a un email de 2005:

source: ... there is a reason why human and others have both built and abandoned the SOCKS proxies. Forwarding arbitrary traffic is just plain unsafe, and it behooves us as developers of anonymity and security software to have the safety of our end users foremost in our minds.
es: ... hay una razón por la que ambos, los humanos y otros, hemos construido y abandonado los proxys SOCKS. Rebotar el tráfico arbitrario es simplemente bastante inseguro, y nos corresponde a nosotros, como desarrolladores de software de anonimato y seguridad, tener la seguridad de nuestros usuarios finales entre nuestras prioridades.

source: Hoping that we can simply strap an arbitrary client on top of I2P without auditing both its behavior and its exposed protocols for security and anonymity is naive. Pretty much *every* application and protocol violates anonymity, unless it was designed for it specifically, and even then, most of those do too. That's the reality. End users are better served with systems designed for anonymity and security. Modifying existing systems to work in anonymous environments is no small feat, orders of magnitude more work that simply using the existing I2P APIs.
es: Esperar que simplemente podamos adherir un cliente arbitrario sobre I2P sin auditar la seguridad y anonimato tanto de su comportamiento como de sus protocolos expuestos, es ingenuo. Casi cualquier aplicación y protocolo viola el anonimato, a menos que fuera específicamente diseñado para lo contrario, e incluso entonces la mayoría de aquellos también lo hace. Esa es la realidad. Los usuarios finales están mejor servidos con sistemas diseñados para el anonimato y la seguridad. Modificar sistemas existentes para trabajar en entornos anónimos no es una cuestión banal, supone varios órdenes de magnitud más de trabajo que simplemente usar las APIs existentes de I2P.

source: The SOCKS proxy supports standard addressbook names, but not Base64 destinations. Base32 hashes should work as of release 0.7. It supports outgoing connections only, i.e. an I2PTunnel Client. UDP support is stubbed out but not working yet. Outproxy selection by port number is stubbed out.
es: El proxy SOCKS soporta los nombres de las libretas de direcciones estándar, pero no los destinos Base64. Los hashes Base32 deberían funcionar desde la versión `0.7`. Sólo soporta conexiones salientes, es decir, se erradicó el soporte para un I2PTunnel de cliente. Se forzó la inclusión del soporte UDP, pero no funciona aún. Se forzó la inclusión de la selección mediante número de puerto de proxy externo (`outproxy`).

source: See Also
es: Consulte también

source: The notes for <a href="%(meeting81)s">Meeting 81</a> and <a href="%(meeting82)s">Meeting 82</a> in March 2004.
es: Las notas para la <a href="%(meeting81)s">Reunión 81</a> y la <a href="%(meeting82)s">Reunión 82</a> en marzo de 2004.

source: If You Do Get Something Working
es: Si consigue que algo funcione

source: Please let us know. And please provide substantial warnings about the risks of socks proxies.
es: Por favor, permítanos saberlo. Y, por favor, proporcione advertencias sustanciales acerca de los riesgos de los proxys SOCKS.

source: September 2015
es: Septiembre de 2015

source: The streaming library is technically part of the "application" layer, as it is not a core router function. In practice, however, it provides a vital function for almost all existing I2P applications, by providing a TCP-like streams over I2P, and allowing existing apps to be easily ported to I2P. The other end-to-end transport library for client communication is the <a href="%(datagrams)s">datagram library</a>.
es: La librería streaming técnicamente es parte de la capa de "aplicación", ya que no es una función central del router. En la práctica, sin embargo, proporciona una función vital para casi todas las aplicaciones I2P existentes, proveyéndolas de flujos (`streams`) tipo-TCP sobre I2P, y permitiendo que las aplicaciones existentes sean fácilmente portadas a I2P. La otra librería de transporte extremo-a-extremo para la comunicación de clientes, es la <a href="%(datagrams)s">librería datagram</a>.

source: The streaming library is a layer on top of the core <a href="%(i2cp)s">I2CP API</a> that allows reliable, in-order, and authenticated streams of messages to operate across an unreliable, unordered, and unauthenticated message layer. Just like the TCP to IP relationship, this streaming functionality has a whole series of tradeoffs and optimizations available, but rather than embed that functionality into the base I2P code, it has been factored off into its own library both to keep the TCP-esque complexities separate and to allow alternative optimized implementations.
es: La librería de streaming es una capa sobre el corazón de la <a href="%(i2cp)s">API I2CP</a> que permite que flujos (streams) de mensajes fiables, ordenados y autentificados, operen a través de una capa de mensaje no confiable, desordenada y no autentificada. Justo como la relación TCP hacia IP, esta funcionalidad streaming tiene un conjunto completo de equilibrios y optimizaciones disponibles, pero en lugar de integrar esta funcionalidad junto al código base de I2P, ha sido desgajado en su propia librería para mantener las complejidades propias de TCP aparte, y para permitir implementaciones optimizadas alternativas.

source: In consideration of the relatively high cost of messages, the streaming library's protocol for scheduling and delivering those messages has been optimized to allow individual messages passed to contain as much information as is available. For instance, a small HTTP transaction proxied through the streaming library can be completed in a single round trip - the first messages bundle a SYN, FIN, and the small HTTP request payload, and the reply bundles the SYN, FIN, ACK, and the HTTP response payload. While an additional ACK must be transmitted to tell the HTTP server that the SYN/FIN/ACK has been received, the local HTTP proxy can often deliver the full response to the browser immediately.
es: En consideración al relativamente alto coste de los mensajes, el protocolo de la librería streaming para programar y entregar esos mensajes ha sido optimizado para permitir que los mensajes individuales pasen a contener tanta información como esté disponible. Por ejemplo, una pequeña transacción HTTP proxificada a través de la librería streaming puede ser completada en un sólo viaje de ida y vuelta - los primeros mensajes empaquetan un SYN, FIN, y la pequeña carga de la petición HTTP, y la respuesta empaqueta el SYN, FIN, ACK, y la carga de la respuesta HTTP. Aunque un ACK adicional debe ser transmitido para decirle al servidor HTTP que el SYN/FIN/ACK ha sido recibido, el proxy HTTP local a menudo puede entregar la respuesta completa de forma inmediata al navegador.

source: The streaming library bears much resemblance to an abstraction of TCP, with its sliding windows, congestion control algorithms (both slow start and congestion avoidance), and general packet behavior (ACK, SYN, FIN, RST, rto calculation, etc).
es: La librería streaming presenta mucha semejanza a una abstracción de TCP, con sus ventanas (de protocolo) deslizantes, algoritmos de control de congestión (tanto de inicio lento como de elusión de congestión), y comportamiento general del paquete (ACK, SYN, FIN, RST, cálculo RTO, etc.).

source: The streaming library is a robust library which is optimized for operation over I2P. It has a one-phase setup, and it contains a full windowing implementation.
es: La librería streaming es una librería robusta que está optimizada para operar sobre I2P. Tiene una instalación de fase-única, y contiene una implementación de ventanización (protocolo) completa.

source: The streaming library API provides a standard socket paradigm to Java applications. The lower-level <a href="%(i2cp)s">I2CP</a> API is completely hidden, except that applications may pass <a href="%(i2cp)s#options">I2CP parameters</a> through the streaming library, to be interpreted by I2CP.
es: La API de la librería streaming proporciona un paradigma de socket estándar a las aplicaciones Java. La API de nivel-inferior de <a href="%(i2cp)s">I2CP</a> está completamente escondida, exceptuando que esas aplicaciones pueden pasar <a href="%(i2cp)s#options">parámetros I2CP</a> a través de la librería streaming, para que sean interpretados por I2CP.

source: The standard interface to the streaming lib is for the application to use the <a href="%(i2psktmf)s">I2PSocketManagerFactory</a> to create an <a href="%(i2psktm)s">I2PSocketManager</a>. The application then asks the socket manager for an <a href="%(i2psess)s">I2PSession</a>, which will cause a connection to the router via <a href="%(i2cp)s">I2CP</a>. The application can then setup connections with an <a href="%(i2pskt)s">I2PSocket</a> or receive connections with an <a href="%(i2psskt)s">I2PServerSocket</a>.
es: La interfaz estándar de la librería streaming es para que la aplicación use el <a href="%(i2psktmf)s">I2PSocketManagerFactory</a> para crear un <a href="%(i2psktm)s">I2PSocketManager</a>. La aplicación pregunta entonces al administrador de socket por una <a href="%(i2psess)s">I2PSession</a>, que producirá una conexión al router vía <a href="%(i2cp)s">I2CP</a>. La aplicación puede entonces establecer conexiones con un <a href="%(i2pskt)s">I2PSocket</a> o recibir conexiones con un <a href="%(i2psskt)s">I2PServerSocket</a>.

source: Here are the <a href="%(url)s">full streaming library Javadocs</a>.
es: Aquí están los <a href="%(url)s">Javadocs de la librería streaming completa</a>.

source: For a good example of usage, see the i2psnark code.
es: Para ver un buen ejemplo de uso, vea el código de i2psnark.

source: Options and Defaults
es: Opciones y valores predeterminados

source: The options and current default values are listed below. Options are case-sensitive and may be set for the whole router, for a particular client, or for an individual socket on a per-connection basis. Many values are tuned for HTTP performance over typical I2P conditions. Other applications such as peer-to-peer services are strongly encouraged to modify as necessary, by setting the options and passing them via the call to <a href="%(i2psktmf)s">I2PSocketManagerFactory</a>.createManager(_i2cpHost, _i2cpPort, opts). Time values are in ms.
es: Las opciones y los actuales valores predeterminados están listados debajo. Las opciones diferencian mayúsculas/minúsculas y pueden ser establecidas para todo el router, para un cliente concreto, o para un socket individual en base a cada conexión. Muchos valores son ajustados para el rendimiento HTTP sobre las condiciones típicas de I2P. Otras aplicaciones tales como los servicios entre pares (`peer-to-peer`) son fuertemente animadas a que los modifiquen como sea necesario, configurando las opciones y pasándolas a través de la llamada a <a href="%(i2psktmf)s">I2PSocketManagerFactory</a>.createManager(_i2cpHost, _i2cpPort, opts). Los valores de los tiempos están en ms.
