Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Note that these are not the limits for datagrams that the client sees, as the router may bundle a reply leaseset and/or session tags together with the client message in a garlic message. The leaseset and tags together may add about 5.5KB. Therefore the current datagram limit is about 10KB. This limit will be increased in a future release.
es: Observe que estos no son los límites para datagramas que el cliente ve, ya que el router puede empaquetar juntos un LeaseSet (grupo de túneles para un destino) de repuesta y/o etiquetas de sesión, junto con el mensaje del cliente, en un mensaje garlic (ajo). El LeaseSet y las etiquetas juntas pueden añadir unos 5,5 KB. Por lo tanto el límite de datagrama actual es de alrededor de 10 KB. Este límite se incrementará en una versión futura.

source: Message Types
es: Tipos de mensajes

source: Higher-numbered priority is higher priority. The majority of traffic is TunnelDataMessages (priority 400), so anything above 400 is essentially high priority, and anything below is low priority. Note also that many of the messages are generally routed through exploratory tunnels, not client tunnels, and therefore may not be in the same queue unless the first hops happen to be on the same peer.
es: Las prioridades numeradas-más-elevadas, son prioridades más altas. La mayoría del tráfico son TunnelDataMessages (Mensajes de Datos de Túnel, prioridad 400), así que cualquier cosa por encima de 400 es esencialmente de alta prioridad, y cualquier cosa por debajo es de baja prioridad. Observe también que muchos de los mensajes están por lo general enrutados a través de túneles exploratorios, no túneles de cliente, y por lo tanto pueden no estar en la misma cola a menos que los primeros saltos resulte que se produzcan en el mismo par (`peer`).

source: Also, not all message types are sent unencrypted. For example, when testing a tunnel, the router wraps a DeliveryStatusMessage, which is wrapped in a GarlicMessage, which is wrapped in a DataMessage.
es: Además, no todos los tipos de mensaje se envían sin encriptar. Por ejemplo, cuando probamos un túnel, el router envuelve un DeliveryStatusMessage (mensaje de estado de la entrega), que es envuelto a su vez en un GarlicMessage (mensaje ajo), que a su vez es envuelto en un DataMessage (mensaje de datos).

source: Message
es: Mensaje

source: Type
es: Tipo

source: Comments
es: Comentarios

source: May vary
es: Puede variar

source: Size is 65 + 32*(number of hashes) where typically, the hashes for three floodfill routers are returned.
es: El tamaño es 65 + 32*(número de hashes) donde típicamente, los hashes (identificadores criptográficos) para tres routers de inundación (`floodfill`) son devueltos.

source: Varies
es: Varía

source: Priority may vary. Size is 898 bytes for a typical 2-lease leaseSet. RouterInfo structures are compressed, and size varies; however there is a continuing effort to reduce the amount of data published in a RouterInfo as we approach release 1.0.
es: La prioridad puede variar. El tamaño es de 898 bytes para un LeaseSet de 2-leases (túneles hacia un destino) típico. Las estructuras de RouterInfo están comprimidas, y el tamaño varía, sin embargo hay un esfuerzo continuo para reducir la cantidad de datos publicados en RouterInfo al aproximarnos a la versión 1.0.

source: Priority may vary on a per-destination basis
es: La prioridad puede variar dependiendo del destino.

source: Used for message replies, and for testing tunnels - generally wrapped in a GarlicMessage
es: Usado para respuestas de mensaje, y para probar túneles - por lo general envuelto en un GarlicMessage (mensaje ajo).

source: Generally wrapped in a DataMessage - but when unwrapped, given a priority of 100 by the forwarding router
es: Envuelto por lo general en un DataMessage (mensaje de datos) - pero cuando está desenvuelto, se le da una prioridad de 100 por el router reenviante.

source: The most common message. Priority for tunnel participants, outbound endpoints, and inbound gateways was reduced to 200 as of release 0.6.1.33. Outbound gateway messages (i.e. those originated locally) remains at 400.
es: El mensaje más común. La prioridad para participantes en el túnel, extremos de salida, y pasarelas (`gateways`) de entrada, se redujo a 200 desde la versión 0.6.1.33. Los mensajes de pasarela de salida (es decir, aquellos originados localmente) permanecen en 400.

source: Shorter TunnelBuildMessage as of 0.7.12
es: Un TunnelBuildMessage (mensaje de establecimiento de túnel) más corto desde la versión 0.7.12

source: Shorter TunnelBuildReplyMessage as of 0.7.12
es: Un TunnelBuildReplyMessage (mensaje de respuesta de establecimiento de túnel) más corto desde la versión 0.7.12

source: Others listed in <a href="%(pdf)s">2003 Spec</a>
es: Otros están listados en la <a href="%(pdf)s">Especificación 2003</a>

source: Obsolete, Unused
es: Obsoleto, sin usar

source: Full Protocol Specification
es: Especificación completa del protocolo

source: <a href="%(i2npspec)s">On the I2NP Specification page</a>. See also the <a href="%(commonstructures)s">Common Data Structure Specification page</a>.
es: En la página de la <a href="%(i2npspec)s">Especificación I2NP</a>. Vea también la página de la <a href="%(commonstructures)s">Especificación de la estructura de datos comunes</a>.

source: It isn't clear whether the current priority scheme is generally effective, and whether the priorities for various messages should be adjusted further. This is a topic for further research, analysis and testing.
es: No está claro si el actual esquema de prioridad es generalmente efectivo, y si las prioridades para diferentes mensajes deben seguir siendo ajustadas. Este es un tema para posterior investigación, análisis y pruebas.

source: Protocol Stack
es: Pila de protocolos

source: Here is the protocol stack for I2P. See also the <a href="%(docs)s">Index to Technical Documentation</a>.
es: Aquí está la pila de protocolo para I2P. Vea también el <a href="%(docs)s">Índice a la documentación técnica</a>.

source: Each of the layers in the stack provides extra capabilities. The capabilities are listed below, starting at the bottom of the protocol stack.
es: Cada una de las capas en la pila proporciona capacidades extra. Las capacidades están listadas debajo, comenzando en el fondo de la pila de protocolo.

source: Internet Layer:
es: Capa de Internet:

source: IP: Internet Protocol, allow addressing hosts on the regular internet and routing packets across the internet using best-effort delivery.
es: IP: Protocolo de Internet, permite redireccionar hacia servidores en la Internet regular y enrutar paquetes a través de Internet usando entrega de mejor-esfuerzo (`best-effort`, sin garantías)

source: Transport Layer:
es: Capa de transporte:

source: TCP: Transmission Control Protocol, allow reliable, in-order delivery of packets across the internet.
es: TCP: Protocolo de Control de Transmisiones, permite la entrega de paquetes fiable y ordenada a través de Internet.

source: UDP: User Datagram Protocol, allow unreliable, out-of-order delivery of packets across the internet.
es: UDP: Protocolo de Datagrama de Usuario, permite entrega de paquetes no fiable y desordenada a través de Internet.

source: <b>I2P Transport Layer:</b> provide encrypted connections between 2 I2P routers. These are not anonymous yet, this is strictly a hop-to-hop connection. Two protocols are implemented to provide these capabilities. NTCP builds on top of TCP, while SSU uses UDP.
es: <b>Capa de Transporte I2P:</b> proporciona conexiones cifradas entre 2 routers I2P. Estos no son aún anónimos, esta es estrictamente una conexión salto-a-salto. Se implementaron dos protocolos para proporcionar estas capacidades. NTCP (TCP basado en NIO) se construye encima de TCP, mientras que SSU (UDP Seguro Semiconfiable) usa UDP.

source: NIO-based TCP
es: TCP basado-en-NIO

source: Secure Semi-reliable UDP
es: UDP Seguro Semi-fiable

source: <b>I2P Tunnel Layer:</b> provide full encrypted tunnel connections.
es: <b>Capa de Túnel I2P:</b> proporciona conexiones de túnel con cifrado completo.

source: <a href="%(tunnelmessage)s">Tunnel messages</a>: tunnel messages are large messages containing encrypted I2NP (see below) messages and encrypted instructions for their delivery. The encryption is layered. The first hop will decrypt the tunnel message and read a part. Another part can still be encrypted (with another key), so it will be forwarded.
es: <a href="%(tunnelmessage)s">Mensajes de túnel</a>: Los mensajes de túnel son mensajes grandes que contienen mensajes cifrados I2NP (vea debajo), e instrucciones cifradas para su entrega. El cifrado está dividido en capas. El primer salto descifrará el mensaje de túnel y leerá una parte. Otra parte puede aún ser cifrada (con otra clave), así que será reenviada.

source: <a href="%(i2np)s">I2NP messages</a>: I2P Network Protocol messages are used to pass messages through multiple routers. These I2NP messages are combined in tunnel messages.
es: <a href="%(i2np)s">Mensajes de I2NP</a>: Los mensajes de Protocolo de Red I2P se usan para pasar mensajes a múltiples routers. Estos mensajes I2NP se combinan en mensajes de túnel.

source: <b>I2P Garlic Layer:</b> provide encrypted and anonymous end-to-end I2P message delivery.
es: <b>Capa Garlic (ajo) de I2P:</b> proporciona entrega de mensajes I2P extremo-a-extremo cifrada y anónima

source: <a href="%(i2np)s">I2NP messages</a>: I2P Network Protocol messages are wrapped in each other and used to ensure encryption between two tunnels and are passed along from source to destination, keeping both anonymous.
es: <a href="%(i2np)s">Mensajes I2NP</a>: Los mensajes de Protocolo de Red I2P se envuelven unos en otros y se usan para asegurar el cifrado entre dos túneles, y se transmiten desde la fuente al destino manteniendo a ambos anónimos.

source: The following layers are strictly speaking no longer part of the I2P Protocol stack, they are not part of the core 'I2P router' functionality. However, each of these layers adds additional functionality, to allow applications simple and convenient I2P usage.
es: Las capas siguientes estrictamente hablando ya no forman parte de la pila del Protocolo I2P, no son parte de la funcionalidad central del 'router I2P'. Sin embargo, cada una de estas capas añade funcionalidad adicional, que permite a las aplicaciones un uso simple y conveniente de I2P.

source: <b>I2P Client Layer:</b> allow any client to use I2P functionality, without requiring the direct use of the router API.
es: <b>Capa de cliente I2P:</b> permite a cualquier cliente usar las funcionalidades de I2P, sin requerir el uso directo de la API (Interfaz de Programación de Aplicaciones) del router.

source: <a href="%(i2cp)s">I2CP</a>: I2P Client Protocol, allows secure and asynchronous messaging over I2P by communicating messages over the I2CP TCP socket.
es: <a href="%(i2cp)s">I2CP</a>: El Protocolo de Cliente I2P, permite una mensajería segura y asíncrona sobre I2P mediante la comunicación de mensajes sobre el socket TCP de I2CP.

source: <b>I2P End-to-end Transport Layer:</b> allow TCP- or UDP-like functionality on top of I2P.
es: <b>Capa de transporte extremo-a-extremo</b>: permite funcionalidades del tipo-TCP o tipo-UDP encima de I2P.

source: <a href="%(streaming)s">Streaming Library</a>: an implementation of TCP-like streams over I2P. This allows easier porting of existing applications to I2P.
es: <a href="%(streaming)s">Librería de Streaming</a>: una implementación de streams tipo TCP sobre I2P. Esto permite importar fácilemente aplicaciones ya existentes a I2P.

source: <a href="%(datagrams)s">Datagram Library</a>: an implementation of UDP-like messages over I2P. This allows easier porting of existing applications to I2P.
es: <a href="%(datagrams)s">Librería de Datagramas</a>: una implementación de mensajes tipo UDP sobre I2P. Esto permite importar más fácilmente aplicaciones ya existentes a I2P.

source: <b>I2P Application Interface Layer:</b> additional (optional) libraries allowing easier implementations on top of I2P.
es: <b>Capa del interfaz para aplicaciones I2P:</b> librerías adicionales (opcionales) que permiten implementaciones más fáciles sobre I2P.

source: <b>I2P Application Proxy Layer:</b> proxy systems.
es: <b>Capa proxy para las aplicaciones I2P:</b> sistemas proxy.

source: HTTP Client/Server, IRC Client, <a href="%(socks)s">SOCKS</a>, Streamr
es: Servidor/Cliente HTTP, cliente IRC , <a href="%(socks)s">SOCKS</a>, Streamr.

source: Finally, what could be considered the <b>'I2P application layer'</b>, is a large number of applications on top of I2P. We can order this based on the I2P stack layer they use.
es: Finalmente, la que puede puede ser considerada la <b>'capa de aplicación de I2P'</b>, es un gran número de aplicaciones sobre I2P. Podemos ordenar esto basándonos en las capas I2P que usan.

source: <b>Streaming/datagram applications</b>: i2psnark, Syndie, i2phex...
es: <b>Aplicaciones de streaming/datagramas</b>: i2psnark, Syndie, i2phex...

source: <b>SAM/BOB applications</b>: IMule, i2p-bt, i2prufus, Robert...
es: <b>Aplicaciones SAM/BOB</b>: IMule, i2p-bt, i2prufus, Robert...

source: <b>Other I2P applications</b>: Syndie, EepGet, <a href="%(plugins)s">plugins</a>...
es: <b>Otras aplicaciones I2P</b>: Syndie, EepGet, <a href="%(plugins)s">complementos</a>...

source: <b>Regular applications</b>: Jetty, Apache, Monotone, CVS, browsers, e-mail...
es: <b>Aplicaciones regulares</b>: Jetty, Apache, Monotone, CVS, navegadores, correo...

source: I2P Network stack
es: Pila de red I2P

source: Figure 1: The layers in the I2P Network stack.
es: Figura 1: Las capas en la pila de red de I2P.

source: Note: SAM/SAMv2 can use both the streaming lib and datagrams.
es: Nota: SAM/SAMv2 puede usar la librería de streaming y de datagramas.

source: Transport Overview
es: Introducción al los Transportes

source: September 2014
es: Septiembre de 2014

source: Transports in I2P
es: Transportes den I2P

source: A "transport" in I2P is a method for direct, point-to-point communication between two routers. Transports must provide confidentiality and integrity against external adversaries while authenticating that the router contacted is the one who should receive a given message.
es: Un "transporte" en I2P es un método para la comunicación directa de punto a punto entre dos ruters. Los transportes tienen que proporcionar confidencialidad e integridad contra adversarios externos a la vez que se aseguran de que el ruter contactado es el que recibe el mensaje indicado.

source: I2P supports multiple transports simultaneously. There are two transports currently implemented:
es: I2P soporta múltiples transportes a la vez. Actualmente hay dos transportes implementados:

source: <a href="%(ntcp)s">NTCP</a>, a Java New I/O (NIO) TCP transport
es: <a href="%(ntcp)s">NTCP</a>, un nuevo transporte I/O (NIO) TCP en Java

source: <a href="%(ssu)s">SSU</a>, or Secure Semireliable UDP
es: <a href="%(ssu)s">SSU</a>, o UDP Seguro Semifiable

source: Each provides a "connection" paradigm, with authentication, flow control, acknowledgments and retransmission.
es: Cada uno proporciona un modelo de "conexión", con autenticación control de flujo, contestaciones y retransmisión.

source: Transport Services
es: Servicios de trasnporte

source: The transport subsystem in I2P provides the following services:
es: El sub-sistema de transportes en I2P proporciona los siguientes servicios:

source: Reliable delivery of <a href="%(i2np)s">I2NP</a> messages. Transports support I2NP message delivery ONLY. They are not general-purpose data pipes.
es: Entrega fiable de mensajes <a href="%(i2np)s">I2NP</a>. Los transportes soportan SÓLO la entrega de mensajes I2NP. No son conductos de datos de propósito general.

source: In-order delivery of messages is NOT guaranteed by all transports.
es: La entrega de mensajes en-orden NO está garantizada por todos los transportes.

source: Maintain a set of router addresses, one or more for each transport, that the router publishes as its global contact information (the RouterInfo). Each transport may connect using one of these addresses, which may be IPv4 or (as of version 0.9.8) IPv6.
es: Mantiene un conjunto de direcciones de routers, una o más para cada transporte, que el router publica como su información global de contacto (la RouterInfo). Cada transporte puede conectarse usando una de estas direcciones, que pueden ser IPv4 o (desde la versión 0.9.8) IPv6.

source: Selection of the best transport for each outgoing message
es: Selección del mejor transporte para cada mensaje saliente

source: Queueing of outbound messages by priority
es: Poner en cola los mensajes salientes según la prioridad

source: Bandwidth limiting, both outbound and inbound, according to router configuration
es: Límite de ancho de banda, de entrada y de salida, de acuerdo con la configuración del ruter.

source: Setup and teardown of transport connections
es: Configuración y desmontaje de las conexiones de trasnporte

source: Encryption of point-to-point communications
es: Cifrado de las comunicaciones de fin a fin.

source: Maintenance of connection limits for each transport, implementation of various thresholds for these limits, and communication of threshold status to the router so it may make operational changes based on the status
es: Mantenimiento y límites de conexión para cada transporte, implementación de varios umbrales para esos límites, y la comunicación del estado de esos umbrales al ruter para que pueda hacer cambios operacionales basados en su estado.

source: Firewall port opening using UPnP (Universal Plug and Play)
es: Abrir puertos en el cortafuegos usando UPnP (Universal Plug and Play)

source: Cooperative NAT/Firewall traversal
es: NAT/Cortafuegos cooperativo trasversal

source: Local IP detection by various methods, including UPnP, inspection of incoming connections, and enumeration of network devices
es: Detección de la IP local por varios métodos, incluyendo UPnP, inspección de los paquetes entrantes y enumeración de los dispositivos de red

source: Coordination of firewall status and local IP, and changes to either, among the transports
es: Coordinación del estado del cortafuegos y la IP local, y sus cambios, a lo largo de los transportes

source: Communication of firewall status and local IP, and changes to either, to the router and the user interface
es: Coordinación del estado del cortafuegos y la IP local, y sus cambios, con el ruter y el interfaz del usuario

source: Determination of a consensus clock, which is used to periodically update the router's clock, as a backup for NTP
es: Determinación de un reloj consensuado, que se usa para actualizar periódicamente el reloj del ruter, como respaldo para NTP

source: Maintenance of status for each peer, including whether it is connected, whether it was recently connected, and whether it was reachable in the last attempt
es: Mantenimiento del estado de cada par, incluyendo cuando está conectado, si se ha conectado recientemente y si estaba accesible en el último intento.

source: Qualification of valid IP addresses according to a local rule set
es: Calificación de una IP válida de acuerdo con un grupo de normas locales.

source: Honoring the automated and manual lists of banned peers maintained by the router, and refusing outbound and inbound connections to those peers
es: Honrar las listas manuales y automáticas mantenidas por el ruter de los pares baneados, y denegar las conexiones entrantes o salientes a esos pares

source: Transport Addresses
es: Direcciones de trasnporte

source: The transport subsystem maintains a set of router addresses, each of which lists a transport method, IP, and port. These addresses constitute the advertised contact points, and are published by the router to the network database. Addresses may also contain an arbitrary set of additional options.
es: El subsistema de transporte mantiene un conjunto de direcciones de router, cada una de las cuales lista un método de transporte, IP, y puerto. Estas direcciones constituyen los puntos de contacto anunciados, y son publicadas por el router en la base de datos de red. Las direcciones también pueden contener un conjunto arbitrario de opciones adicionales.

source: Each transport method may publish multiple router addresses.
es: Cada método de transporte puede publicar múltiples direcciones de router.

source: Typical scenarios are:
es: Los espenarios típicos son:

source: A router has no published addresses, so it is considered "hidden" and cannot receive incoming connections
es: Un ruter no tiene direcciones publicadas, con lo que es considerado "oculto" y no puede recibir conexiones entrantes

source: A router is firewalled, and therefore publishes an SSU address which contains a list of cooperating peers or "introducers" who will assist in NAT traversal (see <a href="%(ssu)s">the SSU spec</a> for details)
es: Un ruter esta bloqueado por el cortafuegos, y por lo tanto publica una dirección SSU la cual contiene una lista de pares cooperantes o "introductores" que ayudarán con el NAT transversal (vea <a href="%(ssu)s">la especificación SSU</a> para más detalles)

source: A router is not firewalled or its NAT ports are open; it publishes both NTCP and SSU addresses containing directly-accessible IP and ports.
es: Un ruter no esta bloqueado por el firewall o sus puertos NAT están abiertos; publica ambas direcciones, NTCP y SSU, que contiene la IP y los puertos accesibles.

source: Transport Selection
es: Selección del transporte

source: The transport system delivers <a href="%(i2np)s">I2NP messages</a> only. The transport selected for any message is independent of the upper-layer protocols and contents (router or client messages, whether an external application was using TCP or UDP to connect to I2P, whether the upper layer was using <a href="%(streaming)s">the streaming library</a> streaming or <a href="%(datagrams)s">datagrams</a>, datagrams etc.).
es: El sistema de transporte entrega sólo <a href="%(i2np)s">mensajes I2NP messages</a>. El trasporte seleccionado por cualquier mensaje es independiente de las capas-superiores de protocolos y contenidos (mensajes de cliente o router, si una aplicación externa estaba usando TCP o UDP para conectarse a I2P, si la capa superior estaba usando el streaming o los <a href="%(datagrams)s">datagramas</a> de la <a href="%(streaming)s">librería streaming</a>, datagramas, etc.).

source: For each outgoing message, the transport system solicits "bids" from each transport. The transport bidding the lowest (best) value wins the bid and receives the message for delivery. A transport may refuse to bid.
es: Para cada mensaje saliente, el sistema de transporte solicita "ofertas" de cada transporte. El transporte que ofrece el valor más bajo (mejor) gana la apuesta y recibe el mensaje para ser entregado. Un transporte puede negarse a apostar.

source: Whether a transport bids, and with what value, depend on numerous factors:
es: Si un transporte apuesta o no, y con qué valor, depende de numerosos factores:

source: Configuration of transport preferences
es: Configuarión de las preferencias de trasnporte

source: Whether the transport is already connected to the peer
es: Si el transporte ya está conectado al par

source: The number of current connections compared to various connection limit thresholds
es: El número de las conexiones actuales comparado con varios límites de conexión.

source: Whether recent connection attempts to the peer have failed
es: Si un intento de conexión reciente ha fallado

source: The size of the message, as different transports have different size limits
es: El tamaño del mensaje, ya que diferentes transportes tienen diferentes límites de tamaño
