Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: Partitioning attacks - finding ways to segregate (technically or analytically) the peers in a network - are important to keep in mind when dealing with a powerful adversary, since the size of the network plays a key role in determining your anonymity. Technical partitioning by cutting links between peers to create fragmented networks is addressed by I2P's built in network database, which maintains statistics about various peers so as to allow any existing connections to other fragmented sections to be exploited so as to heal the network. However, if the attacker does disconnect all links to uncontrolled peers, essentially isolating the target, no amount of network database healing will fix it. At that point, the only thing the router can hope to do is notice that a significant number of previously reliable peers have become unavailable and alert the client that it is temporarily disconnected (this detection code is not implemented at the moment).
es: Los ataques de particionamiento - buscar formas (técnica o analíticamente) de separar los pares en la red - son a tener en cuenta cuando nos enfrentamos a adversarios poderosos, ya que el tamaño de la red juega un papel importante a la hora de determinar el anonimato. I2P ha resuelto el problema técnico del ataque de particionamiento que corta los enlaces entre los pares dentro de su base de datos de la red, la cual mantiene estadísticas sobre los pares a fin de permitir que las conexiones fragmentadas sean reparadas usando otras partes de la red. Aunque si un atacante desconecta todos los enlaces de un par, aislando el objetivo completamente, la base de datos poco podrá hacer para reparar el daño. En este punto lo único que el router I2P puede intentar hacer es avisar de que un gran número de pares anteriormente fiables han pasado a estar no disponibles, y alertar al cliente de que está temporalmente desconectado (este tipo de detección no está aún implementada).

source: Partitioning the network analytically by looking for differences in how routers and destinations behave and grouping them accordingly is also a very powerful attack. For instance, an attacker <a href="#harvesting">harvesting</a> the network database will know when a particular destination has 5 inbound tunnels in their LeaseSet while others have only 2 or 3, allowing the adversary to potentially partition clients by the number of tunnels selected. Another partition is possible when dealing with the <a href="%(todo)s#stop">nontrivial delays</a> and <a href="%(todo)s#batching">batching strategies</a>, as the tunnel gateways and the particular hops with non-zero delays will likely stand out. However, this data is only exposed to those specific hops, so to partition effectively on that matter, the attacker would need to control a significant portion of the network (and still that would only be a probabilistic partition, as they wouldn't know which other tunnels or messages have those delays).
es: Partir la red analíticamente buscando por diferencias en como se comportan los ruters y las destinaciones y agrupándolos de acuerdo a los resultados, es también un ataque poderoso. Por ejemplo, un atacante <a href="#harvesting">cosechando</a> la base de datos de la red sabrá cuando una destinación en particular tiene 5 túneles de entrada y su LeaseSet mientras que otros sólo tienen 2 o 3, permitiendo al adversario clasificar los clientes por el número de túneles seleccionados. Otro ataque por partición es posible cuando tratamos con los <a href="%(todo)s#stop">retardos no triviales</a> y las <a href="%(todo)s#batching">estrategias de procesamiento por lotes</a>, ya que las puertas de entrada de los túneles y los saltos con no-ceros retardos resaltarán entre los demás. Aún así, esta información sólo será expuesta a esos saltos específicos, con lo que para que el ataque por partición sea efectivo, el atacante necesita tener el control de una gran parte de la red (y aún así sólo sería un ataque probabilístico, ya que no sabría que otros túneles o mensajes tienen esos retardos).

source: Also discussed on the <a href="%(netdb)s#threat">network database page</a> (bootstrap attack).
es: También se discute en la <a href="%(netdb)s#threat">página de la base de datos de la red</a> (ataque de bootstrap).

source: The predecessor attack is passively gathering statistics in an attempt to see what peers are 'close' to the destination by participating in their tunnels and keeping track of the previous or next hop (for outbound or inbound tunnels, respectively). Over time, using a perfectly random sample of peers and random ordering, an attacker would be able to see which peer shows up as 'closer' statistically more than the rest, and that peer would in turn be where the target is located.
es: El ataque del predecesor es obtener estadísticas pasivamente intentando ver qué pares están 'cerca' de la destinación, participando en sus túneles y haciendo el seguimiento de los saltos anteriores o siguientes ( para túneles de salida o entrada, respectivamente). Con el tiempo, un atacante usando un ejemplo aleatorio perfecto de pares y ordenación, podría ver cuales pares parecen estar más 'cerca' estadísticamente que el resto, y ese par podría llegar a estar donde el el objetivo se encuentra.

source: I2P avoids this in four ways: first, the peers selected to participate in tunnels are not randomly sampled throughout the network - they are derived from the <a href="%(peerselection)s">peer selection</a> algorithm which breaks them into tiers. Second, with <a href="%(tunnelimpl)s#ordering">strict ordering</a> of peers in a tunnel, the fact that a peer shows up more frequently does not mean they're the source. Third, with <a href="%(tunnelimpl)s#length">permuted tunnel length</a> (not enabled by default) even 0 hop tunnels can provide plausible deniability as the occasional variation of the gateway will look like normal tunnels. Fourth, with <a href="%(todo)s#fullRestrictedRoutes">restricted routes</a> (unimplemented), only the peer with a restricted connection to the target will ever contact the target, while attackers will merely run into that gateway.
es: I2P evita esto de 4 formas: primera, los pares seleccionados para participar en un túnel no están seleccionados aleatoriamente de la red - derivan del algoritmo de <a href="%(peerselection)s">selección de pares</a> que los parte en niveles. Segunda, con el <a href="%(tunnelimpl)s#ordering">orden estricto</a> de los pares en un túnel, el hecho de que un par se muestre más a menudo no quiere decir que que sea la fuente. Tercera, con la <a href="%(tunnelimpl)s#length">permutación del tamaño del túnel</a> (no activado por defecto) incluso los túneles de 0 saltos pueden proveer negación plausible, ya que la variación ocasional de la puerta de salida parecerá un túnel normal. Cuarta, con las <a href="%(todo)s#fullRestrictedRoutes">rutas restringidas</a> (no implementadas), sólo el par con una conexión restringida con el objetivo será capaz de contactar con el objetivo, mientras que los atacantes simplemente pasarán por la puerta de salida.

source: The current <a href="%(tunnelcreation)s">tunnel build method</a> was specifically designed to combat the predecessor attack. See also <a href="#intersection">the intersection attack</a>.
es: El <a href="%(tunnelcreation)s">método de creación de túneles</a> actual fue diseñado específicamente para combatir el ataque del predecesor. Ver también <a href="#intersection">el ataque de interesección</a>.

source: References: <a href="%(pdf2008)s">%(pdf2008)s</a> which is an update to the 2004 predecessor attack paper <a href="%(pdf2004)s">%(pdf2004)s</a>.
es: Referencias: <a href="%(pdf2008)s">%(pdf2008)s</a> el cual es una actualización del documento sobre el ataque del predecesor <a href="%(pdf2004)s">%(pdf2004)s</a>.

source: "Harvesting" means compiling a list of users running I2P. It can be used for legal attacks and to help other attacks by simply running a peer, seeing who it connects to, and harvesting whatever references to other peers it can find.
es: "Harversting", cosechado, es la compilación de una lista de usuarios que ejecutan I2P. Puede ser usado para atacar legalmente o para ayudar a otros ataques simplemente ejecutando un par, viendo quien se conecta al par, y cosechando todas las referencias que pueda encontrar sobre otros pares.

source: I2P itself is not designed with effective defenses against this attack, since there is the distributed network database containing just this information. The following factors make the attack somewhat harder in practice:
es: En sí mismo I2P no está diseñado para defenderse efectivamente contra este ataque, ya que la base de datos de la red distribuida contiene toda esta información. Aunque los siguientes factores hacen este ataque sea un poco más difícil en la práctica:

source: Network growth will make it more difficult to obtain a given proportion of the network
es: El crecimiento de la red hará más difícil el controlar una parte determinada de la red.

source: Floodfill routers implement query limits as DOS protection
es: Los ruters floodfill implementan límites en las peticiones para prevenir ataques de denegación de servicio, DOS.

source: "Hidden mode", which prevents a router from publishing its information to the netDb, (but also prevents it from relaying data) is not widely used now but could be.
es: "Modo oculto", evita que el ruter publique su información en la netDb, (pero también hace que no reenvíe datos), no se usa mucho por ahora.

source: In future implementations, <a href="%(todo)s#nat">basic</a> and <a href="%(todo)s#fullRestrictedRoutes">comprehensive</a> restricted routes, this attack loses much of its power, as the "hidden" peers do not publish their contact addresses in the network database - only the tunnels through which they can be reached (as well as their public keys, etc).
es: En implementaciones futuras, ruters restringidos <a href="%(todo)s#nat">básicos</a> y <a href="%(todo)s#fullRestrictedRoutes">exhaustivos</a>, este ataque perderá gran parte de su poder, ya que los pares "ocultos" no publicarán su lista de contactos en la base de datos de la red - sólo los túneles por los que puede ser cntactado (al igual que sus claves publicas y demás).

source: In the future, routers could use GeoIP to identify if they are in a particular country where identification as an I2P node would be risky. In that case, the router could automatically enable hidden mode, or enact other restricted route methods.
es: En el futuro los ruters podrán usar GeoIP para identificar si están en un país donde la identificación de su nodo como un nodo de I2P podría ser peligroso. En ese caso, el ruter podrá activar el modo oculto automáticamente, o utilizar otros métodos de enrutado restringidos.

source: By inspecting the traffic into and out of a router, a malicious ISP or state-level firewall could identify that a computer is running I2P. As discussed <a href="#harvesting">above</a>, I2P is not specifically designed to hide that a computer is running I2P. However, several design decisions made in the design of the <a href="%(transport)s">transport layer and protocols</a> make it somewhat difficult to identify I2P traffic:
es: Inspeccionando el tráfico entrante y saliente del ruter, un ISP malicioso o un firewall de un estado podrían identificar que una máquina utiliza I2P. Como se discutió <a href="#harvesting">más arriba</a>, I2P no está diseñado específicamente para ocultar que una computadora usa I2P. Aún así, ciertas decisiones en diseño de <a href="%(transport)s">los protocolos y la capa de transporte</a> hacen bastante difícil identificar el tráfico de I2P:

source: Random port selection
es: Selección de puertos aleatoria

source: Point-to-Point Encryption of all traffic
es: Cifrado de todo el tráfico de punto a punto

source: DH key exchange with no protocol bytes or other unencrypted constant fields
es: Intercambio de clave DH sin bytes del protocolo u otros campos constantes no cifrados

source: Simultaneous use of both <a href="%(ntcp)s">TCP</a> and <a href="%(ssu)s">UDP</a> transports. UDP may be much harder for some Deep Packet Inspection (DPI) equipment to track.
es: El uso simultáneo de <a href="%(ssu)s">UDP</a> y <a href="%(ntcp)s">TCP</a>. UDP puede ser mucha más difícil de inspeccionar y seguir con equipamiento DPI, (inspección profunda de paquetes).

source: In the near future, we plan to directly address traffic analysis issues by further obfuscation of I2P transport protocols, possibly including:
es: En breves tenemos planeado solucionar los problemas de análisis de trafico ofuscando los protocolos de transporte de I2P, probablemente incluyendo:

source: Padding at the transport layer to random lengths, especially during the connection handshake
es: Rellenando la capa de transporte para que tenga determinados tamaños, especialmente durante el handshake de conexión

source: Study of packet size distribution signatures, and additional padding as necessary
es: Estudiando las firmas de la distribución de los tamaños de los paquetes, y rellenando si es necesario.

source: Development of additional transport methods that mimic SSL or other common protocols
es: Creación de otros métodos de transporte camuflados como SSL u otros protocolos comunes.

source: Review of padding strategies at higher layers to see how they affect packet sizes at the transport layer
es: Revisión de las estrategias de relleno en las capas superiores para ver como afectan al tamaño de los paquetes en la capa de transporte.

source: Review of methods implemented by various state-level firewalls to block Tor
es: Revisar varios métodos implementados por varios cortafuegos de algunos estados para bloquear Tor

source: Working directly with DPI and obfuscation experts
es: Trabajar directamente con expertos en DPI, inspección profunda de paquetes, y expertos en ofuscación.

source: Reference: <a href="%(pdf)s">Breaking and Improving Protocol Obfuscation</a>
es: Referencia: <a href="%(pdf)s">Breaking and Improving Protocol Obfuscation</a>

source: Sybil describes a category of attacks where the adversary creates arbitrarily large numbers of colluding nodes and uses the increased numbers to help mounting other attacks. For instance, if an attacker is in a network where peers are selected randomly and they want an 80&#37; chance to be one of those peers, they simply create five times the number of nodes that are in the network and roll the dice. When identity is free, Sybil can be a very potent technique for a powerful adversary. The primary technique to address this is simply to make identity 'non free' - <a href="http://www.pdos.lcs.mit.edu/tarzan/">Tarzan</a> (among others) uses the fact that IP addresses are limited, while IIP used <a href="http://www.hashcash.org/">HashCash</a> to 'charge' for creating a new identity. We currently have not implemented any particular technique to address Sybil, but do include placeholder certificates in the router's and destination's data structures which can contain a HashCash certificate of appropriate value when necessary (or some other certificate proving scarcity).
es: Sybil describe una categoría de ataques donde el adversario crea números arbitrariamente grandes de nodos compinchados y usan el incremento numérico para ayudar a montar otros ataques. Por ejemplo, si un atacante esta en una red donde los pares se seleccionan aleatoriamente y quieren un 80&#37; de posibilidades de ser uno de esos pares, simplemente crean cinco veces el número de nodos que están en la red y tiran el dado. Cuando la identidad es gratuita, Sybil puede ser una técnica muy potente para un adversario enérgico. La técnica primaria para enfrentar esto es simplemente hacer la identidad 'no gratuita' - <a href="http://www.pdos.lcs.mit.edu/tarzan/">Tarzan</a> (entre otros) usa el hecho de que la dirección IP es limitada, mientras IIP (proyecto de IRC invisible) usaba <a href="http://www.hashcash.org/">HashCash</a> para realizar un 'cargo' por crear una nueva identidad (prueba de trabajo). Actualmente no hemos implementado técnica particular alguna para enfrentar Sybil, pero incluimos certificados de posición en las estructuras de datos del router y el destino que pueden contener un certificado HashCash de un valor adecuado cuando sea necesario (o algún otro certificado que pruebe la escasez).

source: Requiring HashCash Certificates in various places has two major problems:
es: Requerir certificados HashCash en varios sitios tiene algunos problemas:

source: Maintaining backward compatibility
es: Mantener compatibilidad con versiones anteriores

source: The classic HashCash problem - selecting HashCash values that are meaningful proofs of work on high-end machines, while still being feasible on low-end machines such as mobile devices.
es: El problema clásico del HashCash - seleccionar valores HashCash que sean pruebas significativas de gasto de trabajo en máquinas potentes, mientras que también sean factibles en máquinas no tan potentes como los dispositivos móviles.

source: Various limitations on the number of routers in a given IP range restrict the vulnerability to attackers that don't have the ability to put machines in several IP blocks. However, this is not a meaningful defense against a powerful adversary.
es: Varios límites en el número de ruters que puede haber en un rango determinado de IPs restringe las posibilidades de los atacantes, ya que no pueden poner más computadoras en ese bloque de IPs. Aún así esto no es defensa contra un adversario con muchos recursos.

source: See the <a href="%(netdb)s#threat">network database page</a> for more Sybil discussion.
es: Vea la <a href="%(netdb)s#threat">web de la base de datos de la red</a> para obtener más información sobre Sybil.

source: (Reference: <a href="%(pdf)s">In Search of an Anonymouns and Secure Lookup</a> Section 5.2)
es: (Referencia: <a href="%(pdf)s">In Search of an Anonymouns and Secure Lookup</a> Sección 5.2)

source: By refusing to accept or forward tunnel build requests, except to a colluding peer, a router could ensure that a tunnel is formed wholly from its set of colluding routers. The chances of success are enhanced if there is a large number of colluding routers, i.e. a <a href="#sybil">Sybil attack</a>. This is somewhat mitigated by our <a href="%(peerselection)s">peer profiling</a> methods used to monitor the performance of peers. However, this is a powerful attack as the number of routers approaches <i>f</i> = 0.2, or 20&#37; malicious nodes, as specifed in the paper. The malicous routers could also maintain connections to the target router and provide excellent forwarding bandwidth for traffic over those connections, in an attempt to manipulate the profiles managed by the target and appear attractive. Further research and defenses may be necessary.
es: Al rechazar aceptar o remitir las solicitudes de construcción de túneles, excepto hacia un par (`peer`) compinchado, un router puede asegurar que un túnel está formado en su totalidad con su grupo de routers compinchados. Las posibilidades de éxito se incrementan si hay un gran número de routers compinchados, es decir, un <a href="#sybil">ataque Sybil</a>. Esto es mitigado de alguna manera por nuestros métodos de <a href="%(peerselection)s">perfilado de pares</a> usados para monitorizar el rendimiento de los pares. Sin embargo, esto es un ataque potente cuando el número de routers se aproxima a <i>f</i> = 0.2, o 20&#37; nodos maliciosos, como se detalla en la especificación. Los routers maliciosos también pueden mantener conexiones con el router objetivo y proporcionar un excelente ancho de banda de reenvío para el tráfico sobre aquellas conexiones, en un intento de manipular los perfiles gestinados por el objetivo y parecer atractivos. Podría ser necesaria ulterior investigación y defensa.

source: We use strong cryptography with long keys, and we assume the security of the industry-standard cryptographic primitives used in I2P, as documented <a href="%(cryptography)s">on the low-level cryptography page</a>. Security features include the immediate detection of altered messages along the path, the inability to decrypt messages not addressed to you, and defense against man-in-the-middle attacks. The key sizes chosen in 2003 were quite conservative at the time, and are still longer than those used in <a href="https://torproject.org/">other anonymity networks</a>. We don't think the current key lengths are our biggest weakness, especially for traditional, non-state-level adversaries; bugs and the small size of the network are much more worrisome. Of course, all cryptographic algorithms eventually become obsolete due to the advent of faster processors, cryptographic research, and advancements in methods such as rainbow tables, clusters of video game hardware, etc. Unfortunately, I2P was not designed with easy mechanisms to lengthen keys or change shared secret values while maintaining backward compatibility.
es: Usamos cifrados seguros con claves grandes, y usamos los algoritmos de cifrado por defecto de la industria de la seguridad, como se documenta en <a href="%(cryptography)s">on the low-level cryptography page</a>. Las medidas de seguridad también incluye la detección inmediata de mensajes alterados en los caminos intermedios, la imposibilidad de descifrar los mensajes que no le son enviados explícitamente a un par dado y defensas contra ataques main in the middle. Los tamaños de las claves elegidas en el 2003 todavía son más grandes que las usadas en otras redes de anonimato como <a href="https://torproject.org/">. No creemos que el tamaño de las claves sean la mayor vulnerabilidad, sobre todo contra adversarios que no sean estados; los errores de programación y el pequeño tamaño actual de la red son mucho más preocupantes.. Por supuesto, todos los algoritmos de cifrado se convierten en obsoletos tarde o temprano con la llegada de microprocesadores más potentes, estudios sobre cifrados y avances en métodos como las raionbow tables, grupos de consolas, etc. Desafortunadamente, I2P no fue diseñado con un mecanismo fácil para el cambio del tamaño de las claves o los secretos compartidos, manteniendo la compatibilidad con versiones anteriores.

source: Upgrading the various data structures and protocols to support longer keys will have to be tackled eventually, and this will be a <a href="%(cryptography)s">major undertaking</a>, just as it will be for <a href="https://torproject.org/">others</a>. Hopefully, through careful planning, we can minimize the disruption, and implement mechanisms to make it easier for future transitions.
es: La actualización de varias estructuras y protocolos para el soporte de claves más largas es un tema que deberá ser tratado tarde o temprano, y esto será un <a href="%(cryptography)s">dificil problema de resolver</a>, al igual que le ocurrirá a <a href="https://torproject.org/">otros</a>. Esperemos que con un buen planteamiento podamos minimizar los trastornos e implementar mecanismos que hagan más fáciles futuros cambios.
