Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: See the latest <a href="%(pluginspec)s">plugin specification</a> and the <a href="http://%(zzz)s/forums/16">plugin forum</a> on %(zzz)s.
es: Vea las últimas <a href="%(pluginspec)s">especificaciones de plugins</a> y el <a href="http://%(zzz)s/forums/16">forum de plugins</a> en %(zzz)s.

source: See also the sources for plugins developed by various people. Some plugins, such as <a href="http://%(pluginsite)s/plugins/snowman">snowman</a>, were developed specifically as examples.
es: Vea también las fuentes de los plugins desarrollados por diferentes personas. Algunos plugins como <a href="http://%(pluginsite)s/plugins/snowman">snowman</a>, fueron desarrollados específicamente como ejemplos.

source: <b>Developers wanted!</b> Plugins are a great way to learn more about I2P or easily add some feature.
es: <b>¡Se buscan desarrolladores!</b> Los plugins son una gran manera de aprender más acerca de I2P o de añadir fácilmente alguna característica.

source: Getting Started
es: Primeros pasos

source: To create a plugin from an existing binary package you will need to get makeplugin.sh from <a href="%(url)s">the i2p.scripts branch in monotone</a>.
es: Para crear un plugin desde un paquete binario existente necesitará obtener makeplugin.sh desde <a href="%(url)s">el ramal (`branch`) de i2p.scripts en monotone</a>.

source: Known Issues
es: Problemas conocidos

source: Note that the router's plugin architecture does <b>NOT</b> currently provide any additional security isolation or sandboxing of plugins.
es: Observe que la arquitectura del plugin del router actualmente <b>NO</b> proporciona seguridad adicional, aislamiento o sandboxing de plugins.

source: Updates of a plugin with included jars (not wars) won't be recognized if the plugin was already run, as it requires class loader trickery to flush the class cache; a full router restart is required.
es: Las actualizaciones de un plugin con jars (no wars) incluidos, no serán reconocidas si el plugin ya se está ejecutando, ya que requiere usar trucos en el cargador de clases ('class') para limpiar la caché de clases; se requiere un reinicio completo del router.

source: The stop button may be displayed even if there is nothing to stop.
es: El botón de parada podría mostarse incluso si no hay nada que parar.

source: Plugins running in a separate JVM create a <code>logs/</code> directory in <code>$CWD</code>.
es: Los plugins ejecutandose en una JVM crean un directorio <code>logs/</code> en <code>$CWD</code>.

source: No initial keys are present, except for those of jrandom and zzz (using the same keys as for router update), so the first key seen for a signer is automatically accepted&mdash;there is no signing key authority.
es: No hay claves inciales presentes, excepto para aquellos de `jrandom` y `zzz` (que usan las mismas claves que para la actualización del router), por lo que la primera clave vista para un firmante es automáticamente aceptada&mdash;no hay autoridad de clave de firmado.

source: When deleting a plugin, the directory is not always deleted, especially on Windows.
es: Cuando se borra un plugin el directorio no siempre se borra, especialmente sobre Windows.

source: Installing a plugin requiring Java 1.6 on a Java 1.5 machine will result in a "plugin is corrupt" message if pack200 compression of the plugin file is used.
es: Instalar un plugin que requiere Java 1.6 sobre una máquina Java 1.5 resultará en un mensaje "el plugin está corrupto" si se usó la compresión pack200 en el fichero del plugin.

source: Theme and translation plugins are untested.
es: Los plugins de temas y traducciones no están probados.

source: Disabling autostart doesn't always work.
es: Deshabilitar autoinicio no siempre funciona.

source: Ports Used by I2P
es: Puertos usados por I2P

source: These are the ports used or reserved by I2P, including those for known plugins, common alternates, and some typical related applications.
es: Estos son los puertos usados o reservados por I2P, incluyendo aquellos para plugins conocidos, alternativas comunes, y algunas aplicaciones típicas relacionadas.

source: Note that many of these are not enabled by default. There is more information in <a href="%(faq)s#ports">the FAQ</a>. See also the documentation for individual plugins. Plugin authors please add any ports you use here. For new plugins, we recommend using the next available port in the 766x range.
es: Observe que muchos de estos no están habilitados de forma predeterminada. Hay más información en las <a href="%(faq)s#ports">FAQ</a>. Vea también la documentación para plugins individuales. Los autores de los plugins por favor añadan cualquier puerto que usen aquí. Para nuevos plugins recomendamos usar el siguiente puerto disponible en el rango 766x.

source: recommended spot for new plugins/applications
es: punto recomendado para nuevos plugins/aplicaciones

source: BOB - Basic Open Bridge
es: BOB- Basic Open Bridge (pasarela abierta básica)

source: November 2015
es: Noviembre de 2015

source: Technical differences from SAM (for the better?)
es: Diferencias técnicas con SAM (¿para mejorarlo?)

source: BOB has separate command and data channels. One, an application command channel socket to router to configure. Two, the application data sockets to/from router that carry only data. The command channel is only needed for making or setting the initial destination key, and to set the destination key to port bindings. All connections run in parallel.
es: BOB tiene canales separados de comandos y de datos. Uno, un socket de canal de comandos de aplicación hacia el router. Dos, los sockets de datos de aplicación hacia/desde el router, que portan sólo datos. El canal de comandos sólo es necesario para generar o establecer la clave de destino inicial, y para establecer las ligaduras (`bindings`) de las claves de destino con los puertos. Todas las conexiones se ejecutan en paralelo.

source: SAM has one connection that does everything, and you need to parse every packet.
es: SAM tiene una conexión que hace todo, y usted necesita procesar todos los paquetes.

source: BOB does not hold keypair values, nor does the router. Your application holds the keypair values. This is to reduce any extra complexity in the router code, it also adds to your privacy.
es: BOB no retiene valores de parejas de claves, tampoco lo hace el router. La aplicación de usted retiene los valores de parejas de claves. Esto es para reducir cualquier complejidad extra en el código del router, también contribuye a su privacidad.

source: SAM router stores every keypair you ever make.
es: El router SAM guarda cada par de claves que alguna vez haya generado.

source: Those are the important differences.
es: Esas son las diferencias importantes.

source: <code>KEYS</code> = keypair public+private, these are BASE64
es: <code>CLAVES</code> = par de claves pública+privada, estas son BASE64

source: <code>KEY</code> = public key, also BASE64
es: <code>CLAVE</code> = clave pública, también BASE64

source: <code>ERROR</code> as is implied returns the message <code>"ERROR "+DESCRIPTION+"\n"</code>, where the <code>DESCRIPTION</code> is what went wrong.
es: <code>ERROR</code> como está implícito, devuelve el mensaje <code>"ERROR "+DESCRIPCIÓN+"\n"</code>, donde la <code>DESCRIPCIÓN</code> es lo que fue mal.

source: <code>OK</code> returns <code>"OK"</code>, and if data is to be returned, it is on the same line. <code>OK</code> means the command is finished.
es: <code>OK</code> devuelve <code>"OK"</code>, y si se van a devolver datos, se hará en la misma línea. <code>OK</code> significa que el comando ha finalizado.

source: <code>DATA</code> lines contain information that you requested. There may be multiple <code>DATA</code> lines per request.
es: <code>DATOS</code> líneas conteniendo la información que usted solicitó. Puede haber múltiples líneas de <code>DATOS</code> por solicitud.

source: <b>NOTE:</b> The help command is the ONLY command that has an exception to the rules... it can actually return nothing! This is intentional, since help is a HUMAN and not an APPLICATION command.
es: <b>NOTA:</b> El comando `help` es el ÚNICO comando que tiene una excepción a las reglas... actualmente puede devolver ¡nada! Es intencionado, dado que `help` es un HUMANO y no un comando de APLICACIÓN.

source: <b>PLEASE NOTE:</b> For CURRENT details on the commands PLEASE use the built-in help command. Just telnet to localhost 2827 and type help and you can get full documentation on each command.
es: <b>POR FAVOR OBSERVE QUE:</b> Para detalles ACTUALES de los comandos POR FAVOR use el comando interno `help`. Tan sólo haga telnet al localhost 2827, teclee `help` y podrá obtener la documentación completa para cada comando.

source: Commands never get obsoleted or changed, however new commands do get added from time to time.
es: Los comandos nunca cambian o se vuelven obsoletos, sin embargo nuevos comandos son añadidos de cuando en cuando.

source: Here are the commands we have as of this writing:
es: Aquí están los comandos que tenemos en el momento de escirbir esto:

source: COMMAND
es: COMANDO

source: OPERAND
es: OPERANDO

source: RETURNS
es: DEVUELVE

source: Once set up, all TCP sockets can and will block as needed, and there is no need for any additional messages to/from the command channel. This allows the router to pace the stream without exploding with OOM like SAM does as it chokes on attempting to shove many streams in or out one socket -- that can't scale when you have alot of connections!
es: Una vez configurado, todos los sockets TCP pueden y bloquearán según se necesite, y no hay necesidad de mensaje adicional alguno hacia/desde el canal de comandos. Esto permite al router marcar el paso del stream sin reventar con un OOM (out of memory/agotamiento de memoria) como lo hace SAM al ahogarse intentando empujar varios streams dentro o fuera de un socket -- ¡que no puede crecer cuando tiene muchas conexiones!

source: What is also nice about this particular interface is that writing anything to interface to it, is much much easier than SAM. There is no other processing to do after the set up. It's configuration is so simple, that very simple tools, such as nc (netcat) can be used to point to some application. The value there is that one could schedule up and down times for an application, and not have to change the application to do that, or to even have to stop that application. Instead, you can literally "unplug" the destination, and "plug it in" again. As long as the same IP/port addresses and destination keys are used when bringing the bridge up, the normal TCP application won't care, and won't notice. It will simply be fooled -- the destinations are not reachable, and that nothing is coming in.
es: Lo que también es agradable acerca de esta interfaz en particular es que escribir algo para la interfaz, es mucho mucho más fácil que para SAM. No hay ningún otro proceso que realizar después de configurarla. Su configuración es tan simple, que muchas aplicaciones sencillas, tales como nc (netcat) se pueden usar para apuntar a alguna aplicación. El valor ahí es que uno puede programar periodos de actividad e inactividad para una aplicación, sin tener que cambiar la aplicación para hacer eso, o incluso sin tener que detener esa aplicación. En su lugar, puede literalmente "desenchufar" el destino, y "enchufarlo" de nuevo. Mientras las mismas direcciones IP/puerto y claves de destino sean usadas al levantar la pasarela, a las aplicaciones TCP normales no les importará, y no lo notarán. Simplemente serán engañadas -- los destinos no son alcanzables, y así nada va a recibirse.

source: For the following example, we'll setup a very simple local loopback connection, with two destinations. Destination "mouth" will be the CHARGEN service from the INET superserver daemon. Destination "ear" will be a local port that you can telnet into, and watch the pretty ASCII test puke forth.
es: Para el siguiente ejemplo, estableceremos un conexión loopback local muy simple, con dos destinos. El destino "boca" será el servicio CHARGEN desde el demonio superservidor INET. El destino "oido" será un puerto local sobre el que podrá hacer telnet, y observar el precioso ASCII de prueba vomitado.

source: EXAMPLE SESSION DIALOGUE -- simple telnet 127.0.0.1 2827 works
es: DIÁLOGO DE SESIÓN DE EJEMPLO -- un simple `telnet 127.0.0.1 2827` funciona

source: Application
es: Aplicación

source: BOB's Command response.
es: Respuesta al comando de BOB.

source: FROM
es: DESDE

source: TO
es: HACIA

source: DIALOGUE
es: DIÁLOGO

source: MAKE NOTE OF THE ABOVE DESTINATION KEY, YOURS WILL BE DIFFERENT!
es: ANOTE LA CLAVE DE DESTINO ANTERIOR, ¡LA SUYA SERÁ DIFERENTE!

source: At this point, there was no error, a destination with a nickname of "mouth" is set up. When you contact the destination provided, you actually connect to the <code>CHARGEN</code> service on <code>19/TCP</code>.
es: En este punto no hubo error, un destino con un apodo de "boca" está establecido. Cuando contacte con el destino proporcionado, en realidad conectará con el servicio <code>CHARGEN</code> sobre <code>19/TCP</code>.

source: Now for the other half, so that we can actually contact this destination.
es: Ahora para la otra mitad, para que realmente podamos contactar con este destino.

source: Now all we need to do is telnet into 127.0.0.1, port 37337, send the destination key or host address from addressbook we want to contact. In this case, we want to contact "mouth", all we do is paste in the key and it goes.
es: Ahora todo lo que necesitamos es hacer telnet a 127.0.0.1, puerto 37337, enviar la clave destino o la dirección del servidor de la libreta de direcciones con la que queramos contactar. En este caso, queremos contactar con "boca", todo lo que haremos es pegar la clave e irá.

source: <b>NOTE:</b> The "quit" command in the command channel does NOT disconnect the tunnels like SAM.
es: <b>NOTA:</b> El comando "quit" en el canal de comandos NO desconecta los túneles como SAM.

source: After a few virtual miles of this spew, press <code>Control-]</code>
es: Después de unas pocas millas virtuales de esta eyección, presione <code>Control-]</code>

source: Here is what happened...
es: Aquí está lo que sucedió...

source: You can connect to EEPSITES too!
es: ¡También puede conectar con EEPSITES!

source: Pretty cool isn't it? Try some other well known EEPSITES if you like, nonexistent ones, etc, to get a feel for what kind of output to expect in different situations. For the most part, it is suggested that you ignore any of the error messages. They would be meaningless to the application, and are only presented for human debugging.
es: Bastante chulo ¿verdad? Pruebe con algún otro EEPSITE bien conocido si prefiere, o con los no existentes, etc. para conseguir una sensación de qué tipo de resultado esperar en diferentes situaciones. Para la mayor parte, se sugiere que ignore cualquier tipo de mensajes de error. No tendrían significado para la aplicación, y sólo son presentados para depuración por humanos.

source: Let's put down our destinations now that we are all done with them.
es: Desactivemos nuestros destinos ahora que hemos terminado del todo con ellos.

source: First, lets see what destination nicknames we have.
es: Primero, veamos que apodos de destino tenemos.

source: Alright, there they are. First, let's remove "mouth".
es: De acuerdo, ahí las tiene. Primero, eliminemos "boca" (`mouth`).

source: Now to remove "ear", note that this is what happens when you type too fast, and shows you what typical ERROR messages looks like.
es: Ahora para eliminar "oido" (`ear`), note que esto es lo que ocurre cuando teclea demasiado rápido, y le muestra el aspecto de los típicos mensajes de ERROR.

source: I won't bother to show an example of the receiver end of a bridge because it is very simple. There are two possible settings for it, and it is toggled with the "quiet" command.
es: No le molestaré mostrando un ejemplo de un receptor final de una pasarela (`bridge`) porque es muy simple. Hay dos posibles configuraciones para ello, y se accionan con el comando "quiet" (silenciar).

source: The default is NOT quiet, and the first data to come into your listening socket is the destination that is making the contact. It is a single line consisting of the BASE64 address followed by a newline. Everything after that is for the application to actually consume.
es: La configuración por defecto es NO silenciado, a y los primeros datos en llegar a su socket de escucha es el destiono que está estableciendo el contacto. Es una sola línea consistente en una dirección BASE64 seguida de una nueva línea. Todo lo que viene después de aquello es en realidad para consumo de la aplicación.

source: In quiet mode, think of it as a regular Internet connection. No extra data comes in at all. It's just as if you are plain connected to the regular Internet. This mode allows a form of transparency much like is available on the router console tunnel settings pages, so that you can use BOB to point a destination at a web server, for example, and you would not have to modify the web server at all.
es: En modo silencioso, piense en él como en una conexión regular a Internet. No hay dato extra entrante alguno. Es tan solo como si estuviera conectado normalmente al Internet regular. Este modo permite una forma de transparencia muy parecida a la que está disponible en las páginas de configuración del túnel de la consola del router, así que usted puede, por ejemplo, usar BOB para apuntar hacia un destino en un servidor web, y no tendría que modificar para nada el servidor web.

source: The advantage with using BOB for this is as discussed previously. You could schedule random uptimes for the application, redirect to a different machine, etc. One use of this may be something like wanting to try to goof up router-to-destination upness guessing. You could stop and start the destination with a totally different process to make random up and down times on services. That way you would only be stopping the ability to contact such a service, and not have to bother shutting it down and restarting it. You could redirect and point to a different machine on your LAN while you do updates, or point to a set of backup machines depending on what is running, etc, etc. Only your imagination limits what you could do with BOB.
es: La ventaja de usar BOB para esto es la que fue discutida previamente. Puede programar periodos de actividad aleatorios para la aplicación, redirigirla a una máquina diferente, etc. Un uso de esto puede ser algo parecido a tratar de confundir acciones de estimación de la conectividad router-destino. Puede detener e iniciar el destino con un proceso totalmente diferente para establecer periodos aleatorios de actividad e inactividad para los servicios. De ese modo sólo se estaría deteniendo la capacidad de contactar con tal servicio, sin tener que preocuparse cerrándolo y reiniciándolo. Podría redirigir y apuntar a una máquina diferente de su LAN, mientras hace actualizaciones, o apuntar a un conjunto de máquinas de respaldo dependiendo de lo que se esté ejecuntando, etc, etc. Sólo su imaginación limita lo que podría hacer con BOB.

source: August 2010
es: Agosto del 2010

source: Datagram Overview
es: Introducción a los datagramas

source: Datagrams build upon the base <a href="%(i2cp)s">I2CP</a> to provide authenticated and repliable messages in a standard format. This lets applications reliably read the "from" address out of a datagram and know that the address really sent the message. This is necessary for some applications since the base I2P message is completely raw - it has no "from" address (unlike IP packets). In addition, the message and sender are authenticated by signing the payload.
es: Los datagramas se construyen sobre la base de <a href="%(i2cp)s">I2CP</a> para proporcionar autentificación y mensajes respondibles en un formato estandar. Esto permite a las aplicaciones leer con fiabilidad la dirección "from" (desde) de los datragramas, y confirmar que la dirección envió efectivamente el mensaje. Esto es necesario para algunas aplicaciones ya que el mensaje base I2P es completamente crudo (`raw`) - no tiene dirección "from" (al contrario que los paquetes IP). Además el mensaje y el emisor son autentificados mediante el firmado de la carga.

source: Datagrams, like <a href="%(streaming)s">streaming library packets</a>, are an application-level construct. These protocols are independent of the low-level <a href="%(transports)s">transports</a>; the protocols are converted to I2NP messages by the router, and either protocol may be carried by either transport.
es: Los datagramas, al igual que los <a href="%(streaming)s">paquetes de la librería de streaming</a>, son una construcción al nivel de aplicación. Estos protocolos son diferentes de los <a href="%(transports)s">transportes</a> de bajo nivel; estos protocolos son convertidos en mensajes I2NP por el ruter, y así cualquier protocolo puede ser llevado por cualquier transporte.

source: Application Guide
es: Guía de aplicaciones

source: Applications written in Java may use the <a href="%(url)s">datagram API</a>, while applications in other languages can use <a href="%(sam)s">SAM</a>'s datagram support. There is also limited support in i2ptunnel in the <a href="%(socks)s">SOCKS proxy</a>, the 'streamr' tunnel types, and udpTunnel classes.
es: Las aplicaciones escritas en Java pueden usar la <a href="%(url)s">API datagram</a>, mientras que las aplicaciones en otros idomas pueden usar el soporte datagram de <a href="%(sam)s">SAM</a>. También hay soporte limitado en i2ptunnel en el <a href="%(socks)s">proxy SOCKS</a>, los tipos de túnel 'streamr', y las clases udpTunnel.

source: Datagram Length
es: Longitud del datagrama

source: The application designer should carefully consider the tradeoff of repliable vs. non-repliable datagrams. Also, the datagram size will affect reliability, due to tunnel fragmentation into 1KB tunnel messages. The more message fragments, the more likely that one of them will be dropped by an intermediate hop. Messages larger than a few KB are not recommended. Over about 10 KB, the delivery probablility drops dramatically. Messages over 16 KB cannot be delivered over NTCP, dropping delivery chances even more.
es: El diseñador de la aplicación debe considerar cuidadosamente las contrapartidas de datagramas respondibles frente a los no-respondibles. El tamaño del datagrama también afectaría a la fiabilidad, debido a la fragmentación del túnel en mensajes de túnel de 1KB. Cuantos más fragmentos de mensaje, más probable es que uno de ellos se pierda en un salto intermedio. Los mensajes más largos de unos pocos KB no están recomendados. Por encima de alrededor de 10KB, la probabilidad de entrega cae dramáticamente. Los mensajes por encima de 16KB no pueden ser entregados sobre NTCP (TCP basado en NIO).
