Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/docs.po
Languages: es

source: To cap bandwidth and CPU usage, the router also limits the maximum number of build attempts outstanding across all pools. Critical builds (those for exploratory tunnels, and for pools that have run out of tunnels) are prioritized.
es: Para limitar el uso de CPU y ancho de banda, el ruter también limita el número máximo de intentos de construcción pendientes a través de todos los grupos. Las construcciones críticas (aquellas para los túneles exploratorios, y para los grupos que se han quedado sin túneles) son priorizadas.

source: Tunnel Message Throttling
es: Límites de los mensajes de túnel

source: Even though the tunnels within I2P bear a resemblance to a circuit switched network, everything within I2P is strictly message based - tunnels are merely accounting tricks to help organize the delivery of messages. No assumptions are made regarding reliability or ordering of messages, and retransmissions are left to higher levels (e.g. I2P's client layer streaming library). This allows I2P to take advantage of throttling techniques available to both packet switched and circuit switched networks. For instance, each router may keep track of the moving average of how much data each tunnel is using, combine that with all of the averages used by other tunnels the router is participating in, and be able to accept or reject additional tunnel participation requests based on its capacity and utilization. On the other hand, each router can simply drop messages that are beyond its capacity, exploiting the research used on the normal Internet.
es: Aunque los túneles dentro de I2P son parecidos a una red conmutada de circuito, todo dentro de I2P está basado en mensajes - los túneles no son más que trucos contables para ayudar a organizar el envío de mensajes. No se toman suposiciones con respecto a el orden o fiabilidad de los mensajes, y la retransmisiones son dejadas para los niveles superiores (por ejemplo para la capa cliente de la librería de streaming de I2P) . Esto permite a I2P aprovechar las técnicas de limitaciones disponibles en las redes conmutadas de paquetes y en las redes conmutadas de circuito. Por ejemplo, cada ruter puede hacer un seguimiento de la media cambiante de cuantos datos usa cada túnel, combinar eso con todas medias usadas poro otros túneles en los que participa el ruter, y ser capaz de aceptar o denegar las peticiones de participación adicional de túnel basándose en su capacidad y utilización. Por otro lado, cada ruter puede simplemente denegar los mensajes que están más allá de su capacidad.

source: In the current implementation, routers implement a weighted random early discard (WRED) strategy. For all participating routers (internal participant, inbound gateway, and outbound endpoint), the router will start randomly dropping a portion of messages as the bandwidth limits are approached. As traffic gets closer to, or exceeds, the limits, more messages are dropped. For an internal participant, all messages are fragmented and padded and therefore are the same size. At the inbound gateway and outbound endpoint, however, the dropping decision is made on the full (coalesced) message, and the message size is taken into account. Larger messages are more likely to be dropped. Also, messages are more likely to be dropped at the outbound endpoint than the inbound gateway, as those messages are not as "far along" in their journey and thus the network cost of dropping those messages is lower.
es: En la implementación actual, los ruters implementan una estrategia de rechazo temprano ponderada aleatoria, weighted random early discard (WRED) strategy. Para todos los túneles participantes (participante interno, puerta de salida de entrada y punto final de salida), el ruter empezará a denegar una parte de los mensajes según llegue a los límites del ancho de banda. Cuando el tráfico llega cerca, o excede los límites, se rechazan más mensajes. Para un participante interno, todos los mensajes están fragmentados y rellenados y por lo tanto son del mismo tamaño. En la puerta de salida de entrara y en el punto final de salida, sin embargo, la decisión de rechazo se hace en el mensaje completo (junto), y el tamaño del mensaje es tomado en cuenta. Es más fácil que sean eliminados los mensajes más largos. Además, es más fácil que los mensajes sean rechazados en el punto final de salida que en la puerta de salida de entrada, ya que esos mensajes no están tan "a lo lejos" en su camino y el coste del rechazo de esos mensajes es menor.

source: Mixing/batching
es: Mezcla/lotes

source: What strategies could be used at the gateway and at each hop for delaying, reordering, rerouting, or padding messages? To what extent should this be done automatically, how much should be configured as a per tunnel or per hop setting, and how should the tunnel's creator (and in turn, user) control this operation? All of this is left as unknown, to be worked out for a distant future release.
es: ¿Qué estrategias pueden usarse en la puerta de salida y en cada salto para retrasar, re-ordenar, re-enrutar o rellenar los mensajes? ¿En qué medida debe hacerse esto automáticamente, que configuraciones debemos poner por túnel o por salto, y cómo debe controlar esta operación el creador del túnel (y por lo tanto el usuario)? Todo esto se queda en el aire, para ser estudiado en una versión futura distante.

source: Padding
es: Relleno

source: The padding strategies can be used on a variety of levels, addressing the exposure of message size information to different adversaries. The current fixed tunnel message size is 1024 bytes. Within this however, the fragmented messages themselves are not padded by the tunnel at all, though for end to end messages, they may be padded as part of the garlic wrapping.
es: Las estrategias de relleno pueden ser usadas en varios niveles, evitando la exposición del tamaño de los mensajes a los adversarios. El tamaño actual fijo del túnel es de 1024 bytes. Pero los propios mensajes fragmentados no están rellenados por el túnel, por lo que en lo mensajes de fin a fin, deben ser rellenados como parte del envase garlic.

source: WRED strategies have a significant impact on end-to-end performance, and prevention of network congestion collapse. The current WRED strategy should be carefully evaluated and improved.
es: Las estrategias WRED tienen un impacto importante en el rendimiento de fin a fin, y en la prevención del colapso de la congestión de la red. Esta estrategia WRED actual debería ser evaluada cuidadosamente y mejorada.

source: Old Tunnel Implementation
es: Implementación vieja del túnel

source: Note: Obsolete - NOT used! Replaced in 0.6.1.10 - see <a href="%(tunnelimpl)s">here</a> for the current implementation
es: Nota: Obsoleta - ¡NO se usa! Reemplazada en la versión 0.6.1.10 - vea <a href="%(tunnelimpl)s">esto</a> para la implementación actual.

source: This page describes the origins and design of I2P's unidirectional tunnels. For further infomrmation see:
es: Esta página describe el origen y el diseño de los túneles unidireccionales de I2P. Para más información vea:

source: Tunnel overview page
es: Página de la introducción al túnel

source: Tunnel design discussion
es: Discusión sobre el diseño de túnel

source: Peer selection
es: Selección de pares

source: Meeting 125 (~13:12-13:30)
es: Reunión 125 (~13:12-13:30)

source: Review
es: Revisión

source: While we aren't aware of any published research on the advantages of unidirecdtional tunnels, they appear to make it harder to detect a request/response pattern, which is quite possible to detect over a bidirectional tunnel. Several apps and protocols, notably HTTP, do transfer data in such manner. Having the traffic follow the same route to its destination and back could make it easier for an attacker who has only timing and traffic volume data to infer the path a tunnel is taking. Having the response come back along a different path arguably makes it harder.
es: Aunque no estamos al tanto de investigación publicada alguna sobre las ventajas de túneles unidireccionales, estos parece que hacen más difícil detectar un patrón de solicitud/respuesta, lo cual es bastante posible que se detecte sobre un túnel bidireccional. Varias aplicaciones y protocolos, notablemente HTTP, transfieren datos de esta manera. Hacer que el tráfico siga la misma ruta hacia su destino y de vuelta puede ponerlo más fácil para un atacante que sólo disponga de datos tiempo y de volumen de tráfico para inferir la ruta que está tomando un túnel. Hacer que la respuesta vuelva a través de otra ruta es razonable que lo haga más difícil.

source: When dealing with an internal adversary or most external adversaries, I2P's undirectional tunnels expose half as much traffic data than would be exposed with bidirectional circuits by simply looking at the flows themselves - an HTTP request and response would follow the same path in Tor, while in I2P the packets making up the request would go out through one or more outbound tunnels and the packets making up the response would come back through one or more different inbound tunnels.
es: Cuando tratamos con un adversario interno o con la mayoría de adversarios externos, los túneles unidireccionales de I2P exponen como mucho la mitad de los datos de tráfico que se expondrían con circuitos bidireccionales simplemente observando los propios flujos - una solicitud y respuesta HTTP seguiría la misma ruta en Tor, mientras que en I2P los paquetes que componen la solicitud saldrían a través de uno o más túneles de salida, y los paquetes que componen la respuesta retornarían a traves de uno o más túneles de entrada diferentes.

source: The strategy of using two separate tunnels for inbound and outbound communication is not the only technique available, and it does have anonymity implications. On the positive side, by using separate tunnels it lessens the traffic data exposed for analysis to participants in a tunnel - for instance, peers in an outbound tunnel from a web browser would only see the traffic of an HTTP GET, while the peers in an inbound tunnel would see the payload delivered along the tunnel. With bidirectional tunnels, all participants would have access to the fact that e.g. 1KB was sent in one direction, then 100KB in the other. On the negative side, using unidirectional tunnels means that there are two sets of peers which need to be profiled and accounted for, and additional care must be taken to address the increased speed of predecessor attacks. The tunnel pooling and building process (peer selection and ordering strategies) should minimize the worries of the predecessor attack.
es: La estrategia de usar dos túneles separados para la comunicación de entrada y de salida no es la única técnica disponible, y tiene implicaciones en el anonimato. En el lado positivo, al usar túneles separados se reducen los datos de tráfico expuestos al análisis de los participantes en un túnel - por ejemplo, los pares (`peers´) en un túnel de entrada desde un navegador web sólo verían el tráfico de un HTTP GET, mientras que los pares en un túnel de entrada verían la carga entregada a través del túnel. Con túneles bidireccionales, todos los participantes tendrían acceso al hecho de que, por ejemplo, 1 KB fuera enviado en una dirección, y después 100 KB en la otra. En el lado negativo, usar túneles unidireccionales significa que hay dos conjuntos de pares (`peers`) precisan ser perfilados y fiscalizados, y que se debe tener una precaución adicional para afrontar el incremento de velocidad que se ha producido en los ataques de predecesor. El proceso de depositado (`pooling`) y erigido (selección de pares y estrategias de ordenación) debería minimizar las preocupaciones por los ataques de predecesor.

source: Anonymity
es: Anonimato

source: A recent <a href="%(pdf)s">paper by Hermann and Grothoff</a> declared that I2P's unidirectional tunnels "seems to be a bad design decision".
es: Un <a href="%(pdf)s">estudio reciente de Hermann and Grothoff</a> decía que los túneles unidireccionales de I2p "parecían ser una mala decisión de diseño"

source: The paper's main point is that deanonymizations on unidirectional tunnels take a longer time, which is an advantage, but that an attacker can be more certain in the unidirectional case. Therefore, the paper claims it isn't an advantage at all, but a disadvantage, at least with long-living eepsites.
es: El punto principal del estudio es que de-anonimizar los túneles unidireccionales toma más tiempo, lo que es una ventaja, pero que el atacante puede estar más seguro en el caso unidireccional. Por lo tanto, el estudio dice que no es ninguna ventaja, sino una desventaja, al menos para las eepsites de vida larga.

source: This conclusion is not fully supported by the paper. Unidirectional tunnels clearly mitigate other attacks and it's not clear how to trade off the risk of the attack in the paper with attacks on a bidirectional tunnel architecture.
es: Esta conclusión no está totalmente confirmada en el estudio. Los túneles unidireccionales mitigan claramente otros ataques y no está claro si es inteligente sacrificar el riesgo del ataque del estudio por los riesgos de la arquitectura de túneles bidireccionales.

source: This conclusion is based on an arbitrary certainty vs. time weighting (tradeoff) that may not be applicable in all cases. For example, somebody could make a list of possible IPs then issue subpoenas to each. Or the attacker could DDoS each in turn and via a simple intersection attack see if the eepsite goes down or is slowed down. So close may be good enough, or time may be more important.
es: Esta conclusión está basada en una certeza arbitraria vs. la medición del tiempo (compensación) que no es apreciable en la mayoría de los casos. Por ejemplo, alguien podría hacer una lista de IPs y entonces expedir citaciones a cada uno. O el atacante podría hacer DDos a cada uno por turnos y a través de un simple ataque de intersección ver si la eepsite se cae o si se ralentiza. Estar cerca puede ser lo suficientemente bueno, o el tiempo puede ser más importante.

source: The conclusion is based on a specific weighting of the importance of certainty vs. time, and that weighting may be wrong, and it's definitely debatable, especially in a real world with subpoenas, search warrants, and other methods available for final confirmation.
es: La conclusión está basada en una forma de medir específica de la importancia de la certeza vs. el tiempo, y esa medida puede estar equivocada, y es definitivamente discutible, especialmente en el mundo real con citaciones, órdenes de registro y otros métodos disponibles.

source: A full analysis of the tradeoffs of unidirectional vs. bidirectional tunnels is clearly outside the scope of the paper, and has not been done elsewhere. For example, how does this attack compare to the numerous possible timing attacks published about onion-routed networks? Clearly the authors have not done that analysis, if it's even possible to do it effectively.
es: Un análisis completo de las compensaciones de los túneles unidireccionales vs. bidireccionales está claramente fuera del alcance del estudio, y no se ha hecho en ningún sitio. Por ejemplo, ¿cómo se compara este ataque con los numerosos posibles ataques publicados sobre la red onion? Claramente los autores no han hecho ese análisis, si pudiese ser posible hacerlo efectivamente.

source: Tor uses bidirectional tunnels and has had a lot of academic review. I2P uses unidirectional tunnels and has had very little review. Does the lack of a research paper defending unidirectional tunnels mean that it is a poor design choice, or just that it needs more study? Timing attacks and distributed attacks are difficult to defend against in both I2P and Tor. The design intent (see references above) was that unidirectional tunnels are more resistant to timing attacks. However, the paper presents a somewhat different type of timing attack. Is this attack, innovative as it is, sufficient to label I2P's tunnel architecture (and thus I2P as a whole) a "bad design", and by implication clearly inferior to Tor, or is it just a design alternative that clearly needs further investigation and analysis? There are several other reasons to consider I2P currently inferior to Tor and other projects (small network size, lack of funding, lack of review) but is unidirectional tunnels really a reason?
es: Tor utiliza túneles bidireccionales y tiene mucha revisión académica. I2P usa túneles unidireccionales y tiene muy poca revisión. ¿Significa la falta de estudios defendiendo los túneles unidireccionales que son una mala elección de diseño, o sólo necesita más estudio? Contra los ataques de tiempo y los ataques distribuidos para I2P y tor es difícil defenderse para ambos. El intento de diseño (vea las referencias arriba) era que los túneles de diseño eran más resistentes a los ataques de tiempo. Sin embargo, el estudio presenta un tipo diferente de ataque de tiempo. ¿Es este ataque, innovador, suficiente para calificar la arquitectura de túneles de I2P (y por lo tanto a I2P al completo) de un "mal diseño", y por implicación, claramente inferior a Tor, o simplemente es una alternativa de diseño que claramente necesita más investigación y análisis? Hay otras razones para considerar a I2p inferior a Tor y a otros proyectos (el pequeño tamaño de la red, falta de fondos, falta de revisión) ¿pero son los túneles unidireccionales de verdad una razón?

source: In summary, "bad design decision" is apparently (since the paper does not label bidirectional tunnels "bad") shorthand for "unidirectional tunnels are unequivocally inferior to bidirectional tunnels", yet this conclusion is not supported by the paper.
es: En resumen, la "mala decisión de diseño" parece (ya que el estudio no califica a los túneles bidireccionales de "malos") otra forma de decir que los túneles "unidireccionales son inequívocamente inferiores a los túneles bidireccionales", aunque esta conclusión no está demostrada en el estudio.
