Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: For a future of I2P and attract more people into I2P this bounty is to setup and host a I2P SILC server. This will allow people to send files over their messaging servers and have intrinsic security built into the protocol.
id: Untuk masa depan I2P dan menarik lebih banyak orang ke I2P, bounty ini adalah untuk setup dan host server I2P SILC. Ini akan memungkinkan orang untuk mengirim file melalui pesan server mereka dan memiliki keamanan intrinsik yang dibangun ke dalam protokol.
ru: Ради будущего I2P и привлечения большего количества людей к I2P эта награда была назначена за установку и размещение сервера I2P SILC. Это позволит людям отправлять файлы через свои сервера сообщения, причем безопасность будет реализована в протоколе.

source: A silc server needs to be set up and run for at least 3 month time to get payed. A second server should be set up, too.
id: Silc server perlu disapkan dan menjalankan untuk setidaknya selama 3 bulan untuk mendapatkan pembayaran. Kedua server juga harus juga disiapkan.
ru: Для получения награды необходимо настроить сервер SILC и поддерживать его в рабочем состоянии как минимум 3 месяца. Также должен быть развернут второй сервер.

source: Bounty was withdrawn and money donated to returningnovice and general fund.
id: Bounty ditarik dan uang dikembalikan kepada returningnovice dan dana umum.
ru: Награда была отменена и пожертвованные деньги переданы в общий фонд.

source: Judge is An Anonymous Secret Society, society@mail.i2p.
id: Hakimnya adalah An Anonymous Secret Society, society@mail.i2p.
ru: Судья - An Anonymous Secret Society, society@mail.i2p.

source: Syndie development
id: Pengembangan Syndie
ru: Разработка Syndie

source: Beside of I2P we want to encourage users to care more about anonymity and security. As I2P is a low latency network with its natural limits, the software SYNDIE can overcome some of these limits and provide better anonymity for people who really need it.
id: Selain dari I2P kami ingin mendorong pengguna untuk lebih peduli dengan anonimitas dan keamanan. Seperti I2P jaringan latency rendah dengan batas-batasnya, perangkat lunak SYNDIE dapat mengatasi beberapa batas ini dan memberikan anonimitas lebih baik untuk orang-orang yang benar-benar membutuhkannya.
ru: При помощи I2P мы хотим воодушевить пользователей больше заботиться об анонимности и безопасности. Поскольку I2P - это сеть с низкими задержками и своими ограничениями, ПО SYNDIE может преодолеть некоторые из этих ограничений и предоставить лучшую анонимность людям, которым это действительно нужно.

source: For our bad sake the syndie project was out of development for quite a long time yet (5 years) and has been updated just with small fixes to keep it running. To get a fresh and new built with needed bugfixes we set out this bounty. Also syndie needs some enhancements and a better GUI for users to work with it. Current bounty sum is 3 Bitcoin.
id: Sayangnya, proyek syndie tidak dalam pengembangan untuk waktu cukup lama (5 tahun) dan telah diperbarui hanya dengan perbaikan kecil untuk tetap berjalan. Untuk mendapatkan program yang segar dan baru dengan perbaikan bug, kami membuat bounty ini. Syndie juga perlu beberapa perangkat tambahan dan GUI yang lebih baik untuk pengguna. Saat ini jumlah bounty adalah 3 Bitcoin.

source: The latest Syndie coding rally did improve the situation of the Syndie package dramatically. A new Syndie package with bugfixes was created and made available on different webpages. As a result of this work, the bounty sum was reduced and the withdrawn money moved to the IPv6 bounty.
id: Rally pengkodean Syndie terbaru memperbaiki situasi paket Syndie secara dramatis. Paket Syndie terbaru dengan perbaikan bug yang telah diciptakan dan dibuat, tersedia pada halaman web yang berbeda. Hasilnya, jumlah bounty berkurang dan uang yang dipindah ke bounty IPv6.
ru: Последние доработки Syndie существенным образом улучшили ситуацию с пакетом Syndie. Был создан новый пакет Syndie с исправлениями, он доступен на разных веб-страницах. В результате, награда была уменьшена и сэкономленные деньги были переведены в награду за IPv6.

source: Bounty unittests
id: Bounty untuk unittests
ru: Награда за юнит тесты

source: To improve I2P's maintainability, we want to have a solid set of automated unit tests for the critical code. While we do have some unit tests at the moment, they are ad-hoc and partly unfinished. This bounty is for someone to check the existing tests and move over old ones to jUnit, automate their execution, extend them to provide better code coverage, and publish the report online. Its a massive effort, but can be broken down into phases, listed below (phase 2 must occur first, but further phases may happen in any order). As this needs some reading of code, it is the best start point for new devs to get a good overview of I2P code and coding. A good job for college students, interns or anyone who is just interested.
id: Untuk meningkatkan perawatan I2P, kami ingin memiliki seperangkat padat unit test otomatis yang solid untuk kode-kode penting. Walau kami memiliki beberapa unit test pada saat ini, mereka bersifat ad hoc dan sebagian belum selesai. Bounty ini untuk memeriksa tes yang suadah ada dan memindahkan versi lama ke jUnit, mengotomatisasi eksekusinya, memperpanjang mereka untuk menyediakan cakupan kode yang lebih baik, dan menerbitkan laporan online. Ini adalah upaya besar-besaran, tapi dapat dipecah menjadi fase-fase yang tercantum di bawah ini (Tahap 2 harus dilakukan pertama kali, tetapi fase lebih lanjut mungkin dilakukan dalam urutan apapun). Karena ini membutuhkan membaca kode, ini titik mulai terbaik pengembang baru untuk mendapatkan gambaran yang baik tentang kode I2P dan pengkodean. Pekerjaan yang baik untuk mahasiswa, magang, atau siapa saja yang tertarik.
ru: Чтобы улучшить удобство эксплуатации I2P нам необходим набор автоматизированных юнит тестов для критичного кода. На данный момент у нас есть несколько юнит тестов, они специфичны и частично не закончены. Эту награду получить тот, кто проверить имеющиеся тесты и переведет старые тесты на jUnit, автоматизирует их выполнение, расширит их для покрытия большей части кода, и опубликует отчеты. Это большой фронт работ, но его можно разбить на фазы, перечисленные ниже (фаза 2 должна завершиться раньше, а последующий фазы могут идти в любом порядке). Так как для этого нужно читать код, это будет лучшим начинанием для новых разработчиков, и позволит хорошо вникнуть в код и разработку I2P. Это замечательная работа для студентов, интернов и для всех, кто заинтересован.

source: Take care! Jobs and bounties shuffled a bit! Phase 6,7 and 8 are still open!
id: Sampai jumpa! Pekerjaan dan bounty dikocok sedikit! Fase 6,7 dan 8 masih terbuka!
ru: Будьте внимательны! Работа и награды были немного перемешаны! Фазы 6, 7 и 8 все еще открыты!

source: Phase %(phase)s:
id: Fase %(phase)s:
ru: Фаза %(phase)s:

source: CI jenkins and IRC bot
id: CI jenkins dan IRC bot
ru: CI jenkins и IRC bot

source: server runs and this section is blocked
id: Operasi server dan bagian ini diblokir
ru: сервер запущен и этот раздел заблокирован

source: To collect this bounty, a continuous integration server (Jenkins, old name was Hudson) must be set up and a connected IRC bot needs to set up in the channel #i2p-dev on IRC2p network to print out results of build tests.<br> The server needs to be run long term.
id: Untuk menerima bounty ini, integrasi server berkesinambungan (Jenkins, nama lamanya adalah Hudson) harus ditetapkan dan IRC bot perlu terhubung di channel #i2p-dev di jaringan IRC2p untuk mencetak hasil build test.<br>Server perlu dijalankan jangka panjang.
ru: Чтобы получить эту награду, должен быть установлен сервер непрерывной интеграции (Jenkins, старое название Hudson), также должен быть установлен IRC bot и подключен к каналу #i2p-dev в сети IRC2p для вывода результатов тестов сборки.<br> Сервер должен быть запущен на продолжительное время.

source: Check existing SDK tests
id: Periksa tes SDK yang ada
ru: Тесты проверки существующего SDK

source: paid to str4d
id: dibayar kepada str4d
ru: выплачено str4d

source: To collect this bounty, the existing SDK tests must be checked and made to work again. The need to be integrated into the ant build scripts ("ant test"), and tied in with a code coverage tool (e.g. <a href="%(clover)s">Clover</a>). The ant script must be capable of generating test status results as a web page, which will be published online.
id: Untuk mendapat bounty ini, tes SDK yang ada harus diperiksa dan dibuat untuk berfungsi lagi. Kebutuhan untuk diintegrasikan ke dalam skrip ant build ("ant test"), dan diikat dengan code coverage tool (misalnya <a href="%(clover)s">Clover</a> ). Ant script harus mampu menghasilkan hasil uji status sebagai halaman web, yang akan dipublikasikan secara online.
ru: Чтобы получить эту награду нужно проверить имеющийся SDK и заставить его работать. Нужно интегрировать в скрипты ant ("ant test"), и увязать с утилитой покрытия кода (например, <a href="%(clover)s">Clover</a>). Скрипт ant должен уметь генерировать результаты тестирования в виде веб-страницы, которая будет опубликована в сети.

source: SDK test coverage
id: Cakupan tes SDK
ru: Покрытие тестами SDK

source: paid to unittests dev team
id: Dibayar kepada tim dev unittests
ru: выплачено команде разработчиков юнит тестов

source: To collect this bounty, the automated unit tests of the SDK (i2p/core/java/src) must work again.
id: Untuk mendapat bounty ini, unit tes otomatis SDK (i2p / core / java / src) harus berfungsi kembali.
ru: Для выплаты этой награды автоматизированные юнит тесты SDK (i2p/core/java/src) должны опять заработать.

source: Router test migration
id: Migrasi tes router
ru: Тест миграции маршрутизатора

source: As with phase 2, the existing unit tests for the router must be moved over to the automated system.
id: Seperti fase 2, unit test yang ada untuk router harus dipindahkan ke sistem otomatis.
ru: В фазе 2, существующий юнит тесты маршрутизатора должны быть перемещены в автоматизированную систему.

source: Router test coverage
id: Cakupan tes router
ru: Покрытие тестами маршрутизатора

source: To collect this bounty, the automated unit tests of the router (i2p/router/java/src) must work again.
id: Untuk mendapat bounty ini, unit tes otomatis untuk router (i2p / router / java / src) harus berfungsi kembali.
ru: Для выплаты этой награды автоматизированные юнит тесты маршрутизатора (i2p/router/java/src) должны опять заработать.

source: Streaming lib tests
id: Tes streaming lib
ru: Тесты потоковой библиотеки

source: To collect this bounty, a new set of unit tests must meet a measured code coverage of 90&#37; of the streaming lib (i2p/apps/ministreaming/ and i2p/apps/streaming/).
id: Untuk mendapat bounty ini, serangkaian tes unit baru harus memenuhi cakupan kode terukur dari 90&#37; streaming lib (i2p / apps / ministreaming / dan i2p / apps / streaming /).
ru: Чтобы получить эту награду, новый набор юнит тестов должен соответствовать измеренному покрытию кода 90&#37; потоковой библиотеки (i2p/apps/ministreaming/ и i2p/apps/streaming/).

source: Unit tests coverage
id: cakupan tes unit
ru: Покрытие юнит тестами

source: To collect this bounty, all above unit tests must meet the 100&#37; coverage marker (except for log statements).
id: Untuk mendapat bounty ini, semua unit tes di atas harus memenuhi cakupan 100&#37; (kecuali untuk pernyataan log).
ru: Чтобы получить эту награду, все вышеперечисленные юнит тесты должны соответствовать маркеру покрытия 100&#37; (исключая блок логирования)

source: MultiRouter simulation
id: Simulasi MultiRouter
ru: Симуляция MultiRouter

source: will be split in more sub-tasks
id: akan dibagi lagi dalam sub-tugas
ru: будет разбито на несколько подзадач

source: To collect this bounty, the existing in-memory multi-router simulation must be checked, made work again and extend to simulate lots of routers in memory on a single machine. This bounty will be split in more fine grained subworks.
id: Untuk mendapat bounty ini, simulasi multi-router dalam memori yang ada saat ini harus diperiksa, dikerjakan kembali dan diperluas untuk mensimulasikan banyak router dalam memori pada satu mesin. Bounty ini akan dibagi dalam subwork yang lebih detail.
ru: Чтобы получить эту награду не жно проверить работу симулятора мульти-маршрутизатора, работающего в памяти, заставить его снова работать и расширить симуляцию на множество маршрутизаторов в памяти на одном компьютере. Награда будет разбита на несколько более мелких подзадач.

source: Judge on all these works is the donor and donor decides if a phase is called succesfull done and money can be paid.
id: Hakim atas semua pekerjaan ini adalah donor dan donor memutuskan apakah sebuah fase disebut berhasil dan uang dapat dibayarkan.
ru: Судит все это donor, и donor решает завершена ли фаза удачно и нужно ли выплатить деньги.

source: Bounty I2P vuze plugin
id: Bounty plugin I2P vuze
ru: Награда за I2P плагин vuze

source: vuze plugin
id: plugin vuze
ru: плагин vuze

source: To improve I2P usage and attract more people into I2P torrent P2P I setout the bounty for a working I2P vuze plugin. The plugin needs to be official and submitted to vuze for publication on their webpage/repository for plugins. It should be easy to install and configured, work smooth and flawless. Configuration should be friendly to starters and made easy to be anonymous. It should work with *.b32.i2p destinations as with signed (516++ bits) destinations.
id: Untuk meningkatkan penggunaan I2P dan menarik lebih banyak orang menggunakan I2P torrent P2P, saya menetapkan bounty untuk plugin I2P vuze yang berfungsi. Plugin perlu menjadi resmi dan diserahkan ke vuze untuk dipublikasikan di halaman web / repositori mereka untuk plugin. Ini harus mudah diinstall dan dikonfigurasi, bekerja mulus dan tanpa cela. Konfigurasi harus mudah untuk pemula dan mudah menjadi anonim. Ini harus berfungsi dengan destinasi * .b32.i2p seperti destinasi (516++ bits) yang ditandatangani.
ru: Чтобы улучшить использование I2P и привлечь больше людей в P2P торрент сеть I2P, я назначил эту награду за работающий плагин vuze I2P. Плагин должен быть официальным и предоставлен для публикации на веб-странице и в хранилище плагинов vuze. Он должен легко устанавливаться и настраиваться, работать без сучка без задоринки. Настройка должна быть понятна новичку, и поддерживать анонимность. Он должен работать с адресами *.b32.i2p и с подписанными (516++ bits) пунктами назначения.

source: Application Development
id: Pengembangan Aplikasi
ru: Разработка приложений

source: May 2013
id: Mei 2013
ru: Май 2013

source: Why write I2P-specific code?
id: Mengapa menulis kode khusus I2P?
ru: Зачем писать код под I2P?

source: Important concepts
id: Konsep-konsep penting
ru: Важные понятия

source: Development options
id: Opsi pengembangan
ru: Варианты развития

source: Start developing - a simple guide
id: Mulai mengembangkan - panduan sederhana
ru: Начни разработку - простой путеводитель

source: There are multiple ways to use applications in I2P. Using <a href="%(i2ptunnel)s">I2PTunnel</a>, you can use regular applications without needing to program explicit I2P support. This is very effective for client-server scenario's, where you need to connect to a single website. You can simply create a tunnel using I2PTunnel to connect to that website, as shown in <a href="#tunnel.serverclient">Figure 1</a>.
id: Ada beberapa cara untuk menggunakan aplikasi di dalam I2P. Menggunakan <a href="%(i2ptunnel)s">I2PTunnel</a>, anda dapat menggunakan aplikasi biasa tanpa perlu untuk program dukungan eksplisit I2P. Hal ini sangat efektif untuk skenario client-server, di mana anda perlu untuk menghubungkan ke satu situs web. Anda hanya perlu membuat sebuah tunnel dengan menggunakan I2PTunnel untuk menyambung ke situs web, seperti yang ditunjukkan di dalam <a href="#tunnel.serverclient">gambar 1</a>.
ru: Есть несколько способов использования приложений в I2P. С <a href="%(i2ptunnel)s">I2PTunnel</a> вы можете использовать обычные приложения, которые не поддерживают I2P. Это очень полезно для схемы клиент-сервер, когда вам нужно подключиться к одному веб-сайту. Вы можете просто создать туннель, используя I2PTunnel, чтобы подключиться к этому веб-сайту, как показано на рисунке <a href="#tunnel.serverclient">Figure 1</a>.

source: If your application is distributed, it will require connections to a large amount of peers. Using I2PTunnel, you will need to create a new tunnel for each peer you want to contact, as shown in <a href="#tunnel.peertopeer">Figure 2</a>. This process can of course be automated, but running a lot of I2PTunnel instances creates a large amount of overhead. In addition, with many protocols you will need to force everyone to use the same set of ports for all peers - e.g. if you want to reliably run DCC chat, everyone needs to agree that port 10001 is Alice, port 10002 is Bob, port 10003 is Charlie, and so on, since the protocol includes TCP/IP specific information (host and port).
id: Jika aplikasi anda terdistribusikan, itu akan memerlukan koneksi ke sejumlah besar peer. Dengan menggunakan I2PTunnel, anda akan perlu untuk menciptakan sebuah terowongan baru untuk setiap peer yang anda ingin hubungi, seperti ditunjukkan pada <a href="#tunnel.peertopeer">gambar 2</a>. Proses ini tentu akan otomatis, tetapi menjalankan banyak sesi I2PTunnel menciptakan sejumlah besar overhead. Selain itu, dengan banyak protokol, anda akan perlu untuk memaksa semua orang untuk menggunakan port yang sama untuk semua rekan - misalnya jika anda ingin untuk dapat menjalankan DCC chat dengan reliabel, setiap orang harus setuju bahwa port 10001 adalah Alice, port 10002 adalah Bob, port 10003 adalah Charlie, dan seterusnya, karena setiap protokol mencakup informasi spesifik TCP/IP (host dan port).
ru: Если ваше приложение распределенное, ему придется подключаться к большому количеству узлов. Используя I2PTunnel, вам придется создавать новый туннель для каждого узла, с которым вы хотите взаимодействовать, как показано на <a href="#tunnel.peertopeer">Figure 2</a>. Конечно, этот процесс можно автоматизировать, но запуск большого количества экземпляров I2PTunnel создает большую нагрузку. Кроме того, с большим количеством протоколов, вам придется заставить всех использовать один порт для всех узлов, т.к., если вы хотите использовать DCC чат, то все должны согласиться, что порт 10001 - это Alice, порт 10002 - Bob, порт 10003 - Charlie, и т.д., т.к. протокл содержит специфичную для TCP/IP информацию (хост и порт).

source: General network applications often send a lot of additional data that could be used to identify users. Hostnames, port numbers, time zones, character sets, etc. are often sent without informing the user. As such, designing the network protocol specifically with anonymity in mind can avoid compromising user identities.
id: Aplikasi jaringan umum sering mengirim banyak data tambahan yang dapat digunakan untuk mengidentifikasi pengguna. Nama host, nomor port, zona waktu, rangkaian karakter, dll sering dikirim tanpa memberitahu pengguna. Dengan demikian, merancang protokol jaringan khusus dengan anonimitas dalam dapat menghindari mengorbankan identitas pengguna.
ru: Типичное сетевое приложение часто отсылает кучу дополнительных данных, которые могут быть использованы для идентификации пользователей. Имена компьютеров, номера портов, временные зоны, наборы символов, и т.д. часто отсылаются без уведомления пользователя. Поэтому, проектирование сетевого протокола, поддерживающего анонимность, поможет избежать нарушения идентификации пользователя.

source: There are also efficiency considerations to review when determining how to interact on top of I2P. The streaming library and things built on top of it operate with handshakes similar to TCP, while the core I2P protocols (I2NP and I2CP) are strictly message based (like UDP or in some instances raw IP). The important distinction is that with I2P, communication is operating over a long fat network - each end to end message will have nontrivial latencies, but may contain payloads of up to several KB. An application that needs a simple request and response can get rid of any state and drop the latency incurred by the startup and teardown handshakes by using (best effort) datagrams without having to worry about MTU detection or fragmentation of messages.
id: Ada juga pertimbangan efisiensi untuk meninjau saat menentukan bagaimana berinteraksi di atas I2P. Streaming library dan hal-hal yang dibangun di atasnya beroperasi dengan hanshake yang mirip dengan TCP, sedangkan protokol inti I2P (I2NP dan I2CP) secara ketat berbasis pesan (seperti UDP atau dalam beberapa hal adalah raw IP). Perbedaan penting adalah bahwa dengan I2P, komunikasi beroperasi melalui jaringan tebal yang panjang - setiap ujung ke ujung pesan akan memiliki latency yang trivial, namun mungkin berisi muatan sampai beberapa KB. Aplikasi yang membutuhkan permintaan dan respons sederhana dapat menyingkirkan keadaan apa pun dan menghentikan latensi yang terjadi oleh hanshake oleh startup dan teardown dengan menggunakan datagrams (upaya terbaik) tanpa harus khawatir dengan deteksi MTU atau fragmentasi pesan.
ru: Также нужно рассмотреть вопросы эффективности при определении способов взаимодействия на верхнем уровне I2P. Потоковая библиотека и вещи, основанные на ней, используют процедуру handshake, подобную TCP, в то время как базовые протоколы I2P (I2NP и I2CP) жестко завязаны на сообщения (как UDP или некоторые версии raw IP). Важным отличием I2P является то, что связь устанавливается над большой разнорожной сетью - каждое сообщение будет иметь нетривиальные задержки, хотя его размер может быть всего несколько килобайт. Приложение, которому нужен простой запрос и ответ, может избавиться от любого состояния и отбросить задержку, установленную во время запуска, и игнорировать handshake, используя (в лучшем случае) дейтаграммы, не беспокоясь об определении MTU или фрагментации сообщений.

source: Creating a server-client connection using I2PTunnel only requires creating a single tunnel.
id: Membuat koneksi server-client menggunakan I2PTunnel hanya membutuhkan pembuatan tunnel tunggal.
ru: Для создания подключения клиент-сервер при использовании I2PTunnel нужно создать всего лишь один туннель.

source: Figure 1:
id: Gambar 1:
ru: Рисунок 1:

source: Setting up connections for a peer-to-peer applications requires a very large amount of tunnels.
id: Setting koneksi untuk aplikasi peer-to-peer memerlukan sejumlah tunnel yang sangat besar.
ru: Установка соединения для приложений точка-точка требует большого количества туннелей.

source: Figure 2:
id: Gambar 2:
ru: Рисунок 2:

source: In summary, a number of reasons to write I2P-specific code:
id: Singkatnya, sejumlah alasan untuk menulis kode khusus I2P adalah:
ru: Итого, причины для написания кода под I2P:

source: Creating a large amount of I2PTunnel instances consumes a non-trivial amount of resources, which is problematic for distributed applications (a new tunnel is required for each peer).
id: Membuat sejumlah besar instance dari I2PTunnel mengkonsumsi sejumlah sumber daya non-trivial, yang bermasalah untuk aplikasi terdistribusi (tunnel baru diperlukan untuk setiap peer).
ru: Для создание большого количества экземпляров I2PTunnel требуется нетривиальное количество ресурсов, что проблематично для распределенных приложений (новый туннель требуется для каждого узла).
