Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: There used to be a simple "ministreaming" library, but now ministreaming.jar contains only the interfaces for the full streaming library.
id: Dulu ada sebuah library sederhana bernama "ministreaming", tetapi sekarang ministreaming.jar berisi hanya interface untuk streaming library penuh.
ru: Раньше была простая библиотека "ministreaming", но теперь ministreaming.jar содержит только интерфейс к полной потоковой библиотеке.

source: Datagrams
id: Datagram
ru: Дейтаграммы

source: Recommended for UDP-like applications
id: Direkomendasikan untuk aplikasi seperti UDP
ru: Рекомендовано для UDP-подобных приложений

source: The <a href="%(datagrams)s">Datagram library</a> allows sending UDP-like packets. It's possible to use:
id: <a href="%(datagrams)s">library datagram </a> memungkinkan pengiriman paket seperti UDP. Hal ini dimungkinkan untuk digunakan:
ru: <a href="%(datagrams)s">Библиотека дейтаграмм</a> позволяет отсылать UDP-подобные пакеты. Можно использовать:

source: Repliable datagrams
id: Datagram repliable
ru: Дейтаграммы с возможностью ответа

source: Raw datagrams
id: Datagram mentah
ru: Raw дейтаграммы

source: Not recommended
id: Tidak direkomendasikan
ru: Не рекомендовано

source: <a href="%(i2cp)s">I2CP</a> itself is a language independent protocol, but to implement an I2CP library in something other than Java there is a significant amount of code to be written (encryption routines, object marshalling, asynchronous message handling, etc). While someone could write an I2CP library in C or something else, it would most likely be more useful to use the C SAM library instead.
id: <a href="%(i2cp)s">I2CP</a> sendiri adalah bahasa protokol independen, tapi mengimplementasikan library I2CP di sesuatu selain Java berarti ada sejumlah besar kode yang akan ditulis (encription routines, object marshalling, asynchronous message handling, dll). Sementara seseorang bisa menulis sebuah library I2CP di bahasa C atau yang lain, kemungkinan akan lebih berguna untuk menggunakan library C SAM sebagai gantinya.
ru: Сам по себе <a href="%(i2cp)s">I2CP</a> это независящий от протокола язык, но нужно написать тонну кода, чтобы внедрить библиотеку I2CP в отличный от Java язык (подпрограммы шифрования, сортировка объектов, асинхронная обработка сообщений, и т.д.). Если бы кто-то смог написать библиотеку I2CP на C или чем-то еще, было бы удобнее использовать вместо этого C библиотеку SAM.

source: Web Applications
id: Aplikasi Web
ru: Веб приложения

source: I2P comes with the Jetty webserver, and configuring to use the Apache server instead is straightforward. Any standard web app technology should work.
id: I2p dilengkapi dengan Jetty webserver, dan mengkonfigurasi menggunakan Apache server adalah hal yang 'mudah. Teknologi aplikasi web standar apapun seharusnya berfungsi.
ru: I2P поставляется с веб-сервером Jetty, но проще вместо этого использовать сервер Apache. Любая стандартная веб-технология должна работать.

source: Developing using I2P requires a working I2P installation and a development environment of your own choice. If you are using Java, you can start development with the <a href="#start.streaming">streaming library</a> or datagram library. Using another programming language, SAM or BOB can be used.
id: Mengembangkan penggunaan I2P memerlukan pengembangan instalasi I2P dan lingkungan pengembangan pilihan Anda sendiri. Jika anda menggunakan Java, anda dapat memulai pengembangan dengan <a href="#start.streaming">streaming library</a> atau datagram library. bahasa pemrograman lain, seperti SAM atau BOB, dapat digunakan.
ru: Для разработки I2P необходима работающая установка I2P и среда разработки на ваш выбор. Если вы используете Java, вы можете начать разработку с <a href="#start.streaming">потоковой библиотекой</a> или библиотекой дейтаграмм. Для другого языка программирования можно использовать SAM или BOB.

source: Developing with the streaming library
id: Mengembangkan dengan streaming library
ru: Разработка с потоковой библиотекой

source: The following example shows how to create TCP-like client and server applications using the streaming library.
id: Contoh berikut menunjukkan cara membuat aplikasi klien dan server seperti TCP yang menggunakan streaming library.
ru: Следующий пример показывает как создать TCP-подобные приложения клиент и сервер, используя потоковую библиотеку.

source: This will require the following libraries in your classpath:
id: Ini akan membutuhkan library berikut di classpath anda:
ru: Для этого потребуются следующие библиотека в вашем classpath:

source: The streaming library itself
id: Streaming library itu sendiri
ru: Сама потоковая библиотека

source: Factory and interfaces for the streaming library
id: Mengembangkan untuk streaming library
ru: Фабрика или интерфейс к потоковой библиотеке

source: Standard I2P classes, data structures, API, and utilities
id: Standar I2P kelas, struktur data, API, dan utilities
ru: Стандартные классы I2P, структуры данных, API и утилиты

source: You can fetch these from an I2P installation, or add the following dependencies from Maven Central:
id: Anda dapat mengambil library tersebut dari sebuah instalasi I2P, atau menambahkan dependency dari Maven Central:

source: Network communication requires the usage of I2P network sockets. To demonstrate this, we will create an application where a client can send text messages to a server, who will print the messages and send them back to the client. In other words, the server will function as an echo.
id: Jaringan komunikasi memerlukan penggunaan I2P soket jaringan. Untuk menunjukkan hal ini, kita akan menciptakan sebuah aplikasi di mana klien dapat mengirim pesan teks ke server, yang akan mencetak pesan dan mengirim mereka kembali ke klien. Dengan kata lain, server akan berfungsi sebagai gema.
ru: Для сетевого подключения нужно использовать сетевые сокеты I2P. Чтобы продемонстрировать это, мы создадим приложение, в котором клиент может отослать текстовое сообщение на сервер, которые напечатает сообщение и отправит его обратно клиенту. Другими словами, сервер будет работать как эхо.

source: We will start by initializing the server application. This requires getting an I2PSocketManager and creating an I2PServerSocket. We will not provide the I2PSocketManagerFactory with the saved keys for an existing Destination, so it will create a new Destination for us. So we will ask the I2PSocketManager for an I2PSession, so we can find out the Destination that was created, as we will need to copy and paste that information later so the client can connect to us.
id: Kita akan mulai dengan inisialisasi aplikasi server. Hal ini memerlukan I2PSocketManager dan menciptakan I2PServerSocket. Kami tidak akan memberikan I2PSocketManagerFactory dengan key yang disimpan untuk destinasi yang ada, sehingga ini akan menciptakan destinasi baru untuk kita. Jadi kita akan meminta I2PSocketManager untuk sebuah I2PSession, sehingga kita bisa mengetahui destinasi yang telah dibuat, karena kita perlu copy dan paste informasi itu nanti sehingga klien bisa terhubung dengan kita.
ru: Начнем с инициализации серверного приложения. Для этого нужно получить I2PSocketManager и создать I2PServerSocket. Мы не передадим в I2PSocketManagerFactory сохраненные ключи для существующего пункта назначения, т.о. он создаст для нас новый пункт назначения. Вобщем мы запросим I2PSession у I2PSocketManager, и выясним что за пункт назначения был создан, т.к. нам нужно скопировать и вставить эту информацию позже, чтобы клиент к нам мог подключиться.

source: Code example 1: initializing the server application.
id: Contoh kode 1: inisialisasi aplikasi server.
ru: Пример кода 1: инициализация серверного приложения.

source: Once we have an I2PServerSocket, we can create I2PSocket instances to accept connections from clients. In this example, we will create a single I2PSocket instance, that can only handle one client at a time. A real server would have to be able to handle multiple clients. To do this, multiple I2PSocket instances would have to be created, each in separate threads. Once we have created the I2PSocket instance, we read data, print it and send it back to the client. The bold code is the new code we add.
id: Setelah kita memiliki I2PServerSocket, kita dapat membuat seuah instance I2PSocket untuk menerima koneksi dari klien. Untuk contoh ini, kita akan membuat sebuat I2P socket instance yang hanya mampu menangani satu client dalam satu waktu. Server harus dapat menangani beberapa klien. Untuk melakukan ini, beberapa instance I2PSocket harus dibuat, masing-masing di thread terpisah. Setelah kita telah membuat instance I2PSocket, kita membaca data, mencetaknya dan mengirimkannya kembali kepada klien. Kode yang ditebalkan adalah kode baru yang kami tambah.
ru: Поскольку у нас есть I2PServerSocket, мы можем создать экземпляр I2PSocket для приема подключений клиентов. В этом примере мы создадим один экземпляр I2PSocket, который может обработать за раз только одного клиента. Реальный сервер может обработать несколько клиентов. Для этого нужно создать несколько экземпляров I2PSocket, каждый в отдельном потоке. Как только мы создали экземпляр I2PSocket, мы читаем данные, печатаем их и отправляем обратно клиенту. Жирным выделен добавленный нами код.

source: Code example 2: accepting connections from clients and handling messages.
id: Contoh kode 2: menerima koneksi dari klien dan menangani pesan.
ru: Пример кода 2: прием подключений клиентов и обработка сообщений.

source: When you run the above server code, it should print something like this (but without the line endings, it should just be one huge block of characters):
id: Ketika anda menjalankan kode server di atas, itu harus mencetak sesuatu seperti ini (namun tanpa akhiran garis, itu hanya harus satu blok besar karakter):
ru: Когда вы выполните описанный выше код, он должен будет напечатать что-то вроде этого (только без символов окончания строки, должен быть всего лишь один большой блок символов):

source: This is the base64-representation of the server Destination. The client will need this string to reach the server.
id: Ini adalah representasi base64 dari destinasi server. Klien akan membutuhkan string ini untuk mencapai server.
ru: Это base64 представление серверного пункта назначения. Клиенту понадобится эта строка, чтобы достучаться до сервера.

source: Now, we will create the client application. Again, a number of steps are required for initialization. Again, we will need to start by getting an I2PSocketManager. We won't use an I2PSession and an I2PServerSocket this time. Instead, we will use the server Destination string to start our connection. We will ask the user for the Destination string, and create an I2PSocket using this string. Once we have an I2PSocket, we can start sending and receiving data to and from the server.
id: Sekarang, kita akan menciptakan aplikasi klien. Sekali lagi, sejumlah langkah-langkah diperlukan untuk inisialisasi. Sekali lagi, kita akan perlu memulai dengan mendapatkan I2PSocketManager. Kita tidak akan menggunakan I2PSession dan I2PServerSocket saat ini. Sebaliknya, kita akan menggunakan server Destination string untuk memulai koneksi. Kami akan meminta pengguna untuk destination string, dan menciptakan I2PSocket menggunakan string ini. Setelah kita memiliki I2PSocket, kita bisa mulai mengirim dan menerima data ke dan dari server.
ru: Теперь создадим клиентское приложение. И опять, для инициализации понадобятся несколько шагов. Также нам нужно начать с получения I2PSocketManager. Теперь мы не будем использовать I2PSession и I2PServerSocket. Вместо этого мы используем строку пункта назначения сервера чтобы начать соединение. Мы запросим у пользователя строку пункта назначения, и создадим I2PSocket, используя эту строку. Ну, и т.к. у нас есть I2PSocket, мы можем начать отправку и получение данных с сервера.

source: Code example 3: starting the client and connecting it to the server application.
id: Kode contoh 3: mulai klien dan menghubungkannya ke aplikasi server.
ru: Пример кода 3: запуск клиента и подключение к приложению сервера.

source: Finally, you can run both the server and the client application. First, start the server application. It will print a Destination string (like shown <a href="#start.streaming.destination">above</a>). Next, start the client application. When it requests a Destination string, you can enter the string printed by the server. The client will then send 'Hello I2P!' (along with a newline) to the server, who will print the message and send it back to the client.
id: Akhirnya, anda bisa menjalankan server dan aplikasi klien. Pertama, jalankan aplikasi server. Ini akan mencetak string destination (seperti yang ditunjukkan di <a href="#start.streaming.destination">atas</a> ). Selanjutnya, mulai aplikasi klien. Ketika itu meminta serangkaian destinsi, anda dapat memasukkan string yang dicetak oleh server. Klien kemudian akan mengirimkan 'Halo I2P!' (bersama dengan sebuah newline) ke server, yang akan mencetak pesan dan mengirimnya kembali ke klien.
ru: Наконец-то, мы можем запустить приложения клиента и сервера. Сначала запускаем серверное приложение. Оно напечатает строку пункта назначения (как показано <a href="#start.streaming.destination">выше</a>). Затем запускаем клиентское приложение. Когда оно запросит строку пункта назначения, вы можете ввести строку, напечатанную сервером. Клиент отправит 'Hello I2P!' (с переводом строки) на сервер, который напечатает сообщение и отправит его обратно клиенту.

source: Congratulations, you have successfully communicated over I2P!
id: Selamat, Anda telah berhasil berkomunikasi melalui I2P!
ru: Поздравляем, вы успешно подключились через I2P!

source: Existing Applications
id: Aplikasi yang sudah ada
ru: Существующие приложения

source: Contact us if you would like to contribute.
id: Hubungi kami jika anda ingin berkontribusi
ru: Свяжитесь с нами, если вы ходит сотрудничать.

source: Application Ideas
id: Ide-ide aplikasi
ru: Идеи приложений

source: NNTP server - there have been some in the past, none at the moment
id: NNTP server - ada beberapa di masa lalu, tidak ada ada saat
ru: NNTP сервер - это было в прошлом, не сейчас

source: Jabber server - there have been some in the past, and there is one at the moment, with access to the public internet
id: Jabber server - ada beberapa di masa lalu, dan ada satu saat ini, dengan akses ke internet publik
ru: Jabber сервер - что-то в прошлом было, и сейчас есть один, с доступом к публичному internet

source: PGP Key server and/or proxy
id: PGP key server dan/atau proxy
ru: PGP Key сервер и/или прокси

source: Content Distribution / DHT applications - resurrect feedspace, port dijjer, look for alternatives
id: Distribusi Konten / aplikasi DHT - membangkitkan feedspace, port dijjer, mencari beberapa alternatif
ru: Распределение контента / DHT приложения - воскрешение feedspace, портирование dijjer, ищем альтернативы

source: Help out with <a href="http://syndie.i2p2.de/">Syndie</a> development
id: Membantu dengan pengembangan <a href="http://syndie.i2p2.de/">Syndie</a>
ru: Помощь в разработке <a href="http://syndie.i2p2.de/">Syndie</a>

source: Web-based applications - The sky is the limit for hosting web-server-based applications such as blogs, pastebins, storage, tracking, feeds, etc. Any web or CGI technology such as Perl, PHP, Python, or Ruby will work.
id: Aplikasi berbasis web - langit adalah batas untuk hosting berbasis aplikasi web-server seperti blog, pastebins, penyimpanan, pelacakan, feed, dll. Setiap web atau teknologi CGI seperti Perl, PHP, Python, atau Ruby akan berfungsi.
ru: Основанные на веб приложения - безграничные возможности для размещения web-server-based приложений, таких как блоги, записки, хранилище, отслеживание, фиды и т.д. Будет работать любая веб или CGI технология, такие как Perl, Python или Ruby.

source: Resurrect some old apps, several previously in the i2p source package - bogobot, pants, proxyscript, q, stasher, socks proxy, i2ping, feedspace
id: Membangkitkan beberapa apps lama, sebelumnya beberapa ada di dalam paket sumber i2p - bogobot, Celana, proxyscript, q, stasher, proxy kaus kaki, i2ping, feedspace
ru: Воскресить некоторые старые приложения, которые прежде были в пакете исходников I2P - bogobot, pants, proxyscript, q, stasher, socks proxy, i2ping, feedspace

source: I2P Developer's MTN Keys
id: MTN Key miik pengembang I2P
ru: Ключи I2P Developer's MTN

source: Monotone servers used by the I2P project require two types of keys to be used.
id: Monoton server yang digunakan oleh proyek I2P memerlukan dua jenis key.
ru: Для серверов Monotone, используемых в проекте I2P, нужно использовать два типа ключей.

source: <a href="#commit">Commit Keys</a> to sign changes checked-in to the respository; and
id: <a href="#commit">commit key</a> untuk menandatangani perubahan ke dalam ke respository; dan
ru: <a href="#commit">Commit Keys</a> для подписывания вносимых в репозиторий изменений; и

source: <a href="#transport">Transport Keys</a> to push changes to remote servers.
id: <a href="#transport">Transportasi key</a> untuk mendorong perubahan ke server jarak jauh.
ru: <a href="#transport">Transport Keys</a> для отправки изменений на удаленные сервера.

source: Everyone that uses Monotone to checkout the I2P codebase will need to <a href="%(monotone)s#obtaining-and-deploying-developers-keys">import</a> the developer commit keys, but only Monotone <a href="%(monotone)s#operating-a-monotone-server"> server operators</a> will need to import the <a href="#transport">transport keys</a>.
id: Setiap orang yang menggunakan Monotone untuk checkout basis kode I2P akan perlu untuk <a href="%(monotone)s#obtaining-and-deploying-developers-keys">mengimpor</a> developer commit key, tetapi hanya Monotone <a href="%(monotone)s#operating-a-monotone-server">operator server</a> akan perlu mengimpor <a href="#transport">transport key/a>.
ru: Все кто используют Monotone выборки данных из базы кодов I2P, должны <a href="%(monotone)s#obtaining-and-deploying-developers-keys">импортировать</a> commit keys разработчиков, но только <a href="%(monotone)s#operating-a-monotone-server"> операторы сервера</a> Monotone должны импортировать <a href="#transport">transport keys</a>.

source: Developer Commit keys
id: Developer Commit key
ru: Commit ключи разработчиков

source: Developer Transport Keys
id: Developer Transport Key
ru: Transport ключи разработчиков

source: <b>Note:</b> Transport keys are only needed for setting up a <a href="%(monotone)s#operating-a-monotone-server">Monotone server</a>.
id: <b>Catatan:</b> Transport key hanya diperlukan untuk menyiapkan <a href="%(monotone)s#operating-a-monotone-server">server monoton</a>.
ru: <b>Примечание:</b> Transport ключи нужны только для установки <a href="%(monotone)s#operating-a-monotone-server">Monotone server</a>.

source: License Agreements
id: Perjanjian lisensi
ru: Лицензионное соглашение

source: For more information see <a href="%(licenses)s">the licenses page</a>.
id: Untuk informasi lebih lanjut lihat <a href="%(licenses)s">halaman lisensi</a>.
ru: Более подробно смотри на <a href="%(licenses)s">странице лицензии</a>.

source: Following is a monotonerc file defining the current trust list. Developers must use this file in ~/.monotone/monotonerc or _MTN/montonerc in their i2p.i2p workspace.
id: Berikut ini adalah file monotonerc yang mendefinisikan trust list. Pengembang harus menggunakan file ini di ~/.monotone/monotonerc atau _MTN montonerc di workspace i2p.i2p mereka.
ru: Далее следует файл monotonerc, определяющий текущий лист доверия. Разработчики должи использовать этот файл в ~/.monotone/monotonerc или _MTN/montonerc в своем рабочем пространстве i2p.i2p.

source: Agreements
id: Perjanjian
ru: Соглашения

source: I2P Software Licenses
id: Lisensi Perangkat Lunak I2P
ru: Лицензии ПО I2P

source: As required by our <a href="%(threatmodel)s">threat model</a> (among other reasons), the software developed to support the anonymous communication network we call I2P must be freely available, open source, and user modifiable. To meet these criteria, we make use of a variety of legal and software engineering techniques so as to remove as many barriers to entry for those considering making use of or contributing to the I2P effort.
id: Seperti yang disyaratkan oleh <a href="%(threatmodel)s">ancaman model</a> kami (dan alasan-alasan lain), perangkat lunak yang dikembangkan untuk mendukung jaringan komunikasi anonim yang kita sebut I2P harus tersedia secara bebas, open source, dan dapat dimodifikasi oleh pengguna. Untuk memenuhi kriteria ini, kami membuat penggunaan berbagai hukum dan teknik rekayasa perangkat lunak untuk menghapus banyak hambatan bagi orang-orang mempertimbangkan menggunakan atau berkontribusi terhadap upaya I2P.
ru: Как того требует наша <a href="%(threatmodel)s">модель угроз</a> (наряду с другими причинами), ПО, разработанное для поддержки анонимной сети связи, которую мы называем I2P, должно быть свободно доступно, с открытым исходным кодом и изменяемым пользователем. Чтобы соответствовать этим требованиям, мы используем множество правовых техник и техник инженерии ПО, чтобы устранить как можно больше барьеров для подключения тех, кто рассматривает возможность использовать или способствует развитию I2P.

source: While the information below may be more confusing than just simply stating "I2P is BSD", "I2P is GPL", or "I2P is public domain", the short answer to the question "How is I2P licensed?" is this:
id: Sementara informasi di bawah ini mungkin lebih membingungkan daripada hanya menyatakan "I2P adalah BSD", "I2P adalah GPL", atau "I2P adalah domain publik", jawaban pendek dari pertanyaan "bagaimana I2P berlisensi?" adalah ini:
ru: Т.к. информация, представленная ниже, может быть более запутанно, чем простые утверждения "I2P это BSD", "I2P это GPL", или "I2P это публичный домен", то приведем короткий ответ на вопрос "Как лицензируется I2P?":

source: All software bundled in the I2P distributions will allow:
id: Semua perangkat lunak di I2P didistribusikan:
ru: Все ПО, включенное в поставку I2P, позволяет:

source: use without fee
id: penggunaan tanpa biaya
ru: пользоваться бесплатно

source: use with no restrictions on how, when, where, why, or by whom is running it
id: penggunaan dengan tidak ada pembatasan pada bagaimana, kapan, di mana, mengapa, atau oleh siapa yang menjalankannya
ru: пользоваться без ограничений как, когда, где, почему или кем оно запущено

source: access to the source code without fee
id: akses ke kode sumber tanpa biaya
ru: получать доступ к исходникам бесплатно

source: modifications to the source
id: Modifikasi source code
ru: изменять исходный код
