Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: As long as there were no errors&hellip;Congratulations! You have successfully updated to the latest I2P sources. They should be ready to compile.
id: Selama tidak ada error &hellip; Selamat! Anda telah berhasil update ke source code I2P terbaru. Kode tersebut seharusnya siap dikompilasi
ru: Т.к. ошибок нет&hellip;Поздравляем! Вы успешно обновились до последних исходников I2P. Они готовы для компиляции.

source: Obtaining and deploying developers' transport keys
id: Mendapatkan dan menerapkan transport key milik pengembang
ru: Получение и применение transport ключей разработчиков

source: As a server operator you may want to grant push access to certain developers.
id: Sebagai operator server, anda mungkin ingin memberikan akses push ke pengembang tertentu.
ru: Как оператор сервера вы можете захотеть наделить некоторых разработчиков правом размещения.

source: By default the Monotone server denies all access.
id: Secara default, server Monotone menolak semua akses.
ru: По умолчанию сервер Monotone запрещает любой доступ.

source: To grant pull access to all clients, set the following in
id: Untuk memberikan akses pull ke semua klien, tetapkan hal berikut di
ru: Чтобы дать право извлечения всем клиентам, установите следующее в

source: No one will not be able to push code to your server without permission being explicitly granted. To grant push access:
id: Tidak ada yang tidak dapat mendorong kode ke server anda tanpa izin diberikan secara eksplisit. Memberikan akses push:
ru: Никто без явного наделения правами не сможет размещать код на вашем сервере. Чтобы разрешить доступ на размещение:

source: Add the name of the user's transport key to <code>$HOME/.monotone/write-permissions</code>, such as <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> with one key per line.
id: Tambahkan nama transport key milik pengguna ke <code>$HOME/.monotone/write-permissions</code> , seperti <pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> satu key per baris.
ru: Добавьте имена transport ключей пользователей в <code>$HOME/.monotone/write-permissions</code>, как это сделано для <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> с одним ключом на строке.

source: Import the transport key(s) into your database. The procedure for importing transport keys is the same as for importing commit keys, which is described in the section <a href="#obtaining-and-deploying-developers-keys">Obtaining and deploying developers' keys</a>.
id: Impor transport key ke database anda. Prosedur untuk mengimpor transportasi key sama dengan mengimpor commit key yang dijelaskan di bagian <a href="#obtaining-and-deploying-developers-keys">Memperoleh dan menerapkan kunci pengembang</a> .
ru: Импортируйте transport ключ(и) в вашу базу данных. Процедура для импорта transport ключей подобна импорту commit ключей, которая описана в разделе <a href="#obtaining-and-deploying-developers-keys">Получение и применение ключей разработчиков</a>.

source: A separate database should be used for your Monotone server because monotone will lock the database while it is served to others. Make a copy of your development database, then start the server with:
id: Database terpisah harus digunakan untuk server Monotone anda karena monotone akan mengunci database saat disajikan kepada orang lain. Buat salinan database pengembangan anda, lalu mulai server dengan:
ru: Для вашего сервера Monotone должна использоваться отдельная база данных, потому что Monotone блокирует базу данных пока она служит другим. Сделайте копию вашей разработческой базы данных, затем запустите сервер:

source: If your key is protected with a passphrase, Monotone may request the passphrase when the first client connects. You can work around this by connecting making the first client connection to your server (or by clearing the password for your transport key).
id: Jika kunci anda dilindungi dengan passphrase, Monotone mungkin meminta passphrase saat klien pertama terhubung Anda bisa mengatasinya dengan menghubungkan koneksi klien pertama ke server Anda (atau dengan menghapus password dari transport key anda).
ru: Если ваш ключ защищен паролем, Monotone запросит этот пароль когда подключится первый клиент. Вы можете обойти это, собственноручно выполнив первое подключения клиента к вашему серверу (или очистив пароль к вашему transport ключу).

source: For your server to be accessible for others over I2P, you will need to create a server tunnel for it. Use the "Standard" tunnel type and "Bulk" profile.
id: Supaya server anda agar dapat diakses orang lain dengan I2P, anda akan perlu untuk membuat server tunnel untuk itu. Gunakan jenis tunnel profil "Standar" dan "Bulk".
ru: Чтобы ваш сервер был доступен другим в сети I2P, для этого вам нужно создать серверный туннель. Используйте "Standard" тип туннеля и "Bulk" профиль.

source: Debian (amongst other distributions) has integrated Monotone into their framework of daemons/services. Although Monotone servers can still be run "the ordinary way" on Debian systems, doing it the "Debian way" may be more straightforward.
id: Debian (dan distro lain) telah mengintegrasi Monotone ke framework dari daemons/services mereka. Walau server Monotone masih dapat dijalankan dengan "cara yang biasa" pada sistem Debian, melakukan hal itu "Debian way" mungkin lebih mudah.
ru: В Debian (наряду с другими поставками) есть интегрированный в фреймворк демонов/сервисов Monotone. Также сервера Monotone можно запустить "обычным способом" на системах Debian, запуск в стиле "Debian" может быть более простым.

source: Permissions are granted by editing the files <code>/etc/monotone/read-permissions</code> and <code>/etc/monotone/write-permissions</code>. You'll also need to edit <code>/etc/default/monotone</code> to enable monotone to start at boot or to customize the host, port, or database location.
id: Permission diberikan dengan mengedit file <code>/etc/monotone/read-permissions</code> dan <code>/etc/monotone/write-permissions</code>. Anda juga perlu mengedit <code>/etc/default/monotone</code> untuk membuat monotone dimulai secara otomatis saat boot atau untuk menyesuaikan host, port, atau lokasi database.
ru: Разрешения выдаются редактированием файлов <code>/etc/monotone/read-permissions</code> и <code>/etc/monotone/write-permissions</code>. Вам также нужно отредактировать <code>/etc/default/monotone</code> чтобы включить запуск monotone при загрузке или изменить хост, порт, или расположение базы данных.

source: New Developer's Guide
id: Panduan Pengembang Baru
ru: Руководство Нового Разработчика

source: July 2018
id: Juli 2018

source: Basic study
id: Studi dasar
ru: Начальное изучение

source: Getting the I2P code
id: Cara mendapat source code I2P
ru: Получение кода I2P

source: The easy way: Git
id: Cara mudah: Git

source: The proper way: Monotone
id: Cara yang tepat: Monotone

source: Building I2P
id: Membangun I2P
ru: Сборка I2P

source: Development ideas
id: Ide pengembangan
ru: Идеи разработок

source: Making the results available
id: Membuat hasil tersedia
ru: Сделайте результат доступным

source: Get to know us!
id: Berkenalan dengan kami!
ru: Узнайте о нас!

source: Translations
id: Penerjemahan
ru: Переводы

source: Tools
id: Tool
ru: Средства

source: So you want to start work on I2P? Great! Here's a quick guide to getting started on contributing to the website or the software, doing development or creating translations.
id: Apakah anda ingin mulai mengembangkan I2P? Bagus! Berikut panduan cara cepat untuk memulai berkontribusi untuk website atau software, melakukan pengembangan, atau melakukan penerjemahan.
ru: Итак, вы хотите начать работать над I2P? Отлично! Вот краткое руководство для начала работы над веб-сайтом или ПО, разработки или создания переводов.

source: Not quite ready for coding? Try <a href="%(volunteer)s">getting involved</a> first.
id: Tidak siap menulis code pemograman? Coba baca <a href="%(volunteer)s">terlibat</a>.
ru: Не совсем готовы для написания кода? Попробуйте <a href="%(volunteer)s">поучаствовать</a> для начала.

source: Basic development on the I2P router or the embedded applications uses Java as the main development language. If you don't have experience with Java, you can always have a look at <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a>.
id: Dasar pengembangan pada I2P router atau aplikasi embedded menggunakan Java sebagai bahasa utama pengembangan. Jika anda tidak memiliki pengalaman dengan Java, anda dapat membaca <a href="http://www.mindview.net/Books/TIJ/">Berpikir dengan Java</a>.
ru: Основная разработка маршрутизатора I2P или встроенных приложений выполняется на Java, как главном языке разработки. Если у вас нет опыта с Java, вы всегда можете обратиться к <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a>.

source: Study the <a href="%(intro)s">how intro</a>, the <a href="%(docs)s">other "how" documents</a>, the <a href="%(techintro)s">tech intro</a>, and associated documents. These will give you a good overview of how I2P is structured and what different things it does.
id: Pelajari <a href="%(intro)s">how intro</a>, <a href="%(docs)s">other "how" documents</a>, <a href="%(techintro)s">tech intro</a>, dan dokumen lain yang terkait. Ini akan memberi anda pandangan sekilas yang baik tentang I2P terstruktur dan apa hal-hal yang berbeda.
ru: Изучите <a href="%(intro)s">how intro</a>, <a href="%(docs)s">другие "how" документы</a>, <a href="%(techintro)s">tech intro</a>, и связанные с ними документы. Это даст вам хороший обзор того, как устроен I2P и какие различные вещи он выполняет.

source: For development on the I2P router or the embedded applications, there are two ways to get the source code:
id: Untuk pengembangan I2P router atau embedded application, ada dua cara untuk mendapat source code-nya

source: Install <a href="%(git_url)s">Git</a>.
id: Instal <a href="%(git_url)s">Git</a>.

source: Get the code from <a href="%(i2p_git)s">the GitHub mirror</a>:
id: Ambil source code dari <a href="%(i2p_git)s">the GitHub mirror</a>:

source: Remarks
id: Catatan
ru: Примечания

source: The Git repository is currently a read-only mirror. If you wish to use it for development, you will need to submit patches to <a href="%(trac)s">our issue tracker</a>. We can accept GitHub pull requests, but they must be processed manually by turning them into patches anyway.
id: Repositori Git sekarang hanya read only mirror. Jika anda ingin menggunakannya untuk pengembangan, anda akan perlu menyerahkan patch kepada <a href="%(trac)s">issue tracker</a>. Kita dapat menerima permintaan pull untuk GitHub, tetapi mereka harus diproses secara manual dengan mengubahnya menjadi patch.

source: Install <a href="http://www.monotone.ca/">monotone</a>. Monotone is a version control system. We use it because it allows us to keep track of who does what changes to the source code (and for a lot of complicated things, but 'keeping track of changes' is the basic idea).
id: Menginstal <a href="http://www.monotone.ca/">monoton</a>. Monoton adalah sebuah system untuk mengontrol versi. Kami menggunakannya karena memungkinkan kami untuk melacak siapa yang melakukan perubahan pada kode sumber (dan untuk banyak hal rumit, namun 'mencatat perubahan' adalah ide dasarnya).
ru: Установите <a href="http://www.monotone.ca/">monotone</a>. Monotone это система контроля версий. Мы используем ее, потому что она позволяет следить за тем что и кто изменяет в исходных кодах (и для большого числа сложных вещей, но 'следить за изменениями' это основная задача).

source: Skim over the <a href="http://www.monotone.ca/docs/Tutorial.html">monotone tutorial</a>, to make sure you understand the concepts.
id: Baca <a href="http://www.monotone.ca/docs/Tutorial.html">monotone tutorial</a> , untuk memastikan anda memahami konsepnya.
ru: Загляните в <a href="http://www.monotone.ca/docs/Tutorial.html">учебник monotone</a>, чтобы убедиться, что вы понимаете концепцию.

source: If you want to remain anonymous, you need to do an additional step, to set up a connection to a monotone server over I2P:
id: Jika anda ingin tetap anonim, anda perlu melakukan langkah tambahan, untuk mengatur koneksi ke server monotone di I2P:
ru: Если вы хотите остаться анонимным, вам нужно выполнить дополнительные шаги, чтобы подключиться к серверу monotone через I2P:

source: Enable the <a href="%(i2ptunnel)s">i2ptunnel</a> client tunnel on port 8998 pointing to mtn.i2p-projekt.i2p.
id: Aktifkan client tunnel <a href="%(i2ptunnel)s">i2ptunnel</a> pada port 8998 menunjuk ke mtn.i2p-projekt.i2p.

source: Pick a directory where you want to put all your I2P files, and create a monotone database:
id: Pilih direktori di mana anda ingin menempatkan semua file I2P, dan buat database monotone:
ru: Выберите директорию, в которую вы хотите выгрузить все ваши файлы I2P, и создайте базу данных monotone:

source: Define the trust list by creating <code>~/.monotone/monotonerc</code> (or <code>_MTN/monotonerc</code> in the i2p.i2p workspace) with the following contents:
id: Tentukan trust list dengan membuat <code>~/.monotone/monotonerc</code> (atau <code>_MTN/monotonerc</code> di workspace i2p.i2p) dengan isian sebagai berikut:
ru: Определите список доверия, создав <code>~/.monotone/monotonerc</code> (или <code>_MTN/monotonerc</code> в workspace i2p.i2p) со следующим содержимым:

source: Copy and paste the <a href="%(devkeys)s">developer's commit keys</a> into a new file (e.g. <code>keys.txt</code>) in the same directory that <code>i2p.mtn</code> is in. Import the keys into your database with <br><code><pre> mtn -d i2p.mtn read < keys.txt</pre></code>
id: Copy dan paste <a href="%(devkeys)s">developer commit key</a> ke file baru (misalnya <code>keys.txt</code>) dalam direktori yang sama yang <code>i2p.mtn</code>berada. Impor kuncinya ke database anda dengan<br><code><pre> mtn -d i2p.mtn read <></pre></code>
ru: Скопируйте и вставьте <a href="%(devkeys)s">commit ключи разработчиков</a> в новый файл (например, <code>keys.txt</code>) в той же директории, где находится <code>i2p.mtn</code>. Импортируйте ключи в вашу базу данных с <br><code><pre> mtn -d i2p.mtn read < keys.txt</pre></code>

source: Pull the I2P sources to your machine. This may take a long time, especially if you are doing this over I2P!
id: Tarik source code I2P ke mesin Anda. Ini mungkin memakan waktu yang lama, terutama jika anda melakukan ini dengan I2P!
ru: Выгрузите исходники I2P на ваш компьютер. Это может занять много времени, особенно, если вы делаете это через I2P!

source: Anonymously:
id: Secara anomin:
ru: Анонимно:

source: Non-anonymously:
id: Tidak secara anomin:
ru: Не анонимно:

source: All the sources are now present on your machine, in the database file. To make them available in a directory, you need to check them out:
id: Semua source code sekarang ada di mesin anda, di database file. Untuk membuatnya tersedia di dalam sebuah direktori, anda perlu memeriksa mereka:
ru: Теперь все исходники есть на вашем компьютере, в файле базы данных. Чтобы они были доступны в директории, вам нужно их извлечь:

source: The above command creates a directory i2p.i2p, which contains all of the I2P sources.
id: Perintah di atas menciptakan direktori i2p.i2p, yang berisi semua source code I2P.
ru: Команда выше создает директорию i2p.i2p, которая содержит все исходники I2P.

source: To download the website files instead of the I2P source files, use 'i2p.www' instead of 'i2p.i2p'.
id: Untuk men-download file website, bukan file dari source code I2P, gunakan 'i2p.www' bukan 'i2p.i2p'.
ru: Чтобы загрузить файлы веб-сайта вместо файлов исходников I2P, используйте 'i2p.www' вместо 'i2p.i2p'.

source: The initial pull may take several hours using the tunnel. If it fails after a partial pull, simply rerun it, it will start where it left off. If you are in a hurry, use the non-anonymous access.
id: Tarikan awal mungkin memakan waktu beberapa jam menggunakan tunnel. Jika gagal setelah partial pull, cukup jalankan kembali, dan akan dimulai mana ditinggalkan. Jika anda terburu-buru, gunakan akses non-anonim.
ru: Начальная выгрузка может занять несколько часов при использовании туннеля. Если она прервется после частичной выгрузки, просто перезапустите ее, она продолжится с прерванного. Если вы торопитесь, используйте не анонимный доступ.

source: A full list of branches, including i2p.i2p and i2p.www can be found on <a href="%(viewmtn)s">viewmtn</a>.
id: Daftar lengkap dari semua cabang, termasuk i2p.i2p dan i2p.www dapat ditemukan di <a href="%(viewmtn)s">viewmtn</a>.
ru: Полный список веток, включая i2p.i2p и i2p.www, можно найти на <a href="%(viewmtn)s">viewmtn</a>.

source: A long explanation about using monotone is available on the <a href="%(monotone)s">monotone page</a>.
id: Penjelasan yang panjang tentang cara menggunakan monotone tersedia pada <a href="%(monotone)s">halaman monotone</a>.
ru: Длинное описание использования monotone доступно на <a href="%(monotone)s">странице monotone</a>.

source: To compile the code, you need the Sun Java Development Kit 6 or higher, or equivalent JDK (<a href="%(sunjdk6)s">Sun JDK 6</a> strongly recommended) and <a href="http://ant.apache.org/">Apache ant</a> version 1.7.0 or higher. If you go are working on the main I2P code, you can go into the i2p.i2p directory and run 'ant' to see the build options.
id: Untuk mengkompilasi kode, anda perlu Sun Java Development Kit 6 atau lebih tinggi, atau setara JDK (<a href="%(sunjdk6)s">Sun JDK 6</a> dianjurkan) dan <a href="http://ant.apache.org/">Apache ant</a> versi 1.7.0 atau lebih tinggi. Jika anda akan mengerjakan kode utama I2P, anda dapat mengunjungi direktori i2p.i2p dan menjalankan 'ant' untuk melihat pilihan pengembangan.
ru: Чтобы упростить создание кода, вам понадобится Sun Java Development Kit 6 или выше, ли подобный JDK (<a href="%(sunjdk6)s">Sun JDK 6</a> настоятельно рекомендуется) и <a href="http://ant.apache.org/">Apache ant</a> версии 1.7.0 или выше. Если вы работаете над основным кодом I2P, вы можете зайти в директорию i2p.i2p и запустить 'ant', чтобы увидеть опции сборки.

source: To build or work on console translations, you need the xgettext, msgfmt, and msgmerge tools from the <a href="http://www.gnu.org/software/gettext/">GNU gettext package</a>.
id: Untuk membangun atau mengerjakan console translation, anda membutuhkan xgettext, msgfmt, dan msgmerge dari <a href="http://www.gnu.org/software/gettext/">paket-paket gettext GNU</a>.
ru: Для сборки или работы на переводами консоли, вам нужны средства xgettext, msgfmt и msgmerge из <a href="http://www.gnu.org/software/gettext/">пакета GNU gettext</a>.

source: For development on new applications, see the <a href="%(apps)s">application development guide</a>.
id: Untuk pengembangan aplikasi baru, lihat <a href="%(apps)s">panduan pengembangan aplikasi</a>.
ru: Для разработки новый приложений, смотри <a href="%(apps)s">руководство по разработке приложений</a>.

source: See <a href="http://%(zzz)s/forums/3">zzz's TODO lists</a>, <a href="%(todo)s">this website's TODO list</a> or <a href="%(trac)s">Trac</a> for ideas.
id: Lihat <a href="http://%(zzz)s/forums/3">daftar TODO zzz's</a>, <a href="%(todo)s">daftar TODO website ini</a> atau <a href="%(trac)s">Trac</a> untuk ide-ide.
ru: Смотри <a href="http://%(zzz)s/forums/3">списки TODO zzz's</a>, <a href="%(todo)s">список TODO этого веб-сайта</a> или <a href="%(trac)s">Trac</a> для поиска идей.

source: See the bottom of <a href="%(licenses)s#commit">the licenses page</a> for commit privilege requirements. You need these to put code into i2p.i2p (not required for the website!).
id: Lihat bagian bawah <a href="%(licenses)s#commit">halaman lisensi</a> untuk persyaratan commit privilege. Anda perlu ini untuk menempatkan kode ke i2p.i2p (tidak diperlukan untuk website!).
ru: Необходимые привилегии для фиксации ищи в конце <a href="%(licenses)s#commit">страницы лицензий</a>. Вам они понадобятся для размещения кода в i2p.i2p (не требуется для веб-сайта!).

source: Short version of how to generate and use keys if you plan to commit:
id: Versi dendek cara untuk menghasilkan dan menggunakan key jika anda berencana untuk commit:
ru: Краткая версия описания генерации и использования ключей, если вы планируете выполнять фиксацию:

source: use an empty passphrase
id: Gunakan passphrase kosong
ru: используйте пустой пароль

source: enter a passphrase
id: masukkan passphrase
ru: введите пароль

source: <a href="mailto:%(email)s">send</a> this to a mtn repo operator to get push privileges
id: <a href="mailto:%(email)s">kirim</a> ini ke operator repo mtn untuk mendapatkan hak istimewa push
ru: <a href="mailto:%(email)s">отправьте</a> это оператору mtn repo, чтобы получить привилегию на размещение

source: send this to <a href="mailto:%(email)s">a release manager</a> to get commit privileges - not required for website
id: kirimkan ini ke <a href="mailto:%(email)s">manajer rilis</a> untuk mendapatkan hak komit - tidak diperlukan untuk situs web
ru: отправьте это <a href="mailto:%(email)s">релиз-менеджеру</a>, чтобы получить привилегии фиксации - не требуется для веб-сайта

source: check in with this key
id: Check-In dengan key ini
ru: чекиньте с этим ключом

source: push with this key
id: dorong dengan key ini
ru: извлекайте с этим ключом

source: Long version: see the <a href="%(monotone)s">monotone page</a>.
id: Versi panjang: lihat <a href="%(monotone)s">halaman monotone</a>.
ru: Длинная версия: смотри <a href="%(monotone)s">страницу monotone</a>.

source: The developers hang around on IRC. They can be reached on the Freenode network, OFTC, and on the I2P internal networks. The usual place to look is #i2p-dev. Join the channel and say hi! We also have <a href="%(guidelines)s">additional guidelines for regular developers</a>.
id: Para pengembang berkeliaran di IRC. Mereka dapat dihubungi di jaringan Freenode, OFTC, dan pada jaringan internal I2P. Tempat yang biasa untuk mencari merekadalah di #i2p-dev. Bergabung dengan channel dan sapa mereka! Kami juga memiliki <a href="%(guidelines)s">pedoman tambahan untuk pengembang reguler</a>.
ru: Разработчики общаются в IRC. Их можно найти в сети Freenode, OFTC и во внутренней сети I2P. Обычно нужно искать в #i2p-dev. Присоединитесь к каналу и скажите привет! Также у нас есть <a href="%(guidelines)s">дополнительные руководства для постоянных разработчиков</a>.

source: Website and router console translators: See the <a href="%(newtrans)s">New Translator's Guide</a> for next steps.
id: Situs web dan router penerjemah console: Lihat <a href="%(newtrans)s">panduan penerjemah baru</a> untuk langkah berikutnya.
ru: Переводчики веб-сайта и консоли маршрутизатора: смотрите <a href="%(newtrans)s">Руководство Нового Переводчика</a> для продолжения.
