Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: I2P is open source software that is mostly developed using open sourced toolkits. The I2P project recently acquired a license for the YourKit Java Profiler. Open source projects are eligible to receive a free license provided that YourKit is referenced on the project web site. Please get in touch if you are interested in profiling the I2P codebase.
id: I2p adalah perangkat lunak open source yang sebagian besar dikembangkan menggunakan toolkit yang juga open source. I2P Project baru saja memperoleh lisensi untuk YourKit Java Profiler. Proyek open source memenuhi syarat untuk menerima lisensi bebas, dengan syarat bahwa YourKit yang dirujuk di situs web proyek. Silakan hubungi kami jika anda tertarik membuat profiling dari source code I2P.
ru: I2P это По с открытым исходным кодом, которое в основном разрабатывается с использованием инструментов с открытым исходным кодом. Проект I2P недавно приобрел лицензию на YourKit Java Profiler. У проектов с открытым исходным кодом есть право на получение бесплатной лицензии, гарантирующей, что на веб-сайте проекта есть ссылка на YourKit. Пожалуйста, свяжитесь, если вы заинтересованы в профилировании базы кодов I2P.

source: YourKit is kindly supporting open source projects with its full-featured Java Profiler. YourKit, LLC is the creator of innovative and intelligent tools for profiling Java and .NET applications. Take a look at YourKit's leading software products: <a href="%(java)s">YourKit Java Profiler</a> and <a href="%(dotnet)s">YourKit .NET Profiler</a>.
id: YourKit dengan senang hati mendukung proyek open source dengan Profiler Java yang berfitur lengkap. YourKit, LLC adalah pencipta perangkat inovatif dan cerdas untuk profiling Java dan aplikasi .NET. Lihat produk perangkat lunak YourKit terkemuka : <a href="%(java)s">YourKit Java Profiler</a> dan <a href="%(dotnet)s">YourKit.NET Profiler</a>.
ru: YourKit любезно предоставляет проектам с открытым исходным кодом полностью функциональный Java Profiler. YourKit, LLC - создатель инновационного и умного средства профилирования Java и .NET приложений. Взгляните на ведущие программные продукты YourKit: <a href="%(java)s">YourKit Java Profiler</a> и <a href="%(dotnet)s">YourKit .NET Profiler</a>.

source: New Translator's Guide
id: Panduan Penerjemah Baru
ru: Руководство Нового Переводчика

source: Here's a very quick guide to getting started.
id: Berikut ini adalah panduan sangat cepat untuk memulai.
ru: Это очень краткое руководство для начала работы.

source: How to Translate the Website
id: Cara Menerjemahkan Website
ru: Как переводить Веб-сайт

source: Translation of the website is done with .po files. The easiest way by far to translate the website is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
id: Terjemahan website ini dilakukan dengan file .po. Cara termudah untuk menerjemahkan situs web adalah untuk mendaftar akun di <a href="%(transifex)s">Transifex</a> dan meminta untuk bergabung dengan tim terjemahan. Selain itu dapat dilakukan "cara lama" seperti yang diuraikan di bawah ini.
ru: Перевод веб-сайта выполняется в файлах .po. До сих пор самый простой способ перевода веб-сайта - получить аккаунт на <a href="%(transifex)s">Transifex</a> и присоединиться к команде переводчиков. Или можно переводить "по старинке", как описано ниже.

source: Preparation
id: Persiapan
ru: Подготовка

source: Come to #i2p-dev on irc and talk to people. Claim the language - To make sure other coworkers don't bump onto the files you are working on, please update the translation status on <a href="%(url)s">this wiki page</a>.
id: Datang ke #i2p-dev di irc dan berbicara kepada orang-orang. Klaim bahasa - untuk memastikan rekan kerja lain tidak menimpa file yang sedang anda kerjakan, silahkan update status terjemahan pada <a href="%(url)s">halaman wiki ini</a>.
ru: Зайдите на #i2p-dev в IRC и поговорите с людьми. Запросите язык - Чтобы бы уверенными, что ваши соратники не затрут файлы, над которыми вы работаете, пожалуйста, обновляйте статус перевода на <a href="%(url)s">этой wiki страничке</a>.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, Including the installation of monotone, checking out i2p.www branch, and generate your own monotone keys. It is not required that you sign a dev agreement.
id: Ikuti <a href="%(newdevs)s">panduan pengembang baru</a>, termasuk instalasi monotone, memeriksa cabang i2p.www, dan menghasilkan monotone key. Anda tidak diperlukan untuk menandatangani perjanjian pengembang.
ru: Следуйте <a href="%(newdevs)s">руководству нового разработчика</a>, включая перевод monotone, извлеките ветку i2p.www и сгенерируйте ваши собственные ключи monotone. Вам не требуется подписывать соглашение разработчика.

source: <b>Create files:</b> If the file for your language does not exist yet:
id: <b>Buat file:</b> Jika file untuk bahasa anda belum ada:
ru: <b>Создайте файлы:</b> Если файла для вашего языка еще нет:

source: Run "<code>./extract-messages.sh</code>" to generate a <code>messages.pot</code> in the base directory. Edit the header of this file, then run "<code>./init-new-po.sh locale</code>" to generate the file <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" this file.
id: Jalankan " <code>./extract-messages.sh</code> " untuk menghasilkan <code>messages.pot</code> di direktori dasar. Edit header dari file ini, kemudian jalankan " <code>./init-new-po.sh locale</code> " untuk menghasilkan file <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code> . " <code>mtn add</code> " file ini.
ru: Выполните "<code>./extract-messages.sh</code>" чтобы сгенерировать <code>messages.pot</code> в основной директории. Отредактируйте заголовок файла, затем выполните "<code>./init-new-po.sh locale</code>" чтобы сгенерировать файл <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" этот файл.

source: Edit <code>i2p2www/pages/global/lang.html</code> and add a line for your language (copy an existing line).
id: Edit <code>i2p2www/pages/global/lang.html</code> dan tambahkan baris untuk bahasa anda (salina baris yang sudah ada).
ru: Отредактируйте <code>i2p2www/pages/global/lang.html</code> и добавьте строку для вашего языка (скопируйте какую-нибудь строку).

source: Add a flag image file to <code>i2p2www/static/images/flags/</code> for the menu (copy from the router).
id: Tambahkan file image flag ke <code>i2p2www/static/images/flags/</code> untuk menu (salin dari router).
ru: Добавьте файл с изображением флага в <code>i2p2www/static/images/flags/</code> для меню (скопируйте из маршрутизатора).

source: <b>Edit files:</b> Edit <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
id: <b>Edit file:</b> Edit <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code> . Untuk bekerja dengan file .po secara efisien, anda mungkin ingin menggunakan <a href="http://www.poedit.net/download.php">POEdit</a>
ru: <b>Отредактируйте файлы:</b> Отредактируйте <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. Чтобы эффективно работать с файлами .po, возможно, вы захотите использовать <a href="http://www.poedit.net/download.php">POEdit</a>

source: <b>Check in:</b> "<code>mtn pull</code>", "<code>mtn update</code>". Then check in by "<code>mtn ci -k yourname@mail.i2p file1 file2 ...</code>" This collects the diff info of your changed file into your local repo. Then "<code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code>". This synchronizes your local repo with the repo on the target machine.
id: <b>Check-in:</b> "<code>mtn pull</code>", "<code>mtn update</code>" . Kemudian check-in dengan " <code>mtn ci -k yourname@mail.i2p file1 file2 ...</code> " ini mengumpulkan diff info dari file anda yang berubah menjadi repo lokal anda. Kemudian " <code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code> ". Ini mengsinkronisasi repo lokal anda dengan repo pada mesin target.
ru: <b>Разместите:</b> "<code>mtn pull</code>", "<code>mtn update</code>". Затем выполните размещение "<code>mtn ci -k yourname@mail.i2p file1 file2 ...</code>" Так вы соберете информацию а различиям в измененных вами файлах по вашему локальному репозиторию. Затем "<code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code>". Так вы синхронизируете ваш локальный репозиторий с репозиторием на целевом компьютере.

source: Repeat. Check in often. Don't wait until it is perfect.
id: Ulangi. Sering-sering melakukan check-in . Jangan tunggu sampai sempurna.
ru: Повторите. Размещайте чаще. Не ждите пока оно станет совершенным.

source: How to Translate the Router Console
id: Cara Menerjemahkan Router Console
ru: Как Переводить Консоль Маршрутизатора

source: The easiest way by far to translate the router console is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
id: Sejauh ini, cara termudah untuk menerjemahkan router console adalah mendaftar akun di <a href="%(transifex)s">Transifex</a> dan meminta untuk bergabung dengan tim penerjemah. Selain itu dapat dilakukan "cara lama" seperti yang diuraikan di bawah ini.
ru: До сих пор самый простой способ перевода консоли маршрутизатора - получить аккаунт на <a href="%(transifex)s">Transifex</a> и присоединиться к команде переводчиков. Или можно переводить "по старинке", как описано ниже.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, including the installation of monotone and the gettext tools, checking out i2p.i2p branch, and generate your own monotone keys.
id: Ikuti <a href="%(newdevs)s">panduan pengembang baru</a>, termasuk instalasi monotone dan gettext tool, memeriksa cabang i2p.i2p, dan menghasilkan monotone key.
ru: Следуйте <a href="%(newdevs)s">руководству нового разработчика</a>, включая установку monotone and средств gettext, извлеките ветку i2p.i2p, и сгенерируйте свои собственные ключи monotone.

source: Generate your own gpg key and sign the dev agreement.
id: Hasilkan kunci gpg anda sendiri dan tanda-tangani perjanjian pengembang.
ru: Сгенерируйте ваш собственный gpg ключ и подпишите соглашение разработчика.

source: Before starting a console translation, better help translate some i2p webpages first. At least an i2p homepage in your language would be great.
id: Sebelum memulai penerjemahan console, pertama-tama lebih baik membantu menerjemahkan beberapa halaman web i2p. Setidaknya hompage situs i2p dalam bahasa anda.
ru: До начала перевода консоли маршрутизатора, лучше сначал помогите перевести несколько веб-страниц i2p. Хотя бы домашнюю страницу i2p на ваш язык, это было бы здорово.

source: <b>What to translate:</b> There are about 15 files in the i2p.i2p branch that needs translation:
id: <b>Apa yang harus diterjemahkan:</b> Ada sekitar 15 file di cabang i2p.i2p yang memerlukan terjemahan:
ru: <b>Что переводить:</b> Есть около 15 файлов в ветке i2p.i2p, которые нужно перевести:

source: Where xx is your language code like fr/de/ch/zh/... There may be or may not be files with your lang code. If not, you can create your own. by copying and renaming other language files you know with your own lang code.
id: Mana xx adalah kode bahasa seperti fr/de/ch/zh /... Mungkin ada atau tidak ada file dengan kode bahasa anda. Jika tidak ada, anda dapat membuatnya sendiri. dengan menyalin dan mengubah nama file bahasa lainnya dengan kode bansa anda sendiri.
ru: Где xx это код вашего языка, как fr/de/ch/zh/... Файл с кодом вашего языка может быть, может и нет. Если его нет, вы можете его создать. Скопировав файл другого известного вам языка и переименовав его в код вашего языка.

source: <b>Create files:</b> If the file for your language does not exist yet, copy another language file to a new file <code>foo_xx.bar</code> for your language. Then "<code>mtn add</code>" the file. After creating a .po file, edit the headers. Then run "<code>ant distclean poupdate</code>".
id: <b>Membuat file:</b> Jika file untuk bahasa anda belum ada, salin file bahasa lain ke file baru <code>foo_xx.bar</code> untuk bahasa anda. Kemudian " <code>mtn add</code> " file. Setelah membuat file .po, edit header-nya. Kemudian jalankan " <code>ant distclean poupdate</code> ".
ru: <b>Создайте файлы:</b> Если файла для вашего языка еще нет, скопируйте файл другого языка в новый файл <code>foo_xx.bar</code> для вашего языка. Затем "<code>mtn add</code>" файл. После создания файла .po, отредактируйте заголовки. Затем выполните "<code>ant distclean poupdate</code>".

source: <b>Start to work:</b> Edit the HTML files with any text editor. Be sure not to use an editor in HTML mode that reformats everything. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
id: <b>Mulai bekerja:</b> Mengedit file HTML dengan editor teks apapun. Pastikan untuk tidak menggunakan editor dalam mode HTML yang me-format ulang semuanya. Untuk bekerja dengan file .po secara efisien, anda mungkin ingin menggunakan <a href="http://www.poedit.net/download.php">POEdit</a>
ru: <b>Начните работу:</b> Отредактируйте файлы HTML в любом текстовом редакторе. Не нужно использовать редакторы в режиме HTML, которые отформатируют весь текст. Для более эффективной работы с файлами .po, вы, возможно, захотите использовать <a href="http://www.poedit.net/download.php">POEdit</a>

source: As you can see, it's not that difficult. If you have questions about the meaning of the terms in the console, ask in <code>#i2p-dev</code> on IRC.
id: Seperti yang anda lihat, hal ini tidak sulit. Jika anda memiliki pertanyaan tentang arti istilah di console, tanya dalam <code>#i2p-dev</code> di IRC.
ru: Как вы видите, это не так сложно. Если у вас есть вопросы насчет значения терминов в консоли, спросите в <code>#i2p-dev</code> в IRC.

source: Q: Why do I have to install monotone, Java, jsp, learn about .po files and html, etc.? Why can't I just do a translation and email it to you?
id: T: Mengapa saya harus menginstal monotone, Java, jsp, belajar tentang file .po dan html, dll.? Mengapa saya tidak melakukan terjemahan dan email hasilnya ke anda?
ru: В: Зачем мне нужно устанавливать monotone, Java, jsp, знать о файлах .po и html и т.д.? Почему я не могу просто переводить и отправлять все вам на почту?

source: A: Several reasons:
id: J: Ada beberapa alasan:
ru: О: Несколько причин:

source: You might be interested in translating via Transifex. Request to join a translation team <a href="%(transifex)s">here</a>.
id: Anda mungkin tertarik menerjemahkan melalui Transifex. Minta untuk bergabung dengan tim terjemahan <a href="%(transifex)s">di sini</a>.
ru: Возможно вы заинтересуетесь переводом через Transifex. Присоединитесь к команде переводчиков <a href="%(transifex)s">тут</a>.

source: We don't have anybody who has time to accept manual contributions and submit them to our source control system on your behalf. Even if we did, it doesn't scale.
id: Kami tidak punya orang yang memiliki waktu untuk menerima sumbangan secara manual dan menyerahkannya ke sistem kontrol sumber kami atas nama anda. Bahkan jika kita lakukan, itu tidak efisien.
ru: У нас нет людей, у которых есть время для приема помощи вручную и размещения в системе контроля версий от вашего имени. Даже если бы и были, это плохо масштабируется.

source: Maybe you are thinking translation is a one-step process. It isn't. You can't do it all at once. You will make mistakes. You need to test it and tweak it to make it look right <i>before</i> you submit it. Developers will update or add to the English text, thus requiring a translation update.
id: Mungkin anda berpikir terjemahan adalah langkah satu proses. Hal ini salah. Anda tidak bisa melakukannya sekaligus. Anda akan membuat kesalahan. Anda perlu untuk menguji dan men-tweak itu agar terlihat tepat <i>sebelum</i> anda mengirimkannya. Pengembang akan memperbarui atau menambahkan teks bahasa Inggris, sehingga membutuhkan update terjemahan.
ru: Может вы думаете, что перевод это одношаговый процесс. Это не так. Вы не можете выполнить его за один раз. Вы будете совершать ошибки. Вам нужно его протестировать и сделать его верным <i>до того</i>, как вы его утвердите. Разработчики обновляют или добавляют Английский текст, поэтому требуется обновление перевода.

source: Having translators use a source control system directly provides authentication and accountablility - we know who is doing what, and we can track changes, and revert them if necessary.
id: membuat penerjemah menggunakan sistem kontrol sumber langsung yang menyediakan otentikasi dan accountablility - kita tahu siapa yang melakukan apa, dan kami dapat melacak perubahan, dan kembali mereka jika diperlukan.
ru: Наличие переводчиков, использующих систему контроля версий, увязано с аутентификацией и отчетностью - мы знаем кто что делает, и мы можем отследить изменения, и отменить их в случае необходимости.

source: .po files are not difficult. If you don't want to work directly with them, we recommend 'poedit'.
id: .PO file tidak sulit digunakan. Jika anda tidak ingin bekerja secara langsung dengan mereka, sebaiknya gunakan 'poedit'.
ru: в файлах .po нет ничего сложного. Если вы не хотите работать непосредственно с ними, мы рекомендуем 'poedit'.

source: HTML files are not difficult. Just ignore the html stuff and translate the text.
id: File HTML tidak sulit. Abaikan saja kode html dan terjemahkan teksnya.
ru: В файлах HTML нет ничего сложного. Просто игнорируйте все тэги и переводите текст.

source: Installing and using monotone is not that difficult. Several of the translators and other contributors to I2P are non-programmers, and they use monotone regularly. Monotone is simply a source control system, it is not about "coding".
id: Menginstal dan menggunakan monotone tidak sulit. Beberapa penerjemah dan penyumbang lainnya adalah bukan programmer dan mereka menggunakan monotone secara teratur. Monoton adalah hanya sebuah sistem kontrol sumber, it's bukan untuk "coding".
ru: Установка и использование monotone не так сложны. Несколько переводчиков и других помощников I2P не являются программистами, и они регулярно используют monotone. Monotone - это просто система контроля версий, в нем нет ничего "программистского".

source: Our items to translate are not "documents". They are html files and po files, with a specific format and character encoding (UTF-8) that must be maintained, and not corrupted by email programs or other methods of transfer.
id: Bahan-bahan untuk penerjemahan bukan "dokumen". Mereka adalah file html dan file po, dengan format khusus dan karakter encoding (UTF-8) yang harus dipertahankan, dan tidak rusak oleh program email atau metode transfer lain.
ru: Наша единица перевода - это не "документ". Это файлы html и .po, в определенном формате и кодировкой символов (UTF-8), это нужно поддерживать, и не поломать при отправке по почте или другими методами передачи.

source: We looked at 'pootle' as a front-end for translators. It didn't work well, needed an administrator, and a pootle-based process would suffer from a number of the above flaws.
id: Kami menanggap 'pootle' sebagai sebuah front-end untuk penerjemah. Itu tidak berfungsi baik, memerlukan administrator, dan proses berbasis pootle akan menderita beberapa kelemahan di atas.
ru: Мы рассматриваем 'pootle' в качестве фронт-энда для переводчиков. Он работает не так как нужно, нуждается в администрировании, и pootle-подобный процесс страдает от ряда вышеописанных недостатков.

source: <b>In summary:</b> Yes, we know it is somewhat of a hurdle to get started. It's really the only possible way we can do it. Give it a try, it really isn't that hard.
id: <b>Kesimpulannya:</b> Ya, kami tahu itu adalah sedikit rintangan untuk memulai. Itu mungkin hanya satu-satunya cara. Coba saja dulu, ini tidak terlalu sulit.
ru: <b>В итоге:</b> Да, мы знаем, что у начинающих есть преграды. Это действительно единственный способ. Попробуйте, это на самом деле не так сложно.

source: More Information
id: Informasi Lebih Lanjut
ru: Больше информации

source: The #i2p-dev channel on IRC, or the <a href="http://%(zzz)s/forums/14">translation forum on %(zzz)s</a>.
id: saluran IRC #I2p-dev, atau <a href="http://%(zzz)s/forums/14">terjemahan forum %(zzz)s </a>.
ru: Канал #i2p-dev в IRC, или <a href="http://%(zzz)s/forums/14">форум перевода на %(zzz)s</a>.

source: How to Set up a Reseed Server
id: Cara Set up sebuah Server Reseed

source: February 2017
id: Februari 2017

source: Overview
id: Ringkasan

source: Thank you for volunteering to run an I2P reseed server. "Reseeding" is our term for bootstrapping new routers into the network. New routers fetch a bundle of peer references, or "router infos", from one or more of a hardcoded list of HTTPS URLs.
id: Terima kasih untuk sukarela menjalankan I2P reseed server. "Reseeding" adalah istilah kami untuk bootstrap router baru ke jaringan. Router baru mengambil sebuah bundle berisi peer reference, atau "router infos", dari satu atau lebih satu daftar HTTPS URL yang hardcoded.

source: Requirements
id: Persyaratan

source: At its simplest, a reseed server consists of a Java I2P router, an HTTPS web server, and some scripts that periodically gather router infos from the router, bundle and sign them into a custom file format, and deliver these files over HTTPS. In practice, it's a bit more complex, and a reseed operator must be fairly competent and attentive. A reseed server is not appropriate for a residential internet connection. The complexities include:
id: Pada hal yang paling sederhana, sebuah server reseed terdiri dari Java I2P router, HTTPS web server dan beberapa skrip yang secara berkala mengumpulkan router infos dari router, men-bundel dan menanda-tangan mereka ke dalam format file kustom dan mengirimkan file ini dengan HTTPS. Dalam prakteknya, ini sedikit lebih kompleks, dan reseed operator harus cukup kompeten dan penuh perhatian. Reseed server ini tidak cocok untuk koneksi internet perumahan. Kompleksitasnya meliputi:

source: You must have a secure SSL setup with either a self-signed certificate or a cert that chains up to a standard CA
id: Anda harus memiliki setup SSL secure dengan sertifikat yang ditandatangani sendiri atau cert yang merantai ke CA standar

source: The SSL configuration must conform to current best practices on allowed ciphers and protocols, and the CN/SAN host name must match the URL
id: Konfigurasi SSL harus sesuai dengan praktek-praktek terbaik saat ini untuk sandi dan protokol yang diperbolehkan, dan nama host CN/SAN harus cocok dengan URL

source: The scripts are designed to deliver different router info bundles to different requestors for network diversity
id: Script dirancang untuk memberikan berbagai bundel router info untuk requestors yang berbeda untuk keanekaragaman jaringan

source: The scripts are designed to deliver the same bundle to the same repeated requestor to prevent scraping
id: Script dirancang untuk memberikan bundel yang sama kepada pemohon berulang yang sama untuk mencegah scraping

source: The reseed servers are under periodic attacks and DDoS attempts, and from other buggy I2P implementations and botnets. This necessitates that you run fail2ban or an equivalent solution.
id: Server reseed mengalami serangan-serangan ruting dan upaya DDoS, dan dari implementasi I2P yang penuh bug dan botnets lain. Anda perlu menjalankan fail2ban atau solusi yang setara.

source: Information Required
id: Informasi yang Diperlukan
