Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: I2P has a distributed development model. The source code is replicated across independently administered <a href="http://www.monotone.ca/">Monotone</a> ("MTN") repositories. Developers with commit rights are able to push their changes to the repository (a <a href="%(licenses)s#commit">license agreement</a> needs to be signed before commit rights are granted).
id: I2P memiliki model pengembangan terdistribusi. Kode sumber direplikasi di repositori <a href="http://www.monotone.ca/">Monotone</a> ("MTN") yang dikelola secara independen. Pengembang dengan hak komit dapat mendorong perubahan mereka ke repositori (sebuah <a href="%(licenses)s#commit">perjanjian lisensi</a> perlu ditandatangani sebelum hak komit diberikan).
ru: В I2P используется распределенная модель разработки. Исходный код реплицируется по независимо администрируемым хранилищам <a href="http://www.monotone.ca/">Monotone</a> ("MTN"). Разработчики с правами фиксации могут размещать свои изменения в хранилище (необходимо подписать <a href="%(licenses)s#commit">лицензионное соглашение</a> до того как будут выданы права для фиксации).

source: Some of Monotone's noteworthy qualities are: distributed version control, cryptographic authentication, access control, its small size, having few dependencies, storage of projects in a compressed SQLite database file, and having the ability to resume interrupted synchronization attempts.
id: Beberapa kualitas penting Monotone adalah: terdistribusi kontrol versi, otentikasi kriptografi, kontrol akses, ukurannya yang kecil, hanya sedikit dependensi, penyimpanan proyek dalam file database SQLite terkompresi, dan memiliki kemampuan untuk melanjutkan usaha sinkronisasi yang terganggu.
ru: Некоторые из замечательных качеств Monotone: распределенный контроль версий, криптографическая аутентификация, контроль доступа, малый размер, малое количество зависимостей, хранение проектов в сжатом файле базы данных SQLite и наличие возможности восстанавливать прерванные попытки синхронизации.

source: Operating a Monotone Client
id: Mengoperasikan Klien Monotone
ru: Управление клиентом Monotone

source: A transport key grants you the ability to push your changes to a Monotone repository server. In order to commit code into Monotone (in essence signing your code), a commit key is also needed. None of the public Monotone servers on I2P currently require a key in order to read (or pull) the source code.
id: Kunci transport memberi anda kemampuan untuk mendorong perubahan anda ke server repositori Monotone. Untuk melakukan commit code ke Monotone (pada dasarnya menandatangani kode Anda), sebuah commit key juga diperlukan. Tidak ada server Monotone yang ada di I2P saat ini membutuhkan kunci untuk membaca (atau menarik) kode sumbernya.
ru: Transport ключ дает вам возможность размещать ваши изменения в хранилище сервера Monotone. Для фиксации кода в Monotone (по сути, для подписания вашего кода), также нужен commit ключ. Ни один из публичных серверов Monotone в I2P на данный момент не требует ключ для чтения (или получения) исходного кода.

source: Without a transport key, one cannot: <ul> <li>pull code from a server which doesn't allow global read access</li> <li>push code to any server</li> <li>run a Monotone server</li> </ul>
id: Tanpa kunci transport, seseorang tidak bisa: <ul> <ul> <li> menarik kode dari server yang tidak mengizinkan global read access</li> <li> mendorong kode ke server manapun</li> <li> menjalankan server Monotone</li> </ul>
ru: Без transport ключа невозможно: <ul> <li>получать код от сервера, который не предоставляет доступ для глобального чтения</li> <li>размещать код на любом сервере</li> <li>запускать сервер Monotone</li> </ul>

source: Without a commit key, one cannot: <ul> <li>commit any code</li> </ul>
id: Tanpa commit key, seseorang tidak bisa: <ul> <ul> <li> komit kode apapun </li> </ul>
ru: Без commit ключа невозможно: <ul> <li>фиксировать любой код</li> </ul>

source: If you only intend to retrieve code from MTN, feel free to skip to the <a href="#trust-and-initializing-your-repository">next section</a>. If you want to generate keys, read the following.
id: Jika anda hanya ingin mengambil kode dari MTN, silakan lompat ke <a href="#trust-and-initializing-your-repository">bagian selanjutnya</a> Jika anda ingin menghasilkan kunci, baca berikut ini.
ru: Если вы собираетесь только получать код из MTN, можете спокойно пропустить <a href="#trust-and-initializing-your-repository">следующий раздел</a>. Если же вы хотите генерировать ключи, прочтите нижеследующее.

source: By convention keys are named like an e-mail addresses, but a corresponding e-mail address does not need to exist. For example, your keys might be named:
id: Sesuai konvensi, kunci diberi nama seperti alamat e-mail, namun e-mail yang sesuai tidak perlu ada Misalnya, kunci anda mungkin diberi nama:
ru: По договоренности ключи именуются как адреса e-mail, но соответствующий e-mail не обязательно должен существовать. Например, ваш ключ может называться:

source: Monotone stores keys under <code><b>$HOME/.monotone/keys</b></code> in text files which are named identically to the keys. For example:
id: Monotone menyimpan kunci di bawah <code><b>$HOME/.monotone/keys</b></code> pada file teks yang diberi nama identik dengan kuncinya. Contohnya:
ru: Monotone хранит ключи в <code><b>$HOME/.monotone/keys</b></code> в текстовых файлах, которые названы также как ключи. Например:

source: To generate transport and commit keys, enter the following commands at a prompt:
id: Untuk menghasilkan kunci transportasi dan komit, masukkan perintah berikut pada sebuah prompt:
ru: Для генерации transport и commit ключей выполните следующие команды в командной строке:

source: Monotone will prompt you for a password to protect your keys. You are very strongly encouraged to set a password for the commit key. Many users will leave an empty password for the transport key, especially those running a Monotone server.
id: Monotone akan meminta password untuk melindungi kunci Anda. Anda sangat dianjurkan untuk menyetel password untuk commit key. Banyak pengguna akan membiarkan password kosong untuk kunci transport, terutama yang menjalankan Server monotone.
ru: Monotone запросит у вас пароль для защиты ваших ключей. Вам настоятельно рекомендуется установить пароль для commit ключа. Большинство пользователей оставляют пустым пароль для transport ключа, особенно те, кто запускает сервер Monotone.

source: Trust, and initializing your repository
id: Memberi kepercayaan dan inisialisasi repositori anda
ru: Доверие и инициализация вашего хранилища

source: Monotone's security model helps to ensure that nobody can easily impersonate a developer without it being noticed. Since developers can make mistakes and become compromised,only manual review can ensure quality of code. Monotone's trust model will ensure that you read the right diffs. It does not replace reading diffs.
id: Model keamanan monotone membantu untuk memastikan bahwa tak seorang pun dapat dengan mudah meniru pengembang tanpa diketahui. Karena para pengembang dapat membuat kesalahan dan menjadi bocor identitasnya, hanya manual review dapat memastikan kualitas kode. Model kepercayaan monotone akan memastikan bahwa anda membaca diffs tepat. Ini tidak menggantikan pembacaan diffs.
ru: Модель безопасности Monotone помогает быть уверенным в том, что никто не может запросто выдать себя за разработчика, без того, чтобы он был уведомлен. Т.к. разработчики могут совершать ошибки и быть скомпрометированы, то только ручной пересмотр поможет убедиться в качестве кода. Модель доверия Monotone обязывает вас следить за изменением прав. Что не является заменой чтения изменений.

source: A Monotone repository is a single file (a compressed SQLite database) which contains all of the project's source code and history.
id: Repositori monotone adalah sebuah file tunggal (database SQLite terkompresi) yang berisi semua kode sumber proyek dan sejarah.
ru: Хранилище Monotone это один файл (сжатая база данных SQLite), который содержит исходный код всех проектов и историю.

source: After <a href="#obtaining-and-deploying-developers-keys">importing the developers' keys into Monotone</a> and <a href="#setting-up-trust-evaluation-hooks">setting up trust evaluation hooks</a>, Monotone will prevent untrusted code from being checked out into your workspace. There are commands available to clean untrusted code from your workspace but in practice they've not been needed due to the push access policies in place.
id: Setelah <a href="#obtaining-and-deploying-developers-keys">mengimpor kunci para pengembang ke Monotone</a> dan <a href="#setting-up-trust-evaluation-hooks">menyiapkan trust evaluation hook</a>, Monotone akan mencegah kode yang tidak dipercaya diperiksa ke dalam workspace anda. Ada beberapa perintah yang tersedia untuk membersihkan kode yang tidak dipercaya dari workspace anda tetapi dalam praktiknya mereka sudah tidak diperlukan karena kebijakan akses push diterapkan.
ru: После <a href="#obtaining-and-deploying-developers-keys">импорта ключей разработчиков в Monotone</a> и <a href="#setting-up-trust-evaluation-hooks">установки ловушек оценки доверия</a>, Monotone предотвратит извлечение ненадежного кода в ваш workspace. Существуют команды, способные очистить ненадежный код из вашего workspace, но на практике они не нужны, благодаря политикам доступа на размещение кода.

source: A repository can hold many branches. For example, our repository holds the following main branches:
id: Repositori bisa memiliki banyak cabang. Sebagai contoh, repositori kami memiliki beberapa cabang utama:
ru: В хранилище могут находиться несколько веток. Например, наше хранилище содержит следующие главные ветки:

source: The I2P router and associated programs
id: I2P router dan program-program terkait
ru: Маршрутизатор I2P и связанные с ним программы

source: The I2P project website
id: Website proyek I2P proyek
ru: Веб-сайт проекта I2P

source: Syndie, a distributed forums tool
id: Syndie, alat forum terdistribusikan
ru: Syndie и средства распределенных форумов

source: By convention, the I2P Monotone repository is named <code>i2p.mtn</code>. Before pulling source code from servers, a database for your repository will need to be initialized. To initialize your local repository, change into the directory that you want the <code>i2p.mtn</code> file and branch directories to be stored and issue the following command:
id: Sesuai dengan konvensi, repositori I2P monotone dinamai <code>i2p.mtn</code> . Sebelum menarik kode sumber dari server, database untuk repositori anda akan perlu diinisialisasi. Untuk menginisialisasi repositori lokal, Ubah ke dalam direktori yang anda inginkan <code>i2p.mtn</code>direktori file dan cabang disimpan dan melakukan perintah:
ru: По соглашению хранилище I2P Monotone названо <code>i2p.mtn</code>. Перед извлечением исходного кода с серверов необходимо инициализировать базу данных для вашего хранилища. Для инициализации вашего локального хранилища перейдите в директорию, в которой вы хотите хранить <code>i2p.mtn</code> файл и директории веток, и выполните следующую команду:

source: Keys which developers use to commit code are essential for trust evaluation in Monotone. The other developers' transport keys are only required for Monotone server operators.
id: Kunci yang digunakan oleh pengembang untuk melakukan commit code sangat penting bagi kepercayaan evaluasi di Monotone. Transport key milik para pengembang lain hanya diperlukan untuk operator server monotone.
ru: Ключи, которые используют для фиксации кода, необходимы для оценки доверия в Monotone. Другие transport ключи разработчиков нужны только для операторов сервера Monotone.

source: Developers' commit keys are provided GPG-signed <a href="%(signedkeys)s">on another page</a>.
id: Commit key milik pengembang disediakan GPG-signed <a href="%(signedkeys)s">pada halaman lain</a>.
ru: Commit ключи разработчиков представлены в виде GPG-signed <a href="%(signedkeys)s">на другой странице</a>.

source: To import developers' keys after verifying their authenticity, copy <a href="%(devkeys)s">all of the keys</a> into a new file. Create this file (e.g. <code><b>keys.txt</b></code>) in the same directory where <code>i2p.mtn</code> is located. Import the keys with the command:
id: Untuk mengimpor kunci pengembang setelah memverifikasi keaslian mereka, salin <a href="%(devkeys)s">semua kunci</a> ke file yang baru. Buat file ini (misalnya <code><b>keys.txt</b></code> ) di direktori yang sama di mana <code>i2p.mtn</code> berada. Impor key-nya dengan perintah:
ru: Для импорта ключей разработчиков после проверки их подлинности скопируйте <a href="%(devkeys)s">все ключи</a> в новый файл. Создайте этот файл (например, <code><b>keys.txt</b></code>) в той же директории, в которой расположен <code>i2p.mtn</code>. Импортируйте ключи командой:

source: <b>Note</b>: <i>Never</i> add keys to <code><b>$HOME/.monotone/keys</b></code> manually.
id: <b>Catatan</b>: <i>jangan</i> menambahkan kunci <code><b>$HOME/.monotone/keys</b></code> secara manual.
ru: <b>Примечание</b>: <i>Никогда</i> не добавляйте ключи в <code><b>$HOME/.monotone/keys</b></code> вручную.

source: The default Monotone trust policy is way too lax for our requirements: every committer is trusted by default. That is not acceptable for I2P development.
id: Kebijakan kepercayaan monotone default terlalu lemah untuk persyaratan kami: setiap commit dipercaya secara default. Ini tidak bisa diterima di pengembangan I2P.
ru: Дефолтная политика доверия Monotone слишком слаба для наших требований: каждый коммитер по умолчанию надежен. Это неприемлемо для разработки I2P.

source: Change into the directory <code><b>$HOME/.monotone</b></code> and open the file <code>monotonerc</code> with a text editor. Copy and paste the following two functions into this file:
id: Ubahan ke direktori <code><b>$HOME/.monotone</b></code> lalu buka file <code>monotonerc</code>dengan text editor. Copy dan paste kedua fungsi ini ke dalam file ini:
ru: Перейдите в директорию <code><b>$HOME/.monotone</b></code> и откройте файл <code>monotonerc</code> в текстовом редакторе. Скопируйте и вставьте следующие две функции в этот файл:

source: The first function determines an intersection between two sets, in our case a revision's signers and trusted signers.
id: Fungsi pertama menentukan persimpangan antara dua set, di dalam kasus kita revision's signers dan trusted signers.
ru: Первая функция определяет пересечение между двумя наборами, в нашем случае это подписанты ревизий и надежные подписанты.

source: The second function determines trust in a given revision, by calling the first function with "signers" and "trusted" as arguments. If the intersection is null, the revision is not trusted. If the intersection is not empty, the revision is trusted. Otherwise, the revision is not trusted.
id: Fungsi kedua menentukan kepercayaan dalam revisi tertentu, dengan memanggil fungsi dengan "signers" dan "trusted" sebagai argument. Jika persimpangannya bernilai null, revisi tidak dapat dipercaya. Jika persimpangannya tidak kosong, revisi dapat dipercaya. Jika tidak, revisinya tidak terpercaya.
ru: Вторая функция определяет доверие в заданной ревизии, вызывая первую функцию с аргументами "signers" и "trusted". Если пересечение пусто, то ревизия не надежна. Если пересечение не пусто, то ревизия надежна. В другом случае ревизия не надежна.

source: More information about Trust Evaluation Hooks can be found in the <a href="http://www.monotone.ca/docs/Hooks.html">official Monotone documentation</a>.
id: Informasi lebih lanjut tentang Trust Evaluation Hooks dapat ditemukan dalam <a href="http://www.monotone.ca/docs/Hooks.html">dokumentasi resmi monotone</a>.
ru: Более подробную информацию о Trust Evaluation Hooks вы можете найти в <a href="http://www.monotone.ca/docs/Hooks.html">официальной документации Monotone</a>.

source: I2P is shipped with a pre-configured tunnel pointing to the project Monotone server. Ensure that the tunnel has been started within <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a> before attempting to pull the source code from 127.0.0.1:8998.
id: I2P disebarkan dengan tunnel yang dikonfigurasi untuk menunjuk ke server Monotone milik proyek I2P. Pastikan bahwa tunnel telah dimulai di dalam <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a> sebelum mencoba menarik source code dari 127.0.0.1:8998.
ru: I2P поставляется с предварительно настроенным туннелем, указывающим на сервер проекта Monotone. Убедитесь, что туннель запущен в <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a>, перед тем как получать исходый код с 127.0.0.1:8998.

source: Enter the directory where you initialized <code>i2p.mtn</code>. Depending on whether you want only I2P sources, or also sources for the I2P website and Syndie, you can perform the <code>pull</code> operation in different ways.
id: Masukkan direktori di mana Anda menginisialisasi <code>i2p.mtn</code> . Tergantung apakah anda hanya ingin sumber kode I2P atau juga sumber kode untuk situs I2P atau Syndie, anda dapat melakukan operasi <code>pull</code> dengan cara yang berbeda.
ru: Перейдите в директорию, в которой Вы инициализировали <code>i2p.mtn</code>. В зависимости от того, хотите ли Вы получить только исходники I2P, или ещё и исходники веб-сайта I2P и Syndie, Вы можете выполнить операцию <code>pull</code> по-разному.

source: If you only want I2P sources:
id: Jika Anda hanya ingin source code I2P:
ru: Если вам нужны только исходники I2P:

source: If you want all branches:
id: Jika anda ingin semua cabang:
ru: Если вам нужны все ветки:

source: If the transfer aborts before completing sucessfully, simply repeating the pull command will resume the transfer.
id: Jika transfer berhenti sebelum sampai tuntas, ulangi saja perintah pull untuk melanjutkan transfer.
ru: Если передача прервалась до успешного завершения, просто повторите команду получения, и передача возобновится.

source: Pulling in the above examples is done anonymously by specifying an empty transport key. If everyone pulls anonymously it will be harder for an attacker who gains control of the server to selectively provide some people with tampered data.
id: Melakukan pulling seperti contoh di atas dilakukan secara anonim dengan menspesifikasikan transport key kosong. Jika semua orang menarik secara anonim akan lebih sulit bagi penyerang yang meraih kendali atas server untuk secara selektif memberikan data yang dimodifikasi ke beberapa orang.
ru: Получение в примерах выше совершается анонимно, т.к. был указан пустой transport ключ. Если все будут выполнять получение анонимно, то атакующему будет сложнее получить контроль над сервером, избирательно снабжая некоторых людей поддельными данными.

source: To verify that trust evaluation works:
id: Untuk memverifikasi bahwa evaluasi kepercayaan berfungsi:
ru: Чтобы убедиться, что оценка доверия работает:

source: Make a backup of your <code>monotonerc</code> file.
id: Buat cadangan file <code>monotonerc</code> anda.
ru: Сделайте резервную копию вашего файла <code>monotonerc</code>.

source: Modify <code><b>monotonerc</b></code> by setting the trusted_signers variable in the following way:
id: Modifikasi <code><b>monotonerc</b></code> dengan menetapkan variabel trusted_signers dengan cara berikut:
ru: Измените <code><b>monotonerc</b></code>, определив переменную trusted_signers следующим образом:

source: With <code><b>monotonerc</b></code> configured as above, Monotone will no longer trust any committers. Confirm this by changing into the directory where <code>i2p.mtn</code> was created and attempt a checkout of the I2P branch:
id: Dengan <code><b>monotonerc</b></code> dikonfigurasikan seperti di atas, Monotone tidak akan lagi mempercayai semua pihak. Konfirmasikan ini dengan mengubah ke direktori tempat <code>i2p.mtn</code> dibuat dan mencoba checkout cabang I2P:
ru: С измененным т.о. <code><b>monotonerc</b></code> Monotone не будет больше доверять никаким коммитерам. Убедитесь в этом, изменив директорию на ту, в которой был создан <code>i2p.mtn</code>, и попробуйте извлечь ветку I2P:

source: A directory named <code>i2p.i2p</code> should <b>not</b> appear. You should encounter many error messages like:
id: Sebuah direktori bernama <code>i2p.i2p</code> seharusnya <b>tidak</b> muncul. Anda seharusnya menjumpai banyak pesan error seperti:
ru: Директория с именем <code>i2p.i2p</code> <b>не</b> должна появиться. Вы должны увидеть много сообщений об ошибках, вроде таких:

source: If you are satisfied with results, restore the backup of <code>monotonerc</code> that was created above. If you didn't create a backup as advised, re-read <a href="#setting-up-trust-evaluation-hooks">Setting up trust evaluation hooks</a>.
id: Jika anda puas dengan hasilnya, restore backup-nya <code>monotonerc</code> yang dibuat di atas. Jika anda tidak membuat backup seperti yang disarankan, baca kembali <a href="#setting-up-trust-evaluation-hooks">Menyiapkan trust evaluation hooks</a> .
ru: Если вы удовлетворены результатом, восстановите резервную копию <code>monotonerc</code>, которая была создана ранее. Если вы не создали резервную копию, как предлагалось, перечитайте <a href="#setting-up-trust-evaluation-hooks">Установку ловушек оценки доверия</a>.

source: If you already have a branch checked out, skip to the <a href="#updating-your-working-copy-to-the-latest-version">next section</a>.
id: Jika sebuah cabang sudah di-check out, lompat ke <a href="#updating-your-working-copy-to-the-latest-version">berikutnya</a> bagian</a>.
ru: Если вы уже извлекли ветку, пропустите <a href="#updating-your-working-copy-to-the-latest-version">следующий раздел</a>.

source: Change into the directory where <code>i2p.mtn</code> is located. Over there issue:
id: Ubah ke direktori tempat <code>i2p.mtn</code> berada. Di sana lakukan hal ini:
ru: Перейдите в директорию, в которой находится <code>i2p.mtn</code>. И выполните в ней:

source: The checkout should complete without error messages and a directory named <code>i2p.i2p</code> should appear in the current directory. Congratulations! You have successfully checked out the latest I2P sources, ready to be compiled.
id: Checkout seharusnya selesai tanpa pesan error dan sebuah direktori bernama <code>i2p.i2p</code> seharusnya muncul di direktori saat ini. Selamat! Anda telah berhasil checkout source code I2P terbaru, siap untuk dikompilasi.
ru: Извлечение должно быть выполнено без сообщений об ошибках и директория с именем <code>i2p.i2p</code> должна появиться в текущей директории. Поздравляем! Вы успешно извлекли последние исходники I2P, готовые к компиляции.

source: If you haven't done this already, pull fresh code from the server to your local Monotone repository. To accomplish this, change into the directory where <code>i2p.mtn</code> is located and issue:
id: Jika anda belum melakukan ini, tarik kode dari server ke server lokal anda Repository Monotone. Untuk mencapai hal ini, ganti ke direktori di mana <code>i2p.mtn</code> berada dan lakukan perintah:
ru: Если Вы ещё этого не сделали - загрузите самую последнюю версию кода с сервера в свой локальный Monotone-репозиторий. Чтобы сделать это, перейдите в директорию с <code>i2p.mtn</code> и выполните:

source: Now change into your <code>i2p.i2p</code> directory, and over there issue:
id: Sekarang ganti ke direktori <code>i2p.i2p</code> anda, dan di sana lakukan perintah:
ru: Теперь перейдите в вашу <code>i2p.i2p</code> директорию, и выполните в ней:
