Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: General network protocols often send a lot of additional data that can be used to identify users. Programming specifically for I2P allows the creation of a network protocol that does not leak such information, keeping users anonymous and secure.
id: Protokol jaringan umum sering mengirimkan banyak data tambahan yang bisa digunakan untuk mengidentifikasi pengguna. Pemrograman khusus untuk I2P memungkinkan pembuatan protokol jaringan yang tidak membocorkan informasi tersebut, sehingga pengguna tetap anonim dan aman.
ru: Основные сетевые протоколы часто отсылают много дополнительных данных, которые могут быть использованы для идентификации пользователей. Программирование специально под I2P позволяет создавать сетевой протокол, который не раскрывает подобную информацию, охраняя анонимность и безопасность пользователя.

source: Network protocols designed for use on the regular internet can be inefficient on I2P, which is a network with a much higher latency.
id: Protokol jaringan yang dirancang untuk digunakan di internet biasa dapat menjadi tidak efisien pada I2P, yang merupakan jaringan dengan latency yang jauh lebih tinggi.
ru: Сетевые протоколы, разработанные для использования в обычном интернете, могут быть неэффективными в сети I2P, которая является сетью с гораздо большими задержками.

source: I2P supports a standard <a href="%(plugins)s">plugins interface</a> for developers so that applications may be easily integrated and distributed.
id: I2P mendukung <a href="%(plugins)s">interface plugin</a> standar untuk pengembang sehingga aplikasi dapat dengan mudah diintegrasikan dan didistribusikan.
ru: I2P поддерживает стандартный <a href="%(plugins)s">интерфейс плагинов</a> для разработчиков, так что эти приложения легко могут быть интегрированы и распространены.

source: Applications written in Java and accessible/runnable using an HTML interface via the standard webapps/app.war may be considered for inclusion in the i2p distribution.
id: Aplikasi yang ditulis di Java dan dapat diakses / dijalankan dengan menggunakan interface HTML melalui webapps / app.war standar dapat dipertimbangkan untuk dimasukkan ke dalam distribusi i2p.
ru: Приложения, написанные на Java и доступные/запускаемые из интерфейса HTML с использованием стандартного webapps/app.war могут быть включены в дистрибутив i2p.

source: There are a few changes that require adjusting to when using I2P:
id: Ada beberapa perubahan yang perlu disesuaikan saat menggunakan I2P:
ru: Есть несколько вещей, которые нужно отрегулировать для использования в I2P:

source: Destination ~= host+port
id: Destinasi ~= host+port
ru: Пункт назначения ~= хост+порт

source: An application running on I2P sends messages from and receives messages to a unique cryptographically secure end point - a "destination". In TCP or UDP terms, a destination could (largely) be considered the equivalent of a hostname plus port number pair, though there are a few differences.
id: Aplikasi yang berjalan pada I2P mengirim pesan dari dan menerima pesan ke titik akhir kriptografi aman yang unik - sebuah "destinasi". Dalam istilah TCP atau UDP, destinasi dapat (sebagian besar) dianggap setara dengan nama host plus pasangan nomor port, meskipun ada beberapa perbedaan.
ru: Приложение, выполняемое в I2P отправляет и принимает сообщения через уникальную зашифрованную безопасную точку обмена - "пункт назначения". В терминах TCP или UDP, пункт назначения может (грубо) быть эквивалентом пары название хоста + номер порта, хотя есть некоторые отличия.

source: An I2P destination itself is a cryptographic construct - all data sent to one is encrypted as if there were universal deployment of IPsec with the (anonymized) location of the end point signed as if there were universal deployment of DNSSEC.
id: Destinasi I2P adalah konstruksi kriptografi - semua data yang dikirim ke satu satu destinasi dienkripsi seolah-olah ada penyebaran IPsec universal dengan lokasi titik akhir (anonim) yang ditandatangani seolah-olah ada penyebaran DNSSEC secara universal.
ru: Пункт назначения I2P сам по себе это криптографическая конструкция - все данные, отправляемые в него шифруются, как если бы существовал универсальный IPsec с (анонимизированным) расположением точки обмена, подписанной универсальным DNSSEC.

source: I2P destinations are mobile identifiers - they can be moved from one I2P router to another (or it can even "multihome" - operate on multiple routers at once). This is quite different from the TCP or UDP world where a single end point (port) must stay on a single host.
id: Destinasi i2p pengidentifikasi mobile - mereka dapat dipindahkan dari satu I2P router lain (atau bahkan dapat "multihome" - beroperasi pada router beberapa sekaligus). Hal ini sangat berbeda dari TCP atau UDP yang di mana satu titik akhir (port) harus tetap pada host satu.
ru: Пункты назначения I2P - это мобильные идентификаторы - они могут перемещаться с одного I2P маршрутизатора на другой (или он может быть "multihome" - работать на нескольких маршрутизаторах одновременно). Это сильно отличается от TCP или UDP, в которых отдельная точка обмена (порт) должна оставаться на отдельном хосте.

source: I2P destinations are ugly and large - behind the scenes, they contain a 2048 bit ElGamal public key for encryption, a 1024 bit DSA public key for signing, and a variable size certificate, which may contain proof of work or blinded data.
id: Destinasi I2P itu jelek dan besar - di belakang layar, mereka berisi kunci publik ElGamal 2048 bit untuk enkripsi, kunci publik DSA 1024 bit untuk signing, dan sertifikat variable size, yang mungkin berisi proof of owrk atau blinded data.
ru: Пункты назначения I2P уродливы и огромны - за кулисами, они могут содержать 2048 битный публичный ключ ElGamal для шифрования, 1024 битный публичный ключ DSA для подписания, и сертификат переменного размера, который может содержать подтверждение или слепые данные.

source: There are existing ways to refer to these large and ugly destinations by short and pretty names (e.g. "irc.duck.i2p"), but those techniques do not guarantee globally uniqueness (since they're stored locally in a database on each person's machine) and the current mechanism is not especially scalable nor secure (updates to the host list are managed using "subscriptions" to naming services). There may be some secure, human readable, scalable, and globally unique, naming system some day, but applications shouldn't depend upon it being in place, since there are those who don't think such a beast is possible. <a href="%(naming)s">Further information on the naming system</a> is available.
id: Ada cara untuk merujuk kepada destinasi yang besar dan jelek ini dengan nama pendek dan cantik (misalnya "irc.duck.i2p"), tetapi teknik tersebut tidak menjamin keunikan global (karena mereka yang tersimpan secara lokal dalam database pada mesin setiap orang) dan mekanisme yang saat ini tidak scalable ataupun tidak aman (update ke daftar host dikelola menggunakan "langganan" naming service). Mungkin suatu hari ada beberapa penamaan sistem yang aman, mudah dibaca manusia, terukur, dan secara global unik,, tapi aplikasi seharusnya tidak bergantung, namun ada orang-orang yang berpikir seperti tidak mungkin terwujud. <a href="%(naming)s">Informasi lebih lanjut pada sistem penamaan</a> juga tersedia.
ru: Существует способ обратиться к этим уродливым и огромным пунктам назначения по короткому и привлекательному имени (например, "irc.duck.i2p"), но этот метод не гарантирует глобальной уникальности (поскольку они хранятся локально в базе данных на каждом компьютере) и текущий механизм не является ни масштабируемым, ни безопасным (обновления списка хостов управляются через "подписки" к серверам имен). Возможно, когда-нибудь будет существовать безопасная, удобочитаемая, масштабируемая и глобально уникальная система имен, но приложения не должны зависеть от ее появления, поскольку есть те, кто сомневается в том, что такая зверюга может существовать. <a href="%(naming)s">Еще больше информации по системе имен</a>.

source: While most applications do not need to distinguish protocols and ports, I2P <em>does</em> support them. Complex applications may specify a protocol, from port, and to port, on a per-message basis, to multiplex traffic on a single destination. See the <a href="%(datagrams)s">datagram page</a> for details. Simple applications operate by listening for "all protocols" on "all ports" of a destination.
id: Sementara kebanyakan aplikasi tidak perlu membedakan protokol dan port, I2P <em>tidak</em> mendukungnya. Aplikasi yang kompleks dapat menetapkan sebuah protokol, dari port, dan kepada port, untuk setiap pesan, untuk lalu lintas multipleks di satu tujuan. Lihat <a href="%(datagrams)s">Halaman datagram</a> untuk rincian. Aplikasi sederhana beroperasi dengan mendengarkan "Semua protokol" pada "semua Port" di suatu destinasi.
ru: В то время как большинству приложений не нужно распознавать протоколы и порты, I2P <em>поддерживает</em> их. Сложные приложения могут указывать протокол, порт источника и назначения, основываясь на сообщении, чтобы мультиплицировать трафик в один пункт назначения. Подробнее смотри на <a href="%(datagrams)s">странице дейтаграмм</a>. Простые приложения прослушивают "все протоколы" на "всех портах" пункта назначения.

source: Anonymity and confidentiality
id: Anonimitas dan kerahasiaan
ru: Анонимность и конфиденциальность

source: I2P has transparent end to end encryption and authentication for all data passed over the network - if Bob sends to Alice's destination, only Alice's destination can receive it, and if Bob is using the datagrams or streaming library, Alice knows for certain that Bob's destination is the one who sent the data.
id: I2p memiliki enkripsi yang transparan dan end to end, dan otentikasi untuk semua data yang disahkan melalui jaringan - jika Bob mengirim ke tujuan Alice, hanya Alice yang dapat menerimanya, dan jika Bob menggunakan datagram atau streaming library, Alice tahu dengan pasti tahu untuk bahwa Bob adalah salah yang mengirim data.
ru: В I2P используются прозрачные "end to end" шифрование и аутентификация для всех данных, передаваемых по сети - если Bob отправляет в пункт назначения Alice, только пункт назначения Alice может это получить, и, если Bob использует библиотеку дейтаграмм или потоковую, Alice знает наверняка, что именно пункт назначения Bob'а отправил данные.

source: Of course, I2P transparently anonymizes the data sent between Alice and Bob, but it does nothing to anonymize the content of what they send. For instance, if Alice sends Bob a form with her full name, government IDs, and credit card numbers, there is nothing I2P can do. As such, protocols and applications should keep in mind what information they are trying to protect and what information they are willing to expose.
id: Tentu saja, I2P secara transparan meng-anonimkan data yang dikirim antara Alice dan Bob, tapi itu tidak melakukan apa-apa untuk menganonimkan isi dari pesan yang mereka kirim. Misalnya, jika Alice mengirim kepada Bob, sebuah formulir berisi nama lengkap, no KTP, dan nomor kartu kredit, tidak ada yang I2P dapat lakukan. Dengan demikian, protokol dan aplikasi harus mengingat informasi apa yang mereka coba untuk lindungi dan informasi apa yang mereka bersedia untuk mengekspos.
ru: Естественно, I2P прозрачно анонимизирует данные, пересылаемые между Alice и Bob, но он не делает ничего для анонимизирования содержимого того, что они отсылают. Например, если Alice отправляет Bob'у форму с ее именем, персональным ID и номера кредиток, то I2P тут уж ничего не поделает. Т.о., протоколы и приложения обязаны помнить - какую информацию они должны защищать и какую разглашать.

source: I2P datagrams can be up to several KB
id: Datagram i2p dapat mencapai beberapa KB
ru: Размер дейтаграммы I2P может быть несколько КБ

source: Applications that use I2P datagrams (either raw or repliable ones) can essentially be thought of in terms of UDP - the datagrams are unordered, best effort, and connectionless - but unlike UDP, applications don't need to worry about MTU detection and can simply fire off large datagrams. While the upper limit is nominally 32 KB, the message is fragmented for transport, thus dropping the reliability of the whole. Datagrams over about 10 KB are not currently recommended. See the <a href="%(datagrams)s">datagram page</a> for details. For many applications, 10 KB of data is sufficient for an entire request or response, allowing them to transparently operate in I2P as a UDP-like application without having to write fragmentation, resends, etc.
id: Aplikasi yang menggunakan I2P datagram (yang mentah atau repliable) dapat pada dasarnya dianggap dalam istilah UDP - datagram adalah unordered, usaha terbaik, dan connectionless - tetapi tidak seperti UDP, aplikasi tidak perlu khawatir tentang Deteksi MTU dan bisa begitu saja mengirimkan datagram yang besar. Sementara batas atas nominal adalah 32 KB, pesan dipecah untuk transportasi, dengan demikian menjatuhkan keandalan dari seluruh datagram. Datagram di atas 10 KB tidak dianjurkan saat ini. Lihat <a href="%(datagrams)s">Halaman datagram</a> untuk rincian. Untuk banyak aplikasi, 10 KB data ini cukup untuk seluruh permintaan atau tanggapan, memungkinkan mereka untuk secara transparan beroperasi di I2P sebagai UDP-seperti aplikasi tanpa harus menulis fragmentasi, mengirim ulang, dll.
ru: Приложения, которые используют дейтаграммы I2P (как raw так и repliable), могут быть рассмотрены с точки зрения UDP - дейтаграммы не упорядочены, в лучшем случае, и бессвязны - но в отличие от UDP, приложениям не нужно беспокоиться об определении MTU, и они могут просто кидаться большими дейтаграммами. Так как обычно предел - 32 КБ, сообщение фрагментируется для отправки и надежность падает. Дейтаграммы размером более 10 КБ не рекомендуются для использования. Смотри подробнее на <a href="%(datagrams)s">странице дейтаграмм</a>. Для большинства приложений, 10 КБ данных достаточно для внутреннего запроса или ответа, этого достаточно для прозрачного функционирования в I2P в качестве UDP-подобных приложений без необходимости написания фрагментирования, переотправки и т.п.

source: There are several means of sending data over I2P, each with their own pros and cons. The streaming lib is the recommended interface, used by the majority of I2P applications.
id: Ada beberapa cara pengiriman data dengan I2P, masing-masing dengan kelebihan dan kekurangan. Streaming lib adalah interface yang direkomendasikan, yang digunakan oleh sebagian besar aplikasi I2P.
ru: Есть несколько способов отправки данных через I2P, в каждом есть свои За и Против. Потоковая библиотека - рекомендуемый интерфейс, используемый большинством I2P приложений.

source: The <a href="%(streaming)s">full streaming library</a> is now the standard interface. It allows programming using TCP-like sockets, as explained in the <a href="#start.streaming">Streaming development guide</a>.
id: <a href="%(streaming)s">full streaming library</a> sekarang adalah interface yang standar. Hal ini memungkinkan pemrograman menggunakan soket yang menyerupai TCP, seperti yang dijelaskan dalam <a href="#start.streaming">panduan pengembangan streaming</a>.
ru: <a href="%(streaming)s">Потоковая библиотека</a> теперь является стандартным интерфейсом. Она позволяет программировать, используя TCP-подобные сокеты, как описано в <a href="#start.streaming">Руководстве по потоковой разработке</a>.

source: BOB is the <a href="%(bob)s">Basic Open Bridge</a>, allowing an application in any language to make streaming connections to and from I2P. At this point in time it lacks UDP support, but UDP support is planned in the near future. BOB also contains several tools, such as destination key generation, and verification that an address conforms to I2P specifications. Up to date info and applications that use BOB can be found at this <a href="http://%(boburl)s/">eepsite</a>.
id: BOB adalah <a href="%(bob)s">Basic Open Bridge</a> , yang memungkinkan aplikasi dalam bahasa pemograman apa pun untuk melakukan koneksi streaming ke dan dari I2P. Pada saat itu, ini tidak memiliki dukungan UDP, tapi dukungan UDP direncanakan di masa depan. BOB juga berisi beberapa alat, seperti destination key generation dan verifikasi bahwa alamat sesuai spesifikasi I2P. Info terbaru tentang aplikasi yang menggunakan BOB dapat ditemukan di <a href="http://%(boburl)s/">eepsite</a>ini.
ru: BOB это <a href="%(bob)s">Basic Open Bridge</a>, он позволяет приложениям на любом языке создавать потоковые подключения в и из I2P. В настоящий момент времени в нем нет поддержки UDP, но поддержка UDP запланирована на ближайшее будущее. BOB также содержит несколько утилит, таких как удаленная генерация ключа, и проверка того, что адрес соответствует спецификации I2P. Актуальную информацию и приложения, использующие BOB можно найти это этом <a href="http://%(boburl)s/">eepsite</a>.

source: SAM is not recommended. SAM V2 is okay, SAM V3 is recommended.
id: SAM tidak dianjurkan. SAM V2 tidak apa-apa, SAM V3 dianjurkan.
ru: SAM не рекомендован. SAM V2 одобрен, SAM V3 рекомендован.

source: SAM is the <a href="%(sam)s">Simple Anonymous Messaging</a> protocol, allowing an application written in any language to talk to a SAM bridge through a plain TCP socket and have that bridge multiplex all of its I2P traffic, transparently coordinating the encryption/decryption and event based handling. SAM supports three styles of operation:
id: SAM adalah protokol <a href="%(sam)s">Simple Anonymous Messaging</a> , yang memungkinkan aplikasi yang ditulis dalam bahasa pemograman apapun untuk berbicara dengan SAM bridge melalui soket TCP plain dan memiliki bridge multipleks itu di semua lalu lintas I2P, mengkoordinasikan transparan enkripsi/dekripsi dan event based handling. SAM mendukung tiga gaya operasi:
ru: SAM это протокол <a href="%(sam)s">Simple Anonymous Messaging</a> , он позволяет приложению, написанному на любом языке, обращаться к мосту SAM через TCP сокет и давать этому мосту мультиплицировать весь трафик I2P, прозрачно координирующему шифрование/дешифрование и обработку событий. SAM поддерживает три типа операций:

source: streams, for when Alice and Bob want to send data to each other reliably and in order
id: stream, ketika Alice dan Bob ingin mengirimkan data ke satu sama lain dengan handal dan dalam urutan
ru: потоки, для случая если Alice и Bob хотят отсылать друг другу данные надежно и упорядочено

source: repliable datagrams, for when Alice wants to send Bob a message that Bob can reply to
id: repliable datagram, ketika Alice ingin mengirim pesan yang Bob dapat membalas
ru: repliable дейтаграммы, для случая когда Alice хочет отослать сообщение Bob'у, на которое Bob может ответить

source: raw datagrams, for when Alice wants to squeeze the most bandwidth and performance as possible, and Bob doesn't care whether the data's sender is authenticated or not (e.g. the data transferred is self authenticating)
id: Datagram mentah, ketika Alice ingin memeras sebanyak mungkin bandwidth dan kinerja, dan Bob tidak peduli apakah pengirim data diotentikasi atau tidak (misalnya data yang ditransfer adalah diotentikasi dirinya sendiri)
ru: raw дейтаграммы, для случая если Alice хочет выжать максимум из пропускной способности канала и из проиводительности, и Bob'у не важно - аутентифицирован ли отправитель данных или нет (т.к. передаваемые данные сами по себе аутентифицированы)

source: SAM V3 aims at the same goal as SAM and SAM V2, but does not require multiplexing/demultiplexing. Each I2P stream is handled by its own socket between the application and the SAM bridge. Besides, datagrams can be sent and received by the application through datagram communications with the SAM bridge.
id: SAM V3 bertujuan untuk tujuan yang sama dengan SAM dan SAM V2, tetapi tidak memerlukan multiplexing/demultiplexing. Setiap stream I2P ditangani sendiri oleh soket antara aplikasi dan SAM bridge. Selain itu, datagram dapat dikirim dan diterima oleh aplikasi melalui komunikasi datagram dengan SAM bridge.
ru: SAM V3 служит тем же целям, что и SAM и SAM V2, но он не нуждается в мультиплицировании/демультиплицировании. Каждый поток I2P обрабатывается собственным сокетом между приложением и мостом SAM. Кроме того, дейтаграммы могут отправляться и приниматься приложением через обмен дейтаграммами с мостом SAM.

source: <a href="%(samv2)s">SAM V2</a> is a new version used by imule that fixes some of the problems in <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> is used by imule since version 1.4.0.
id: <a href="%(samv2)s">SAM V2</a> adalah versi baru yang digunakan oleh imule yang memperbaiki beberapa masalah di <a href="%(sam)s">SAM</a>. <br> <a href="%(samv3)s">SAM V3</a> digunakan oleh imule sejak versi 1.4.0.
ru: <a href="%(samv2)s">SAM V2</a> это новая версия, используемая imule, которая исправляет некоторые проблемы <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> используется imule с версии 1.4.0.

source: The I2PTunnel application allows applications to build specific TCP-like tunnels to peers by creating either I2PTunnel 'client' applications (which listen on a specific port and connect to a specific I2P destination whenever a socket to that port is opened) or I2PTunnel 'server' applications (which listen to a specific I2P destination and whenever it gets a new I2P connection it outproxies to a specific TCP host/port). These streams are 8-bit clean, and are authenticated and secured through the same streaming library that SAM uses, but there is a nontrivial overhead involved with creating multiple unique I2PTunnel instances, since each have their own unique I2P destination and their own set of tunnels, keys, etc.
id: Aplikasi I2PTunnel memungkinkan aplikasi untuk membangun tunnel seperti TCP untuk peer dengan menciptakan baik I2PTunnel aplikasi 'klien' (yang mendengarkan pada port tertentu dan terhubung ke destinasi I2P tertentu setiap kali soket ke port dibuka) atau I2PTunnel aplikasi 'server' (yang mendengarkan I2P destinasi tertentu dan setiap kali mendapat sambungan I2P baru, itu membuka outproxies untuk host/port TCP tertentu). Stream ini adalah ini 8-bit bersih, dan dikonfirmasi dan dijamin melalui streaming library yang sama yang digunakan oleh SAM, tetapi ada overhead nontrivial terlibat dengan membuat beberapa instance I2PTunnel unik, karena masing-masing memiliki tujuan I2P unik mereka sendiri dan serangkaian tunnel, kunci, dll.
ru: Приложение I2PTunnel позволяет программам строить особый TCP-подобный туннель к узлам, создавая или "клиентское" приложение I2PTunnel (которое слушает определенный порт и подключается к определенному пункту назначения I2P, если открывается сокет на этом порту) или "серверное" приложение I2PTunnel (которое слушает определенный пункт назначения I2P и все новые подключения I2P проксирует на определенную пару хост/порт TCP). Эти потоки 8-битны, и аутентифицированы и обеспечены безопасностью с помощью той же потоковой библиотеки, которую использует SAM, но при этом нетривиально увеличиваются накладные расходы при создании нескольких уникальных экземпляров I2PTunnel, т.к. у кадого из них есть уникальный пункт назначения I2P и собственный набор туннелей, ключей и т.п.

source: I2P supports a SOCKS V4 and V5 proxy. Outbound connections work well. Inbound (server) and UDP functionality may be incomplete and untested.
id: i2p Mendukung SOCKS V4 dan V5 proxy. Koneksi outbound bekerja dengan baik. Fungsi inbound (server) dan UDP mungkin tidak lengkap dan belum teruji.
ru: I2P поддерживает SOCKS V4 и V5 прокси. Исходящие соединения работают хорошо. Входящие соединения (на сервер) и функциональность UDP могут работать не полностью и не протестированы.

source: Removed
id: Telah dihapus
ru: Удалено
