Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: When your setup is complete and ready for testing, we will need the HTTPS URL, the SSL public key certificate, and the "su3" bundle public key. After testing is complete, these will be added to the hardcoded entries in the Java and C++ routers in the next release, and you will start seeing traffic. We also will need your email address so we may continue to contact you about reseed administration issues. The email will not be made public but will be known to the other reseed operators. You should expect that your nick or name and its association with that URL or IP will become public.
id: Ketika setup anda lengkap dan siap untuk pengujian, kami akan membutuhkan HTTPS URL, SSL sertifikat kunci publik dan kunci publik bundel "su3". Setelah pengujian selesai, ini akan ditambahkan ke entri hardcoded di router Java dan C++ pada rilis berikutnya, dan Andaaakan mulai melihat lalu lintas. Kami juga akan membutuhkan alamat email anda sehingga kami dapat melanjutkan menghubungi anda mengenai masalah administrasi reseed. Emailnya tidak akan disebarluaskan tetapi akan dikenal oleh operator reseed lain. Anda harus mengharapkan bahwa nama asli atau nama samaran anda dan hubungannya dengan URL atau IP akan menjadi umum.

source: Privacy Policy
id: Kebjiakan Privasi

source: A reseed operator is a trusted role in the network. While we do not yet have a formal privacy policy, you must ensure the privacy of our users by not publicizing logs or IPs found in those logs, except as necessary to discuss administration issues with the I2P reseed team.
id: Reseed operator adalah memiliki peran terpercaya dalam jaringan. Sementara kita belum memiliki kebijakan privasi formal, Anda harus memastikan privasi pengguna kami dengan tidak mempublikasikan log atau IPs yang ditemukan di log, kecuali diperlukan untuk mendiskusikan isu-isu administrasi dengan tim I2P reseed.

source: Financial Support
id: Dukungan Keuangan

source: Modest financial support may be available to those running reseed servers. This support would be in partial reimbursement for your server costs. Support will not be paid in advance and will probably not cover all your expenses. Support is only available to those who have been running reseed servers in good standing for several months, and is based on actual need.
id: Dukungan keuangan sederhana mungkin tersedia ke server reseed yang berfungsi. Dukungan ini adalah penggantian sebagian untuk biaya server. Dukungan tidak akan dibayar di muka dan mungkin tidak akan menutupi semua pengeluaran anda. Dukungan hanya tersedia bagi mereka yang telah menjalankan server reseed dalam performa yang baik selama beberapa bulan, dan didasarkan pada kebutuhan sebenarnya.

source: If you would like to discuss support, please contact echelon and CC: backup.
id: Jika anda ingin mendiskusikan dukungan, hubungi eselon dan CC: backup.

source: Getting Started
id: Cara Memulai

source: Our reseed coordinator is "backup" and he may be contacted at backup at mail.i2p or backup at i2pmail.org. Unfortunately, he is not generally on IRC. The reseed setup is somewhat specialized, and you should direct most questions to him.
id: Koordinator reseed kami "backup" dan ia bisa dihubungi di "backup at mail.i2p" atau "backup at i2pmail.org". Sayangnya, ia tidak sering muncul di IRC. Reseed setup adalah agak terspesialisasi, dan anda harus langsung sebagian besar pertanyaan kepadanya.

source: For actual implementation, details below. We have one recommended reseed solution:
id: Untuk pelaksanaannya, lihat rincian di bawah ini. Kami memiliki satu solusi reseed yang direkomendasikan:

source: A Go implementation that includes the web server and all the scripts. This is the recommended solution.
id: Implementasi yang mencakup server web dan semua skripnya. Ini adalah solusi yang disarankan.

source: For further information, read the information at the following links, and then contact backup. Thank you!
id: Untuk informasi lebih lanjut, baca informasi di link berikut lalu kontak Backup. Terima kasih!

source: Detailed Instructions
id: Instruksi Terperinci

source: Thank you for your interest in contributing to I2P! The details of how you can make your contribution are provided below.
ru: Спасибо за ваш интерес к поддержке проекта I2P! Подробности о том, как вы можете сделать свой вклад, приведены ниже.

source: I2P is not incorporated. Your contributions are probably not tax-deductible. If you would like to discuss a large contribution, please contact eche|on.
ru: I2P не является корпорацией или юридическим лицом. Ваши пожертвования, вероятно, не облагаются налогом. Если вы хотите обсудить большое пожертвование, пожалуйста, свяжитесь с echelon.

source: While supplies last, we offer I2P stickers to those who donate enough to cover PayPal fees and postage from the U.S. You must include "stickers please" and your address in the Paypal comments. For other payment methods, follow up with an email to eche|on with the subject "stickers please", your payment information, and your address.
ru: Пока есть запасы, мы предлагаем I2P стикеры тем, чьё пожертвование покрывает сборы PayPal и пересылку из США. Вам необходимо указать "stickers please" и ваш адрес в комментариях PayPal. Для других способов оплаты отправьте письмо echelon, указав в теме "stickers please", платежную информацию и ваш адрес.

source: As of %(date)s, eche|on has been running a <a href="%(coinurl)s">%(cointype)s</a> account for the I2P project. ATTENTION! The address changed on 02-20-2014. ATTENTION! If you'd like to donate using %(cointype)s, just transfer your desired amount of coins to the account <b>%(account)s</b> and leave eche|on a note if you'd like your donation to be mentioned on the I2P webpage.
ru: С %(date)s echelon имеет <a href="%(coinurl)s">%(cointype)s</a> аккаунт для проекта I2P. ВНИМАНИЕ! Адрес изменится с 02-20-2014. ВНИМАНИЕ! Если вы хотели бы сделать пожертвование, используя %(cointype)s, просто переведите желаемое количество монет на аккаунт <b>%(account)s</b> и оставьте echelon сообщение, если вы хотите, чтобы ваше пожертвование было отображено на странице I2P.

source: For easy usage, use the QR code below!
ru: Для простоты используйте этот QR код!

source: As of %(date)s, eche|on has been running a <a href="%(coinurl)s">%(cointype)s</a> account for the I2P project. ATTENTION! The address changed 02-20-2014. ATTENTION! If you'd like to donate using %(cointype)s, just transfer your desired amount of coins to the account <b>%(account)s</b> and leave eche|on a note if you'd like your donation to be mentioned on the I2P webpage.
ru: С %(date)s echelon имеет <a href="%(coinurl)s">%(cointype)s</a> аккаунт для проекта I2P. ВНИМАНИЕ! Адрес изменится с 02-20-2014. ВНИМАНИЕ! Если вы хотели бы сделать пожертвование, используя %(cointype)s, просто переведите желаемое количество монет на аккаунт <b>%(account)s</b> и оставьте echelon сообщение, если вы хотите, чтобы ваше пожертвование было отображено на странице I2P.

source: As of %(date)s, Meeh has been running a <a href="%(coinurl)s">%(cointype)s</a> account for the I2P project. If you'd like to donate using %(cointype)s, just transfer your desired amount of coins to the account <b>%(account)s</b> and leave Meeh a note if you'd like your donation to be mentioned on the I2P webpage.
ru: C %(date)s Meeh имеет <a href="%(coinurl)s">%(cointype)s</a> аккаунт для проекта I2P. Если вы хотели бы сделать пожертвование, используя %(cointype)s, просто переведите желаемое количество монет на аккаунт <b>%(account)s</b> и оставьте Meeh сообщение, если вы хотите, чтобы ваше пожертвование было отображено на странице I2P.

source: We accept most altcoins, just ask Meeh. Other altcoins can be converted and exchanged for a crypto currency we currently support. Please send a mail to "%(account)s" for a such donation.
ru: Мы принимаем большинство криптовалют, просто спросите Meeh. Другие криптовалюты могут быть конвертированы и обменяны на принимаемую нами валюту. Пожалуйста, отправьте письмо "%(account)s" для такого пожертвования.

source: You can donate direct via PayPal to the account "%(account)s".
ru: Вы можете пожертвовать на прямую через PayPal на аккаунт "%(account)s".

source: One time donation:
ru: Разовое пожертвование:

source: Donate 10 &euro;/month for 12 months:
ru: Жертвовать по 10 &euro;/месяц в течение 12 месяцев:

source: I2P donation
ru: пожертвовать I2P

source: Donate 20 &euro;/month for 12 months:
ru: Жертвовать по 20 &euro;/месяц в течение 12 месяцев:

source: Donate 30 &euro;/month for 12 months:
ru: Жертвовать по 30 &euro;/месяц в течение 12 месяцев:

source: Donate 50 &euro;/month for 12 months:
ru: Жертвовать по 50 &euro;/месяц в течение 12 месяцев:

source: Flattr this
ru: Через Flattr

source: If you want to keep more or less anonymous, the option to send money via mail is also available. But it is less secure as the envelope can be lost on the way to us.
ru: Если вы хотите более или менее сохранить анонимность, вы можете отправить деньги почтой. Однако это менее безопасно так как конверт может потеряться по пути к нам.

source: If you'd like to donate via snail mail, send an email to <a href="mailto:%(email)s?subject=information about snailmail donation">%(email)s</a> and you'll receive an email with instructions detailing how to proceed.
ru: Если вы хотите сделать пожертвование по средствам бумажной почты, отправьте электронное письмо на адрес <a href="mailto:%(email)s?subject=information about snailmail donation">%(email)s</a> и в ответ вы получите письмо с подробными инструкциями как это осуществить.

source: In the meantime, feel free to take a look at the generous donations that have been given in support of the I2P Project at the <a href="%(halloffame)s">hall of fame</a>.
ru: А пока, вы можете взглянуть на щедрые пожертвования сделанные проекту I2P в <a href="%(halloffame)s">зале славы</a>.

source: We need help in many areas, and you don't need to know Java to contribute! Here's a list to help you get started!
ru: Нам нужна помощь по многим направлениям, поэтому вам не обязательно знать язык Java, чтобы оказать помощь! Вот список, который поможет вам начать!

source: Run the latest builds from <a href="%(monotone)s">monotone</a> and report results on #i2p or as bugs on <a href="%(trac)s">Trac</a>.
ru: Запустите последние сборки из <a href="%(monotone)s">monotone</a> и отправьте результаты на #i2p или, в качестве сообщения об ошибке на <a href="%(trac)s">Trac</a>.

source: Coding
ru: Программируйте

source: There's plenty to do if you know Java or are ready to learn. Check for open tickets on <a href="%(trac)s">Trac</a> or the TODO list on <a href="http://%(zzz)s">%(zzz)s</a> for some ideas on where to start. See the <a href="%(newdevs)s">new developer's guide</a> for details.
ru: Есть много дел, если вы знаете Java или готовы его изучать. Проверьте открытые тикеты на <a href="%(trac)s">Trac</a> или список TODO на <a href="http://%(zzz)s">%(zzz)s</a>, чтобы понять с чего начать. Подробнее смотрите <a href="%(newdevs)s">руководство нового разработчика</a>.

source: Roadmap
ru: План разработки

source: Include some seed data in the distribution so a central reseed location isn't required?
ru: Включить дополнительные начальные данные в дистрибутив, т.о. не будет необходимости в централизованной начальной загрузке?

source: Improve help pages and website
ru: Улучшить страницы помощи и веб-сайт

source: More translations
ru: Больше переводов

source: SSU disconnect message
ru: Сообщение о разрыве соединения SSU

source: Iterative floodfill lookups
ru: Итеративный поиск floodfill

source: Full review of anonymity issues and other vulnerabilities
ru: Полный пересмотр вопросов анонимности и других уязвимостей

source: Reduce memory usage, remove debugging overhead, make it run better on slow and embedded machines
ru: Уменьшить использование памяти, убрать накладные расходы на отладку, улучшить запуск на медленных устройствах и встраиваемых системах

source: Docs
ru: Документация

source: link
ru: ссылка

source: BTC I2P native client
ru: Родной I2P клиент BTC

source: datastore
ru: хранилище данных

source: For the future of I2P and in order to attract more people to I2P, this bounty was set for including an I2P package into the Ubuntu and Debian archive mirrors. To claim this bounty, the I2P router package needs to be available from Ubuntu and Debian archive mirrors and Debian bug <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> needs to be closed successfully.
ru: Ради будущего I2P и для привлечения большего количества людей к I2P, эта награда установлена за включение пакета I2P в зеркала архивов Ubuntu и Debian. Для получения этой награды, пакет маршрутизатора I2P должен быть доступен на архивных зеркалах Ubuntu и Debian, и Debian баг <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> должен быть успешно закрыт.

source: Current bounties
ru: Текущие награды

source: Status
ru: Статус

source: Judge
ru: Судья

source: Dev
ru: Разработчик

source: Bounty
ru: Награда

source: Frost for I2P datastorage
ru: Frost для хранилища данных I2P

source: Proposal in development
ru: Предложено для разработки

source: vacant
ru: свободно

source: Eepsites served out of I2P datastorage
ru: Eepsites для хранилища данных I2P

source: Backporting Phex code onto I2PHex
ru: Портирование кода Phex в i2Phex

source: Bitcoin client for I2P
ru: Биткойн клиент для I2P

source: Done, phase of verification
ru: Выполнено, выполняется верификация

source: Unit tests and Multi-router Simulation
ru: Юнит тестирование и симулирование мульти-роутера

source: Partly done, partly in work, partly still open
ru: Частично выполнено, частично работает, частично еще в работе

source: Hold bounties, set on hold due to jrandom AWOL and missing funding
ru: Выплата награды задерживается из-за jrandom AWOL и отсутствия финансирования

source: Bundling bounties
ru: Объединение наград

source: Proposed
ru: Предложено

source: Swarming file transfer
ru: Сегментированная передача файлов

source: Streaming library window size
ru: Размер окна потоковой библиотеки

source: IRC connect time monitor
ru: Контроль времени подключения IRC

source: NetDB Backend
ru: Бэкенд NetDB

source: netDB backend
ru: Бэкенд netDB

source: For our bad sake the syndie project was out of development for quite a long time yet (5 years). To get a fresh and new built with needed bugfixes we set out this bounty. Also syndie needs some enhancements and a better GUI for users to work with it. Current bounty sum is 50 Bitcoin.
ru: На нашу беду проект syndie перестал разрабатываться довольно давно (5 лет). Чтобы получить свежую сборку с необходимыми исправлениями мы установили эту награду, также syndie нуждается в некотором совершенствовании и лучшем GUI для пользователей. Текущий размер награды - 50 биткойнов.

source: unit test
ru: Юнит тесты

source: Bounty: %(euro)s &euro;
ru: Награда: %(euro)s &euro;

source: Application Development Guide
ru: Руководство по разработке приложений

source: Contents
ru: Содержание

source: Streaming Lib
ru: Потоковая библиотека Streaming Lib

source: Source path
ru: Исходный путь

source: GPL + java exception
ru: Исключение для GPL + Java

source: Commit privileges
ru: Привилегии фиксирования

source: Release Signing Key
ru: Ключи подписания релизов

source: Following is the GPG key for the security@geti2p.net email address:
ru: Ниже приведен GPG ключ для адреса электронной почты security@geti2p.net.

source: Ensure that you pull the latest revision before you check in. If you inadvertently diverge, merge and push as soon as possible. Don't routinely make others merge for you. Yes, we know that monotone says you should push and then merge, but in our experience, in-workspace merge works just as well as in-database merge, without creating a merge revision.
ru: Убедитесь, что вы выбрали последнюю ревизию до того как выполнили чекин. Если вы случайно разошлись, выполните merge и push как можно скорее. Не заставляйте других выполнять merge за вас. Да, мы знаем, что monotone говорит - вы должны выполнить push, а затем merge, но, по нашему опыту, in-workspace merge работает также хорошо как и in-database merge, без создания merge ревизии.

source: New classes and methods require at least brief javadocs. Add @since release-number.
ru: Для новых классов и методов нужен хотя бы краткий javadocs. Добавьте @since номер-релиза.

source: We require Java 6 to build but only Java 5 to run I2P. Do not use Java 6 classes or methods without handling the class not found exceptions and providing alternate Java 5 code. See classes in net.i2p.util for examples.
ru: Мы требуем Java 6 для сборки, но только Java 5 для запуска I2P. Не используйте классы или методы Java 6 без обработки исключений "class not found" и выполнения альтернативного кода Java 5. Для примера смотри классы net.i2p.util.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain .project and .classpath Eclipse files, to enable the branch to be easily set up in Eclipse.
ru: Главные ветки разработки I2P (<code>i2p.i2p</code> и ее подветки) содержат файлы Eclipse .project и .classpath для легкого добавления веток в Eclipse.

source: Open Eclipse and create a new Workspace, based in the directory that the I2P branch was checked out to.
ru: Откройте Eclipse и создайте новый Workspace для директории, в которую вы извлекли ветку I2P.

source: Select "File - Import..." and then under "General" select "Existing Projects into Workspace".
ru: Выберите "File - Import..." и в разделе "General" выберите "Existing Projects into Workspace".

source: For "Select root directory:" choose the directory that the I2P branch was checked out to.
ru: Для опции "Select root directory:" выберите директорию, в которую вы извлекли ветку I2P.

source: If necessary, click "Refresh" to refresh the list of projects.
ru: Если необходимо, нажмите "Refresh" для обновления списка проектов.

source: Select every project in the list, and click "Finish".
ru: Выберите каждый проект в списке и нажмите "Finish".

source: Obtaining and deploying developers’ transport keys
ru: Получение и применение transport ключей разработчиков

source: For development on the i2p router or the embedded applications, get the monotone source repository installed - short instructions:
ru: Для разработки маршрутизатора I2P или встроенных приложений, установите хранилище исходников monotone - краткая инструкция:

source: Enable the <a href="%(i2ptunnel)s">i2ptunnel</a> client tunnel on port 8998 pointing to mtn.i2p2.i2p.
ru: Включите клиентский туннель <a href="%(i2ptunnel)s">i2ptunnel</a> на порту 8998, указывающий на mtn.i2p2.i2p.

source: Alternatively, instead of 'mtn.i2p2.de', you can also download from mtn.i2p-projekt.de.
ru: Также, вместо 'mtn.i2p2.de' вы можете выполнять загрузку с mtn.i2p-projekt.de.

source: FAQ
ru: ЧАВо
