Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: In addition to the anonymity aspects of more varied tunnel operation, there is a functional dimension as well. Each peer only has a certain amount of data they can route for the network, and to keep any particular tunnel from consuming an unreasonable portion of that bandwidth, they will want to include some throttles on the tunnel. For instance, a tunnel may be configured to throttle itself after passing 600 messages (1 per second), 2.4MB (4KBps), or exceeding some moving average (8KBps for the last minute). Excess messages may be delayed or summarily dropped. With this sort of throttling, peers can provide ATM-like QoS support for their tunnels, refusing to agree to allocate more bandwidth than the peer has available.
id: Selain aspek anonimitas operasi tunnel yang lebih bervariasi, ada juga dimensi fungsional. Setiap peer hanya memiliki sejumlah data yang dapat mereka tuju untuk jaringan, dan untuk menjaga agar tunnel tertentu tidak mengkonsumsi porsi bandwidth yang tidak masuk akal, mereka ingin memasukkan beberapa throttle di tunnel. Sebagai contoh, sebuah tunnel mungkin dikonfigurasi untuk throttle sendiri setelah melewatkan 600 pesan (1 per detik), 2.4MB (4KBps), atau melebihi rata-rata (8KBps untuk menit terakhir). Kelebihan pesan mungkin tertunda atau dihapus. Dengan ini semacam throttling, peer dapat memberikan dukungan QoS seperti-ATM untuk tunnel, menolak untuk setuju untuk mengalokasikan lebih banyak bandwidth daripada peer telah tersedia.
ru: Наряду с аспектами анонимности большего количества операций над туннелями, есть и функциональная составляющая. У каждого узла есть определенное количество данных, которые он может маршрутизировать для сети, и чтобы уберечь определенный туннель от необоснованного использования полосы пропускания, они захотят добавить некий регулятор в туннель. Например, туннель может быть сконфигурирован на самоограничение после прохождения 600 сообщений (1 в секунду), 2.4МБ (4КБ/с), или по достижении некоего изменяемого порога (8КБ/с за последнюю минуту). Избыточные сообщения могут быть задержаны, или отброшены. С таким регулированием узлы могут обеспечить поддержку QoS типа ATM для их туннелей, избегая выделения полосы пропускания большей, чем доступно узлу.

source: In addition, we may want to implement code to dynamically reroute tunnels to avoid failed peers or to inject additional hops into the path. This can be done by garlic routing a message to any particular peer in a tunnel with instructions to redefine the next-hop in the tunnel.
id: Selain itu, kita mungkin ingin menerapkan kode untuk secara dinamis mengalihkan tunnel untuk menghindari rekan-rekan yang gagal atau untuk menyuntikkan tambahan hop ke path. Ini dapat dilakukan dengan mengirim pesan dengan garlic routing untuk setiap peer yang tertentu dalam tunnel dengan petunjuk untuk mendefinisikan kembali hop berikutnya di dalam tunnel.
ru: Также, мы можем реализовать код, динамически перемаршрутизирующий туннели, чтобы уберечься от ошибочных узлов или добавить дополнительные хопы в маршрут. Это можно сделать, чесночно маршрутизировав сообщение для определенного узла в туннеле, с предписанием переопределить следующий прыжок в туннеле.

source: Beyond the per-tunnel batching and mixing strategy, there are further capabilities for protecting against powerful attackers, such as allowing each step in a garlic routed path to define a delay or window in which it should be forwarded on. This would enable protections against the long term intersection attack, as a peer could send a message that looks perfectly standard to most peers that pass it along, except at any peers where the clove exposed includes delay instructions.
id: Di balik batching per-terowongan dan strategi pencampuran, ada kemampuan lebih lanjut untuk melindungi terhadap ari penyerang yang kuat, seperti memungkinkan setiap langkah di jalan melakukan garlic routing untuk mendefinisikan keterlambatan atau jendela di mana kepadanya pesan diteruskan. Ini akan memungkinkan perlindungan terhadap serangan persimpangan jangka panjang, seperti peer bisa mengirim pesan standar yang terlihat sempurna untuk kebanyakan peer yang memberikannya, kecuali di peer yang mana clove yang terbuka termasuk petunjuk penundaan.
ru: Наряду с методами смешивания и объединения туннелей, есть еще возможности для защиты от мощных атак, например, разрешить каждому шагу на пути чесночного маршрута определять задержку или окно, с которыми должна работать маршрутизация. Это позволит защититься от долгих атак пересечением, т.к. узел может отослать сообщение, которое выглядит как вполне стандартное для большинства узлов, через которые оно проходит, за исключением тех узлов, где зубчик подвергается добавлению инструкций по задержке.

source: Performance related improvements are listed on the <a href="%(futureperf)s">Performance</a> page.
id: Kinerja terkait perbaikan tercantum di halaman <a href="%(futureperf)s">Performance</a> .
ru: Улучшения, связанные с производительностью, перечислены на странице <a href="%(futureperf)s">Производительность</a>.

source: Bounty Arabic translation of webpage and router console
id: Bounty untuk terjemahan bahasa Arab untuk halaman web dan router konsol
ru: Поощряемый перевод на арабский веб-сайта и консоли маршрутизатора

source: Arabic translation
id: Penerjemahan bahasa Arab
ru: Арабский перевод

source: To improve I2P usage and attract more people into I2P echelon set out this bounty for translation of the I2P web page and I2P router console into Arabic.
id: Untuk meningkatkan penggunaan I2P dan menarik lebih banyak orang ke I2P, echelon menetapkan bounty ini untuk terjemahan dari halaman web I2P dan I2P router console ke dalam bahasa Arab.
ru: Чтобы расширить использование I2P и привлечь больше людей в эшелон I2P мы поощряем за перевод веб-сайта I2P и консоли маршрутизатора на арабский.

source: This bounty is set into 2 subparts:
id: Bounty ini dibagi menjadi 2 bagian:
ru: Награда состоит из 2 частей:

source: Part 1 is translation of the webpage.
id: Bagian 1 adalah terjemahan dari halaman web.
ru: Часть 1 - перевод веб-страницы.

source: For collecting the bounty of 20 BTC you need to translate the following pages:
id: Untuk mengumpulkan karunia 20 BTC, anda perlu menerjemahkan halaman-halaman berikut:
ru: Чтобы получить 20 биткойнов вам нужно перевести эти страницы:

source: This job was done by hamada and the bounty of 20 BTC was paid to hamada.
id: Pekerjaan ini dilakukan oleh hamada dan bounty sebesar 20 BTC dibayar kepada hamada.
ru: Эта работа была выполнена hamada и награду в 20 биткойнов была выплачена hamada.

source: Part 2 is the translation of the router console. The router console was partly translated and the bounty of 80 BTC was paid to hamada.
id: Bagian 2 adalah terjemahan dari router console. Router console sebagian diterjemahkan dan bounty sebesar 80 BTC dibayar kepada hamada.
ru: Часть 2 - перевод консоли маршрутизатора. Консоль маршрутизатора была частично переведена и награда в 80 биткойнов была выплачена hamada.

source: Judge is echelon.
id: Hakimnya adalah echelon.
ru: Судья - echelon.

source: Bounty creating a I2P native Bitcoin client
id: Bounty menciptakan klien Bitcoin native I2P
ru: Награда за создание родного I2P клиента Bitcoin

source: For a future of I2P and attract more people into I2P this bounty is to create a I2P native Bitcoin client. It should integrate with other client via the I2P network and via gateways to the existant bitcoin network.
id: Untuk masa depan I2P dan menarik lebih banyak orang ke I2P bounty ini adalah untuk menciptakan client asli Bitcoin di I2P. Itu seharusnya terintegrasi dengan klien lain melalui jaringan I2P dan melalui gateway ke jaringan bitcoin.
ru: Ради будущего I2P и для привлечения большего количества людей в I2P награда выплачивается за создание родного I2P клиента Bitcoin. Он должен интегрироваться с другими клиентами через сеть I2P и через шлюзы в существующую сеть bitcoin.

source: Judge is psychonaut who donated the first 30 &euro; to this bounty. Bounty was almost fullfilled with <a href="http://echelon.i2p/btci2p/">btci2p</a>, only a small part of creating a plugin is leftover. User giv has been paid for the work.
id: Hakimnya adalah psychonaut yang menyumbangkan 30 &euro; pertama untuk bounty ini. Bounty-nya hampir dipenuhi dengan <a href="http://echelon.i2p/btci2p/">btci2p</a>, hanya sebagian kecil untuk menciptakan sebuah plugin yang tersisa. Pengguna bernama giv telah dibayar untuk pekerjaan tersebut.
ru: Судья — psychonaut, пожертвовавший первые 30 &euro; для этой награды. Задача была почти полностью реализована в <a href="http://echelon.i2p/btci2p/">btci2p</a>, осталась лишь небольшая часть по созданию плагина. Пользователю giv была выплачена награда.

source: Bounty datastorage
id: Bounty untuk datastorage
ru: Хранилище данных наград

source: To improve I2P's usage and to be independent of routers online status we want a datastorage as a extension to I2P. Like in Freenet the datastorage should be distributed and every participating node should be able to configure his options. The files should be saved in chunks and at least 2-3 times to obtain redundancy. Usage of storage space should be auto balanced. As it is a extra application, it should work flawless within I2P and cooperate nice with the I2P router. Maybe a integration within the webpage/router could be done.
id: Untuk meningkatkan penggunaan I2P's dan menjadi independen dari router status online, kami ingin datastorage sebagai ekstensi untuk I2P. Seperti di Freenet, datastorage harus didistribusikan dan setiap node yang berpartisipasi harus mampu mengkonfigurasi pilihan-yya. File harus disimpan dalam potongan dan setidaknya 2 - 3 kali untuk mendapatkan redundansi. Penggunaan ruang penyimpanan harus seimbang secara otomatis. Seperti sebuah aplikasi tambahan, itu harus bekerja sempurna dalam I2P dan bekerjasama baik dengan I2P router. Mungkin integrasi dalam halaman web/router dapat dilakukan.
ru: Для улучшения использования I2P и для независимости от сетевого статуса маршрутизаторов, нам нужно хранилище данных в качестве расширения к I2P. Как и в Freenet хранилище данных должно быть распределенным и каждый участвующий узел должен иметь возможность управлять его настройками. Файлы должны сохраняться в памяти по крайней мере 2-3 раза для достижения избыточности. Использование места в хранилище должно автоматически балансироваться. Поскольку это дополнительное приложение, оно должно безупречно работать в I2P и взаимодействовать с маршрутизатором I2P. Возможно понадобится интеграция с веб-страницей/маршрутизатором.

source: This bounty cooperates with the 2 other bounties "frost for I2P" and "eepsites in datastorage".
id: Bounty ini bekerja sama dengan 2 bounty lain "frost untuk I2P" dan "eepsites di datastorage".
ru: Эта награда связана с двумя другими: "Frost для I2P" и "Eepsites в хранилище данных".

source: The frost for I2P datastorage bounty is paid for a frost like program with which files/messages are stored into database and got from database. It needs to work with a GUI.
id: Bounty Frost untuk I2P datastorage dibayar untuk program seperti Frost di mana file pesan disimpan ke dalam database dan didapat dari database. Perlu untuk bekerja dengan GUI.
ru: Награда за Frost для хранилища данных I2P выплачивается за программу типа Frost, которая хранит файлы/сообщения в базе данных, и достает их оттуда. Она должна работать с GUI.

source: The eepsite served out of I2P datastorage extends a I2P router to send out eepsites out of the I2P datastorage. All files for eepsites need to be saved inside of datastorage and are taken from it. Extension: For better integration all datastorage participants could serve that eepsite.
id: Eepsite yang disajikan dari I2P datastorage memperluas I2P router untuk mengirim eepsites dari I2P datastorage. Semua file untuk eepsites perlu disimpan ke dalam datastorage dan diambil dari itu. Perpanjangan: Untuk integrasi lebih baik semua peserta datastorage bisa melayani eepsite itu.
ru: Eepsite для хранилища данных I2P расширяет маршрутизатор I2P, для отправки eepsites из хранилища данных I2P. Все файлы для eepsites должны хранится в хранилище и извлекаться из него. Расширение: Для лучшей интеграции все участники хранилища данных должны обслуживать eepsite.

source: For bounties to be declared done and paid, we need the program AND the source. Source and code need to be licensed under a free license (free to change and free to distribute).
id: Untuk bounty dinyatakan dilakukan selesai dan dibayar, kita memerlukan program dan source code. Source dan code harus dilisensikan di bawah lisensi bebas (bebas untuk mengubah dan bebas untuk mendistribusikan).
ru: Для выплаты награды нам необходима программа И исходники. Исходники и программа должны распространяться по свободной лицензии (свободное изменение и распространение).

source: Bounty I2P package in Debian and Ubuntu mirrors
id: Bounty I2P paket di mirror Debian dan Ubuntu
ru: Награда за пакет I2P в зеркалах Debian и Ubuntu

source: I2P Ubuntu/Debian package
id: Paket i2p untuk Ubuntu/Debian
ru: Ubuntu/Debian пакет I2P

source: For the future of I2P and in order to attract more people to I2P, this bounty was set for including an I2P package into the Ubuntu and Debian archive mirrors. To claim this bounty, the I2P router package needs to be available from Ubuntu and Debian archive mirrors and Debian bug <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> needs to be closed successfully. Done in 2017 by mhatta.
id: Untuk masa depan I2P dan menarik lebih banyak orang ke I2P, imbalan ini dibuat untuk memperkenalkan paket I2P ke dalam Ubuntu dan Debian archive mirrors. Untuk mengambil imbalan ini, I2P router package harus tersedia di dalam Ubuntu dan Debian archive mirrors dan Debian bug <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> perlu ditutup dengan sukses. Done in 2017 by mhatta.

source: Bounty I2PHex code implementation
id: Implementasi kode bounty I2PHex
ru: Награда за реализацию кода I2PHex

source: i2phex code implementation
id: Implementasi kode i2phex
ru: Реализация кода I2PHex

source: To improve I2P usage and attract more people into I2PHex P2P ArneBab setout the bounty for implementing actual Phex code onto I2PHex.
id: Untuk meningkatkan penggunaan I2P dan menarik lebih banyak pengguna I2PHex P2P, ArneBab memberikan bounty untuk mengimplementasikan kode Phex aktual ke I2PHex.
ru: Для улучшения использования I2P и привлечения большего количества людей к I2PHex P2P ArneBab установил награду за реализацию актуального кода Phex в I2PHex.

source: Bounties for I2P
id: Bounty untuk I2P
ru: Награды за I2P

source: While we always gratefully accept any contributions of code, documentation, and the like, there are other ways to help I2P move forward. As with any open source project, our goals would be achieved more rapidly if we were able to support all of our contributors to work on I2P full time. However, as with any open source project, that's not a possibility. Instead, we are making use of a bounty system, whereby anyone can get support for working on something that people want implemented, and people who want to contribute to I2P can be assured that their support goes to what they care about.
id: Sementara kita selalu dengan senang menerima setiap kontribusi kode, dokumentasi, dan sejenisnya, ada cara lain untuk membantu I2P bergerak maju. Seperti proyek open source lain, tujuan kita akan dicapai lebih cepat jika kita mampu untuk mendukung semua kontributor kami untuk bekerja pada I2P penuh waktu. Namun, seperti dengan proyek open source lain, itu tidak kemungkinan. Sebaliknya, kami membuat sistem bounty, di mana siapa pun bisa mendapatkan dukungan untuk mengerjakan sesuatu yang orang lain ingin diimplementasikan, dan orang-orang yang ingin berkontribusi kepada I2P dapat yakin bahwa dukungan mereka pergi ke apa yang mereka peduli.
ru: Мы всегда с благодарностью принимаем любую помощь в написании кода, документации, и т.п., но есть и другие способы помочь продвижению I2P. Как и во всех проектах с открытым исходным кодом, наша цель будет достигнута быстрее, если мы сможем мотивировать всех наших участников работать над I2P полный рабочий день. Но, как в любом проекте с открытым исходным кодом, это не возможно. Вместо этого мы создали систему поощрений, благодаря которой все мотивируются за работу над тем, что люди хотят реализовать, и люди, которые хотят пожертвовать средства на I2P могут быть уверены, что их пожертвования пойдут на то, что им нужно.

source: We are also keeping open the ability for people who want to support I2P but don't have strong feelings about the bounties available. Those people can simply put their trust in the I2P team to do what we feel is best by donating to a catch-all general fund that will be used as deemed necessary - allocated to various bounties, covering incidentals (hosting, etc), and the like.
id: Kami juga terus membuka kesempatan untuk orang yang ingin mendukung I2P tetapi tidak memiliki keinginan yang kuat untuk mendapat bounty yang tersedia. Mereka menempatkan kepercayaan mereka kepada tim I2P untuk melakukan apa yang kami rasakan terbaik dengan menyumbangkan untuk menangkap semua dana umum yang akan digunakan, sebagai dianggap perlu - dialokasikan untuk berbagai bounty, menutupi biaya tak terduga (hosting, dll), dan sejenisnya.
ru: Мы также оставляем возможность людям, которые хотят поддержать I2P, даже если они не уверены насчет необходимых поощрений. Эти люди просто могут довериться команде I2P, которая работает над тем, что мы считаем наиболее важным, и жертвовать в общий фонд, который мы будем использовать по необходимости - распределять на несколько наград, покрывать расходы (хостинг и т.д.), и т.п.

source: Name
id: Nama
ru: Имя

source: Claimed bounties
id: Bounty diklaim
ru: Заявленные награды

source: Dev team
id: Tim pengembang
ru: Команда разработчиков

source: I2P package in Debian and Ubuntu mirrors
id: Paket I2p di mirror Debian dan Ubuntu
ru: Пакет I2P на зеркалах Debian и Ubuntu

source: Make I2P IPv6 native
id: Membuat I2P di native IPv6
ru: Сделать I2P IPv6 нативным

source: Setting up a SILC server
id: Menyiapkan server SILC
ru: Установка сервера SILC

source: Datastore over I2P
id: Datastore di atas I2P
ru: Хранилище данных над I2P

source: Russian translation
id: Penerjemahan ke bahasa Russia
ru: Русский перевод

source: Unit tests (part 1)
id: Unit test (Bagian 1)
ru: Юнит тестирование (часть1)

source: Dev lists anyone who may already be working on the bounty - collaboration is preferred, so if you're interested in working on it, please contact one of the people listed!
id: Pengembang mendaftar siapa saja yang sudah mengerjakan bounty - kolaborasi lebih disukai, jadi jika anda tertarik untuk mengerjakan sebuah bounty, silahkan hubungi salah satu dari orang-orang yang terdaftar!
ru: Перечислены все, кто уже работает за награду - сотрудничество является предпочтительным, так что если вы заинтересованы в этой работе, пожалуйста, свяжитесь с перечисленными людьми!

source: Bounty I2P IPv6 native
id: Bounty I2P IPv6 asli
ru: Награда за нативный I2P IPv6

source: native IPv6 I2P
id: IPv6 native di I2P
ru: нативный IPv6 I2P

source: For a future of I2P and attract more people into I2P I withdrawal the vuze bounty and offer a IPv6 bounty. To claim this bounty, the I2P router needs to run full on native IPv6 connections like it does on IPv4.
id: Untuk masa depan I2P dan menarik lebih banyak orang ke I2P, saya membatalkan bounty untuk vuze karunia dan menawarkan bounty untuk IPv6. Untuk mengklaim bounty ini, I2P router perlu berjalan penuh pada koneksi IPv6 native seperti di IPv4.
ru: Ради будущего I2P и привлечения большего количества людей в I2P, я снимаю награду за vuze и предлагаю награду за IPv6. Награда выплачивается за реализацию полной поддержки нативного IPv6 в маршрутизаторе I2P, как это сделано для IPv4.

source: For bounties to be declared done and paid, we need the plugin AND the source. Source and code need to be licensed under a free license (free to change and free to distribute).
id: Untuk bounty dinyatakan selesai dan dibayar, kita memerlukan plugin dan sumber kodenya. Source dan code harus dilisensikan di bawah lisensi bebas (bebas untuk mengubah dan bebas untuk mendistribusikan).
ru: Чтобы награда числилась завершенной и выплаченной необходимо предоставить плагин И исходники. Исходники должны быть предоставлены по свободной лицензии (свободное изменение и распространение).

source: The current NetDB implementation (namely the FloodFill system) needs to be extended with another backend to improve reliability, reduce attack surface and solve the scalability issue for the coming years.
id: Implementasi NetDB saat ini (yaitu sistem FloodFill) perlu diperpanjang dengan backend lain untuk meningkatkan kehandalan, mengurangi surface attact dan memecahkan masalah skalabilitas untuk tahun-tahun mendatang.
ru: Текущую реализацию NetDB (а точнее, систему FloodFill) нужно расширить другим бэкендом для улучшения надежности, уменьшения поверхности атаки и решения вопросов масштабирования в ближайшие годы.

source: A solution likely based on a DHT will be investigated and finally implemented.
id: Solusi yang mungkin didasarkan pada DHT akan diselidiki dan akhirnya diterapkan.
ru: Будет рассмотрено и наконец-то реализовано решение на основе DHT.

source: Bounty russian translation of webpage and router console
id: Bounty terjemahan bahasa Rusia dari halaman web dan router konsol
ru: Награда за русский перевод веб-страниц и консоли маршрутизатора

source: To improve I2P usage and attract more people into I2P a anonymous donator set out the bounty for translation of the I2P web page and I2P router console into russian language.
id: Untuk meningkatkan penggunaan I2P dan menarik lebih banyak orang ke I2P, donatur anonim membuat bounty untuk terjemahan dari halaman web I2P dan I2P router konsol ke dalam bahasa Rusia.
ru: Для улучшения использования I2P и привлечения большего количества людей в I2P анонимный даритель установил награду за перевод веб-страниц I2P и консоли маршрутизатора I2P на русский язык.

source: For collecting the bounty of $115 USD you need to translate the following pages:
id: Untuk mengambil bounty sebesar $115 USD, anda perlu menerjemahkan halaman-halaman berikut:
ru: Для получения награды в $115 USD вам необходимо перевести следующие страницы:

source: Part 2 is the translation of the router console. The whole router console needs to be translated to collect the bounty of $115 USD.
id: Bagian 2 adalah terjemahan dari router console. Seluruh bagian router console perlu diterjemahkan untuk mengumpulkan bounty sebesar $115 USD.
ru: Часть 2 - перевод консоли маршрутизатора. Вся консоль маршрутизатора должны быть переведена для получения награды в $115 USD.

source: Judge is the russian donor.
id: Hakimnya adalah donor dari Rusia.
ru: Судья - русский даритель.

source: Bounty migrate I2P IRC to SILC
id: Bounty untuk migrasi I2P IRC ke SILC
ru: Награда за миграцию I2P IRC на SILC

source: I2P silc server
id: server silc I2p
ru: I2P silc сервер
