Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: Donate
id: Donasi
ru: Пожертвовать

source: Tax Status
id: Status Pajak
ru: Налоговый статус

source: Stickers
id: Stricker
ru: Стикеры

source: Get Involved!
id: Ikut Terlibat!
ru: Присоединяйтесь!

source: We need your help!
id: Kami membutuhkan bantuan Anda!
ru: Нам нужна ваша помощь!

source: To get involved, please feel free to join us on the #i2p-dev IRC channel (on irc.freenode.net, irc.oftc.net, or within I2P on irc.echelon.i2p, irc.dg.i2p or irc.postman.i2p).
id: Untuk ikut terlibat, jangan sungkan untuk bergabung dengan kami pada channel IRC #i2p (pada irc.freenode.net, atau di dalam I2P pada irc.echelon.i2p, irc.dg.i2p or irc.postman.i2p).
ru: Чтобы принять участие, не стесняйтесь и заходите на наш IRC канал #i2p-dev (на серверах irc.freenode.net и irc.oftc.net или в сети I2P на серверах irc.echelon.i2p, irc.dg.i2p и irc.postman.i2p).

source: If you're interested in joining our <a href="%(team)s">team</a>, please get in touch as we're always looking for eager contributors!
id: Jika Anda tertarik untuk bergabung dengan <a href="%(team)s">tim</a> kami, silahkan berhubungan karena kami selalu mencari kontributor yang bersemangat!
ru: Если вы хотите присоединить к нашей <a href="%(team)s">команде</a>, пожалуйста, свяжитесь с нами, так как мы постоянно ищем новых активных участников.

source: We need help in many areas, and you don't need to know Java to contribute! Here's a list to help get you started!
id: Kami membutuhkan bantuan pada banyak area, dan anda tidak perlu mengerti Java untuk berkontribusi! Berikut adalah daftar yang akan membantu anda dalam memulai!

source: Spread the Word!
id: Sebarkan Berita!
ru: Расскажите о нас!

source: Tell people about I2P on forums, blogs, and comments to articles. Fix up the Wikipedia article about I2P in your language. Tell your friends.
id: Katakan kepada orang-orang mengenai I2P di forum, blog, dan komentar di artikel. Perbaiki artikel Wikipedia mengenai I2P dalam bahasa anda. Katakan kepada teman-teman Anda.
ru: Рассказывайте людям о I2P на форумах, в блогах и в комментариях к статьям. Исправляйте и дополняйте статьи о I2P в Википедии на вашем языке. Расскажите своим друзьям.

source: Testing
id: Menguji
ru: Тестирование

source: Run the latest builds from <a href="%(monotone)s">monotone</a> and report results on #i2p or as bugs on <a href="http://%(trac)s/report/1">Trac</a>.
id: Jalankan build terbaru dari <a href="%(monotone)s">monotone</a> dan laporkan hasilnya di #i2p atau sebagai bug di <a href="http://%(trac)s/report/1">Trac</a>.

source: Documentation
id: Dokumentasi
ru: Документация

source: Help fix the parts of the website that are outdated or incomplete. Translate pages into other languages.
id: Bantu memperbaiki bagian website kami yang sudah terlalu lama atau tidak lengkap. Terjemahkan halaman ke dalam bahasa lain.
ru: Помогите исправить разделы сайта, содержащие устаревшую или неполную информацию. Переводите страницы на другие языки.

source: Pictures
id: Gambar
ru: Изображения

source: Make some more pictures, fix the old ones on the website
id: Membuat lebih banyak gambar, perbaiki yang lama pada website.
ru: Добавьте больше картинок, обновите устаревшие на сайте

source: Content
id: Konten
ru: Контент

source: Make an eepsite! Add some content! Contribute to the community!
id: Membuat eepsite! Tambahkan beberapa konten! Kontribusi kepada komunitas!
ru: Создайте eep-сайт! Добавьте содержимое! Сделайте вклад в сообщество!

source: Services
id: Service
ru: Службы

source: Run a service on an eepsite. It could be a proxy, a forum, a tracker, a naming service, a search engine, an eepsite monitor... many of these aren't that hard.
id: Menjalankan sebuah service pada sebuah eepsite. Itu bisa berupa proxy, forum, tracker, naming service, mesin pencari, pemantau eepsite... dan kebanyakan dari hal ini tidaklah sulit.
ru: Запустите службу на eep-сайте. Это может быть прокси-сервер, форум, трекер, служба имён, поисковый сервис, мониторинг eep-сайтов... много всего и это не так уж сложно.

source: Applications
id: Aplikasi
ru: Программы

source: Write or port applications for I2P! There's some guidelines and a list of ideas on the <a href="%(apps)s">applications page</a>.
id: Menulis atau port aplikasi ke dalam I2P! Ada beberapa pedoman dan daftar ide pada <a href="%(apps)s">laman aplikasi</a>.
ru: Создавайте или портируйте программы для I2P! Вы найдёте несколько руководств и список идей на <a href="%(apps)s">странице приложений</a>.

source: There's plenty to do if you know Java or are ready to learn. Check for open tickets on <a href="http://%(trac)s/report/1">Trac</a> or the TODO list on <a href="http://%(zzz)s">%(zzz)s</a> for some ideas on where to start. See the <a href="%(newdevs)s">new developer's guide</a> for details.
id: Ada banyak hal yang harus dilakukan jika anda mengerti Java atau siap untuk belajar. Periksa tiker yang terbuka di <a href="http://%(trac)s/report/1">Trac</a> atau daftar TODO di <a href="http://%(zzz)s">%(zzz)s</a> untuk beberapa ide di mana harus memulai. Lihat <a href="%(newdevs)s">panduan pengembang baru</a> untuk detail.

source: Translation
id: Penerjemahan
ru: Перевод

source: Help translate the website and the software into your language. See the <a href="%(newtrans)s">new translator's guide</a> for details.
id: Bantu menerjemahkan website dan perangkat lunak ke dalam bahasa anda. Lihat <a href="%(newtrans)s">panduan penerjemah baru</a> untuk detail.
ru: Помогите перевести веб-сайт и программное обеспечение на ваш язык. Обратитесь к <a href="%(newtrans)s">руководству переводчика</a> для подробностей.

source: Analysis
id: Analisis
ru: Анализ

source: Study or test the code to look for vulnerabilities. Both anonymity vulnerabilities from the various <a href="%(threatmodel)s">threat models</a>, and DOS and other weaknesses due to securities holes, need researching.
id: Pelajari atau uji kode untuk melihat kerentanan. Baik kerentanan anonimitas dari beragam <a href="%(threatmodel)s">model ancaman</a>, maupun DOS dan kelemahan lainnya dikarenakan celah keamanan, ini butuh penelitian.
ru: Изучайте или тестируйте исходный код для выявления уязвимостей. И различные <a href="%(threatmodel)s">модели угроз</a> деанонимизации, и DOS, и другие проблемы безопасности требуют тщательного изучения.

source: Set up a reseed server for new routers to bootstrap from. Detailed instructions are on our <a href="%(reseed)s">reseed server page</a>.
id: Buat server reseed untuk router baru untuk bootstrap. Petunjuk terperinci ada di <a href="%(reseed)s">halaman server reseed</a> kami.

source: January 2016
id: Januari 2016

source: Reachability Mapping / handle peers partially reachable / enhanced <a href="%(todo)s#fullRestrictedRoutes">restricted routes</a>
id: Peers Pemetaan Terjangkau / penanganan yang sebagian dapat dijangkau / ditingkatkan <a href="%(todo)s#fullRestrictedRoutes">pembatasan rute</a>
ru: Отображение доступности / обработка частично доступны узлов / улучшить <a href="%(todo)s#fullRestrictedRoutes">ограниченные маршруты</a>

source: Full restricted routes
id: Rute terbatas penuh
ru: Полностью ограниченные маршруты

source: Tunnel mixing and padding
id: Tunnel mixing dan padding
ru: Смешивание и изменение размера туннелей

source: User defined message delays
id: Message delays yang ditentukan pengguna
ru: Задержка сообщений, определяемая пользователем

source: Please see the <a href="%(todo)s">TODO</a> list for more detailed info about some of these tasks.
id: Silakan lihat daftar <a href="%(todo)s">TODO</a> untuk info lebih rinci tentang beberapa tugas ini.
ru: Больше информации по этим задачам можно увидеть здесь: <a href="%(todo)s">TODO</a>.

source: January 2017
id: Januari 2017

source: I2P Project Targets
id: Target Proyek I2P
ru: Цели проекта I2P

source: Core functionality
id: Fungsionalitas inti
ru: Основная функциональность

source: NetworkDB and profile tuning and ejection policy for large nets
id: NetworkDB dan tuning profil dan kebijakan ejeksi untuk jaringan besar
ru: NetworkDB, настройка профиля и политика исключения для больших сетей

source: Security / anonymity
id: Keamanan / anonimitas
ru: Безопасность / анонимность

source: Full blown n-hop restricted routes with optional trusted links
id: Full blown n-hop restricted routes dengan optional trusted links
ru: Полностью разорванные n-прыжковые ограниченные маршруты с необязательными доверенными ссылками

source: Hashcash for routerIdentity, destination, and tunnel request
id: Hashcash untuk routerIdentity, destinasi, and pernintaan tunnel
ru: Hashcash для запросов идентификатора маршрута, пункта назначения и туннеля

source: Advanced tunnel operation (batching/mixing/throttling/padding)
id: Operasi terowongan tingkat lanjut (batching / mixing / throttling / padding)
ru: Расширенные операции над туннелем (пакетирование/смешивание/регулирование/изменение размера)

source: Stop &amp; go mix w/ garlics &amp; tunnels
id: Berhenti & pergi mix w / garlics & terowongan
ru: Задержка совместно с чесночной маршрутизацией &amp; туннелями

source: Performance
id: Kinerja
ru: Производительность

source: Note: This page is not up-to-date. See <a href="%(roadmap)s">the roadmap</a> for current plans.
id: Catatan: Halaman ini tidak up-to-date. Lihat <a href="%(roadmap)s">roadmap</a> untuk rencana saat ini.

source: Below is a more detailed (yet still incomplete) discussion of the major areas of future development on the core I2P network, spanning the plausibly planned releases. This does not include stego transports, porting to wireless devices, or tools to secure the local machine, nor does it include client applications that will be essential in I2P's success. There are probably other things that will come up, especially as I2P gets more peer review, but these are the main 'big things'. See also <a href="%(roadmap)s">the roadmap</a>. Want to help? <a href="%(volunteer)s">Get involved</a>!
id: Berikut adalah diskusi yang lebih rinci (namun masih belum lengkap) tentang bidang utama pengembangan masa depan di jaringan inti I2P, yang mencakup rencana peluncuran yang masuk akal. Ini tidak termasuk transport stego, porting ke perangkat nirkabel, atau peralatan untuk mengamankan mesin lokal, juga tidak termasuk aplikasi klien yang penting dalam kesuksesan I2P. Mungkin ada hal lain yang akan muncul, terutama karena I2P mendapat banyak peer review, tapi ini adalah 'hal besar' utama. Lihat juga <a href="%(roadmap)s">roadmap</a>. Ingin membantu? <a href="%(volunteer)s">Ikut terlibat</a>
ru: Ниже приведено более детальное (еще не завершенное) обсуждение основных областей будущей разработки ядра сети I2P, охватывающее планируемые релизы. Оно не включает в себя транспорт stego, портирование на беспроводные устройства, или способы обезопасить локальную машину, также не включает в себя клиентские приложения, что будет иметь важное значение для успеха I2P. Возможно, появятся и другие вещи, особенно, когда на I2P будет больше рецензий, но нижеприведенное - это главные 'большие вещи'. Смотрите также <a href="%(roadmap)s">roadmap</a>. Хотите помочь? <a href="%(volunteer)s">Участвуй</a>!

source: Within the current network database and profile management implementation, we have taken the liberty of some practical shortcuts. For instance, we don't have the code to drop peer references from the K-buckets, as we don't have enough peers to even plausibly fill any of them, so instead, we just keep the peers in whatever bucket is appropriate. Another example deals with the peer profiles - the memory required to maintain each peer's profile is small enough that we can keep thousands of full blown profiles in memory without problems. While we have the capacity to use trimmed down profiles (which we can maintain 100s of thousands in memory), we don't have any code to deal with moving a profile from a "minimal profile" to a "full profile", a "full profile" to a "minimal profile", or to simply eject a profile altogether. It just wouldn't be practical to write that code yet, since we aren't going to need it for a while.
id: Dalam database jaringan saat ini dan penerapan manajemen profil, kami telah mengambil kebebasan untuk menentukan beberapa shortcut. Misalnya, kami tidak memiliki kode untuk melepaskan referensi rekan dari K-bucket, karena kami tidak memiliki cukup peer untuk memasukkannya dengan masuk akal, jadi sebaliknya, kita tetap menjaga peer di dalam bucket apa yang sesuai. Contoh lain yang berkaitan dengan profil peer - memori yang dibutuhkan untuk mempertahankan profil masing-masing peer adalah cukup kecil sehingga kita bisa menyimpan ribuan profil penuh dalam memori tanpa masalah. Meskipun kami memiliki kapasitas untuk menggunakan profil yang dipangkas (yang dapat memuat 100 ribu profil di memori), kami tidak memiliki kode untuk menangani pemindahan profil dari "profil minimal" ke "profil penuh", dan sebaliknya, atau hanya mengeluarkan sebuah profil. Tidak akan praktis untuk menulis kode itu, karena kami tidak akan membutuhkannya untuk sementara waktu.
ru: В рамках реализации нынешней базы данных сети и управления профилями мы используем несколько практичных упрощений. Например, у нас нет кода, реализующего удаление узла из K-bucket'ов, т.к. у нас нет достаточного количества узлов, чтобы даже приблизительно заполнить все bucket'ы, вместо этого, мы просто храним узлы в любых подходящих bucket'ах. Другой пример - работа с профилями узлов - размер памяти, необходимой для хранения профиля каждого узла, достаточно мал, так что мы можем хранить тысячи полных профилей в памяти без проблем. До тех пор пока у нас есть возможность использовать урезанные профили (мы можем хранить их 100-ми тысяч в памяти), у нас нет кода для преобразования профиля из "минимального профиля" в "полный профиль", из "полного профиля" в "минимальный профиль", или просто для выбрасывания обоих профилей. Пока написание такого кода не будет иметь практического значения, т.к. в ближайшее время он не будет нам нужен.

source: That said, as the network grows we are going to want to keep these considerations in mind. We will have some work to do, but we can put it off for later.
id: Seiring pertumbuhan jaringan, kita akan ingin mengingat pertimbangan ini. Kita akan memiliki beberapa pekerjaan yang harus dilakukan, tapi kita bisa menundanya nanti.
ru: Как было упомянут, с ростом сети мы будем помнить об этих моментах. У нас есть над чем поработать, но мы можем отложить это на потом.

source: The restricted route functionality described before was simply a functional issue - how to let peers who would not otherwise be able to communicate do so. However, the concept of allowing restricted routes includes additional capabilities. For instance, if a router absolutely cannot risk communicating directly with any untrusted peers, they can set up trusted links through those peers, using them to both send and receive all of its messages. Those hidden peers who want to be completely isolated would also refuse to connect to peers who attempt to get them to (as demonstrated by the garlic routing technique outlined before) - they can simply take the garlic clove that has a request for delivery to a particular peer and tunnel route that message out one of the hidden peer's trusted links with instructions to forward it as requested.
id: Fungsi rute terbatas yang dijelaskan sebelumnya hanyalah masalah fungsional - bagaimana cara membiarkan peer yang tidak dapat berkomunikasi dengannya. Namun, konsep untuk mengizinkan rute yang dibatasi, mencakup kemampuan tambahan. Misalnya, jika router benar-benar tidak dapat mengambil risiko berkomunikasi secara langsung dengan peer yang tidak dipercaya, mereka dapat mengatur tautan terpercaya melalui peer mereka, menggunakannya untuk mengirim dan menerima semua pesannya. Peer tersembunyi yang ingin benar-benar terisolasi juga menolak untuk terhubung dengan peer yang berusaha mendapatkannya (seperti yang ditunjukkan oleh teknik perutean garlic yang diuraikan sebelumnya) - mereka hanya bisa mengambil garlic clove yang memiliki permintaan untuk mengirim pesan ke rute peer dan tunnel yang mengeluarkan salah satu tautan terpercaya peer tersembunyi dengan petunjuk untuk meneruskannya sesuai permintaan.
ru: Функциональность ограниченных маршрутов, описанная ранее, была просто способом - дать возможность подключаться узлам, которые не могут сделать это иначе. Тем не менее, концепция ограниченных маршрутов добавляет дополнительные возможности. Например, если маршрутизатор не может рисковать, подключаясь напрямую к любым ненадежным узлам, он может установить доверенные ссылки через эти узлы, используя их для отправки и получения всех сообщений. Скрытые узлы, которые хотят быть абсолютно изолированными, также будут избегать подключений к узлам, которые хотят достучаться до них (как ранее продемонстрировано методом чесночной маршрутизацией) - они могут взять один чесночный зубчик, который требуется доставить определенному узлу, и маршрутизировать это сообщение в туннель, через доверенную ссылку одного из скрытых узлов с предписанием переслать его согласно запросу.

source: Within the network, we will want some way to deter people from consuming too many resources or from creating so many peers to mount a <a href="%(link)s">Sybil</a> attack. Traditional techniques such as having a peer see who is requesting a resource or running a peer aren't appropriate for use within I2P, as doing so would compromise the anonymity of the system. Instead, we want to make certain requests "expensive".
id: Dalam jaringan, kita akan ingin beberapa cara untuk mencegah orang untuk mengkonsumsi terlalu banyak sumber daya atau menciptakan begitu banyak peer untuk melakukan serangan <a href="%(link)s">Sybil</a> . Teknik tradisional seperti meminta peer melihat siapa yang meminta sumber daya atau menjalankan peer tidak sesuai untuk digunakan di dalam I2P, karena hal itu akan membahayakan anonimitas sistem ini. Sebagai gantinya, kami ingin membuat permintaan tertentu menjadi "mahal".
ru: В рамках сети, мы хотим удержать людей от выделения слишком большого количества ресурсов, или от создания слишком большого количества узлов для осуществления атаки <a href="%(link)s">Sybil</a>. Традиционный подход с наличием узла, просматривающего кто запрашивает ресурс, или запуск узла, не подходящего для использования в I2P, скомпрометирует анонимность системы. Вместо этого мы хотим сделать такие запросы "дорогостоящими".

source: <a href="http://www.hashcash.org/">Hashcash</a> is one technique that we can use to anonymously increase the "cost" of doing certain activities, such as creating a new router identity (done only once on installation), creating a new destination (done only once when creating a service), or requesting that a peer participate in a tunnel (done often, perhaps 2-300 times per hour). We don't know the "correct" cost of each type of certificate yet, but with some research and experimentation, we could set a base level that is sufficiently expensive while not an excessive burden for people with few resources.
id: <a href="http://www.hashcash.org/">Hashcash</a> adalah salah satu teknik yang bisa kita gunakan untuk secara anonim meningkatkan "biaya" dalam melakukan aktivitas tertentu, seperti menciptakan identitas router baru (hanya dilakukan sekali pada pemasangan), membuat tujuan estinasi baru (dilakukan hanya sekali saat membuat service), atau meminta agar peer berpartisipasi dalam tunnel (sering dilakukan, mungkin 2-300 kali per jam). Kami tidak tahu biaya "sebenarnya" dari setiap jenis sertifikat, namun dengan beberapa penelitian dan eksperimen, kami dapat menetapkan tingkat dasar yang cukup mahal, namun ini bukan merupakan beban yang berlebihan bagi orang-orang yang memiliki sedikit sumber daya.
ru: <a href="http://www.hashcash.org/">Hashcash</a> - один из методов, который мы можем использовать для анонимного увеличения "стоимости" такой активности, использование идентификатора нового маршрутизатора (выполняется только один раз во время установки), создание нового пункта назначения (выполняется только один раз когда создаем сервис), или запрос на участие узла в туннеле (выполняется часто, возможно 2-300 раз в час). Нам пока неизвестна "точная" стоимость каждого типа удостоверения, но после исследований и экспериментов, мы можем установить начальный уровень, который будет достаточно дорогостоящим и не будет сильно обременять людей с ограниченными ресурсами.

source: There are a few other algorithms that we can explore for making those requests for resources "nonfree", and further research on that front is appropriate.
id: Ada beberapa algoritma lain yang dapat kita jelajahi untuk membuat permintaan sumber daya "nonfree", dan penelitian lebih lanjut di bagian itu adalah hal yang tepat.
ru: Есть еще несколько других алгоритмов, которые мы можем использовать для "удорожания" подобных запросов, и дальнейшие исследования на этом фронте являются целесообразными.

source: To powerful passive external observers as well as large colluding internal observers, standard tunnel routing is vulnerable to traffic analysis attacks - simply watching the size and frequency of messages being passed between routers. To defend against these, we will want to essentially turn some of the tunnels into its own mix cascade - delaying messages received at the gateway and passing them in batches, reordering them as necessary, and injecting dummy messages (indistinguishable from other "real" tunnel messages by peers in the path). There has been a significant amount of <a href="%(pdf)s">research</a> on these algorithms that we can lean on prior to implementing the various tunnel mixing strategies.
id: Bagi pengamat eksternal pasif yang kuat serta pengamat internal berkolusi besar, perutean tunnel standar adalah rentan terhadap serangan analisis lalu lintas - hanya dengan melihat ukuran dan frekuensi pesan yang dilewatkan di antara router. Untuk melawannya, pada intinya kita akan mengalihkan sebagian tunnel ke dalam cascade campurannya sendiri - menunda pesan yang diterima di gateway dan meneruskannya dalam batch, mengatur ulang mereka seperlunya, dan menyuntikkan pesan dummy (tidak dapat dibedakan dari pesan tunnel "nyata" lainnya oleh peer di dalam path). Telah ada sejumlah besar <a href="%(pdf)s">penelitian</a> tentang algoritma yang dapat kita andalkan sebelum menerapkan berbagai strategi pencampuran tunnel.
ru: Для мощных пассивных внешних наблюдателей, так же как и для больших сговоров внутренних наблюдателей, стандартная туннельная маршрутизация уязвима для атак с анализом трафика - простое наблюдение за размером и частотой сообщений, передаваемых между маршрутизаторами. Чтобы защититься от этого мы хотим скомпоновать некоторые туннели в смешанный каскад - задерживая сообщения, полученные на шлюзе и отправляя их в группы, при необходимости пересортировывая их, внедряя пустые сообщения (неотличимые для узлов от других "реальных" туннельных сообщений). Было выполнено колоссальное количество <a href="%(pdf)s">исследований</a> этих алгоритмов, на которые мы можем опираться при реализации различных стратегий смешивания туннелей.
