Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: Have a basic understanding of distributed source control systems, even if you haven't used monotone before. Ask for help if you need it. Once pushed, checkins are forever, there is no undo. Please be careful. If you have not used monotone before, start with baby steps. Check in some small changes and see how it goes.
id: Memiliki pemahaman dasar tentang sistem kontrol kode sumber terdistribusi, bahkan jika anda belum menggunakan Monotone sebelumnya. Ajukan pertanyaan jika diperlukan Setelah didorong, checkin berlaku selamanya, tidak ada revisi. Harap berhati-hati. Jika anda belum pernah menggunakan monotone sebelumnya, mulailah dengan langkah-langkah kecil. Check-in beberapa perubahan kecil dan lihat bagaimana kelanjutannya.
ru: Получите основные понятия о распределенной системе контроля версий, даже если раньше вы не использовали monotone. Если нужно - попросите помощи. Единожды чекин да пребудет вовеки, никакого отката нет. Пожалуйста, будьте аккуратны. Если раньше вы не использовали monotone - начните с маленьких шагов. Зачекиньте небольшое изменение и посмотрите как пойдет дело.

source: Test your changes before checking them in. If you prefer the checkin-before-test development model, use your own development branch (e.g. i2p.i2p.yourname.test) and propagate back to i2p.i2p once it is working well. Do not break the build. Do not cause regressions. In case you do (it happens), please do not vanish for a long period after you push your change.
id: Uji perubahan sebelum melakukan checkin. Jika Anda memilih model pengembangan checkin-sebelum-test, gunakan cabang pengembangan anda sendiri (misalnya i2p.i2p.yourname.test) dan sebarkan kembali ke i2p.i2p setelah itu bekerja dengan baik. Jangan rusak build yang sudah ada Jangan membuat regressions. Jika anda melakukan hal ini (sudah terjadi), harap anda jangan kabur untuk jangka waktu yang lama setelah anda mendorong perubahan anda.
ru: Тестируйте свои изменения до того как зачекинить их. Если вы предпочитаете модель программирования чекин-перед-тестированием, то используйте свою ветку разработки (например i2p.i2p.yourname.test) и переносите изменения в i2p.i2p когда они заработают как надо. Не ломайте сборку. Не провоцируйте регрессию. А если сделали (это случается), пожалуйста, не исчезайте на долго после того как внесли изменения.

source: If your change is non-trivial, or you want people to test it and need good test reports to know whether your change was tested or not, add a checkin comment to history.txt and increment the build revision in RouterVersion.java.
id: Jika perubahan anda non-trivial, atau anda ingin orang lain mengujinya dan perlu laporan tes yang bagus untuk mengetahui apakah perubahan anda sudah diuji atau tidak, tambahkan komentar checkin ke history.txt dan buat build revision di RouterVersion.java.
ru: Если ваши изменения нетривиальны, или вы хотите чтобы люди их протестировали, и вам нужны хорошие отчеты о тестировании, дабы знать протестированы ваши изменения или нет - добавьте чекин-комментарий в history.txt и увеличьте версию сборки в RouterVersion.java.

source: Ensure that you have the latest monotonerc file in _MTN. Do not check in on top of untrusted revisions.
id: Pastikan bahwa anda memiliki file monotonerc yang terbaru di _MTN. Jangan check-in di atas revisi tidak terpercaya.
ru: Убедитесь, что у вас есть свежий файл monotonerc в _MTN. Не чекиньте в ненадежные ревизии.

source: Ensure that you 'mtn pull' and 'mtn update' to the latest revision before you check in and push. If you inadvertently diverge, merge and push as soon as possible. Don't routinely make others merge for you. Yes, we know that monotone says you should push and then merge, but in our experience, in-workspace merge works just as well as in-database merge, without creating a merge revision.
id: Pastikan anda melakukan 'mnt pull' 'dan 'mtn update' ke revisi terbaru sebelum anda check in dan push. Jika Anda secara tidak sengaja menyimpang, gabungkan dan dorong sesegera mungkin. Jangan sering-sering membuat orang lain menggabungkannya untuk anda. Ya, kami tahu bahwa monotone bilang bahwa anda harus mendorong dan kemudian menggabungkan, tetapi dalam pengalaman kami, penggabungan in-workspace bekerja dengan baik seperti penggabungan dalam database, tanpa membuat revisi penggabungan.

source: Do not check in major changes into the main i2p.i2p branch late in the release cycle. If a project will take you more than a couple days, create your own branch in monotone and do the development there so you do not block releases.
id: Jangan checkin perubahan besar ke dalam cabang utama i2p.i2p di akhir siklus rilis. Jika sebuah proyek memerlukan waktu lebih dari beberapa hari, buat cabang sendiri di monotone dan lakukan pengembangan di sana sehingga anda tidak memblokir rilis.
ru: Не чекиньте важные изменения в главную ветку i2p.i2p на поздних стадиях цикла релиза. Если проект занимает у вас больше нескольких дней, создайте свою ветку в monotone и разрабатывайте в ней, т.о. вы не заблокируете релиз.

source: Coding Style
id: Gaya Pengkodean
ru: Стиль форматирования кода

source: Coding style throughout most of the code is 4-spaces for indentation. Do not use tabs. Do not reformat code. If your IDE or editor wants to reformat everything, get control of it. Yes, we know 4 spaces is a pain, but perhaps you can configure your editor appropriately. In some places, the coding style is different. Use common sense. Emulate the style in the file you are modifying.
id: Gaya Pengkodean sepanjang sebagian besar kode adalah 4-spasi untuk indentasi. Jangan gunakan tab. Jangan memformat-ulang kode Jika IDE atau editor anda ingin memformat ulang semuanya, kendalikan itu. Ya, kami tahu 4 spasi tidak enak dilakukan, tapi mungkin anda dapat mengkonfigurasi editor anda. Di beberapa tempat, gaya pengkodean berbeda. Gunakan akal sehat. Ikuti gaya ini dalam file yang anda memodifikasi.
ru: В большинстве кода для отступа используется 4 пробела. Не используйте символ табуляции. Не переформатируйте код. Если ваш IDE или редактор хочет отформатировать все, возьмите его под контроль. Да, мы знаем, что 4 пробела это та еще головная боль, но, возможно, вы сможете правильно настроить свой редактор. В некоторых местах стиль форматирования может разниться. Руководствуйтесь здравым смыслом. Воспроизводите имеющийся стиль в файле, который вы изменяете.

source: All new public and package-private classes and methods require Javadocs. Add @since release-number. Javadocs for new private methods are desirable.
id: Semua kelas umum dan paket-pribadi yang baru dan metode memerlukan Javadocs. Tambahkan @since nomor rilis. Javadocs untuk metode privaye baru lebih disukai.

source: For any Javadocs added, there must not be any doclint errors or warnings. Run 'ant javadoc' with Oracle Java 8 or higher to check. All params must have @param lines, all non-void methods must have @return lines, all exceptions declared thrown must have @throws lines, and no HTML errors.
id: Untuk setiap Javadocs yang ditambahkan, harus tidak ada kesalahan doclint atau peringatan apapun. Jalankan 'ant javadoc' dengan Oracle Java 8 atau lebih tinggi untuk memeriksa. Semua parameter harus memiliki baris @param, semua metode non-void harus memiliki garis-garis @return, semua exceptions yang dideklarasikan harus memiliki garis-garis @throws, dan tidak ada kesalahan HTML.

source: Classes in core/ (i2p.jar) and portions of i2ptunnel are part of our official API. There are several out-of-tree plugins and other applications that rely on this API. Be careful not to make any changes that break compatibility. Don't add methods to the API unless they are of general utility. Javadocs for API methods should be clear and complete. If you add or change the API, also update the documentation on the website (i2p.www branch).
id: Class di core / (i2p.jar) dan beberapa bagian dari i2ptunnel merupakan bagian dari API resmi kami. Ada beberapa plugin out-of-tree dan aplikasi lainnya yang mengandalkan API ini. Berhati-hatilah untuk tidak membuat perubahan yang merusak kompatibilitas. Jangan menambahkan metode ke API kecuali mereka memiliki utilitas umum. Javadocs untuk metode API harus jelas dan lengkap. Jika anda menambahkan atau mengubah API, juga memperbarui dokumentasi pada website (cabang i2p.www).
ru: Классы в core/ (i2p.jar) и куски i2ptunnel - это части нашего официального API. Есть несколько out-of-tree плагинов и других приложений, которые основаны на этом API. Будьте осторожны при их изменении, чтобы не поломать совместимость. Добавляйте методы в API, только если они полезны для всех. Javadocs для методов API должны быть просты и полны. Если вы вносите изменения в API, обновите также документацию на веб-сайте (i2p.www branch).

source: Tag strings for translation where appropriate. Don't change existing tagged strings unless really necessary, as it will break existing translations. Do not add or change tagged strings after the "tag freeze" in the release cycle so that translators have a chance to update before the release.
id: Beri tag kepada string untuk terjemahan di mana tepat. Jangan mengubah string tagged yang ada kecuali benar-benar diperlukan, karena itu akan merusak terjemahan yang ada. Jangan menambahkan atau mengubah tagged string setelah "freeze tag" di siklus rilis sehingga penerjemah memiliki kesempatan untuk memperbarui terjemahan sebelum rilis.
ru: Делайте заметки к строкам для переводов где следует. Изменяйте существующие отмеченные строки, только если это действительно необходимо, т.к. это нарушает существующий перевод. Не добавляйте и не изменяйте отмеченные строки после "tag freeze" в цикле релиза, тогда у переводчиков будет шанс обновиться до релиза.

source: Use generics and concurrent classes where possible. I2P is a highly multi-threaded application.
id: Gunakan generik dan concurrent class di mana mungkin digunakan. I2p adalah sebuah aplikasi yang sangat multi-thread.
ru: По возможности используйте дженерики и конкурентные классы. I2P - это сильно мульти-потоковое приложение.

source: Be familiar with common Java pitfalls that are caught by findbugs. Run 'ant findbugs' to learn more.
id: Kenali common pitfalls Java yang tertangkap oleh findbugs. Jlankan 'ant findbugs' untuk mempelajari lebih lanjut.

source: Explicitly convert between primitive types and classes; don't rely on autoboxing/unboxing.
id: Secara eksplisit mengkonversi antara tipe primitif dan kelas; jangan bergantung pada autoboxing/unboxing.
ru: Выполняйте явное преобразование примитивных классов и типов; не полагайтесь на autoboxing/unboxing.

source: Don't use URL. Use URI.
id: Jangan gunakan URL. Gunakan URI.

source: Don't catch Exception. Catch RuntimeException and checked exceptions individually.
id: Tidak menangkap Exceptions. Tangkap RuntimeException dan exception diperiksa secara satu per satu.

source: Don't use String.getBytes() without a UTF-8 charset argument. You may also use DataHelper.getUTF8() or DataHelper.getASCII().
id: Jangan gunakan String.getBytes() tanpa argumen charset UTF-8. Anda juga dapat menggunakan DataHelper.getUTF8() atau DataHelper.getASCII().

source: Always specify a UTF-8 charset when reading or writing files. The DataHelper utilities may be helpful.
id: Selalu menentukan charset UTF-8 saat membaca atau menulis file. Utility DataHelper dapat membantu.

source: Always specify a locale (for example Locale.US) when using String.toLowerCase() or String.toUpperCase(). Do not use String.equalsIgnoreCase(), as a locale cannot be specified.
id: Selalu tentukan locale (misalnya Locale.US) ketika menggunakan String.toLowerCase() atau String.toUpperCase(). Jangan gunakan String.equalsIgnoreCase(), karena locale tidak bisa dispesifikasikan.

source: Don't use String.split(). Use DataHelper.split().
id: Jangan gunakan String.split(). Gunakan DataHelper.split().

source: Ensure that InputStreams and OutputStreams are closed in finally blocks.
id: Pastikan bahwa InputStreams dan OutputStreams ditutup dalam finally blocks.

source: Use {} for all for and while blocks, even if only one line. If you use {} for either the if, else, or if-else block, use it for all blocks. Put "} else {" on a single line.
id: Gunakan {} untuk semua untuk dan while block, bahkan jika hanya satu baris. Jika anda menggunakan {} untuk blok if, else,atau if-else, gunakannya untuk semua blok. tempatkan "} else {" pada satu baris.

source: Specify fields as final wherever possible.
id: tentukan field sebagai final sedapat mungkin.

source: Don't store I2PAppContext, RouterContext, Log, or any other references to router or context items in static fields.
id: Jangan simpan I2PAppContext, RouterContext, Log, atau referensi lain untuk router atau konteks item di static fields.

source: Don't start threads in constructors. Use I2PAppThread instead of Thread.
id: Jangan mulai threads di dalam constructors. Gunakan I2PAppThread, jangan Thread.

source: Licenses
id: Lisensi
ru: Лицензии

source: Only check in code that you wrote yourself. Before checking in any code or library jars from other sources, justify why it is necessary, verify the license is compatible, and obtain approval from the lead developer.
id: Hanya periksa kode yang anda tulis sendiri. Sebelum check in kode atau library jar dari sumber lain, periksa apakah mereka diperlukan, verifikasi lisensi kompatibel, dan dapatkan persetujuan dari pengembang utama.
ru: Чекиньте только тот код, который вы написали сами. Перед тем как зачекинить любой код или библиотеку jar из других источников, объясните почему это необходимо, убедитесь что лицензия совместима, и получите подтверждение от главного разработчика.

source: If you do obtain approval to add external code or jars, and binaries are available in any Debian or Ubuntu package, you must implement build and packaging options to use the external package instead. Checklist of files to modify:
id: Jika anda memperoleh persetujuan untuk menambahkan kode eksternal atau jar, dan binari tersedia dalam paket Debian atau Ubuntu, anda harus menerapkan opsi build dan packaging dengan menggunakan paket eksternal sebagai gantinya. Daftar Periksa file untuk modifikasi:

source: For any images checked in from external sources, it is your responsibility to first verify the license is compatible. Include the license and source information in the checkin comment.
id: Setiap gambar yang diperiksa dari sumber eksternal, adalah tanggung jawab anda untuk pertama-tama memverifikasi lisensi apakah kompatibel. Termasuk informasi lisensi dan sumber dalam komentar Check-in.
ru: Для любых image зачекиненых из внешних источников, вашей ответственностью является проверка совместимости лицензии. Включите лицензию и информацию об источнике в комментарий к чекину.

source: Bugs
id: Bug
ru: Ошибки

source: Managing Trac tickets is everybody's job, please help. Monitor %(trac)s for tickets you have been assigned or can help with. Assign, categorize, comment on, fix, or close tickets if you can.
id: Mengelola Trac tickets adalah tanggung-jawab semua orang, mohon bantuannya. Pantau %(trac)s untuk tiket yang menjadi tanggung-jawab anda atau yang dapat anda bantu. Delegasi, kategorisasi, beri komentar, perbaiki atau tutup tiket, jika anda dapat melakukannya.
ru: Управление потоком тикетов это общая работа, пожалуйста, помогайте. Просматривайте %(trac)s на предмет тикетов, к которым вы прикреплены, или по которым вы можете помочь. Назначайте, категоризируйте, комментируйте, испарвляйте или закрывайте тикеты, если можете.

source: New developers should start by fixing a bug. Search for bugs with the 'easy' keyword on trac. When you have a fix, attach your patch to the ticket and add the keyword 'review-needed'. Do not close the ticket until it's been successfully reviewed and you've checked your changes in. Once you've done this smoothly for a couple of tickets, you may follow the normal procedure below.
id: Pengembang baru harus mulai dengan memperbaiki bug. Cari bug dengan kata kunci 'mudah' di trac. Bila anda sudah memiliki perbaikan, lampirkan patch anda ke tiket dan tambahkan kata kunci 'review-needed'. Jangan tutup tiket telah berhasil ditinjau dan anda sudah memeriksa perubahan. Setelah anda melakukan ini dengan lancar selama dua tiket, anda dapat mengikuti prosedur normal di bawah ini.

source: Close a ticket when you think you've fixed it. We don't have a test department to verify and close tickets. If you arent sure you fixed it, close it and add a note saying "I think I fixed it, please test and reopen if it's still broken". Add a comment with the dev build number or revision and set the milestone to the next release.
id: Tutup tiket ketika menurut anda bug sudah diperbaiki. Kami tidak memiliki departemen tes untuk memverifikasi dan menutup tiket. Jika anda tidak yakin anda telah memperbaiki sebuah bug, tutup dan tambahkan catatan: "Saya pikir saya telah memperbaikinya, silahkan uji dan buka kembali jika bug masih ada". Tambahkan komentar dengan nomor dev atau nomor revisi dan tetapkan milestone untuk rilis berikutnya.
ru: Закройте тикет, если считаете, что исправили его. У нас нет отдела тестирования для верификации и закрытия тикетов. Если вы не уверены, что исправили, закрывайте и добавляйте запись с текстом "Я думаю, я это исправил, пожалуйста, протестируйте и откройте заново если ошибка все еще воспроизводится". Добавляйте комментарий с номером сборки или ревизией, и устанавливайте веху в следующем релизе.

source: Using an IDE with I2P
id: Menggunakan IDE dengan I2P
ru: Использование IDE с I2P

source: The main I2P development branch (<code>i2p.i2p</code>) has been set up to enable developers to easily set up two of the commonly-used IDEs for Java development: Eclipse and NetBeans.
id: Cabang utama pengembangan I2P( <code>i2p.i2p</code> ) telah dibentuk untuk memungkinkan pengembang untuk dengan mudah mengatur dua dari IDEs sering digunakan untuk pengembangan Java: Eclipse dan NetBeans.
ru: Главная ветка разработки I2P (<code>i2p.i2p</code>) была создана для того чтобы разработчики могли легко установить один из двух часто используемых IDE для Java разработки: Eclipse и NetBeans.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain build.gradle to enable the branch to be easily set up in Eclipse.
id: Cabang utama pengembangan I2P ( <code>i2p.i2p</code> dan cabang darinya) berisi file build.gradle untuk memungkinkan cabang tersebut mudah diatur di Eclipse.

source: Make sure you have a recent version of Eclipse. Anything newer than 2017 should do.
id: Pastikan Anda memiliki Eclipse versi terbaru. Versi terbaru dari 2017 dapat digunakan.

source: Check out the I2P branch into some directory (e.g. <code>$HOME/dev/i2p.i2p</code>).
id: Periksa cabang I2P ke beberapa direktori (misal <code>$HOME/dev/i2p.i2p</code>).
ru: Извлеките ветку I2P в какую-нибудь директорию (например, <code>$HOME/dev/i2p.i2p</code>).

source: Select "File - Import..." and then under "Gradle" select "Existing Gradle Project".
id: Pilih "File - Import ..." dan kemudian di bawah "Gradle" pilih "Existing Gradle Projects".

source: For "Project root directory:" choose the directory that the I2P branch was checked out to.
id: Untuk "Project root directory:" pilih direktori di mana cabang I2P yang diperiksa.

source: In the "Import Options" dialog, select "Gradle Wrapper" and press continue.
id: Di jendela dialog "Import Options", pilih "Gradle Wrapper" lalu klik continue.

source: In the "Import Preview" dialog you can review the project structure. Multiple projects should appear under "i2p.i2p". Press "Finish."
id: Di jendela dialog "Import Preview" Anda dapat melihat struktur proyek. Beberapa proyek seharusnya muncul di bawah "i2p.i2p". Tekan "Finish."

source: Done! Your workspace should now contain all projects within the I2P branch, and their build dependencies should be correctly set up.
id: Selesai! Workspace anda sekarang seharusnya berisi semua proyek di dalam cabang I2P, dan dependensi pembuatannya seharusnya telah disiapkan dengan benar.
ru: Готово! Ваш workspace теперь должен содержать все проекты из ветки I2P, и его зависимости сборки должны быть корректно установлены.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain NetBeans project files.
id: Cabang utama pengembangan I2P ( <code>i2p.i2p</code> dan cabang darinya) berisi file proyek NetBeans.
ru: Главные ветки разработки I2P (<code>i2p.i2p</code> его его подветки) содержит файлы проекта NetBeans.

source: Monotone Guide
id: Panduan Monotone
ru: Руководство по Monotone

source: Operating a Monotone client
id: Mengoperasikan klien Monotone
ru: Управление клиентом Monotone

source: Generating Monotone keys
id: Membuat Kunci Monotone
ru: Генерация ключей Monotone

source: Trust and initializing your repository
id: Mempercayai dan menginisialisasi repositori anda
ru: Доверие и инициализация вашего хранилища

source: Obtaining and deploying developers' keys
id: Mendapatkan dan menerapkan kunci pengembang
ru: Получение и применение ключей разработчиков

source: Setting up trust evaluation hooks
id: Menyiapkan trust evaluation hooks
ru: Установка ловушек оценки доверия

source: Pulling the <code>i2p.i2p</code>, <code>i2p.www</code> and <code>i2p.syndie</code> branches
id: Menarik cabang <code>i2p.i2p</code> , <code>i2p.www</code> dan <code>i2p.syndie</code>
ru: Получение веток <code>i2p.i2p</code>, <code>i2p.www</code> и <code>i2p.syndie</code>

source: Verifying that trust evaluation works
id: Memastikan bahwa evaluasi kepercayaan berfungsi
ru: Проверка работоспособности оценки доверия

source: Checking out a working copy of the latest version
id: Periksa wroking copy dari versi terbaru
ru: Извлечение рабочей копии последней версии

source: Updating your working copy to the latest version
id: Perbarui working copy anda ke versi terbaru
ru: Обновление вашей рабочей копии до последней версии

source: Operating a Monotone Server
id: Mengoperasikan Server Monotone
ru: Управление сервером Monotone

source: Obtaining and deploying developers transport keys
id: Mendapatkan dan menerapkan kunci transport milik pengembang

source: Granting push and pull access
id: Memberikan akses push dan pull
ru: Назначение прав доступа push и pull

source: Running Monotone in server mode
id: Menjalankan Monotone d dalam mode server
ru: Запуск Monotone в режиме сервера

source: Differences under Debian GNU/Linux
id: Perbedaan di dalam Debian GNU / Linux
ru: Различия под Debian GNU/Linux

source: This is a revised version of <a href="%(transitionguide)s">Complication's original guide</a> detailing the use of Monotone in I2P development. For basic instructions see the <a href="%(newdevs)s">quick-start guide</a>.
id: Ini adalah versi revisi dari <a href="%(transitionguide)s">Original Complication</a> panduan yang merinci penggunaan Monotone dalam pengembangan I2P. Untuk petunjuk dasar, lihat <a href="%(newdevs)s">quick-start guide</a> .
ru: Это проверенная версия <a href="%(transitionguide)s">Оригинального руководства Complication</a>, поясняющего использование Monotone в разработке I2P. Основные инструкции смотри в <a href="%(newdevs)s">руководстве по быстрому старту</a>.
