Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: id, ru

source: Most of the software guarantees much more - the ability of <b>anyone</b> to distribute the modified source however they choose. However, not all of the software bundled provides this freedom - the GPL restricts the ability of developers who wish to integrate I2P with their own applications that are not themselves open source applications. While we applaud the noble goals of increasing the resources in the commons, I2P is best served by removing any barriers that stand in the way of its adoption - if a developer considering whether they can integrate I2P with their application has to stop and check with their lawyer, or conduct a code audit to make sure their own source can be released as GPL-compatible, we lose out.
id: Sebagian besar perangkat lunak menjamin lebih banyak - kemampuan <b>siapa saja</b> untuk mendistribusikan source code yang diubah Namun, tidak semua perangkat lunak yang dibundel memberikan kebebasan ini - GPL membatasi kemampuan pengembang yang ingin mengintegrasikan I2P dengan aplikasi mereka sendiri yang bukan open source. Meskipun kami menghargai tujuan mulia untuk meningkatkan sumber daya secara umum, I2P paling baik dilayani dengan menghilangkan hambatan yang menghalangi adopsi - jika pengembang mempertimbangkan apakah mereka harus berhenti mengintegrasikan I2P dengan aplikasinya dan memeriksa dengan pengacara mereka, atau melakukan audit kode untuk memastikan sumber mereka sendiri dapat dilepaskan sebagai GPL-compatible, kita kalah.
ru: Большинство приложений гарантирует гораздо больше - возможность <b>любому</b> распространять измененные исходники по его выбору. Тем не менее, не все включенное ПО предоставляет эту возможность - GPL ограничивает возможность разработчиков, желающих интегрировать I2P с их собственными приложениями, которые сами не являются приложениями с открытым исходным кодом. В то время как мы в общем-то приветствуем благородные цели увеличения ресурсов, I2P будет лучше без любых ограничений, которые стоят на пути его принятия - если разработчик будет рассматривать возможность интеграции I2P со своим приложением, он должен посоветоваться со своим адвокатом, или провести аудит кода, чтобы быть уверенным, что его код может быть выпущен под лицензией GPL, мы от этого проигрываем.

source: Component licenses
id: Lisensi komponen
ru: Лицензии компонентов

source: The I2P distribution contains several resources, reflecting the partitioning of the source code into components. Each component has its own license, which all developers who contribute to it agree to - either by explicitly declaring the release of code committed under a license compatible with that component, or by implicitly releasing the code committed under the component's primary license. Each of these components has a lead developer who has the final say as to what license is compatible with the component's primary license, and the I2P project manager has the final say as to what licenses meet the above four guarantees for inclusion in the I2P distribution.
id: Distribusi I2P berisi beberapa sumber daya, mencerminkan pembagian source code ke dalam komponen. Setiap komponen memiliki lisensi sendiri, yang semua pengembang yang berkontribusi setuju untuk itu - baik dengan secara eksplisit mendeklarasikan rilis berkomitmen dengan lisensi komponen tersebut, atau dengan secara implisit melepaskan kode yang berkomitmen dengan lisensi komponen yang utama. Masing-masing komponen ini memiliki pengembang utama yang berhak menentukan mengenai lisensi yang kompatibel dengan lisensi komponen utama, dan manajer proyek I2P memiliki wewenang mengenai lisensi apa yang memenuhi syarat untuk disertakan dalam distribusi I2P secara luas.
ru: Поставка I2P содержит несколько ресурсов, отражающих разделение исходного кода на компоненты. У каждого компонента своя лицензия, с которой соглашаются все его разработчики - либо непосредственно объявляя об этом при релизе исходного кода зафиксированного под лицензией, совместимой с этим компонентом, либо опосредованно при релизе исходного кода зафиксированного под главной лицензией компонента. У каждого из этих компонентов есть главный разработчик, который говорит совместима ли лицензия с главной лицензией компонента, и менеджер проекта I2P, который говорит подходит ли лицензия ко всем четырем требованиям для включения в поставку I2P.

source: Component
id: Komponen
ru: Компонент

source: Resource
id: Sumber daya
ru: Ресурс

source: Primary license
id: Lisensi utama
ru: Главная лицензия

source: Alternate licenses
id: Lisensi alternatif
ru: Альтернативная лицензия

source: Lead developer
id: Pengembang utama
ru: Главные разработчик

source: While it may be redundant, just for clarity the <a href="%(gpl)s">GPL</a>'ed code included within I2PTunnel and other apps must be released under the GPL with an additional "exception" explicitly authorizing the use of Java's standard libraries:
id: Walaupun mungkin berlebihan, hanya untuk kejelasan kode <a href="%(gpl)s">GPL</a>' yang dimasukkan ke dalam I2PTunnel dan aplikasi lainnya, harus dirilis di bawah GPL dengan tambahan "pengecualian" yang secara tegas memberi kewenangan penggunaan Java library standar:
ru: Не смотря на то, что это может быть избыточным, просто чтобы внести ясность в код под <a href="%(gpl)s">GPL</a>, включенный в I2PTunnel и другие приложения, должны быть предоставлены под GPL с дополнительным "исключением", непосредственно дающим право использовать стандартные библиотеки Java:

source: All source code under each component will by default be licensed under the primary license, unless marked otherwise in the code. All of the above is summary of the license terms - please see the specific license for the component or source code in question for authoritative terms. Component source locations and resource packaging may be changed if the repository is reorganized.
id: Semua source code di bawah setiap komponen akan secara default dilisensikan di bawah lisensi utama, kecuali dijelaskan lain di dalam kode. Semua di atas adalah ringkasan dari ketentuan lisensi - silakan lihat lisensi tertentu untuk komponen atau source code yang bersangkutan untuk istilah yang otoritatif. Komponen lokasi sumber dan paket sumber daya dapat berubah jika repositori direorganisasi.
ru: По умолчанию, весь исходный код каждого компонента лицензируется по главной лицензии, если иное не указано в коде. Все сказанное выше - суть условий лицензирования - в случае возникновения вопросов об особых условиях лицензирования, смотри лицензионные соглашения соответствующего исходного кода или компонента. В случае реорганизации хранилища расположение исходных кодов компонентов и пакетов может быть изменено.

source: Website content
id: Konten situs web

source: Developers may push changes to a distributed monotone repository if you receive permission from the person running that repository. See the <a href="%(monotone)s">Monotone Page</a> for details.
id: Pengembang dapat mendorong perubahan ke repositori monotone terdistribusikan jika anda menerima izin dari orang yang menjalankan repositori. Lihat <a href="%(monotone)s">Halaman Monotone</a> untuk rincian.
ru: Разработчики могут протолкнуть изменения в распределенное хранилище monotone, если у вас есть разрешение от человека, запустившего это хранилище. Подробнее смотри на странице <a href="%(monotone)s">Monotone Page</a>.

source: However, to have changes included in a release, developers must be trusted by the release manager (currently zzz). In addition, they must explicitly agree with the above terms to be trusted. That means that they must send one of the release managers a signed message affirming that:
id: Namun, untuk supaya perubahan disertakan dalam rilis, pengembang harus dipercaya oleh pengelola rilis (saat ini zzz). Selain itu, mereka harus secara eksplisit setuju dengan syarat-syarat di atas untuk dapat dipercaya. Itu berarti mereka harus mengirim salah satu manajer rilis, pesan yang ditandatangani untuk menegaskan bahwa:
ru: Тем не менее, чтобы изменения были включены в релиз, разработчики должны быть одобрены релиз-менеджером (сейчас это zzz). Кроме того, для одобрения они должны явно согласиться с условиями, описанными выше. Это означает, что они должны отправить одному из релиз-менеджеров подписанное сообщение, подтверждая что:

source: Unless marked otherwise, all code I commit is implicitly licensed under the component's primary license
id: Kecuali disebut lain, semua kode saya serahkan secara implisit berlisensi di bawah lisensi komponen utama
ru: Если не указано иное, весь код, что я фиксирую, явно лицензируется главной лицензией компонента

source: If specified in the source, the code may be explicitly licensed under one of the component's alternate licenses
id: Jika ditentukan dalam sumber, kode dapat secara eksplisit dilisensikan di bawah salah satu komponen alternatif lisensi
ru: Если указано в исходном коде, код может быть опосредованно лицензирован одной из альтернативных лицензий компонента

source: I have the right to release the code I commit under the terms I am committing it
id: Saya punya hak untuk melepaskan kode yang saya serahkan di bawah dalam persyaratan saya ikuti
ru: У меня есть право выпускать код, который я фиксирую, в соответствии с условиями, на которых я это делаю

source: If anyone is aware of any instances where the above conditions are not met, please contact the component lead and/or an I2P release manager with further information. <a href="%(licenseagreements)s">See developers' license agreements</a>.
id: Jika ada yang menyadari setiap contoh di mana kondisi di atas tidak terpenuhi, hubungi pimpinan komponen dan/atau I2P release manager untuk informasi lebih lanjut. <a href="%(licenseagreements)s">Lihat perjanjian lisensi pengembang</a>.
ru: Если кому-либо известно о каких-либо случаях, когда указанные выше условия не будут выполнены, просьба обратиться к главному разработчику компонента и/или к релиз-менеджеру I2P с этой информацией. <a href="%(licenseagreements)s">Смотри лицензионное соглашение разработчиков</a>.

source: Press GPG Key
id: Publikasikan Kunci GPG

source: Following is the GPG key for the press _at_ geti2p.net email address:
id: Berikut ini adalah kunci GPG untuk publikasi di alamat email _at_ geti2p.net:

source: Releases 0.7.6 and later are signed by zzz. His current public key is:
id: Rilis 0.7.6 dan selanjutnya ditandatangani oleh zzz. Publik key-nya saat ini adalah:
ru: Релиз 0.7.6 и более поздние подписаны zzz. Его действительный публичный ключ:

source: Releases from 0.9.9 could be signed by str4d. His current public key is:
id: Rilis dari 0.9.9 mungkin ditandatangani oleh str4d. Publik key-nya saat ini adalah:

source: str4d has signed the following releases:
id: str4d telah menandatangani rilis berikut:

source: Releases 0.7.6 through 0.9.12 were signed by zzz with the following key:
id: Rilis 0.7.6 sampai 0.9.12 ditandatangani oleh zzz dengan key berikut:
ru: Релизы с 0.7.6 до 0.9.12 были подписаны zzz следующим ключом:

source: Releases 0.6.1.31 through 0.7.5 were signed by Complication. His public key is:
id: Rilis 0.6.1.31 sampai 0.7.5 ditandatangani oleh Compilation. Public key-nya adalah:
ru: Релизы с 0.6.1.31 по 0.7.5 были подписаны Complication. Его публичный ключ:

source: Security GPG Key
id: Kunci GPG Keamanan
ru: GPG ключ

source: Following is the GPG key for the security _at_ geti2p.net email address:
id: Berikut ini adalah kunci GPG untuk keamanan alamat email _at_ geti2p.net:

source: Signed Developer Keys
id: Developer Key yang Ditandatangani
ru: Подписанные ключи разработчиков

source: Keys for zzz, Complication and welterde are provided clearsigned. The key for jrandom must be verified differently, since he's away, and only left a binary detached signature for his key.
id: Kunci untuk zzz, Complication dan welterde disediakan clearsigned. Kunci jrandom harus diverifikasi secara berbeda, karena dia sudah pergi, dan hanya membiarkan tanda tangan biner terpisah untuk kuncinya.
ru: Ключи для zzz, Complication и welterde предоставляются в виде clearsigned. Ключ для jrandom должен быть верифицирован иначе, т.к. его нет, и осталась только двоично отделенная - binary detached - подпись его ключа.

source: Monotone keys for zzz
id: Kunci monotone untuk zzz
ru: Ключи monotone для zzz

source: Monotone keys for welterde
id: Kunci monotone untuk welterde
ru: Ключи monotone для welterde

source: Monotone keys for Complication
id: Kunci monotone untuk Compilation
ru: Ключи monotone для Complication

source: Monotone keys for jrandom
id: Kunci monotone untuk jrandom
ru: Ключи monotone для jrandom

source: Others
id: Lainnya
ru: Другие

source: <u>Tip:</u> To find zzz's GPG key, on his eepsite locate the key `0xA76E0BED`, with the name `zzz@mail.i2p` and the fingerprint `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.
id: <u>Tips:</u> Untuk menemukan kunci GPG milik zzz, di eepsite-nya, cari kunci '0xA76E0BED', dengan nama 'zzz@mail.i2p' dan sidik jari '4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED'.
ru: <u>Примечание:</u> Чтобы найти GPG ключ zzz, на его eepsite найдите ключ `0xA76E0BED`, с именем `zzz@mail.i2p` и fingerprint `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.

source: <b>Tip:</b> To find welterde's GPG key, on public keyservers locate the key `0x62E011A1`, with the name `welterde@arcor.de` and the fingerprint `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.
id: <b>Tips:</b> Untuk menemukan kunci GPG milik welterde, di keyservers publik, cari kunci '0x62E011A1', dengan nama 'welterde@arcor.de' dan sidik jari '6720 FD81 3872 6DFC 6016 64D 1 EBBC 0374 62E0 11A1'.
ru: <u>Примечание:</u> Чтобы найти GPG ключ welterde, на публичном key-сервере найдите ключ `0x62E011A1`, с именем `welterde@arcor.de` и fingerprint `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.

source: <b>Tip:</b> To find Complication's GPG key, on his eepsite locate the key `0x79FCCE33`, with the name `complication@mail.i2p` and the fingerprint `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.
id: <b>Tips:</b> untuk menemukan kunci GPG milik Compilation, pada eepsite-nya, cari kunci '0x79FCCE33', dengan nama 'complication@mail.i2p' dan sidik jari ' 73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79 FC CE33'.
ru: <u>Примечание:</u> Чтобы найти GPG ключ Complication, на его eepsite найдите ключ `0x79FCCE33`, с именем `complication@mail.i2p` и fingerprint `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.

source: <b>Tip:</b> To find jrandom's GPG key for Syndie releases, on public keyservers locate the key `0x393F2DF9`, with the name `syndie-dist-key@i2p.net` and the fingerprint `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.
id: <b>Tips:</b> untuk menemukan kunci GPG rilis Syndie milik jrandom, di keyservers publik, cari kunci '0x393F2DF9', dengan nama 'syndie-dist-key@i2p.net' dan sidik jari ' AE89 D080 0E85 72F0 B777 B2ED C2FA 68C 0 393F 2DF9'.
ru: <u>Примечание:</u> Чтобы найти GPG ключ jrandom для релизов Syndie, на публичном key-сервере найдите ключ `0x393F2DF9`, с именем `syndie-dist-key@i2p.net` и fingerprint `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.

source: Jrandom had to leave unexpectedly in the end of 2007. His commit key was deployed in the Syndie Monotone repository, in a file named `mtn-committers`. That file also had a GPG signature, `mtn-committers.sig`, but it was a binary detached signature. I am going to supply both files in GPG ASCII-armoured form below.
id: Jrandom tiba-tiba harus meninggalkan I2P di akhir tahun 2007. Commit key-nya ditempatkan dalam repositori Syndie Monotone, dalam sebuah file yang bernama 'mtn-committers'. File tersebut juga memiliki tanda tangan GPG, ' mtn-committers.sig', tapi itu binary detached signature. Saya akan memasok kedua file tersebut dalam bentuk GPG ASCII-armoured di bawah ini.
ru: Jrandom был вынужден неожиданно уйти в конце 2007. Его ключ фиксации был размещен в хранилище Syndie Monotone, в файле с именем `mtn-committers`. У этого файла также есть подпись GPG, `mtn-committers.sig`, но она binary detached. Я хочу привести содержимое обоих файлов в GPG ASCII форме ниже.

source: First, the file `mtn-committers` containing jrandom's Monotone key. Save as `mtn-committers.asc` and unpack it using `gpg --output mtn-committers --dearmor mtn-committers.asc`:
id: Pertama, file 'mtn-committers' berisi kunci Monotone milik jrandom. Simpan sebagai `mtn-committers.asc` dan ekstrak menggunakan `gpg --output mtn-committers --dearmor mtn-committers.asc`:
ru: Первое, файл `mtn-committers`, содержащий Monotone ключ jrandom. Хранимый как `mtn-committers.asc`, для распаковки используйте `gpg --output mtn-committers --dearmor mtn-committers.asc`:

source: Now the file `mtn-committers.sig`, containing the GPG signature. Save as `mtn-committers.sig.asc` and unpack it using `gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc`. Use it to verify the above supplied `mtn-committers` file:
id: Sekarang file `mtn-committers.sig` berisi tanda tangan GPG. Simpan sebagai ' mtn-committers.sig.asc' dan unpack dengan menggunakan ' gpg--output mtn-committers.sig--dearmor mtn-committers.sig.asc'. Gunakan itu untuk memverifikasi file 'mtn-committers' yang disediakan di atas:
ru: Теперь файл `mtn-committers.sig`, содержащий подпись GPG. Хранимый как `mtn-committers.sig.asc`, распаковывается используя `gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc`. Используйте его для верификации имеющегося `mtn-committers` файла:

source: Some of the developers have included their Monotone keys in their <a href="%(licenseagreements)s">signed license agreement</a>.
id: Beberapa pengembang telah memasukkan kunci Monotone mereka dalam <a href="%(licenseagreements)s">perjanjian lisensi yang ditandatangani</a> mereka.
ru: Некоторые разработчики включили свои ключи Monotone в свои <a href="%(licenseagreements)s">подписанные лицензионные соглашения</a>.

source: Developer Guidelines and Coding Style
id: Panduan Pengembang dan Gaya Coding
ru: Руководство по разработке и стиль программирования

source: Read the <a href="%(newdevs)s">new developers guide</a> first.
id: Pertama-tama, baca <a href="%(newdevs)s">panduan pengembang baru</a>.
ru: Для начала прочтите <a href="%(newdevs)s">руководство нового разработчика</a>.

source: Basic Guidelines and Coding Style
id: Dasar Panduan Pengembang dan Gaya Coding
ru: Базовые принципы и стиль форматирования кода

source: Most of the following should be common sense for anybody who has worked on open source or in a commercial programming envrionment. The following applies mostly to the main development branch i2p.i2p. Guidelines for other branches, plugins, and external apps may be substantially different; check with the appropriate developer for guidance.
id: Sebagian besar hal berikut seharusnya panduan umum bagi siapa saja yang telah mengerjakan open source atau dalam lingkungan pemrograman komersial. Berikut ini berlaku terutama untuk cabang pengembangan utama i2p.i2p. Pedoman untuk cabang-cabang lain, plugin, dan aplikasi eksternal mungkin secara substansial berbeda; periksa dengan pengembang yang bersangkutan untuk panduan.
ru: Большинство из ниже следующего должно быть хорошо известно каждому кто участвует в разработке open source или в коммерческой среде разработки. Ниже следующее применимо к большей части основной разработки ветки i2p.i2p. Руководства для других веток, дополнений и внешних приложений может существенно отличаться; для уточнения свяжитесь с соответствующим разработчиком.

source: Community
id: Komunitas
ru: Общество

source: Please don't just "write code". If you can, participate in other development activities, including: development discussions and support on IRC, zzz.i2p, and forum.i2p; testing; bug reporting and responses; documentation; code reviews; etc.
id: Mohon jangan hanya "menulis kode". Jika bisa, anda dapat berpartisipasi dalam kegiatan pengembangan lainnya, termasuk: diskusi pengembangan dan dukungan IRC, zzz.i2p dan forum.i2p; pengujian; melaporkan bug dan tanggapan; dokumentasi; ulasan kode; dll.
ru: Пожалуйста, не нужно просто "писать код". Если вы можете, участвуйте в других мероприятиях, включая: обсуждения разработки и поддержке в IRC, zzz.i2p и на форуме forum.i2p; в тестировании; сообщениях об ошибках и ответах на них; документировании; просматривании кода, и т.д.

source: Active devs should be available periodically on IRC #i2p-dev. Be aware of the current release cycle. Adhere to release milestones such as feature freeze, tag freeze, and the checkin deadline for a release.
id: Pengembang aktif harus bisa dihubungi secara berkala di IRC #i2p-dev. Hati-hati dengan siklus rilis saat ini. Patuhi milestone rilis seperti feature freeze, tag freeze, dan checkin deadline untuk rilis.
ru: Активные разработчики должны периодически быть доступны по IRC #i2p-dev. Будьте в курсе текущего цикла выпуска. Придерживайтесь релизных вех, таких как freeze, tag freeze и checkin deadline для релиза.

source: Release Cycle
id: Siklus Rilis

source: Our normal release cycle is 6-10 weeks. Following are the approximate deadlines within a typical 8-week cycle. Actual deadlines for each release are set by the lead developer.
id: Siklus normal rilis kami adalah 6-10 minggu. Berikut adalah perkiraan tenggat waktu dalam siklus 8 minggu. Tenggat waktu yang sebenarnya untuk setiap rilis ditetapkan oleh pemimpin pengembang.

source: 1-2 days after previous release: Checkins to trunk are allowed.
id: 1-2 hari setelah rilis sebelumnya: Checkins ke trunk diperbolehkan.

source: 2-3 weeks after previous release: Deadline to propagate major changes from other branches to trunk.
id: 2-3 minggu setelah rilis sebelumnya: tenggat waktu untuk menyebarkan perubahan besar dari cabang lainnya ke trunk.

source: 4-5 weeks before release: Deadline to request new home page links.
id: 4-5 minggu sebelum rilis: tenggat waktu untuk permintaan link ke home page baru.

source: 3-4 weeks before release: Feature freeze. Deadline for major new features.
id: 3-4 minggu sebelum rilis: fitur dibekukan. Batas waktu untuk fitur baru.

source: 2-3 weeks before release: Hold project meeting to review new home page link requests, if any.
id: 2-3 minggu sebelum rilis: mengadakan rapat proyek untuk meninjau permintaan link home page baru, jika ada.

source: 7-10 days before release: String freeze. No more changes to translated ("tagged") strings. Push strings to Transifex, announce translation deadline on Transifex.
id: 7-10 hari sebelum rilis: String dibekukan. Tidak lebih perubahan untuk string yang diterjemahkan ("tagged"). Mendorong string ke Transifex, mengumumkan tenggat waktu terjemahan di Transifex.

source: 7-10 days before release: Feature deadline. Bug fixes only after this time. No more features, refactoring or cleanup.
id: 7-10 hari sebelum rilis: tenggang waktu fitur. Perbaikan Bug hanya setelah ini Tidak ada fitur tambahan, refactoring atau cleanup.

source: 3-4 days before release: Translation deadline. Pull translations from Transifex and check in.
id: 3-4 hari sebelum rilis: tenggat waktu terjemahan. Tarik terjemahan dari Transifex and periksa.

source: 2-3 days before release: Checkin deadline. No checkins after this time without the permission of the release builder.
id: 2-3 hari sebelum rilis: batas waktu check-in. Tidak ada checkins setelah ini tanpa izin dari release builder.

source: Hours before release: Code review deadline.
id: Beberapa jam sebelum rilis: tenggang review kode.
