Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/misc.po
Languages: es, id, ro, ru

source: The difference in network load and latency is significant - this is essentially a UDP version of HTTP. On the normal web, we can't really do that, since most HTTP requests and responses are orders of magnitude larger than UDP packets functionally support, but in I2P, messages can be large. The savings for the network load comes from the fact that we don't need to send any ACK messages - rather than the earlier wrap/unwrap request (that bundles a DataMessage with a DeliveryStatusMessage to provide guaranteed delivery), the MinWWW proxy deals with resends (if necessary - in I2PTunnel today, there are no resends).
es: La diferencia en la carga y latencia de la red es significante - esto es esencialmente una versión UDP de HTTP. En las webs normales no podemos hacer esto, ya que la mayoría de las peticiones y respuestas HTTP son mayores de lo que permiten los paquetes UDP, pero en I2P, los mensajes pueden ser más grandes. El ahorro para la red viene de que no necesitamos enviar ningún mensaje ACK - al contrario que las peticiones wrap/unwrap anteriores (que unen un DataMessage con un DeliveryStatusMessage para asegurarse que que ha sido entregado), el proxy MinWWW se encarga de estos reenvíos (si es necesario - en los I2PTunnel no hay reenvíos).
id: Ada perbedaan signifikan dalam beban jaringan dan latensi - hal ini pada dasarnya adalah UDP versi HTTP. Di web normal, kita tidak bisa benar-benar melakukannya, karena kebanyakan permintaan HTTP dan tanggapan berkalo kali lipat lebih besar daripada paket-paket UDP yang didukung, tetapi dalam I2P, pesan dapat menjadi besar. Beban jaringan yang dihemat berasal dari fakta bahwa kita tidak perlu untuk mengirim pesan ACK- daripada permintaan wrap/unwrap sebelumnya (yang mem-bundle DataMessage dengan DeliveryStatusMessage untuk memberikan jaminan pengiriman), proxy MinWWW berkaitan dengan mengirim ulang (jika diperlukan - dalam I2PTunnel hari ini, ada tidak mengirim ulang).
ro: Diferența de încărcare a rețelei și de latență este semnificativ - acesta este în esență, o versiune UDP de HTTP. Pe web normal, nu putem într-adevăr că, deoarece cele mai multe cereri HTTP și răspunsuri sunt ordine de mărime mai mari decât UDP pachete sprijine funcțional, dar în I2P, mesajele pot fi mari. economiile pentru sarcina de rețea vine de la faptul că nu avem nevoie pentru a trimite orice ACK mesaje - mai degrabă decât folie / cererea desface mai devreme (ce include un DataMessage cu o DeliveryStatusMessage de a asigura livrarea garantat), MinWWW ocupă proxy cu retransmite (dacă este necesar - în I2PTunnel de astăzi, nu există retransmite).

source: The data that the MinWWW proxy and server need to wrap is trivial - when the proxy wants to send "GET /", it prepends it with the I2P Destination sending the request, followed by a 4 byte request ID. The MinWWW server receives those requests, contacts the appropriate HTTPD, sends the request, waits for the response, and sends a reply to the MinWWW proxy containing the response, prefixed with the original request ID. That response is taken and passed back to the browser and the connection is closed.
es: Los datos que el servidor y el proxy MinWWW necesitan envolver son triviales - cuando el proxy quiere enviar un "GET /", lo antepone con la destinación I2P y envía la petición, seguido por un ID de petición de 4 bytes. El servidor MinWWW recibe entonces estas peticiones, contacta con el servidor HTTP apropiado, envía la petición, espera por la respuesta, y envía una respuesta al proxy MinWWW con la respuesta dentro, y con el ID original de la petición como prefijo. Esa respuesta se toma y se envía de vuelta al navegador, y se cierra la conexión.
id: Data yang dibutuhkan oleh proxy dan server MinWWW untuk membungkus adalah sangat kecil - ketika proxy ingin mengirim "GET /", ia menambahkannya dengan destinasi I2P yang mengirim permintaan, diikuti oleh ID permintaan 4 byte. Server MinWWW menerima permintaan tersebut, mengontak HTTPD yang sesuai, mengirim permintaan, menunggu respon dan mengirim balasan ke proxy MinWWW yang mengandung respon, diawali dengan permintaan id yang asli. Respon itu diambil dan dilewatkan kembali ke browser lalu koneksi ditutup.
ro: Datele pe care proxy MinWWW și serverul trebuie să-și încheie este banal - în cazul în care proxy vrea să trimită "GET /", ea, adauga inaintea cu destinație I2P trimiterea cererea, urmate de o solicitare ID 4 octeți. Serverul MinWWW primește cele cereri, contacte httpd adecvat, trimite cererea, așteaptă răspuns, și trimite un răspuns la proxy MinWWW conține răspunsul, prefix cererea ID-ul original. Că răspunsul este preluat și a trecut înapoi la browser și conexiunea este închisă.

source: In addition, the MinWWW proxy can choose the MinWWW server to use from a list, going through some round robin or other algorithm, so that there are multiple outproxies merged transparently. The bandwidth required for running one of these outproxies is also greatly reduced, since it will only handle 128KB files (aka no one is going to be downloading porn, warez, etc).
es: Además, el proxy MinWWW puede elegir el servidor MinWWW a usar de una lista, a través de round robin u otro algoritmo, con lo que habría múltiples outproxies unidos transparentemente. El ancho de banda necesario para ejecutar estos outproxies se reduce drásticamente, ya que sólo maneja archivos de 128KB (tambien conocido como: nadie va a bajar porno, software, etc).
id: Selain itu, proxy MinWWW dapat memilih server MinWWW untuk digunakan dari sebuah daftar, melalui beberapa robin atau algoritma lainnya, sehingga ada beberapa outproxies digabungkan secara transparan. Bandwidth yang diperlukan untuk menjalankan salah satu outproxies ini juga sangat berkurang, karena itu hanya akan menangani file 128KB (sehingga tidak ada yang akan men-download porno, warez, dll).
ro: În plus, proxy-ul MinWWW poate alege serverul MinWWW pentru folosirea din lista, trece printr-un round robin sau alt algoritm, astfel încât există mai multe outproxies fuzionate transparent. Lățimea de bandă necesară pentru rularea unului dintre aceste outproxies este, de asemenea, redusa foarte mult, deoarece acesta se va ocupa doar 128KB fișiere (aka nimeni nu e de gând să descărce filme porno, warez, etc).
ru: В дополнение, прокси MinWWW может выбирать используемый сервер MinWWW из списка, по алгоритму round-robin или другому, чтобы прозрачно совмещать несколько выходных прокси. Необходимая ропускная способность для запуска одного выходного прокси уменьшается, так как он должнен обрабатывать только 128KB файлы (то есть никто не будет загружать порно, варез и т.д.)

source: The functionality /is/ limited, but 128KB of data is a lot for a single HTTP request or response. The above diagrams are also unrealistic in their hops - ROUTERA will really never talk directly to ROUTERB. ROUTERA will send each of the messages through two additional outbound routers, then forwarded to two additional inbound routers to ROUTERB, so the lag there is significant - while the above only saves 11 steps, 8 of those steps need to traverse the entire tunnel path (4+ remote hops each time when tunnels are 2 remote hops in each stretch), leaving MinWWW with only two full traversals (one for the request, one for the response), instead of 10.
es: Esta funcionalidad /está/ limitada, pero 128KB es mucho para una simple respuesta o petición HTTP. Los diagramas de más arriba además no son realistas en sus saltos - ROUTERA nunca conectará directamente con ROUTERB, ROUTERA enviará sus mensajes a través de dos ruters de salida adicionales, entonces se reenviará a dos túneles adicionales hacia ROUTERB, con lo que el retraso es significante - mientras que lo anterior sólo ahorra 11 pasos, 8 de estos pasos necesitan atravesar el camino entero de túneles (4 saltos más remotos cada vez), dejando MinWWW con sólo dos recorridos completos (uno para la petición, otro para la respuesta), en vez de 10.
id: Fungsinya terbatas, tetapi 128KB data adalah banyak untuk satu permintaan HTTP atau respon. Diagram di atas juga tidak realistis di hop mereka - ROUTERA akan benar-benar tidak pernah berbicara langsung ke ROUTERB. ROUTERA akan mengirimkan kepada setiap pesan melalui dua router outbound tambahan, lalu meneruskan ke dua router inbound tambahan ke ROUTERB, sehingga lag menjadi signifikan - sementara di atas hanya menghemat 11 langkah, 8 langkah tersebut perlu melintasi seluruh jalur tunnel (4 remote hop setiap kali ketika tunnel adalah 2 hop jarak jauh di setiap strecth), meninggalkan MinWWW hanya dengan dua traversals penuh (satu untuk permintaan, satu untuk tanggapannya), bukan 10.
ro: Funcționalitatea /este/ limitata, dar 128KB de date este mult pentru o singura cerere sau răspuns HTTP. Diagramele de mai sus sunt, de asemenea, nerealiste în sectorul hameiului lor - ROUTERA într-adevăr nu va vorbi direct la ROUTERB. ROUTERA va trimite fiecare din mesaje prin două routere de ieșire suplimentare, apoi înaintat două routere de intrare suplimentare ROUTERB, astfel încât decalajul nu este semnificativ - în timp ce cele de mai sus salvează numai 11 pași, 8 dintre aceste măsuri trebuie să traverseze întreaga cale tunel (4 + hamei la distanță de fiecare dată când tuneluri sunt 2 hamei de la distanță în fiecare întindere), lăsând MinWWW cu doar doua traversari complete (una pentru cerere, unul pentru răspunsul), în loc de 10.
ru: Функциональность /is/ ограничена, но 128KB данных с запасом хватит для одного запроса или ответа HTTP. Диаграммы выше нереалистичны в отображении хопов - ROUTERA никогда напрямую не свяжется с ROUTERB. ROUTERA пошлет каждое из сообщений через два дополнительных выходных роутера, затем их перешлют на два дополнительных входных роутера на ROUTERB, так что задержка здесь существенна - хотя указанное выше сэкономит только 11 шагов, 8 из них нужны для обхода всего туннельного пути (каждый раз 4+ удаленных хопа при туннелях протяженностью 2 удаленных хопа), оставляя MinWWW только два обхода (один для запроса, один для ответа), вместо 10.

source: Implementing the MinWWW proxy and server should be fairly easy - read an HTTP request from the client fully (perhaps only start out with HTTP GET, leaving HTTP POST for later), wrap the message, and wait for the response. The server in turn simply needs to parse the request to either open a socket or URL, send the request, wait for the response, and send it back through the network. If someone were to implement this, it would be Good :)
es: Implementar el proxy y el servidor MinWWW debería ser bastante fácil - leer una petición HTTP del cliente (quizás sólo empezar con un HTTP GET; dejando HTTP POST para más tarde), envolver el mensaje, y esperar por la respuesta. El servidor de turno sólo necesita analizar la petición para abrir un socket o una URL, enviar la petición, esperar por la respuesta y enviarlo de vuelta a través de la red. ¡Si alguien implementase esto, sería Genial! :)
id: Menerapkan MinWWW proxy dan server seharusnya cukup mudah - sepenuhnya membaca permintaan HTTP dari klien (mungkin hanya dimulai dengan method GET, menyisakan method POST untuk nanti), bungkus pesan, dan menunggu respon. Server selanjutnya hanya perlu parsing permintaan untuk membuka soket atau URL, mengirim permintaan, menunggu jawabannya, dan mengirimkannya kembali melalui jaringan. Jika seseorang menerapkan ini, itu akan menjadi baik :)
ro: Punerea în aplicare a proxy MinWWW și serverului ar trebui să fie destul de usoara - citit o HTTP cerere complet din partea clientului (poate începe numai cu HTTP GET, lăsând POST HTTP pentru mai târziu), înfășurați mesajul, și așteptați răspunsul. serverul la rândul său, pur și simplu are nevoie pentru a analiza cererea fie a deschide un socket sau URL-ul, trimiteti cererea, așteptați răspunsul, și trimite-l înapoi prin intermediul rețelei. Dacă cineva a fost să pună în aplicare acest lucru, ar fi bine :)
ru: Реализация прокси MinWWW и сервера должная быть довольно проста - читать HTTP запрос с клиента полностью (возможно, начать с HTTP GET, оставив HTTP POST на потом), проксировать сообщение и ждать ответа. Далее сервер просто должен распознать запрос и открыть сокет или URL, послать запрос, ждать ответа, и отправить его обратно по сети. Будет отлично, если кто-то реализует это :)

source: [1] Why 128KB files? Currently I2CP allows functionally arbitrary message size, but that's going to be going away since it involves either excessive memory overhead on intermediary routers, or additional implementation details to handle. I2PTunnel is currently limited to 128KB and hasn't been a burden, so perhaps it could be increased to 256KB when the I2CP spec is updated)
es: [1] ¿Por qué archivos de 128KB? Actualmente I2P permite mensajes de tamaño arbitrario, pero eso se eliminará ya que implica un gasto de memoria en los ruters intermedios. Los túneles I2P están limitados a 128KB y no ha sido un problema, son lo que quizás podría ampliarse a 256KB cuando las espcificaciones de I2CP se actualicen)
id: [1] Mengapa file sebesar 128KB? Saat ini I2CP memungkinkan ukuran pesan arbitrary secara fungsional, tapi itu akan hilang karena melibatkan overhead memori yang berlebihan pada router intermediary, atau detail implementasi tambahan yang harus ditangani. I2PTunnel saat ini terbatas pada 128KB dan belum menjadi beban, jadi mungkin bisa ditingkatkan menjadi 256KB saat spesifikasi I2CP diperbarui)
ro: [1] De ce fișiere 128KB? În prezent, I2CP funcțional permite mesaje dimensiune arbitrara , dar care va fi merge departe, deoarece aceasta implică memorie excesiva pe routere intermediare, sau detalii suplimentare de punere în aplicare . I2PTunnel este în prezent limitat la 128KB și nu a fost o povară,așa că, probabil, ar putea fi crescută la 256KB când spec. I2CP va fi actualizata)
ru: [1] Почему файлы 128KB? Сейчас I2CP допускает работу с произвольным размером сообщения, но это будет отменено так как повлекает или избыточное использование памяти на промежуточных маршрутизаторах, или дополнительные усилия по реализации. I2PTunnel сейчас ограничен до 128KB без перегрузки, так что возможно он будет увеличен до 256KB когда спецификации I2CP обновят)

source: There has been discussion about a distributed blogging application for a few months now called "MyI2P". While the original discussions were lost, we were able to retrieve a Google <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html">cache</a> of it. It isn't pretty, but it includes the basic overview and some discussion that ensued.
es: Ha habido discusiones durante unos meses sobre una aplicación de blogging llamada ahora "MyI2P". Aunque la discusión original se perdió, fuimos capaces de conseguirla con el <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html">cache</a> de Google.
id: Telah ada diskusi tentang aplikasi blogging terdistribusi selama beberapa bulan yang sekarang disebut "MyI2P". Sementara diskusi asli hilang, kami dapat mengambil <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html">cache</a> Google dari situ. Ini tidak terlihat enak dipandang, tapi mencakup gambaran dasar dan beberapa diskusi yang terjadi.
ro: Au fost discuții cu privire la o cerere de blogging-ul distribuit de câteva luni, numit acum "MyI2P". În timp ce discuțiile originale s-au pierdut, a fost posibilitatea de a prelua un <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html"> cache Google </ a> . Acesta nu este destul, dar include o vedere de ansamblu de bază și unele discuții care a urmat.
ru: Несколько месяцев длилась дискуссия о распределенном приложении для блогов, теперь оно называется "MyI2P". Хотя оригинальное обсуждение утеряно, мы можем восстановить его <a href="http://dev.i2p.net/~jrandom/i2p.net/myi2p.html">сохраненную версию из Google</a>. Не бог весть что, но хотя бы основная идея и завязавшееся обсуждение.

source: The application itself is not yet implemented, and the ideas behind it have been made less ambitious over time, but they are still valid and the current <a href="%(roadmap)s">plan</a> is to have the core MyI2P functionality available along side the I2P 1.0 release. That will include a distributed address book to enable secure, distributed, and human readable naming by sacrificing the need for global uniqueness - basically everyone has their own local address book and can 'subscribe' to other people's address books, letting MyI2P periodically retrieve new name to destination mappings (leaving conflicts up to the user to resolve). In addition to the address book, there will be a distributed blogging system using a reduced and secured subset of <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode">bbcode</a> to essentially provide an anonymous <a href="http://www.livejournal.com/">LiveJournal</a> with a 'friends list' and transparent access control (authenticated by the I2P <a href="%(datagrams)s">datagrams</a> with rules defined based on the address book).
es: La aplicación en si misma no está implementada, y las ideas detrás de ella se han hecho menos ambiciosas con el tiempo, pero aún son válidas y el <a href="%(roadmap)s">plan</a> actual es tener el núcleo de MyI2P disponible con la versión 1.0 de I2P. Esto incluirá una libreta de direcciones distribuida para permitir un sistema de nombres seguro y distribuido aunque signifique sacrificar la necesidad de unicidad global - básicamente cada uno tiene su libreta de direcciones locales y puede 'suscribirse' a las libretas de direcciones de otros usuarios, permitiendo a MyI2P obtener periódicamente nuevos nombres de destinos (dejando al usuario arreglar los conflictos). Ademas de la libreta de direcciones, habrá un sistema de blogs distribuidos usando una parte segura de <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode">bbcode</a>, para proveer un <a href="http://www.livejournal.com/">LiveJournal</a> anónimo, una 'lista de amigos' y un control de acceso transparente (autentificado por los <a href="%(datagrams)s">datagramas</a> de I2P con normas definidas basadas en la libreta de direcciones).
id: Aplikasinya sendiri belum diimplementasikan, dan gagasan di baliknya telah dibuat kurang ambisius seiring berjalannya waktu, namun tetap valid dan <a href="%(roadmap)s">rencana</a> saat ini adalah memiliki fungsionalitas MyI2P inti yang tersedia di sepanjang rilis I2P 1.0. Itu akan mencakup buku alamat terdistribusi untuk memungkinkan penamaan yang aman, terdistribusi, dan dapat dibaca manusia dengan mengorbankan kebutuhan akan keunikan global - pada dasarnya setiap orang memiliki buku alamat lokal mereka sendiri dan dapat 'berlangganan' ke buku alamat orang lain, membiarkan MyI2P secara berkala mengambil nama baru ke pemetaan tujuan (meninggalkan konflik untuk diselesaikan pengguna). Selain buku alamat, akan ada sistem blogging terdistribusi yang menggunakan <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode">subkunci bbcode yang</a> dikurangi dan dijamin untuk memberikan <a href="http://www.livejournal.com/">LiveJournal</a> anonim secara sederhana dengan 'daftar teman' dan kontrol akses transparan (disahkan oleh <a href="%(datagrams)s">datagram</a> I2P dengan peraturan yang ditentukan berdasarkan buku alamat).
ro: Aplicatie în sine nu este încă pusă în aplicare , iar ideile din spatele acestuia au fost destul de ambitiosi , dar ele sunt încă valabile si in <a href="%(roadmap)s">planul curent < / a > este de a avea funcționalitatea MyI2P de bază disponibila de-a lungul release-ului I2P 1.0 . Care va include o agendă de adrese distribuita pentru a permite denumiri sigure , distribuite , și umane ce pot fi citite prin sacrificarea nevoie de unicitate la nivel mondial - în principiu, fiecare are propria lor agendă locală și pot " abona " la agende altor persoane , permițându- MyI2P periodic prelua nume nou pentru maparea de destinație ( lăsând conflicte până la utilizatorul le rezolva ) . În plus față de agenda , va exista un blogging- distribuit sistem folosind un subset redus și asigurat de <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode"> BBCode < / a > , în esență, oferă un <a href="http://www.livejournal.com/"> LiveJournal < / a > anonim cu o " lista de prieteni " și de control al accesului transparent ( autentificat de I2P <a href="%(datagrams)s"> datagrame</ a> cu reguli definite bazat pe agenda de adrese) .
ru: Само приложение не реализовано, и со временем идеи, стоящие за ним стали менее амбициозными, но они до сих пор существуют и текущий <a href="%(roadmap)s">план</a> состоит в том чтобы сделать доступной основную функциональность MyI2P к выпуску I2P 1.0. Который будет включать в себя распределенную адресную книгу, что нужно для защищенной, распределенной, удобной для людей адресации пожертвовав необходимостью иметь глобальные уникальные адреса - ведь обычно у всех есть своя локальная адресная книга и возможность подписаться на адресные книги других людей, позволив MyI2P периодически получать новые связки адресов и назначений (оставляя разрещение конфликтов за пользователем). В дополнение к адресной книге будет распределенная блоговая система использующая урезанную защищенную версию <a href="http://www.phpbb.com/phpBB/faq.php?mode=bbcode">bbcode</a> для предоставления <a href="http://www.livejournal.com/">LiveJournal</a> со 'списком друзей' и прозрачным контролем доступа (с аутентификацией с помощью <a href="%(datagrams)s">датаграмм</a> I2P и правилами определяемыми на основе адресной книги).

source: Additional functionality, such as integration with a DHT backing store or swarming file transfers for 'attachments' can be added later. Email may or may not get in the first pass either, though its implementation is essentially just a blog entry with private access, so perhaps some UI designer can come up with something. Exporting the data to RSS or access through ATOM will be an option down the road as well.
es: Las funcionalidades adicionales, como la integración del almacenamiento de copias DHT o la transferencia de archivos cmoo 'adjuntos' puede añadirse más tarde. El email puede estar listo o no en esta primera versión, aunque su implementación es esencialmente simplemente una entrada de blog con acceso privado, con lo que quizás algún diseñador de aplicaciones gráficas podría hacer algo. Esportando los datos a RSS o el acceso a través de ATOM podría ser unas opciones también.
id: Fungsi tambahan, seperti integrasi dengan DHT backing store atau transfer file swarming untuk 'attachment' dapat ditambahkan nanti. Email mungkin atau mungkin juga tidak masuk pertama kali, walaupun implementasinya pada dasarnya hanya entri blog dengan akses pribadi, jadi mungkin beberapa perancang UI dapat membuat sesuatu. Mengekspor data ke RSS atau akses melalui ATOM akan menjadi sebuah pilihan juga.
ro: Funcționalitate suplimentară, cum ar fi integrarea cu un magazin de suport DHT sau transferuri de fișiere pentru atașamente pot fi adăugate mai târziu. E-mail poate sau nu ajunge în prima trecere, fie, deși punerea sa în aplicare este, în esență doar o intrare de blog cu acces privat, asa ca, probabil unele designer de UI pot veni cu ceva. Exportarea datelor la RSS sau accesul prin ATOM va fi o opțiune adaugata in viitor, de asemenea.
ru: Дополнительная функциональность, такая как интеграция с резервным хранилищем DHT или распределенная передача файлов для 'вложений' могут быть добавлены позже. Электронная почта будет или не будет добавлена в первую очередь, хотя ее реализация по существу просто запись в блоге с приватным доступом, возможно некоторые дизайнеры пользовательского интерфейса смогут что нибудь придумать. Экспорт данных в RSS или доступ через ATOM также будет добавлен позже.

source: RateStat list
es: Lista de RateStat
id: Daftar RateStat
ro: lista RateStat
ru: Список статистики оценок
