Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/misc.po
Languages: es, id, ro, ru

source: The beauty of I2P is that it allows standard Internet clients and servers for most protocols to be transparently 'tunneled' through the anonymous network.
es: La belleza de I2P radica en que permite que los clientes y servidores de la mayoría de los protocolos sean 'tunelados' transparentemente a través de la red anónima I2P.
id: Keindahan I2P adalah bahwa hal itu memungkinkan Internet klien dan server standar untuk kebanyakan protokol, untuk menjadi 'tunneled' melalui jaringan anonim secara transparan.
ro: Frumusețea I2P este că permite clienților de internet standard și servere pentru cele mai multe protocoale să fie transparent "tunel" prin intermediul rețelei anonim.
ru: Прелесть I2P заключается в том, что она позволяет вполне обычным клиентам и серверам большинства протоколов работать без особой перенастройки путём их 'туннелирования' через анонимную сеть.

source: You can run mailservers/clients, nameservers/clients, newsservers/clients - almost anything at all - perhaps even FTP in passive mode.
es: Puede ejecutar servidores/clientes de email, servidores/clientes de nombres, servidores/clientes de noticias - realmente casi caulquier cosa - quizás incluso FTP en modo pasivo.
id: Anda dapat menjalankan mailservers / clients, nameserver / clients, newsservers / clients - hampir semuanya - bahkan mungkin FTP dalam mode pasif.
ro: Puteți rula de servere mail / clienti, servere de nume / clienti, servere de noutati / clienti - aproape orice, la toate - poate chiar FTP în modul pasiv.
ru: Вы можете использовать почтовые серверы/клиенты, серверы/клиенты разрешения имён, новостные серверы/клиенты - практически всё - возможно даже FTP в пассивном режиме.

source: Now, we'll create a client tunnel. This is like the server tunnel we created earlier, but works in reverse. It listens to a port on your local machine; your local client connects to this port; the connection gets forwarded through I2P to the service on the other end.
es: Ahora vamos a crear un túnel cliente. Este es como el túnel servidor que hemos creado anteriormente, pero funciona al revés. Escucha en un puerto en su máquina local; su cliente local se conecta a este puerto; la conexión se reenvía a través de I2P hasta el servicio de destino.
id: Sekarang, kita akan membuat tunnel klien. Ini seperti tunnel server yang kita buat tadi, tapi bekerja terbalik. Ini mendengarkan port di komputer lokal anda; klien lokal anda terhubung ke port ini; koneksi akan diteruskan melalui I2P ke service di ujung yang lain.
ro: Acum, vom crea un tunel client. Acest lucru este ca tunelul de server pe care l-am creat mai devreme, dar funcționează în sens invers. Se ascultă la un port de pe computerul local, clientul dvs. local se conectează la acest port, conexiunea este transmisă prin I2P la serviciul de la celălalt capăt.
ru: Теперь создадим клиентский туннель. Он похож на серверный, созданный нами ранее, но работает в обратном направлении. Он ждёт соединений на определённом порту на Вашем компьютере; Ваш локальный клиент соединяется с этим портом; соединение перенаправляется через I2P к сервису на другом конце туннеля.

source: To open your client tunnel for your server, type the command <code>java -jar lib/i2ptunnel.jar -nogui -e "config localhost 7654" -e "client 10888 textofbase64key"</code> (all one line).
es: Para abrir el túnel cliente para su servidor, ejecute el comando <code>java -jar lib/i2ptunnel.jar -nogui -e "config localhost 7654" -e "client 10888 textofbase64key"</code> (todo en una línea).
id: Untuk membuka tunnel klien anda untuk server anda, ketik perintah <code>java -jar lib/i2ptunnel.jar -nogui -e "config localhost 7654" -e "client 10888 textofbase64key"</code> (semua satu baris).
ro: Pentru a deschide tunelul client pentru server-ul dvs., tastați comanda <code> java-jar lib/i2ptunnel.jar-nogui-e "config localhost 7654"-e "client 10888 textofbase64key" </ code> (tot intr-o singură linie).
ru: Для открытия клиентского туннеля для сервера наберите команду code>java -jar lib/i2ptunnel.jar -nogui -e "config localhost 7654" -e "client 10888 textofbase64key"</code> (всё одной строкой)

source: The port 10888 is arbitrary - it just needs to be something other than the physical port your server is listening on.
es: El puerto10888 es arbitrario - simplemente es necesario que sea un puerto diferente al que ocupa su servidor, y que no esté usado por ningún otro servicio.
id: Port 10888 dapat diubah - hanya perlu hal selain port fisik yang didengarkan server anda.
ro: Port 10888 este arbitrar - trebuie doar să fie altceva decât portul fizic pe care il asculta server-ul dvs..
ru: Порт 10888 выбран произвольно - он просто должен отличаться от порта, на котором ожидает соединений Ваш сервер.

source: textofbase64key is simply the contents of the public key text file myWebPubKey.txt, reproduced fully on one line (alternately, instead of textofbase64key, you can specify the name from your hosts.txt - e.g. myserver.i2p)
es: textofbase64key no es más que el contenido del archivo de la clave pública myWebPubKey.txt, reproducido completamente en una línea (alternativamente, en vez de usar textofbase64key, puede especificar el nombre en su hosts.txt - por ejemplo myserver.i2p)
id: textofbase64key hanyalah isi dari file teks public key untuk myWebPubKey.txt, direproduksi sepenuhnya pada satu baris (sebaliknya, alih-alih textofbase64key, anda dapat menentukan namanya dari hosts.txt - misal myserver.i2p)
ro: textofbase64key este pur și simplu conținutul fișier cheie public myWebPubKey.txt, scrisa pe o singură linie (alternativ, în loc de textofbase64key, puteți specifica numele de hosts.txt dvs. - de exemplu myserver.i2p)
ru: textofbase64key — это содержимое текстового файла myWebPubKey.txt, воспроизведенное полностью в одну линию (как вариант, вместо textofbase64key можно выбрать имя из hosts.txt, например, myserver.i2p)

source: Within a minute or two of launching this command, the client tunnel from your local machine into I2P will be open and ready for use.
es: Después de un minuto o dos de haber ejecutado este comando, el túnel cliente desde su máquina local hacia I2P estará abierto y listo para usar.
id: Dalam satu atau dua menit peluncuran perintah ini, tunnel klien akan terbuka dari mesin lokal anda ke I2P dan siap digunakan.
ro: Într-un minut sau două dupa lansarea acestei comenzi, tunelul de client de la computerul local în I2P va fi deschis și gata de utilizare.
ru: Клиентский туннель с вашего компьютера в I2P откроется и будет готов к использованию через пару минут после выполнения этой команды.

source: Point your regular web browser (ie, not the one you configured to use localhost:4444), and point it to <a href="http://localhost:10888" target="_blank">http://localhost:10888</a>
es: Apunte su navegador web normal (no el que ha configurado para usar localhost:4444), hacia <a href="http://localhost:10888" target="_blank">http://localhost:10888</a>
id: Arahkan browser web biasa anda (misalnya, bukan yang anda konfigurasikan untuk menggunakan localhost: 4444), dan arahkan ke <a href="http://localhost:10888" target="_blank">http: // localhost: 10888</a>
ro: Punctul de browser-ul web regulat (de exemplu, nu cel pe care l-ati configurat pentru a utiliza localhost: 4444), și punctul în care să <a href="http://localhost:10888" target="_blank"> http://localhost:10888 </ a>
ru: Зайдите браузером (не тем, который настроен использовать localhost:4444) на <a href="http://localhost:10888" target="_blank">http://localhost:10888</a>

source: Verify that the main page of your server eventually comes up in your browser.
es: Asegúrese que la página principal de su servidor aparece en su navegador web.
id: Pastikan halaman utama server anda akhirnya muncul di browser anda.
ro: Asigurați-vă că pagina principală a serverului dvs. în cele din urmă vine în browser-ul dumneavoastră.
ru: Удостоверьтесь, что главная страница вашего сервера отображается в браузере

source: You use the same procedure for using any local client program to access a remote I2P server - just get the base64 public key (called destination key) of the remote server, choose a local port to connect to the remote server, open the tunnel, and just connect with your client to your heart's content.
es: Usará el mismo procedimiento para que cualquier aplicación cliente local pueda acceder a un servidor remoto I2P - simplemente consiga la clave pública base64 (llamada clave de destino) del servidor remoto, elija un puerto local para conectarse al servidor remoto, abra el túnel, y conecte con su cliente al contenido deseado.
id: Anda menggunakan prosedur yang sama untuk menggunakan program klien lokal manapun untuk mengakses server I2P jarak jauh - cukup dapatkan public key base64 (disebut destinantion key) dari server jarak jauh, pilih port lokal untuk terhubung ke server jarak jauh, buka tunnel, dan hubungkan saja dengan klien anda sesuka hati Anda.
ro: Puteți utiliza aceeași procedură pentru folosirea orice programului client local, pentru a accesa un server de la distanță I2P - ajunge doar cheia publică base64 (denumit cheie destinație) din serverul de la distanță, alegeți un port local pentru a se conecta la serverul de la distanță, deschideți tunel, și doar conecta cu clientul dvs. pentru inima ta de conținut.
ru: Использование локальных клиентских програм для доступа к удаленному серверу I2P ничем не отличается от обычной процедуры: получаете открытый ключ удаленного сервера в виде base64 (ключ адреса назначения), выбираете локальный порт для соединения с удаленным сервером, открываете туннель, просто подсоединяетесь клиентской программой и получаете доступ к вашему любимому контенту.

source: 7 - Share your server details with others
es: 7 - Comparta los datos del servidor con otros
id: 7 - Bagikan rincian server anda dengan orang lain
ro: 7 - Împărtășiți detaliile de server cu alții
ru: 7 - Поделитесь адресом вашего сервера

source: Using an anonymous medium (eg the one of the I2P IRC servers or ugha's wiki), post your domain name (eg <a href="http://www.mynick.i2p" target="_blank">www.mynick.i2p</a> as well as your destination key. Others will then be able to reach your server remotely, without either of you jeopardizing your anonymity.
es: Usando un medio anónimo (por ejemplo unos los servidores IRC en I2P o la wiki de ugha), anuncie su nombre de dominio ( por ejemplo <a href="http://www.mynick.i2p" target="_blank">www.mynick.i2p</a>) así como su clave de destino. Entonces otros podrán conectarse a su servidor remotamente sin comprometer su anonimato o el de ellos.
id: Menggunakan media anonim (misalnya server I2P IRC atau wiki ugha), <a href="http://www.mynick.i2p" target="_blank">kirimkan</a> nama domain anda (misalnya <a href="http://www.mynick.i2p" target="_blank">www.mynick.i2p</a> dan juga destination key anda. Orang lain kemudian dapat menjangkau server anda dari jarak jauh, tanpa membahayakan anonimitas anda.
ro: Folosind un mediu anonim (de exemplu, unul dintre serverele IRC I2P sau wiki ugha), posta numele dvs. de domeniu (de exemplu, <a href="http://www.mynick.i2p" target="_blank"> www.mynick.i2p</ a>, precum și cheia destinație. Alții vor putea apoi să ajungă la server-ul dvs. de la distanță, fără ca nici unul dintre va pune în pericol anonimatul.
ru: Используя анонимные средства (например, один из I2P IRC-серверов или ugha's wiki), сообщите доменное имя (например, <a href="http://www.mynick.i2p" target="_blank">www.mynick.i2p</a> вместе с ключом адреса назначения. После этого другие пользователи смогут соединиться с вашим сервером без риска для вашей и их анонимности.

source: Remember, you can go to What's on I2P and find the latest public keys linked to their URL. You should also post your own public key and URL their. However, you will want to do this anonymously, of course. Drupal.i2p.net is currently, as of this writing, only accessible from the net. So, to access the outside WWW anonymously from inside of I2P, you will need to start up your script called startSquid. Do it the same way you have been doing these other scripts. Reconfigure your browser to proxy on localhost:5555, as defined in the script, and when the script has generated it's keys, you can access the squid proxy. Put any WWW URL (such as Google or this i2p site) into your browser's address bar and you will be surfing the World Wide Web anonymously. Now you can safely post your public key, and no one can detect your IP address.
es: Recuerde, pude ir a What's on I2P y buscar las últimas claves públicas enlazadas a su URL. También debería añadir su clave pública y URL allí. Pero por supuesto, quiere hacer esto anónimamente. Drupal.i2p.net es sólo accesible desde la clearnet. Por lo que para acceder a la WWW anónimamante desde I2P, necesitará ejecutar el script startSquid. Hágalo de la misma forma que ha ejecutado otros scripts. Vuelva a configurar su navegador web para que use localhost:5555 como proxy, como se ha definido en el script, y cuando el script haya generado sus claves, ya puede acceder el proxy squid. Ponga cualquier URL WWW (como Google o esta web de I2P) en su navegador y estará navegando la clearnet anónimamante. Ahora puede añadir su clave pública seguro, y nadie puede averiguar si IP.
id: Ingat, anda bisa masuk ke What's on I2P dan menemukan public key terbaru yang terkait dengan URL mereka. Anda juga sebaiknya memposting public key anda sendiri dan URL mereka. Namun, anda pasti ingin melakukan hal ini secara anonim, tentu saja. Drupal.i2p.net saat ini, seperti tulisan ini, hanya bisa diakses dari internet. Jadi, untuk mengakses WWW luar secara anonim dari dalam I2P, anda perlu memulai skrip anda yang disebut startSquid. Lakukan dengan cara yang sama seperti anda telah menjalainkan skrip lain. Konfigurasikan ulang browser anda ke proxy di localhost: 5555, seperti yang didefinisikan dalam skrip, dan saat skrip telah menghasilkan kunci itu, anda dapat mengakses proxy squid. Letakkan URL WWW (seperti Google atau situs i2p ini) ke bilah alamat browser anda dan Anda akan berselancar di World Wide Web secara anonim. Sekarang anda dapat memposting kunci publik anda dengan aman, dan tidak ada yang bisa mendeteksi alamat IP Anda.
ro: Retineti, poti sa te duci la ceea ce este pe I2P și pentru a găsi cele mai recente cheile publice legate de URL-ul lor. Tu ar trebui să postezi, de asemenea, cheie publică proprie și URL-ul lor. Cu toate acestea, veți dori să faceți acest lucru anonim, desigur. Drupal.i2p.net este în prezent, scris, accesibil numai de pe net. Deci, pentru a accesa WWW exterior anonim din interiorul I2P, veți avea nevoie pentru a porni script-ul numit startSquid. Fă-o la fel cum au făcut alte script-uri. Reconfigurati browser-ul dvs. să proxezi pe localhost: 5555, astfel cum sunt definite în script, iar în cazul în care script-ul a generat cheile, puteți accesa proxy squid. Pune orice URL-ul WWW (cum ar fi Google sau site-ul I2P) în bara de adrese a browser-ului dvs. și veti avea navigarea pe World Wide Web anonim. Acum puteți posta în siguranță cheia dvs. publică, și nimeni nu poate detecta adresa IP.
ru: Помните, что Вы можете зайти на What's on I2P и найти самые последние публичные ключи, привязанные к URL. Вы также должны разместить там свой публичный ключи и URL. Разумеется, Вы захотите сделать это анонимно. Drupal.i2p.net в настоящее время, по состоянию на момент написания этого текста, доступен только из сети. Таким образом, для того чтобы получить доступ к внешней сети WWW анонимно из внутренней I2P, Вам придется запустить запустить Ваш скрипт подназванием startSquid. Сделайти это таким же образом, как Вы делали другие скрипты. Перенастройте свой браузер на прокси localhost:5555, как определено в скрипте, и когда скрипт сгенерирует свои ключи, Вы сможете получить доступ к прокси-приманке. Вставьте любой URL (((далее перевод не закончен)))

source: 8 - Write Some Scripts To Handle All This Menial Nonsense
es: 8 - Cree algunos scripts para manejar todo este sinsentido
id: 8 - Tuliskan Beberapa Skrip untuk Menangani Semua Hal-hal Sepele Ini
ro: 8 - scrie unele script-uri să se ocupe de toate aceste prostii dezonorante
ru: 8 - Написать скрипты, чтобы справиться со всем этим беспорядком

source: It would drive most people crazy, going through all these steps every time one sets up an I2P server, and/or deploys a client.
es: Repetir estos pasos cada vez que se configura un cliente o servidor I2P puede volver loco a mucha gente.
id: Ini akan membuat kebanyakan orang menjadi gila, melakukan semua langkah ini setiap kali seseorang membuat server I2P, dan / atau membuat klien.
ro: Aceasta ar conduce majoritatea oamenilor nebun, trecând prin toate aceste etape de fiecare dată când unul stabilește un server I2P, și / sau implementează un client.
ru: Если проходить через эти шаги каждый раз, когда вы настраиваете I2P сервер или развертываете клиент, то можно сойти с ума.

source: Aum's website <a href="http://www.freenet.org.nz/i2p/" target="_blank">http://www.freenet.org.nz/i2p/</a> has a script called setupServer.py which automates all this nonsense into one simple command line . But I respect that people's tastes in user interfaces differ, and trying to write something which satisfies everyone's needs usually results in something so complex that it turns into newbie-repellent.
es: En la web de Aum <a href="http://www.freenet.org.nz/i2p/" target="_blank">http://www.freenet.org.nz/i2p/</a> hay un script llamado setupServer.py que automatiza todo este sinsentido en un comando de una sola línea.
id: Situs web milik Aum <a href="http://www.freenet.org.nz/i2p/" target="_blank">http://www.freenet.org.nz/i2p/</a> memiliki skrip yang disebut setupServer.py yang mengotomatisasi semua omong kosong ini menjadi satu baris perintah sederhana. Tapi saya menghargai selera masing-masing orang dalam antarmuka pengguna, dan mencoba menulis sesuatu yang memenuhi kebutuhan setiap orang biasanya menghasilkan sesuatu yang sangat kompleks sehingga membuat pemula menjadi takut mencoba.
ro: Aum site-ul <a href="http://www.freenet.org.nz/i2p/" target="_blank"> http://www.freenet.org.nz/i2p/ </ a> are un script numit setupServer.py care automatizează toate prostiile astea într-o singură linie de comandă simplă. Dar eu respect gusturile oamenilor în interfețe de utilizator diferite, și încercarea de a scrie ceva care satisface nevoile tuturor, de obicei, duce la ceva atât de complex, care se transformă în ceva teribil.
ru: Сайт Aum <a href="http://www.freenet.org.nz/i2p/" target="_blank">http://www.freenet.org.nz/i2p/</a> содержит скрипт setupServer.py, который автоматизирует все эти шаги в одной командной строке. Но я уважаю, что представления людей об интерфейсах отличаются, и попытка написать что-то удовлетворяющее всем требованиям обычно приводит к громоздким и непонятным вещам, которые отпугивают новичков.

source: So please feel free to use and/or customize setupServer.py to taste, or write your own in Python or another language.
es: Siéntase libre de usar o cambiar etupServer.py para probarlo, o para escribir su propio script en Python o en cualquier otro lenguaje.
id: Jadi, silakan gunakan dan / atau sesuaikan setupServer.py secukupnya, atau tuliskan sendiri dengan Python atau bahasa pemograman lain.
ro: Deci, vă rugăm să nu ezitați să folositi și/sau personalizati setupServer.py la gust, sau scrieti script propriu în Python sau intr-o altă limbă.
ru: Пожалуйста, свободно пользуетесь и подстраивайте на свой вкус setupServer.py или напишите свой собственный на Python или другом языке.

source: Also, you may want to write a script which handles the startup of the I2P Router, the eepProxy, plus any and all tunnels you are using. I've got such a script called startEverything.sh, which gets launched at system startup. (Be sure to search this site for template scripts to automate your I2P commands. If I create a page for one, I'll try to remember to link it here.
es: También pude querer escribir para que maneje el inicio del Ruter I2P, el eepProxy y los túneles que esté usando. Yo uso un script llamado startEverything.sh, que se ejecuta al iniciar al sistema. (Estos scripts no son necesarios en las nuevas versiones de I2P).
id: Selain itu, anda mungkin ingin menulis skrip yang menangani startup Router I2P, eepProxy, ditambah terowongan yang anda gunakan. Saya punya skrip yang disebut beginEverything.sh, yang diluncurkan pada saat startup sistem. (Pastikan untuk mencari situs ini untuk template skrip untuk mengotomatisasi perintah I2P anda. Jika saya membuat halaman untuk itu, saya akan mencoba mengingat untuk menghubungkannya di sini.
ro: De asemenea, poate doriți să scrieti un script care se ocupă de pornire a Router-ului I2P, eepProxy, plus toate tunelurile pe care le folosiți. Am un astfel de script numit startEverything.sh, care va fi lansat la pornirea sistemului. (Asigurați-vă că pentru a căuta site-ul pentru script-uri șablon pentru a automatiza comenzile I2P. Dacă aș crea o pagină pentru unul, voi încerca să retin ca să-l leg aici.
ru: Также вы можете захотеть написать скрипт, который управляет загрузкой маршрутизатора I2P, eepProxy, а также используемыми вами туннелями. У меня есть такой скрипт, называется startEverything.sh, загружается при входе в систему. (Не забудьте найти на сайте шаблоны скриптов для автоматизации команд I2P. Если я создам для них страницы, то постараюсь указать здесь ссылки

source: Exercise for Windows users - port setupServer.py into a MS-DOS .BAT file.
es: Un ejercicio para los usuarios de Windows - portar setupServer.py a un archivo MS-DOS .BAT.
id: Latihan untuk pengguna Windows - ubah setupServer.py ke file MS-DOS .BAT.
ro: Exercițiu pentru utilizatorii de Windows - transcrieti setupServer.py într-un fișier BAT MS-DOS..
ru: Упражнение для пользователей Windows: перенести setupServer.py в файл MS-DOS .BAT

source: Old Documents
es: Documentos viejos
id: Dokumen lama
ro: Documente vechi
ru: Старые документы

source: Following is a list of documents originally on www.invisiblenet.net/i2p/ and rescued via the <a href="http://www.archive.org/">Wayback Machine</a>. They are quite dated and may or may not be accurate. However, the I2CP and I2NP documents in particular have some good information.
es: Aquí hay una lista de documentos originarios de www.invisiblenet.net/i2p/ y rescatado gracias a la <a href="http://www.archive.org/">Wayback Machine</a>. Son bastantes antiguos y pueden que ya no sean precisos. Aún así, los documentos sobre I2CP e I2NP tienen información bastante buena.
id: Berikut adalah daftar dokumen yang aslinya ada di www.invisiblenet.net/i2p/ dan diselamatkan melalui <a href="http://www.archive.org/">Wayback Machine</a> . Mereka cukup lama dan mungkin tidak akurat. Namun, dokumen I2CP dan I2NP khususnya memiliki beberapa informasi bagus.
ro: Urmind listă de documente inițiale pe www.invisiblenet.net/i2p/ și salvate la <a href="http://www.archive.org/"> Wayback Masini </a>. Ele sunt destul de datat și pot sau nu pot fi corecte. Cu toate acestea, I2CP și I2NP documente, au unele informații utile.
ru: Ниже следует список документов, изначально расположенных по адресу www.invisiblenet.net/i2p/ и сохраненных в <a href="http://www.archive.org/">Wayback Machine</a>. Они довольно старые и могут быть или не быть точными. Однако, документация о I2CP и I2NP содержит много полезной информации.

source: August 2011
es: Agosto 2011
id: Agustus 2011
ru: Август 2011

source: Overview
es: Vista general
ro: Prezentare generală
ru: Обзор
