Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/misc.po
Languages: es, id, ro, ru

source: I2P enables the collection of a wide range of rates.
es: I2p permite un gran número de diferentes velocidades.
id: I2P memungkinkan pengumpulan berbagai rate.
ro: I2P permite colectarea de o gamă largă de rate.
ru: I2P предусматривает сбор в широком диапазоне скоростей.

source: The list was gathered using the following command in the top directory of the branch i2p.i2p:
es: La lista fue obtenida usando el siguiente comando en el directorio principal de la rama 2p.i2p:
id: Daftar itu dikumpulkan dengan menggunakan perintah berikut di direktori atas cabang i2p.i2p:
ro: Lista a fost colectate folosind următoarea comandă în directorul de sus in ramură i2p.i2p :
ru: Информация в списке была собрана с использованием следующей команды в верхнем каталоге ветки i2p.i2p:

source: All options aren't needed, but it works.
es: No son necesarias todas las opciones, pero funciona.
id: Semua pilihan tidak diperlukan, tapi berfungsi.
ro: Toate opțiunile nu sunt necesare, dar funcționează.
ru: Не все опции нужны, но так работает.

source: The I2P sourcecode is kept in several distributed monotone repositories. See the <a href="http://www.monotone.ca/">Monotone website</a> for information on monotone. See <a href="http://%(forum)s/viewtopic.php?t=2524">this forum post on i2p monotone</a> for more information on how to get started and check out the source anonymously. There is also a quick-start guide on the <a href="%(newdevs)s">new developer's page</a>.
es: El código fuente de i2p es mantenido en varios repositorios distribuidos de monotone. Vea la <a href="http://www.monotone.ca/">Web de Monotone</a> para mas información sobre monotone. Vea <a href="http://%(forum)s/viewtopic.php?t=2524">este foro sobre i2p y monotone</a> para obtener mas información de como comenzar y descargar el código fuente anónimamente. También hay una guía rápida en la <a href="%(newdevs)s">web de nuevos desarrolladores</a>.
id: Kode sumber I2P disimpan di beberapa repositori monotone yang terdistribusi. Lihat <a href="http://www.monotone.ca/">situs Monotone</a> untuk informasi tentang monotone. Lihat <a href="http://%(forum)s/viewtopic.php?t=2524">posting forum ini di i2p monotone</a> untuk informasi lebih lanjut tentang cara memulai dan memeriksa sumber kode secara anonim. Ada juga panduan ringkas di <a href="%(newdevs)s">halaman pengembang baru</a> .
ro: Codului sursă I2P este păstrată în mai multe depozite monotone distribuite. Vezi site-ul <a href="http://www.monotone.ca/"> Monotone </ a> pentru informații de monoton. vedea <a href="http://%(forum)s/viewtopic.php?t=2524"> acest post pe forum I2P monoton </ a> pentru mai multe informații cu privire la modul de a începe și a verifica afară de sursa anonim. Există, de asemenea, un ghid rapid de pornire pe <a href="%(newdevs)s"> pagină nouă pentru dezvoltatori </ a>.
ru: Исходный код I2P хранится в нескольких распределенных репозиториях Monotone. Дополнительную информацию о системе вы найдёте на <a href="http://www.monotone.ca/">сайте Monotone</a>. Для начала работы и анонимного получения исходного кода смотрите <a href="http://%(forum)s/viewtopic.php?t=2524">сообщение на форуме по поводу i2p и monotone</a>. Также смотрите краткое руководство на <a href="%(newdevs)s">новой странице для разработчиков</a>.

source: If you want to get the source non-anonymously, pull from the public server mtn.welterde.de. The i2p source code branch is "i2p.i2p".
es: Si desea obtener el código fuente no anónimamente, descargue desde el servidor publico mtn.welterde.de. La rama del código fuente de i2p es "i2p.i2p".
id: Jika Anda ingin mendapatkan sumber kode secara non-anonim, ambil dari server publik mtn.welterde.de. Cabang kode sumber i2p adalah "i2p.i2p".
ro: Dacă doriți să obțineți sursa non-anonim, trage de la server public mtn.welterde.de . Denumirea ramurei sursei de cod I2P este "i2p.i2p".
ru: Если вы хотите получить исходный код неанонимно, загрузите его с публичного сервера mtn.welterde.de. Исходный код I2P находится в ветке i2p.i2p.

source: Guide
es: Guía
id: Panduan
ro: Ghidaj
ru: Руководство

source: The following is a detailed guide by Complication.
es: Lo siguiente es una guía detallada hecha por Complication.
id: Berikut ini adalah panduan terperinci oleh Complication.
ro: Ceea ce urmează este un ghid detaliat de complicație.
ru: Это - детальное руководство от Complication.

source: How to Upgrade from 0.6.1.30 and Earlier
es: Como actualizar desde la versión 0.6.1.30 y anteriores.
id: Cara Upgrade dari 0.6.1.30 dan Sebelumnya
ro: Cum să faceți upgrade de la 0.6.1.30 și anterioare
ru: Как произвести обновление с версии 0.6.1.30 и более ранних

source: Upgrading from 0.6.1.30 and Earlier Releases
es: Actualizando desde 0.6.1.30 y versiones anteriores.
id: Upgrade dari 0.6.1.30 dan Rilis Sebelumnya
ro: Actualizarea de la 0.6.1.30 și anterioare
ru: Обновление с 0.6.1.30 и более ранних версий

source: Since i2p's lead developer <a href="%(jrandom)s">has gone AWOL</a>, we do not have his update signing key or access to www.i2p[.net] or dev.i2p[.net]. Complication and zzz have generated new signing keys, and they and Amiga are providing update file hosting. These changes must be configured in your router to take effect.
es: Desde que el programador principal de i2p <a href="%(jrandom)s">se ausentó sin avisar, AWOL</a>, no tenemos su clave de actualización firmada o acceso a www.i2p[.net] o dev.i2p[.net]. Complication y zzz han generado nuevas claves de firmado, y ellos y Amiga proveen alojamiento a los archivos de actualización. Estos cambios tienen que ser configurados en su ruter para que tengan efecto.
id: Karena pengembang utama i2p telah<a href="%(jrandom)s">AWOL</a>, kami tidak memiliki update signing key miliknya atau akses ke www.i2p [.net] atau dev.i2p [.net]. Complication dan zzz telah menghasilkan signing key baru, dan mereka dan Amiga menyediakan hosting file update. Perubahan ini harus dikonfigurasi di router anda agar berlaku.
ro: De la dezvoltator I2P <a href="%(jrandom)s"> a plecat AWOL </ a>, nu avem cheia de semnare pentru actualizare sau acces la www.i2p [. net] sau dev.i2p [. net]. Complicație și zzz au generat noi chei de semnare, și ei și Amiga furnizeaza actualizarea hosting-ului de fișiere. Aceste modificări trebuie să fie configurate în router-ul pentru efect.
ru: Так как ведущий разработчик i2p <a href="%(jrandom)s">отсутствует</a>, у нас нет доступа к его ключам для подписи обновлений или доступа к www.i2p[.net] или dev.i2p[.net]. Complication и zzz сгенерировали новые ключи для подписи, и они и Amiga предоставляют хостинг для файлов обновления. Чтобы вступить в силу, эти изменения должны быть внесены в настройки маршрутизатора.

source: Make the following configuration changes and your router will automatically install the latest release.
es: Haga los siguientes cambios de configuración y su ruter instalará automáticamente la última versión
id: Buat perubahan konfigurasi berikut ini lalu router anda akan secara otomatis menginstal rilis terbaru.
ro: Face următoarele modificări de configurare și router-ul se va instala automat la cea mai recentă versiune.
ru: Сделайте следующие изменения настроек, и ваш маршрутизатор будет автоматически устанавливать последнюю версию.

source: We recommend the automated process as it will verify the key of the signed update file. If you do not make these changes, you may manually download the i2pupdate.zip file from <a href="%(downloads)s">the download page</a>.
es: Recomendamos el proceso automático ya que verificará la clave del archivo de actualización firmado. Si no hace estos cambios, puede descargar manualmente el archivo i2pupdate.zip de la <a href="%(downloads)s">página de descargas</a>.
id: Kami merekomendasikan proses otomatis karena akan memverifikasi kunci dari file pembaruan yang ditandatangani. Jika anda tidak melakukan perubahan ini, anda dapat mendownload file i2pupdate.zip secara manual dari <a href="%(downloads)s">halaman download</a> .
ro: Vă recomandăm proces automatizat care va verifica cheia fișierului semnat de actualizare. Dacă nu faceti aceste modificări, puteți descărca manual fișierul i2pupdate.zip de la <a href="%(downloads)s"> pagina de descărcare </ a>.
ru: Мы рекомендуем автоматизированный процесс, так как в этом случае выполняется проверка ключа подписанного файла обновления. Если вы не внесёте эти изменения в настройки, то вы можете скачать файл i2pupdate.zip вручную со <a href="%(downloads)s">страницы загрузок</a>.

source: Change the News URL to: %(url)s
es: Cambie el enlace de noticias a: %(url)s
id: Ubah URL Berita ke: %(url)s
ro: Schimbați URL-ul de știri la:%(url)s
ru: Смените новостной URL на: %(url)s

source: Select ONE of the following new Update URLs at random and enter it into the Update URL box:
es: Seleccione una de las siguientes enlaces de actualización aleatoriamente e introdúzcalo dentro de la casilla Update URL:
id: Pilih SATU URL Update terbaru berikut ini secara acak dan masukkan ke dalam kotak Update URL:
ro: Selectați unul din următoarele URL-uri de actualizare noi la întâmplare și introduceți-l în caseta de actualizare URL:
ru: Выберите ОДИН случайный URL обновлений из предоставленных и введите его в текстовое поле для URL обновлений:

source: Check the box "Update through the eepProxy?"
es: Active la casilla "Actualizar a través del eepProxy?"
id: Centang kotak "Update melalui eepProxy?"
ro: Verificați caseta "Actualizare prin eepProxy?"
ru: Поставьте галочку около "Обновляться через eepProxy?"

source: Click "Save"
es: Pulse "Guardar"
id: Klik "Simpan"
ro: Clic pe Salvează
ru: Нажмите "Сохранить"

source: Add the following line:
es: Añada la siguiente línea:
id: Tambahkan baris berikut:
ro: Adăugați următoarea linie:
ru: Добавьте эту строчку:

source: Click "Apply"
es: Pulse "Aplicar"
id: Klik "Apply"
ro: Faceți clic pe "Apply"
ru: Нажмите "Применить"

source: You are now ready to automatically receive the release update file, either by setting your update policy to "download and install" or by clicking on the "update available" link when it appears.
es: Ahora estas listo para recibir automáticamente el archivo de actualización, ya sea configurando su política de actualizaciones a "descargar e instalar" o pulsando en el enlace "actualización disponible" cuando aparezca.
id: Anda sekarang siap untuk secara otomatis menerima file pembaruan rilis, baik dengan cara menetapkan kebijakan pembaruan anda untuk "mendownload dan menginstal" atau dengan mengklik link "update available" saat muncul.
ro: Acum sunteți gata pentru a primi în mod automat fișierul de actualizare de eliberare, fie prin stabilirea politicii dvs. de actualizare pentru a "descărca și instala" sau făcând clic pe link-ul "update disponibil", atunci când apare.
ru: Теперь вы можете автоматически получать обновления, либо установив политику обновлений в режим "скачать и установить" или вручную, пройдя по ссылке "Доступно обновление", когда она появляется.

source: If you would like to verify the trusted update keys, they are also <a href="%(url)s">posted and signed here</a>. Thank you for your support during this transition. For help please contact us on #i2p.
es: Si deseas verificar las claves de actualización de confianza, se encuentran también <a href="%(url)s">subidas y firmadas aquí</a>. Gracias por su ayuda durante la transición. Por favor, para pedir ayuda contacte con nosotros en #I2P.
id: Jika anda ingin memverifikasi trusted update key, mereka juga <a href="%(url)s">diposkan dan ditandatangani di sini</a> . Terima kasih atas dukungan anda selama masa transisi ini. Untuk bantuan silahkan hubungi kami di IRC channel #i2p.
ro: Dacă doriți pentru a verifica cheile de actualizare de încredere, ele sunt, de asemenea, scris și semnat <a href="%(url)s"> aici </ a>. Vă mulțumim pentru sprijinul dumneavoastră în timpul acestei tranziții. Pentru ajutor, vă rugăm să ne contactați la # I2P.
ru: Если вы хотите проверить доверенные ключи обновления, то они доступны <a href="%(url)s">здесь</a>. Спасибо за вашу поддержку во время этого переходного периода. За помощью, пожалуйста, обращайтесь к нам на #i2p.
