Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/misc.po
Languages: es, id, ro, ru

source: A destination key works a lot like a regular IP address, except that it can't be traced to your IP address or physical location. When users place a request to speak with you, your gateways are the ones that answer for you. So the requesting user can only know the IP address of your gateways. However, gateways don't know your IP address, because gateways are the last nodes on your tunnels, and you anonymously create tunnels by way of garlic routing. (So gateways are like puppets that can't see their masters, and everyone communicates through these puppets)
es: Una clave de Destino funciona como una dirección IP normal, excepto que no se puede seguir dicha dirección hasta tu localización local. Cuando los usuarios hacen una petición para hablarle, sus puertas de salida, gateways son las que responden por usted. Con lo que los usuarios sólo pueden saber las IP de sus gateways. Además, las gateways no saben su IP, ya que las gateways son los últimos nodos de sus túneles, y los túneles han sido creado anónimamante con el rutado Garlic. (Las gateways son como mascotas que no pueden ver a sus dueños, y todo el mundo se comunica a través de estas mascotas)
id: Destination key bekerja seperti alamat IP yang biasa, kecuali bahwa itu tidak dapat ditelusuri ke alamat IP atau lokasi fisik anda. Ketika pengguna membuat permintaan untuk berbicara dengan anda, gateway adalah pihak-pihak yang menjawab untuk anda. Jadi pengguna hanya dapat tahu alamat IP Gateway anda. Namun, aateway tidak tahu alamat IP anda, karena gateway adalah simpul-simpul terakhir pada terowongan, dan anda secara anonim membuat tunnel dengan garlic routing. (Jadi Gateway adalah seperti boneka yang tidak dapat melihat tuan mereka, dan semua orang berkomunikasi melalui boneka ini)
ro: O cheie destinație funcționează ca o adresă IP obișnuită, cu excepția faptului că nu pot fi urmărite dupa adresa IP sau locație fizică. Când utilizatorii plaseaza o cerere de a vorbi cu tine, gateway-urile sunt cele care răspund pentru tine. Astfel încât utilizatorul solicitant poate cunoaște doar adresa IP a gateway-urile. Cu toate acestea, gateway-uri nu știu adresa IP dvs. , deoarece gateway-uri sunt ultimele nodurile de pe tuneluri, și creați anonim tuneluri de cale de usturoi de rutare. (Deci, gateway-uri sunt ca marionete care nu pot vedea stăpânii lor, și toată lumea comunică prin intermediul acestor marionete)
ru: Ключ адреса назначения работает очень похоже на обычные IP адреса, исключая возможность отследить его до вашего реального IP адреса или действительного местонахождения. Когда пользователи отправляют запрос на связь с вами, то шлюзы отвечают за вас. Таким образом, пользователь, который отправил запрос, может узнать только IP адреса шлюзов. Однако, шлюзы не знают ваш IP адрес, так как шлюзы являются последними узлами туннелей, и вы анонимно создаете туннели с помощью чесночной маршрутизации. (Шлюзы как марионетки, которые не могут видеть кукловода, при этом все используют их для общения)

source: To deploy a server on I2P, you create a destination keypair. You use the private key to authenticate your server when connecting it to I2P, and you make the public key (aka destination key) known publicly, so others can connect to your server. (indirectly, through your gateways)
es: Para crear un servicio en I2P, se crean un par de claves de destino. Se utiliza la clave privada para autentificar sur servidor cuando se conecta a I2P, y se hace pública la clave pública (también llamada clave de destino), así otros pueden conectarse a su servidor. (indirectamente, a través de sus gateways)
id: Untuk menggunakan server pada I2P, anda membuat destination keypair. Anda menggunakan private key untuk mengotentikasi server anda saat tersambung ke I2P, dan anda membuat public key (alias destination key) yang dikenal publik, sehingga orang lain dapat terhubung ke server anda. (tidak langsung, melalui gateway)
ro: Pentru a implementa un server de pe I2P, creați o keypair destinație. Puteți utiliza cheia privată pentru a autentifica server-ul dvs. atunci când se conecteaza la I2P, și să vă facă cheia publică (aka cheie destinație), cunoscut în mod public, astfel încât alții se poate conecta la server. (indirect, prin intermediul gateway-urile)\
ru: Для развертывания сервера в I2P вы создаете пару ключей назначения. Закрытый ключ используется для аутентификации вашего сервера при его подключении к I2P. Открытый ключ (ключ назначения) публикуется, чтобы клиенты могли соединяться с вашим сервером (не напрямую, через ваши шлюзы)

source: Each service you run on I2P requires a different keypair.
es: Cada servicio que ejecute en I2P necesita un par de claves diferente.
id: Setiap service yang anda jalankan pada I2P memerlukan keypair berbeda.
ro: Fiecare serviciu ce rula pe I2P necesită un keypair diferit.
ru: Каждый сервис, который Вы запускаете в I2P, требует отдельной пары ключей.

source: To generate your keypair, type the command: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code> (all on one line)
es: Para generar el par de claves, ejecute el comando: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code> (en una sola línea)
id: Untuk menghasilkan keypair anda, ketik perintah: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code> (semua pada satu baris)
ro: Pentru a genera keypair dvs., tastați comanda: <code> java-jar lib/i2ptunnel.jar-nogui-e "genkeys myWebPrivKey.dat myWebPubKey.dat" </ code> (tot pe o singură linie)
ru: Выполните следующую команду для генерации пары ключей: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code> (в одну строку)

source: In windows, to generate your keypair, type the command: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code>
es: Para generar el par de claves en windows, ejecute el comando: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code>
id: Di Windows, untuk menghasilkan keypair anda, ketik perintah:<code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code>
ro: Pentru a genera keypair dvs., tastați comanda: <code> java-jar lib/i2ptunnel.jar-nogui-e "genkeys myWebPrivKey.dat myWebPubKey.dat" </ code>
ru: Выполните следующую команду для генерации пары ключей, если Вы используете Windows: <code>java -jar lib/i2ptunnel.jar -nogui -e "genkeys myWebPrivKey.dat myWebPubKey.dat"</code>

source: The filenames <code>myWebPrivKey.dat</code> and <code>myWebPubKey.dat</code> are arbitrary - choose whatever you want here, as long as you understand your own choices.
es: Los nombres de archivo <code>myWebPrivKey.dat</code> y <code>myWebPubKey.dat</code> son arbitrarios - elija el que desee, al menos mientras entienda sus elecciones.
id: Nama file <code>myWebPrivKey.dat</code> dan <code>myWebPubKey.dat</code> adalah arbitrary - pilih apapun yang anda inginkan di sini, asalkan anda memahami pilihan anda sendiri.
ro: Nume de fișiere <code> myWebPrivKey.dat </ code> și <code> myWebPubKey.dat </ code> sunt arbitrare - alege ce vrei aici, atâta timp cât ați înțeles propriile alegeri.
ru: Имена файлов <code>myWebPrivKey.dat</code> и <code>myWebPubKey.dat</code> не обязательно должны быть именно такими - задайте свои, если хотите, но не забывайте о своём выборе.

source: We now need to export your public key into base64 format, which you will share with others.
es: Ahora necesitamos exportar su clave pública al formato base64, el cual compartirá con otros.
id: Kita sekarang perlu untuk ekspor kunci publik ke format base64, yang anda akan bagikan dengan orang lain.
ro: Avem acum nevoie pentru a exporta cheia dvs. publică în format base64, care vă vor împărtăși cu alții.
ru: Теперь нам нужно экспортировать публичный ключ, закодированный в base64, для последующей его публикации.

source: To convert your myWebPubKey.dat file into shareable base64, type the command <code>java -cp lib/i2p.jar net.i2p.data.Base64 encode myWebPubKey.dat &gt; myWebPubKey.txt</code> (all on one line).
es: Para convertir su archivo myWebPubKey.dat al formato base64 compartible, ejecute el comando <code>java -cp lib/i2p.jar net.i2p.data.Base64 encode myWebPubKey.dat &gt; myWebPubKey.txt</code> (todo en la misma línea).
id: Untuk mengkonversi myWebPubKey.dat ke dalam shareable base64, ketik perintah <code>java -cp lib/i2p.jar net.i2p.data.Base64 encode myWebPubKey.dat > myWebPubKey.txt</code> (semua pada satu baris).
ro: Pentru a converti fișierul myWebPubKey.dat în base64 partajabile, tastați <code> comanda java-cp lib/i2p.jar net.i2p.data.Base64 codifica myWebPubKey.dat> myWebPubKey.txt </ code> (tot pe o linie ).
ru: Чтобы закодировать Ваш myWebPubKey.dat в base64 для публикации и обмена выполните такую команду <code>java -cp lib/i2p.jar net.i2p.data.Base64 encode myWebPubKey.dat &gt; myWebPubKey.txt</code> (в одну строчку).

source: This file you have just generated, <code>myWebPubKey.txt</code>, contains a long base64 string (516 chars at last count), which we call a destination key. All you need to know about this string for now is that it allows remote clients to uniquely pinpoint and connect to your server, just the same way as an IP address allows remote machines to pinpoint and connect to your machine.
es: El archivo que acaba de generar, <code>myWebPubKey.txt</code>, contiene una cadena larga base64 (con 516 caracteres), lo que llamamos una clave de destino. Todo lo que necesita saber por el momento es que esta clave de destino permite que los clientes remotos localicen con precisión su servicio y se conecten a él, justamente de la misma forma que una IP permite que las máquinas remotas puedan localizar su máquina y se conecten a ella.
id: File yang dihasilkan, <code>myWebPubKey.txt</code> , berisi string base64 panjang (516 karakter di hitungan terakhir), yang disebut sebagai destination key. Anda hanya perlu tahu tentang string ini untuk saat ini adalah bahwa hal itu memungkinkan remote klien untuk unik menemukan dan terhubung ke server anda, sama seperti alamat IP memungkinkan mesin remote untuk mencari dan terhubung ke mesin anda.
ro: Acest fișier pe care tocmai ați generat, <code> myWebPubKey.txt </ code>, conține un șir de base64 lung (516 de caractere de la ultima numaratoare), pe care o numim o cheie destinație. Tot ce trebuie să știți despre acest șir de acum este că permite clienților de la distanță pentru a indica în mod unic și conecta la server-ul dvs., chiar în același mod ca și o adresă IP permite mașini la distanță să identifice și să se conecteze la mașina dumneavoastră.
ru: Файл <code>myWebPubKey.txt</code>, который Вы только что сгенерировали, содержит длинную base64-строку (516 символов по нашим подсчётам), которая называется ключом назначения. На текущий момент всё, что Вам нужно знать об этой строке - это то, что она позволяет удалённым клиентам однозначно определить и соединиться с Вашим сервером точно так же, как IP-адрес позволяет удалённым устройствам определять Вам компьютер и соединяться с ним.

source: However, in contrast to an IP address, there is no way to trace your machine's physical location - even though your server can be addressed via I2P, your IP address cannot be traced or associated with this destination key.
es: Aunque, y a diferencia de una dirección IP, no hay forma de rastrear la localización física de su máquina - aunque el servidor pueda ser accedido desde I2P, su dirección IP no puede ser rastreada o asociada a esta clave de destino.
id: Namun, tidak seperti alamat IP, tidak ada cara untuk melacak lokasi fisik mesin anda - meskipun server anda bisa terhubung via I2P, alamat IP anda tidak dapat ditelusuri atau terkait dengan destination key ini.
ro: Cu toate acestea, spre deosebire de o adresă IP, nu există nici o modalitate de a urmări locația fizică a aparatului dumneavoastră - chiar dacă server-ul dvs. pot fi abordate prin intermediul I2P, adresa IP nu pot fi urmărite sau asociate cu această cheie destinație.
ru: Но в отличие от IP-адреса при использовании ключа назначения невозможно определить физическое местонахождение Вашего устройства; IP-адрес Вашего сервера не может быть отслежен или связан с этим ключом назначения даже несмотря на то, что Ваш сервер доступен в I2P.

source: 3 - Open a 'Tunnel' from I2P To Your Server
es: 3 - Abra un 'Túnel' desde I2P hacia su servicio/servidor
id: 3 - buka sebuah 'tunnel' dari I2P ke server anda
ro: 3 - Deschide un "tunel" de la I2P la server
ru: 3 - Создайте "Туннель" из I2P к Вашему серверу

source: For clients elsewhere in I2P to be able to access your server, you must run a 'bridge' or 'tunnel', which takes connections from these clients and forwards them to your local server.
es: Para que los clientes de I2P sean capaces de acceder a su servidor, tiene que ejecutar un 'bridge', puente, o un 'túnel', los cuales cogen las conexiones desde esos clientes y las reenvían hasta su servidor local.
id: Supaya klien lain di I2P mampu mengakses server anda, anda harus menjalankan 'bridge' atau 'tunnel', yang membutuhkan koneksi dari klien tersebut dan meneruskan mereka ke server lokal anda.
ro: Pentru clienții din alte părți I2P a putea accesa server-ul dvs., trebuie să executați o "punte" sau "tunel", care are legături de la acești clienți și le transmite la server-ul local.
ru: Для того, чтобы клиенты из I2P смогли получить доступ к Вашему серверу, Вы должны открыть "мост" или "туннель", который направляет соединения от этих клиентов на Ваш локальный сервер.

source: To activate such a tunnel, type the command <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code> (all one line).
es: Para activar este tipo de túneles, ejecute el comando <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code> (todo en la misma línea).
id: Untuk mengaktifkan tunnel seperti itu, ketik perintah <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code> (semua satu baris).
ro: Pentru a genera keypair dvs., tastați comanda: <code> java-jar lib/i2ptunnel.jar-nogui-e "genkeys myWebPrivKey.dat myWebPubKey.dat" </ code> (tot pe o singură linie)
ru: Для активации этого туннеля выполните команду <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code> (в одну строчку).

source: If you used different filenames or port number earlier on, change these accordingly
es: Si anteriormente ha usado nombres diferentes en los archivos, o usado números de puertos diferentes, cámbielos de acuerdo a ello.
id: Jika Anda menggunakan nama file atau nomor port syang berbeda sebelumnya, ubah sesuai nama tersebut
ro: Dacă ați utilizat diferite nume de fișiere sau număre de port mai devreme, schimba aceste în consecință
ru: Если вы использовали другие имена для файлов или номер порта - измените их и здесь

source: Windows users, remember to replace apostrophes with double quotes. Thus: <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code>
es: Para usuarios de windows; recuerden cambiar los apostrofes con comillas dobles. Tal que: <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code>
id: Pengguna Windows, ingatlah untuk mengganti tanda kutip tunggal dengan tanda kutip ganda. Dengan demikian:<code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code>
ro: Utilizatorii de Windows, tineti minte sa înlocuiti apostroful cu ghilimele duble. Astfel: <code> java-jar lib/i2ptunnel.jar-nogui-e "localhost server de 10880 myWebPrivKey.dat" </ code>
ru: Пользователи Windows - не забудьте заменить апострофы на двойные кавычки. Т.е.: <code>java -jar lib/i2ptunnel.jar -nogui -e "server localhost 10880 myWebPrivKey.dat"</code>

source: Within a few seconds, the 'tunnel' should now be active, and remote clients should be able to reach your server anonymously. Remember to let your router "warm up" before opening clients to it.
es: En unos pocos segundos el 'túnel' debería estar activo, y los clientes remotos deberían poder acceder al servicio anónimamante. Recuerde dejar su ruter "calentarse" antes de permitir que los clientes se conecten.
id: Dalam beberapa detik, 'tunnel' tersebut sekarang seharusnya aktif, dan remote klien seharusnya dapat mencapai server anda secara anonim. Ingatlah untuk membiarkan router anda melakukan "warming up" sebelum membuka tunnel kepada klien itu.
ro: În câteva secunde, "tunelul" ar trebui să fie acum activ, și clienți la distanță ar trebui să ajungă la server-ul dvs. în mod anonim. Amintiți-vă pentru a permite router-ul "sa se incalzeasca" înainte de a deschide pentru clienți .
ru: В течении нескольких секунд "туннель" должен активироваться, и удалённые клиенты смогут соединяться с Вашим сервером анонимно. Не забудьте дать маршрутизатору время "разогреться" перед тем, как приглашать посетителей.

source: 4 - Update Your hosts.txt File
es: 4 - Actualice su archivo hosts.txt
id: 4 - update file hosts.txt
ro: 4 - Actualizați fișierul dvs. hosts.txt
ru: 4 - Обновите свой hosts.txt

source: To test your own server locally, you'll need to create an entry in your hosts.txt file, so I2P can translate the simple URL you place in the browser's address bar into the full public key text needed to find your server.
es: Para probar su propio servicio localmente debe crear una entrada en su archivo host.txt, para que I2P pueda traducir la URL sencilla que introduce en la barra de direcciones de su navegador en la clave pública completa que necesita para encontrar su servidor.
id: Untuk menguji server anda sendiri secara lokal, anda harus membuat entri di file hosts.txt anda, sehingga I2P dapat menerjemahkan URL sederhana yang Andaatempatkan di address bar web browser ke teks public key penuh yang diperlukan untuk menemukan server anda.
ro: Pentru a testa un server propriu la nivel local, va trebui să creați o intrare în fișierul hosts.txt, astfel încât I2P poate traduce URL-ul simplu plasați în bara de adresa a browser-ului cheie publică necesara pentru a găsi server.
ru: Для тестирования вашего сервера локально потребуется создать запись в hosts.txt, чтобы сеть I2P могла преобразовать вводимый в браузере URL в полный открытый ключ, необходимый для обнаружения сервера.

source: Edit your hosts.txt, and add the line myserver.i2p=blahblahblah, where myserver.i2p is an I2P 'domain' you want to associate with your site, and the blahblahblah is the text of the base64 public key you created earlier in the file myWebPubKey.txt
es: Edite su archivo host.txt y añada la línea myserver.i2p=blahblahblah, donde myserver.i2p es un 'dominio' I2P que desea asociar con su web, y en donde el blahblahblah es el texto de la clave pública base64 que ha creado anteriormente en el archivo
id: Edit hosts.txt anda, dan tambahkan baris myserver.i2p=blahblahblah, yang mana myserver.i2p adalah 'domain' I2P anda yang anda ingin mengasosiasikan dengan situs anda, dan blablabla adalah teks dari base64 public key yang anda buat sebelumnya dalam file myWebPubKey.txt
ro: Editati hosts.txt dvs., și adăugați linia myserver.i2p = blahblahblah, unde myserver.i2p este un "domeniu" I2P doriți să se asocieze cu site-ul dvs., și blahblahblah este textul cheii publice base64 ce l-ați creat mai devreme în fișier myWebPubKey.txt
ru: Отредактируйте hosts.i2p: добавьте строку myserver.i2p=blahblahblah, где myserver.i2p — 'домен' в I2P, на котором вы хотите разместить сайт, а blahblahblah — открытый ключ в виде base64, который вы создали ранее в файле myWebPubKey.txt

source: With this in place, you and others can reach your server with the simple domain name myserver.i2p in the browser's address bar.
es: Una vez hecho esto, usted y otros pueden acceder a su servidor simplemente poniendo el nombre de dominio myserver.i2p en la barra de direcciones del navegador.
id: Dengan ini , anda dan orang lain dapat mencapai server anda dengan nama domain sederhana myserver.i2p di address bar di browser.
ro: În acest loc, dvs. si altii pot ajunge la server-ul dvs. cu un simplu nume de domeniu myserver.i2p în bara de adrese a browser-ului.
ru: Если всё указано верно, вы и другие пользователи смогут связаться с вашим сервером, введя доменное имя myserver.i2p в адресную строку браузера.

source: 5 - Surf Your Site Within I2P
es: 5 - Navegue hasta su web dentro de I2P
id: 5 - surfing situs anda dalam I2P
ro: 5 - navigarea site-ul dvs. În I2P
ru: 5 - Зайдите на свой сайт в I2P

source: Using your secondary browser - the one you earlier configured to use localhost:4444 as a proxy - point this browser to the address <a href="http://myserver.i2p" target="_blank">http://myserver.i2p</a>
es: Usando su navegador web secundario - el que anteriormente ha configurado para usar el proxy localhost:4444 - acceda en su navegador a la dirección
id: Gunakan browser yang lain - yang sebelumnya dikonfigurasi untuk menggunakan localhost:4444 sebagai proxy - arahkan browser ini ke alamat <a href="http://myserver.i2p" target="_blank">http://myserver.i2p</a>
ro: Folosind browser-ul secundar - configurat mai devreme pentru a utiliza localhost: 4444 ca un proxy - punct acest browser pentru a adresa <a href="http://myserver.i2p" target="_blank"> http://myserver. I2P </ a>
ru: Укажите вашему второму браузеру - тому, который Вы настроили на использование localhost:4444 в качестве прокси-сервера - посетить адрес <a href="http://myserver.i2p" target="_blank">http://myserver.i2p</a>

source: You should see the main page of your webserver come up.
es: Debería aparecerle la página web principal de su servidor.
id: Anda akan melihat halaman utama webserver anda.
ro: Ar trebui să vedeți pagina principală de pe serverul Web
ru: Вы должны увидеть стартовую страницу своего веб-сервера.

source: 6 - Create a Local Client Tunnel Connection
es: 6 - Crear un Túnel cliente local para la conexión
id: 6 - membuat koneksi tunnel klien lokal
ro: 6 - Creați o conexiune locală Tunnel Client
ru: 6 - Создайте локальное соединение через клиентские туннели

source: We now have to think beyond just web servers.
es: Ahora debemos pensara más allá de los servidores web.
id: Kita sekarang harus berpikir di luar web server.
ro: Avem acum să se gândească dincolo de doar servere de web.
ru: Теперь пора задуматься о чём-то большем, чем просто веб-серверы.

source: As you grow into I2P and get more of a 'feel' for it, you will want to use all manner of servers and clients.
es: Según use más I2P y lo conozca mejor, deseará usar todo tipo de servidores y clientes.
id: Ketika anda mulai menyukai I2P dan mendapatkan 'feeling' untuk itu, anda akan ingin untuk menggunakan segala macam server dan klien.
ro: Pe măsură ce creste integritate în I2P și a obține mai mult de un "simt" pentru el, veți dori să folositi tot felul de servere si clienti.
ru: Когда вы ближе познакомитесь с I2P, вы захотите пользоваться всякого рода серверами и клиентами.
