Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/misc.po
Languages: es, id, ro, ru

source: I2P at CLT and PetCon 2009.1
es: I2P en el CLT y el PetCon 2009.1
id: I2P di CLT dan PetCon 2009.1
ro: I2P la CLT și PETCON 2009.1
ru: I2P на CLT и PetCon 2009.1

source: Members of I2P will held a talk at CLT and PetCon 2009.1 Two members of the I2P team will be at two forthcoming Linux day and security convention.
es: Miembros de I2P darán una charla en el CLT y PetCon 2009.1. Dos miembros de equipo de I2P estarán en los 2 próximos Linux day y en concenciones de seguridad.
id: Para anggota I2P akan melakukan perbincangan di CLT dan PetCon 2009.1 Dua anggota dari I2P team akan berada di hari Linux dan konvensi keamanan yang akan datang.
ro: Membrii I2P va avea loc o discuție la CLT și PETCON 2009.1 Doi membri ai echipei de I2P vor fi la două viitoarea zi Linux și securitate convenție.
ru: Представители сообщества I2P выступят с докладом на CLT и PetCon 2009,1 Два члена команды I2P примут участие в предстоящих конференциях Linux day и security convention.

source: On 14th march of 2009 there will be a short talk about general introduction to I2P at the <a href="%(chemnitzer)s">Chemnitz Linux Tag 2009</a> hold by echelon. Echelon and some other members of the I2P family will attend to the Linux meeting the whole two days (Saturday and Sunday) and will be recognizable as I2P family members. Meet them, ask them your questions, show them your props! Show your support!
es: El 14 de mayo del 2009 habrá un corta charla sobre una introducción general a I2P en la <a href="%(chemnitzer)s">Chemnitz Linux Tag 2009</a> guiada por echelon. Echelon y algunos otros miembros de la familia I2P estarán en la conferencia los dos días (sábado y Domingo) y serán reconocibles como parte de la familia I2P. Conócelos, pregúntales, muéstreles sus propuestas.
id: Pada tanggal 14 maret 2009 akan ada pembicaraan singkat tentang pengenalan umum I2P di <a href="%(chemnitzer)s">Chemnitz Linux Tag 2009 yang</a> diadakan oleh Echelon. Eselon dan beberapa anggota keuarga I2P lainnya akan menghadiri pertemuan Linux tersebut selama penuh dua hari (Sabtu dan Minggu) dan akan dikenali sebagai anggota keluarga I2P. Temui mereka, tanyakan pertanyaan anda kepada mereka, tunjukkan alat peraga anda! Tunjukkan dukungan anda!
ro: Pe data de 14 martie 2009 va avea loc o scurtă discuție despre introducere generală la I2P la <a href="%(chemnitzer)s"> Chemnitz Linux Eticheta de 2009 </ a> deținuta de Echelon. Echelon și alți membri ai familiei I2P vor participa la reuniunea Linux două zile (sâmbătă și duminică) și vor fi recunoscute în calitate de membri de familie I2P. Faceti cunostinta, dați întrebări, arată-le elemente de recuzită dumneavoastră! Demonstrați-vă sprijinul!
ru: 14 марта 2009 года состоится встреча, на которой будет представлена сеть I2P, на <a href="%(chemnitzer)s">Chemnitz Linux Tag 2009</a>, проводимая echelon. Echelon и некоторые члены сообщества I2P будут присутствовать на встрече два полных дня (суббота и воскресенье). Встретьтесь с ними, задайте вопросы, поделитесь своими предложениями! Поддержите I2P!

source: Just 10 days later the <a href="%(petcon)s">Privacy and Data Security convention</a> in Dresden will take place. Again, echelon will attend this event and hold a short talk about general introduction to I2P. Another talk about the profiling by the I2P clients will be held.
es: Justo 10 días después se llevará a cabo la <a href="%(petcon)s">Privacy and Data Security convention</a> en Dresden.. De igual forma, echelon estará en el evento y dará una pequeña charla introductoria sobre I2P. También se dará otra charla sobre los perfiles de los clientes I2P.
id: Baru 10 hari kemudian <a href="%(petcon)s">konvensi Privacy and Data Security</a> di Dresden akan berlangsung. Sekali lagi, Echelon akan menghadiri acara ini dan mengadakan pembicaraan singkat tentang pengenalan umum I2P. Pembicaraan lain tentang profiling oleh klien I2P akan diadakan.
ro: Doar 10 zile mai târziu va avea loc<a href="%(petcon)s"> convenția de confidențialitate și securitate a datelor </ a> din Dresda . Din nou, Echelon va participa la acest eveniment și va avea loc o scurtă discuție cu privire la prezentare generală a I2P. La fel va avea loc o alta discutie despre stabilirea profilului de clienti I2P .
ru: 10 днями позже в Дрездене пройдет съезд <a href="%(petcon)s">Privacy and Data Security</a>. Echelon посетит это событие и расскажет о базовых принципах I2P. Также будет другой доклад о возможностях профилирования клиентами I2P.

source: The I2P sourcecode was kept in a CVS repository. Nowadays it is kept in a <a href="%(monotone)s">Monotone</a> repository. For those who aren't very familiar with CVS, there is a <a href="http://cvsbook.red-bean.com/cvsbook.html">fantastic book</a> on the subject (developers only need to deal with the first chapter - "An Overview of CVS", as subsequent chapters go into some nasty details very few ever need to touch).
es: El código fuente de I2P se guardaba en un repositorio CVS. En estos momentos se guarda en un repositorio <a href="%(monotone)s">Monotone</a>. Para aquellos que no estén familiarizados con CVS, existe un <a href="http://cvsbook.red-bean.com/cvsbook.html">libro fantásrico</a> sobre este tema (los desarrolladores sólo necesitan familiarizarse con el primer capítulo - "An Overview of CVS", ya que los siguientes capítulos tratan sobre algunos feos detalles que pocas personas necesitarán).
id: Kode sumber I2P disimpan dalam repository CVS. Sekarang, ini disimpan di repositori <a href="%(monotone)s">Monotone</a> . Bagi mereka yang tidak begitu mengenal CVS, ada sebuah <a href="http://cvsbook.red-bean.com/cvsbook.html">buku yang bagus</a> tentang masalah ini (pengembang hanya perlu berurusan dengan bab pertama - "An Overview of CVS", karena bab-bab berikutnya membahas beberapa rincian rumit yang sangat sedikit yang perlu dilakukan).
ro: Cod sursă I2P a fost ținut într-un depozit CVS. In zilele noastre se păstrează într-un depozit<a href="%(monotone)s"> Monotone </ a> . Pentru cei care nu sunt foarte familiarizati cu CVS, există o <a href="http://cvsbook.red-bean.com/cvsbook.html">carte fantastica</ a> pe această temă (dezvoltatorii trebuie doar să faca cunostinta cu primul capitol - "O privire de ansamblu de CVS", așa cum capitolele următoare intra în unele detalii urâte cu foarte puțini nevoie pentru a atinge vreodată).
ru: Ранее исходный код I2P хранился в CVS репозитории. Теперь он хранится в репозитории <a href="%(monotone)s">Monotone</a>. Для тех, кто не очень знаком с CVS, есть <a href="http://cvsbook.red-bean.com/cvsbook.html">потрясающая книга</a> по теме (разработчикам потребуется только первая глава — "Обзор CVS", тогда как последующие главы касаются некоторых неприятных деталей, с которыми вряд ли доведется сталкиваться).

source: Humorous quote from WinCVS: "Did you know... Never experiment with new CVS commands on your working repository. Create a sample module instead."
es: Nota humorística en WinCVS: "¿Sabía que nunca debería experimentar los nuevos comandos CVS en el repositorio de trabajo?. Es mejor crear un módulo de ejemplo."
id: Kutipan lucu dari WinCVS: "Tahukah anda ... Jangan pernah bereksperimen dengan perintah CVS baru di repositori kerja anda. Buat contoh modul sebagai gantinya. "
ro: Citat plin de umor de la WinCVS: "Știați că ... Niciodata experimentul cu noile comenzile CVS pe repozitoriul dumneavoastră de lucru Crearea unui modul de probă în loc.".
ru: Забавная цитата из WiCVS: "Знаете ли... Никогда не экспериментируй с новыми командами CVS в действующем репозитории. Создайте тестовый модуль вместо него."

source: I2PTunnel migration
es: Migración de los I2PTunnel
id: Migrasi I2PTunnel
ro: migrație I2PTunnel
ru: Миграция I2PTunnel

source: After upgrading to the new architecture, you'll have to do a little work to get your old I2PTunnel-driven servers running. Lets walk through a simple example. For an eepsite with the old clientApp configuration, you had:
es: Después de actualizar la nueva arquitectura, deberá realizar un pequeño esfuerzo para hacer funcionar de nuevo sus servidores antiguos manejados por los I2PTunnel. Para una eepsite con la configuración clientApp antigua, debe:
id: Setelah melakukan upgrade ke arsitektur baru, anda harus melakukan sedikit pekerjaan untuk memuat bekerja server lama yang dioperasikan oleh I2PTunnel. Mari kita mencoba dengan contoh sederhana. Untuk eepsite dengan konfigurasi clientApp yang lama, anda sebaiknya:
ro: După actualizarea la noua arhitectură, veți avea de a face un pic de lucru pentru a obține servere vechi I2PTunnel-conduse in funcționare.Vom exemplifica printr-un exemplu simplu. Pentru un eepsite cu configurația clientApp veche, ati avut:
ru: После перехода на новую архитектуру вам почти не потребуется что-то делать, чтобы заработали старые сервера, управляемые менеджером туннелей I2P. Рассмотрим простой пример. Для сайта со старыми настройками clientApp было:

source: To provide that same functionality on the new web architecture:
es: Para proporcionar la misma duncionalidad en la nueva arquitectura:
id: Memberikan fungsionalitas yang sama tersebut pada web arsitektur baru:
ro: Pentru a oferi aceeași funcționalitate pe noua arhitectura web:
ru: Для обеспечения той же самой функциональности на новой архитектуре:

source: Jump to <a href="%(url)s">%(url)s</a>
es: Saltar a <a href="%(url)s">%(url)s</a>
id: Lompat ke <a href="%(url)s">%(url)s</a>
ro: Sari la <a href="%(url)s">%(url)s</a>
ru: Перейти к <a href="%(url)s">%(url)s</a>

source: Click on Add new: [Server tunnel] "GO"
es: Pulse en Añadir un nuevo:[Rúnel Servidor] "GO"
id: Klik pada Add new: [Server tunnel] "GO"
ro: Faceți clic pe Adauga nou: [tunel Server] "GO"
ru: Нажмите на Добавить новый: [Серверный туннль] "Вперед"

source: For the name: <code>"eepsite"</code>
es: Nombre: <code>"eepsite"</code>
id: Untuk nama: <code>"eepsite"</code>
ro: Pentru numele: <code> "eepsite" </code>
ru: В качестве названия: <code>"eepsite"</code>

source: For the description: <code>"My eepsite, isn't it pretty?"</code>
es: Descripción:<code>"Mi eepsite, ¿no es bonita?"</code>
id: Untuk deskripsi: <code>"Eepsite saya, cantik bukan?"</code>
ro: Pentru descrierea: <code> "? Eepsite meu, oare nu este destul de frumos" </ code>
ru: В качестве описания: <code>"Мой eepsite, он хорош, не правда ли?"</code>

source: >For the target host:
es: >Servidor de destino:
id: >Untuk target host:
ro: > Pentru gazdă țintă:
ru: >В качестве узла назначения:

source: For the target port:
es: Puerto de destino:
id: Untuk target port:
ro: Pentru portul țintă:
ru: В качестве порта назначения:

source: For the private key file: <code>path to "myWebPriv.dat"</code><br /> (it is recommended to copy that .dat to your new install dir)
es: Archivo con la clave privada: <code>path de "myWebPriv.dat"</code><br /> (se recomienda que copie ese archivo .dat al nuevo directorio de instalación)
id: Untuk file kunci pribadi: <code>jalur ke "myWebPriv.dat"</code><br /> (direkomendasikan untuk menyalin .dat file tersebut ke direktori pemasangan anda)
ro: Pentru fișierul cheie privat: <code>cale la "myWebPriv.dat" </ code> <br /> (este recomandat pentru a copia acest fisierul .dat la noua instalare dir)
ru: В качестве пути к файлу с закрытым ключом: <code>путь к "myWebPriv.dat"</code><br /> (рекокмендуется скопировать этот .dat-файл в директорию с новой установкой)

source: Check the "Start automatically?" checkbox
es: Active la casilla de "Iniciar automáticamente".
id: Centang kotak "Start automatically?"
ro: Verificați caseta "porni automat?"
ru: Отметьте пункт "Запускать автоматически?"

source: Click <code>"Save"</code>
es: Pulse <code>"Guardar"</code>
id: Klik <code>"Save"</code>
ro: Faceți clic pe <code> "Salvare" </ code>
ru: Нажмите <code>"Сохранить"</code>

source: It will come back saying:
es: Responderá diciendo:
id: Dia akan kembali mengatakan:
ro: Acesta va veni înapoi spunând:
ru: Будет выведено сообщение:

source: That's it! Creating a new I2PTunnel server works the same way too, except you don't need to "copy the old file", obviously. Behind the scenes, it is all driven by the <code>i2ptunnel.config</code> file, which you may modify externally (if you do, hit "Reload config" on the I2PTunnel web page, which will tear down all of your existing tunnels and rebuild new ones)
es: ¡Ya está! Para crear el nuevo servidor I2PTunnel funciona de la misma forma, excepto que no necesita "copiar el archivo antiguo". Internamente está todo controlado por el archivo <code>i2ptunnel.config</code>, el cual puede editar externamente (si lo hace, pulse "Recargar configuración" en la página web del I2PTunnel, que apagará todos los túneles existentes y los construirá y levantará de nuevo).
id: Itu saja! Membuat server I2PTunnel baru dikerjakan dengan cara yang sama juga, kecuali tentu saja anda tidak perlu "menyalin file lama". Di balik layar, semua digerakkan oleh file <code>i2ptunnel.config</code> , yang dapat anda modifikasi secara eksternal (jika anda melakukannya, tekan "Reload config" di halaman web I2PTunnel, yang akan merobohkan semua tunnel yang ada dan membangun kembali yang baru)
ro: Asta este! Server nou I2PTunnel creat funcționează în același mod de asemenea, în afară de tine Nu este nevoie să "copiați fișierul vechi". În spatele scenei, totul este condus de <code> i2ptunnel.config </ code> , care s-ar putea modifica extern (dacă ai face, apasa "Reload config", pe pagina de web I2PTunnel, care va dărâma toate dvs. tuneluri existente și reconstrui noi)
ru: Это всё! Создание нового I2PTunnel сервера работает точно таким же образом, только вам, конечно, не потребуется "копировать старый файл". На самом деле всё это управляется файлом <code>i2ptunnel.config</code>, который вы можете изменить отдельно (если вы это сделаете, нажмите "Перезагрузить конфигурацию" на странице I2PTunnel, при этом все существующие туннели будут разорваны и построены новые)

source: Note that you WILL need to wait until your router is integrated into the network before you are able to use the /i2ptunnel/ web interface. It will say "Please be patient" if you try to beforehand, which means that it is still trying to build the necessary I2PTunnel sessions it has been configured to create.
es: Dese cuenta que TENDRÁ que esperar hasta que el ruter esté integrado en la red antes de poder usar el interfaz web para /i2ptunnel/. Le dirá "Por favor sea paciente" si ya lo ha intentado anteriormente, lo que significa que aún está intentando de construir las sesiones de los túneles que ha configurado para ser creados.
id: Perhatikan bahwa anda AKAN perlu menunggu sampai router anda terintegrasi ke dalam jaringan sebelum anda dapat menggunakan antarmuka /i2ptunnel/web. Dia akan mengatakan "Mohon bersabar" jika anda mencoba sebelumnya, yang berarti dia masih berusaha membangun sesi I2PTunnel yang diperlukan yang telah dikonfigurasi untuk dibuat.
ro: Rețineți că va trebui să așteptați până când router-ul va fi integrat în rețea înainte de a fi capabili de a utiliza / i2ptunnel / web interfață. Se va spune "Vă rugăm să așteptați", dacă încercați în prealabil, ceea ce înseamnă că acesta este încă in stare de construire sesiuni de I2PTunnel necesare acesta ce a fost configurat pentru a crea.
ru: Учтите, что перед использованием интерфейса /i2ptunnel/ потребуется подождать, пока маршрутизатор интегрируется в сеть. До этого времени будет появляться сообщение с просьбой подождать, что означает, что маршрутизатор находится в процессе построения необходимых сессий I2PTunnel в соответствии с конфигурацией.

source: I2PTunnel services
es: Servicios I2PTunnel.
id: I2PTunnel service
ro: servicii I2PTunnel
ru: Сервисы I2PTunnel

source: Below is quick copy of aum's eepsite deployment guide.
es: Más abajo tiene una copia de la guía de aum de como crear una eepsite rápidamente.
id: Berikut adalah salinan cepat panduan penyebaran eepsite Aum.
ro: Mai jos este copia rapida de eepsite ghid de implementare Aum lui.
ru: Нижеприведённое - копия руководства по развёртыванию с eep-сайта aum'а:

source: 1. - Deploy a local server
es: 1. - Instalar un servidor local
id: 1. - aktifkan server lokal
ro: 1. - Implementați un server local
ru: 1. - Установите локальный сервер

source: For simplicity's sake, we will walk through the setup of a web server; however, this procedure is the same regardless what protocol of servers and/or clients you are setting up.
es: Para simplificar, seguiremos los pasos de cómo crear un servidor web; aún así, este procedimiento es le mismo independientemente del protocolo del servidor o/y los clientes que esté configurando.
id: Demi kesederhanaan, kita akan menjalankan setup server web; namun, prosedur ini sama terlepas dari protokol server dan/atau klien yang anda siapkan.
ro: Pentru simplitate, vom merge prin configurarea unui server web, cu toate acestea, această procedură este aceeași, indiferent ce protocol de servere și / sau clienți pe care îl configurați.
ru: Для простоты мы рассмотрим процедуру настройки для веб-сервера; тем не менее эта процедура одинакова вне зависимости от того, серверы и/или клиенты для каких протоколов Вы устанавливаете.

source: I recommend the Tiny Httpd web server, thttpd, (windows version available on site) although you can use anything that you feel comfortable with.
es: Recomiendo el servidor web Tiny Httpd, thttpd, (hay una versión disponible en su web para windows) aunque puede usar cualquier servidor con el que se encuantre confortable.
id: Saya sarankan server web Tiny Httpd, thttpd, (versi windows tersedia di situs) meskipun anda dapat menggunakan apa pun yang anda merasa nyaman.
ro: Vom recomanda serverul Httpd Tiny web, thttpd, (versiunea disponibilă pentru windows pe site-ul ), deși se poate utiliza orice cu care sa te simti confortabil cu.
ru: Я рекомендую использовать веб-сервер Tiny Httpd, thttpd, (на сайте доступна windows-версия), но Вы можете использовать то, что удобно Вам.

source: Another more robust option would be to use EasyPHP, which is also open source. It comes with PHP, PHPmyadmin, mySQL, and Apache web server. For newbies who have no experience setting up and hosting content over servers, see the hosting page for help.
es: Otra opción robusta podría ser usar EasyPHP, el cual es también libre. Viene con PHP, PHPmyamin, mySQL y el servidor web Apache. Para los principiantes que no tengan experiencia en configurar un domino o servidores de contenido, vea la web de hosting/servidores para más ayuda.
id: Pilihan lain yang lebih lengkap adalah menggunakan EasyPHP, yang juga merupakan open source. Ini berisi PHPmyadmin, PHP, mySQL, dan Apache web server. Untuk pemula yang tidak memiliki pengalaman pengaturan dan hosting konten di dalam server, lihat halaman hosting untuk bantuan.
ro: O altă opțiune mai robusta ar fi de a folosi EasyPHP, care este, de asemenea, open source. Acesta este dotat cu PHP, phpMyAdmin, MySQL, și server web Apache. Pentru începători care nu au experiență configurarea și găzduire conținutului pe servere, consultați pagina de hosting pentru ajutor.
ru: Другим более стойким вариантом является использование EasyPHP, также с открытым исходным кодом. EasyPHP поставляется вместе с PHP, PHPmyadmin, mySQL, и веб-сервером Apache. Для новичков, если нет опыта по настройке и размещению контента на серверах, рекомендуем просмотреть страницу о хостинге для справки.

source: With the web server you've chosen, configure it to listen on a port of your choice, and serve its documents from a directory of your choice. For this example, we'll assume port 10880.
es: En el servidor web que haya elegido, configúrelo para que escuche en un puerto de su elección, y sirva los documentos de un directorio de su elección. Para este ejemplo supondremos que usamos el puerto 10880.
id: Dengan server web yang dipilih, konfigurasinya untuk mendengarkan pada port pilihan anda, dan melayani dokumennya dari direktori pilihan anda. Untuk contoh ini, kita berasumsi port yang digunakan adalah 10880.
ro: Cu serverul web pe care l-ați ales, configurați-l pentru a asculta un port la alegere, și a servi documentele sale de la un director la alegerea ta. Pentru acest exemplu, vom presupune 10880 port.
ru: Настройте выбранный Вам веб-сервер на нужный порт и корневую директорию с веб-документами. В этом примере будет использоваться порт 10880.

source: Make sure your firewall is set up so that you cannot receive incoming connections on this port (which would breach your anonymity).
es: Asegúrese que su cortafuegos está configurado para bloquear las conexiones entrantes a este puerto (si no, al poder acceder directamente a este puerto, eliminaría su anonimato)
id: Pastikan bahwa firewall anda diatur sehingga anda tidak bisa menerima koneksi masuk pada port ini (yang akan menghilangkan anonimitas anda).
ro: Asigurați-vă că firewall-ul este configurat astfel încât să nu poate primi conexiuni de intrare la acest port (care ar încălca anonimatul).
ru: Убедитесь, что ваш межсетевой экран запрещает входящие соединения на этом порту (что нарушило бы вашу анонимность).

source: Test the webserver, by pointing your normal browser (the one with the "direct connection") at <a href="http://localhost:10880" target="_blank">http://localhost:10880</a> (changing the 10880 to the port number you have chosen).
es: Pruebe el servidor web abriendo en su navegador web (el navegador con "conexión directa") la dirección <a href="http://localhost:10880" target="_blank">http://localhost:10880</a> (cambiando el puerto 10880 por el número que haya elejido).
id: Uji webserver dengan menunjuk webrowser biasa (yang punya "direct connection") pada <a href="http://localhost:10880" target="_blank">http://localhost:10880</a> (ubah 10880 menjadi nomor port yang anda pilih).
ro: Testați serverul de web, arătând browser-ul dvs. normal (cel cu "legătura directă") la <a href="http://localhost:10880" target="_blank"> http://localhost:10880 </ a> (schimbati 10880 de numărul de port ce l-ați ales).
ru: Попробуйте открыть при помощи Вашего обычного браузера (того, у которого "прямое соединение") страницу по адресу <a href="http://localhost:10880" target="_blank">http://localhost:10880</a> для проверки работы веб-сервера (при необходимости замените 10880 на выбранный Вами порт).

source: Once your webserver is working, and you can access it locally with your browser, continue to the next step.
es: Una vez que el servidor esté funcionando, y pueda acceder a él localmente con su explorador, continue con el siguiente paso.
id: Ketika webserver anda berfungsi, dan anda dapat mengaksesnya secara lokal dengan browser anda, lanjutkan ke langkah berikutnya.
ro: Odată ce serverul dvs. lucreaza, și îl puteți accesa la nivel local cu browser-ul dvs., continuați cu pasul următor.
ru: Когда убедитесь, что Ваш веб-сервер работает корректно, и Вы можете зайти на него локально из браузера - переходите к следующему шагу.

source: 2 - Generate an I2P Destination Keypair
es: 2 - Genere el par de claves de destino de I2P
id: 2 - Buat Keypair Destinasi I2P
ro: 2 - generează o destinație pereche de chei I2P
ru: 2 - Генерация I2P пары ключей назначения

source: I2P does not deal in IP addresses. To protect your anonymity, it deals in unique addresses called destination keys.
es: I2P no funciona con su dirección IP. Para proteger su anonimato funciona con direcciones únicas llamadas claves de destino.
id: I2p tidak berurusan dengan alamat IP. Untuk melindungi anonimitas anda, I2P berhubungan dengan alamat unik yang disebut destination key.
ro: I2P nu ocupă adrese IP. Pentru a proteja anonimatul, se ocupă adrese unice numite chei de destinație.
ru: Внутренняя сеть I2P не использует IP-адреса. Для защиты Вашей анонимности она использует уникальные адреса, называемые ключами назначения.
