Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/misc.po
Languages: es, id, ro, ru

source: Run <code>build.sh</code> (if you downloaded GMP) or <code>build.sh dynamic</code> (if you have /usr/lib/libgmp.so).<br/> Maybe the build spewed out some errors of missing jni.h and jni_md.h files. Either copy these files from your java install into the core/c/jbigi/jbigi/include/ directory, or fix $JAVA_HOME.<br> You can run the <code>build.sh</code> from the <code>core/c/</code> directory which will build all available jbigi libs into a jbigi.jar.</br> A file named <code>libjbigi.so</code> should be created in the current directory. If this doesn't happen and/or you get errors then please report them.
es: Ejecute <code>build.sh</code> (si ha descargado GMP) o <code>build.sh dynamic</code> (si ya tiene /usr/lib/libgmp.so).<br/> Quizás al compilar le arroje algunos errores sobre la falta de los archivos jni.h y jni_md.h. Puede copiar estos archivos desde su instalación de java al directorio core/c/jbigi/jbigi/include/, o arregle su $JAVA_HOME.<br> Puede ejecutar <code>build.sh</code> desde el directorio <code>core/c/</code>, lo cual compilará todas las librerías jbigi disponibles dentro de jbigi.jar.</br>. En dicho directorio debería crearse un archivo llamado <code>libjbigi.so</code>. Si no aparece y/o obtiene errores, por favor repórtelo.
id: Jalankan <code>build.sh</code> (jika anda mendownload GMP) atau <code>build.sh dynamic</code> (jika anda memiliki /usr/lib/libgmp.so). <br/> mungkin build melaporkan beberapa kesalahan file jni.h dan jni_md.h yang hilang. Salin file-file ini dari java install ke direktori inti /c/jbigi/jbigi/include/, atau perbaiki $JAVA_HOME. <br> Anda dapat menjalankan <code>build.sh</code> dari direktori <code>core/c/</code> yang akan membangun semua jbigi libs yang tersedia ke jbigi.jar. </br> Sebuah file bernama <code>libjbigi.so</code> harus dibuat di current directory. Jika ini tidak berfungsi dan/atau anda mendapat pesan error, mohon laporkan kepada kami.
ro: Rulați <code> build.sh </ code> (dacă ați descărcat GMP) sau <code> build.sh dinamic </ code> (dacă aveți / usr / lib / libgmp.so). <br/> Poate construirea a aruncat unele erori de lipsă jni.h și fișiere jni_md.h. Copiati aceste fișiere din directoriul de instalare a java dvs. / c / jbigi / jbigi / include / directory, sau reparati $JAVA_HOME. <br> Puteți rula <code> build.sh </ code> din <code>core / c / </ code> director care va construi toate biblioteci jbigi disponibile într-o jbigi.jar. </ br> Un fișier numit <code> libjbigi.so </ code> ar trebui să fie creat în director curent. Dacă acest lucru nu se întâmplă și / sau veți obține erori, vă rugăm să raportati ele.
ru: Выполните <code>build.sh</code> (если вы скачивали GMP) или <code>build.sh dynamic</code> (если у вас есть /usr/lib/libgmp.so).<br/> Возможно, скрипт выдаст ошибки об отсутствии файлов jni.h и jni_md.h. Или скопируйте эти файли из установки java в директорию core/c/jbigi/jbigi/include/, или исправьте $JAVA_HOME.<br> Вы можете запустить <code>build.sh</code> из директории <code>core/c/</code>, в результате будет выполнена сборка всех доступных библиотек jbigi в jbigi.jar.</br> В текущей директориии должен быть создан файл <code>libjbigi.so</code>. Если этого не произойдет и/или будут сообщения об ошибках, пожалуйста, расскажите нам об этом.

source: Follow the instructions in core/c/README to install the library and run the speed test. Read the final lines of the speed test's output for some additional info, it will be something like this:
es: Siga las instrucciones de core/c/README para instalar la librería y ejecutar las pruebas de velocidad. Lea las últimas líneas del test de velocidad para obtener información adicional, debería ser algo como esto:
id: Ikuti instruksi di inti /c/README untuk menginstal library dan jalankan tes kecepatan. Baca baris terakhir dari output tes kecepatan untuk beberapa info tambahan, ini akan seperti ini:
ro: Urmați instrucțiunile din bază / c / README pentru a instala biblioteca și a trece testul de viteză. Citiți liniile finale ale rezultatului testului de viteză pentru unele info suplimentare, acesta va fi ceva de genul:
ru: Для установки библиотеки и запуска теста скорости следуйте инструкциям в core/c/README. Прочитайте последние строки результата теста для дополнительной информации, они будут похожи на:

source: If the native is indeed 5-7x faster (or more) then it looks all good. If not, please report.
es: Si el nativo es 5-7 veces más rápido (o más), entonces todo está bien. Si no, avísenos.
id: Jika yang native memang 5-7x lebih cepat (atau lebih) maka kelihatannya bagus. Jika tidak, mohon laporkan kepada kami.
ro: În cazul în care nativul este într-adevăr de 5-7x mai rapid (sau mai mult), atunci se pare totul bine. Dacă nu, vă rugăm să raportați.
ru: Если нативная библиотека действительно в 5-7 раз быстрее (или более), то всё хорошо. Иначе, сообщите нам.

source: Copy <code>libjbigi.so</code> to your i2p directory
es: Copie <code>libjbigi.so</code> a su carpeta i2p
id: Salin <code>libjbigi.so</code> ke direktori i2p anda
ro: Copie <code> libjbigi.so </ code> in directorul I2P
ru: Скопируйте <code>libjbigi.so</code> в директорию с i2p.

source: Restart your I2P programs.
es: Reinicie sus programas I2P
id: Restart program I2P anda.
ro: Reporniți programele I2P.
ru: Перезапустите приложения I2P

source: On <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> the <code>crypto.elGamal.decrypt</code> and <code>crypto.elGamal.encrypt</code> should be a lot faster.
es: En <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> las velocidades en <code>crypto.elGamal.decrypt</code> y <code>crypto.elGamal.encrypt</code> deberían ser mucho más rápidas.
id: Pada <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> <code>crypto.elGamal.decrypt</code> dan <code>crypto.elGamal.encrypt</code> seharusnya jauh lebih cepat.
ro: Pe <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> <code>crypto.elGamal.decrypt</code> si <code>crypto.elGamal.encrypt</code> ar trebui să fie mult mai repede.
ru: На странице <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> <code>crypto.elGamal.decrypt</code> и <code>crypto.elGamal.encrypt</code> должны быть гораздо быстрее.

source: Jrandom's Announcement
es: Aviso de Jrandom
id: Pengumuman Jrandom
ro: Anunt Jrandom-lui
ru: Объявление Jrandom'а

source: The following message was received in mid-November 2007. We have no further information on jrandom's status.
es: El siguiente mensaje fue recibido a mediados de Noviembre del 2007. No tenemos más información sobre jrandom.
id: Pesan berikut diterima pada pertengahan November 2007. Kami tidak memiliki informasi lebih lanjut tentang status jrandom.
ro: Următorul mesaj a fost primit la mijlocul lunii noiembrie 2007. Nu avem nici o informație suplimentara cu privire la statutul jrandom-lui.
ru: Представленное ниже сообщение было получено в середине ноября 2007. Мы не располагаем никакой дополнительной информацией о jrandom'е.

source: Subsequently, in an unrelated incident, the hosting company for all *.i2p.net servers (except forum.i2p.net) suffered a power outage on January 13, 2008, and the i2p.net servers did not fully return to service. As only jrandom has the credentials required to restore service, and he could not be contacted, we moved all public services to <a href="%(site)s">www.i2p2.de</a> and related subdomains.
es: Más tarde, en un incidente no relacionado, la compañía de hosting de todos los servidores *.i2p.net (excepto forum.i2p.net) sufrió una perdida de corriente el 13 de Enero del 2008, y los servidores i2p.net no volvieron a funcionar. Ya que sólo jrandom tiene las credenciales para restaurar el servicio, y no puede ser contactado, movimos todos los servicios públicos a <a href="%(site)s">www.i2p2.de</a>.
id: Selanjutnya, dalam insiden yang tidak terkait, perusahaan hosting untuk semua server * .i2p.net (kecuali forum.i2p.net) mengalami pemadaman listrik pada tanggal 13 Januari 2008, dan server i2p.net tidak sepenuhnya kembali beroperasi. Karena hanya jrandom yang memiliki kredensial yang diperlukan untuk memulihkan layanan, dan dia tidak dapat dihubungi, kami memindahkan semua layanan publik ke <a href="%(site)s">www.i2p2.de</a> dan subdomain terkait.
ro: Ulterior, într-un incident care nu au legătură, compania de găzduire pentru toate serverele *.i2p.net (cu excepția forum.i2p.net) a suferit o pană de curent pe 13 ianuarie 2008, iar serverele i2p.net nu au revenit pe deplin la serviciu. Ca doar jrandom are acreditările necesare pentru a restabili serviciu, și el nu a putut fi contactat, ne-am mutat toate serviciile publice la <a href="%(site)s"> www.i2p2.de </ a>
ru: Позже, в несвязанном с этим происшествии, хостинговая компания всех серверов *.i2p.net (кроме forum.i2p.net) пострадала от отключения питания 13 января 2008 года, и i2p.net сервера восстановили функционирование не в полной мере. Так как только jrandom имел необходимый для восстановления сервисов доступ, а с ним невозможно связаться, мы перенесли все публичные сервисы на <a href="%(site)s">www.i2p2.de</a> и связанные с ним поддомены.

source: Approximately two months later, for unrelated reasons, forum.i2p.net was moved to <a href="http://%(forum)s/">%(forum)s</a>.
es: Dos meses más tarde, aproximadamente, y por otras razones, forum.i2p.net fue movido a <a href="http://%(forum)s/">%(forum)s</a>.
id: Kira-kira dua bulan kemudian, karena alasan yang tidak terkait, forum.i2p.net dipindahkan ke <a href="http://%(forum)s/">%(forum)s</a> .
ro: Aproximativ două luni mai târziu, din motive care nu au legatura, forum.i2p.net a fost mutat la <a href="http://%(forum)s/">%(forum)s</a>.
ru: Спустя примерно два месяца по несвязанным причинам forum.i2p.net переехал на <a href="http://%(forum)s/">%(forum)s</a>.

source: Manually Installing the Java Wrapper
es: Instalar manualmente el Wrapper de Java
id: Instalasi Manual Java Wrapper
ro: Instalarea manual Java Wrapper
ru: Установка Java Wrapper вручную

source: The installation package for the <a href="%(downloads)s">I2P router</a> comes with a Java wrapper for the most common architectures. If your system is not supported by our installer&mdash;or if you want to update the wrapper to a newer version&mdash;the following steps describe installing the wrapper manually.
es: El paquete de instalación para el <a href="%(downloads)s">ruter I2P</a> viene con un wrapper de Java para las arquitecturas más comunes. Si su sistema no está soportado por nuestro instalador, o si desea actualizar el wrapper a una nueva versión, los siguientes pasos describen como instalar el wrapper a mano.
id: Paket instalasi untuk <a href="%(downloads)s">router I2P</a> hadir pembungkus Java wrapper untuk arsitektur yang paling umum. Jika sistem anda tidak didukung oleh installer kami - atau jika anda ingin mengupdate wrappernya ke versi yang lebih baru - langkah-langkah berikut menjelaskan instalasi wrappernya secara manual.
ro: Pachetul de instalare pentru router <a href="%(downloads)s"> I2P </a> vine cu un înveliș Java pentru cele mai comune arhitecturi. Dacă sistemul dvs. nu este susținut de instalator nostru sau dacă doriți să actualizați wrapper la o versiunea următoarele etape noi descriu instalarea manuală ambalajul
ru: Пакет установки для <a href="%(downloads)s">маршрутизатора I2P</a> поставляется вместе с Java Wrapper для большинства распространенных архитектур. Если ваша система не поддерживается нашим инсталлятором &mdash; или вы хотите обновить Wrapper до более новой версии &mdash; следующие шаги описывают процесс установки Java Wrapper вручную.

source: Check Tanuki Software's <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable">download page</a> for your platform. Is your platform listed? If so, you're in luck! Download the most recent version of the Community Edition for your OS and CPU and move to <a href="#packaged">the next step</a>.
es: Compruebe la <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable">página de descargas</a> de Tanuki Software por su plataforma. ¿Está su plataforma listada? Si es así, ¡está de suerte! Descargue la versión más reciente para su sistema operativo y su CPU y vaya al <a href="#packaged">siguiente paso</a>.
id: Periksa perangkat lunak milik Tanuki di <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable">halaman downloadnya</a> untuk platform anda. Apakah platform anda terdaftar? Jika demikian, anda beruntung! Download Versi Edisi Komunitas terbaru untuk OS dan CPU anda dan lanjutkan ke <a href="#packaged">langkah berikutnya</a> .
ro: Verifica <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable"> pagina de descărcare </ a> pentru platforma dumneavoastră. Este listat platforma? Dacă da, sunteți norocos! Descărcați cea mai recentă versiune a ediției comunitar pentru sistemul de operare și CPU și treceti la <a href="#packaged"> următorul pas </ a>.
ru: Проверьте <a href="http://wrapper.tanukisoftware.com/doc/english/download.jsp#stable">страницу загрузки</a> Tanuki Software. Ваша платформа есть в списке? Если это так, то вам повезло! Скачайте последнюю версию Community Edition для вашей ОС и процессора и переходите к <a href="#packaged">следующему шагу</a>.

source: If your platform does not have an already compiled wrapper available, you may be able to compile it yourself. If you are willing to have a go at it, move on to <a href="#compiling">compiling</a> the wrapper for your system.
es: Si su plataforma no tiene todavía un wrapper disponible compilado, podría ser capaz de compilarlo usted mismo. Si desea hacerlo, vaya a <a href="#compiling">compilar</a> el wrapper para su sistema.
id: Jika platform anda tidak memiliki wrapper yang sudah dikompilasi, anda mungkin bisa mengkompilasinya sendiri. Jika anda bersedia melakukannya, lanjutkan ke <a href="#compiling">kompilasi</a> wrapper untuk sistem anda.
ro: În cazul în care platforma nu are un înveliș deja compilat disponibil, poate veti fi capabil să-l compilați singur. Dacă sunteți dispus treceti la <a href="#compiling"> compilarea </ a> învelișului pentru sistemul dumneavoastră.
ru: Если для вашей платформы отсутствует скомпилированный Wrapper, то вы можете скомпилировать его самостоятельно. Если вы хотите попытаться сделать это, то переходите к шагу <a href="#compiling">компиляции</a> для вашей системы.

source: Using existing binaries
es: Usando binarios ya existentes
id: Menggunakan file binari yang ada
ro: Folosind binare existente
ru: Использование готовых исполняемых файлов

source: In the steps below, $I2P means <em>the location I2P was installed to</em>.
es: En los pasos de más abajo, $I2P significa <em>el lugar donde ha sido instalado I2P</em>.
id: Pada langkah di bawah, $I2P berarti <em>lokasi yang dipasang I2P</em> .
ro: În pașii de mai jos, $ I2P înseamnă <em> locație I2P a fost instalat la </ em>.
ru: В изложенных ниже шагах $I2P обозначает <em>путь, куда установили I2P</em>.

source: Try to start I2P using <code>$I2P/i2prouter start</code>
es: Intente iniciar I2P usando <code>$I2P/i2prouter start</code>
id: Cobalah untuk memulai I2P menggunakan <code>$I2P/i2prouter start</code>
ro: Încercați să porniți I2P folosind <code> $I2P/i2prouter start </ code>
ru: Попробуйте запустить I2P, выполнив <code>$I2P/i2prouter start</code>

source: <code>tail -f /tmp/wrapper.log</code> and look for any problems.
es: <code>tail -f /tmp/wrapper.log</code> y busque los problemas.
id: <code>tail -f /tmp/wrapper.log</code> dan cari apakah ada masalah.
ro: <code> tail-f /tmp/wrapper.log </code> și căutați orice probleme.
ru: <code>tail -f /tmp/wrapper.log</code> и посмотрите, нет ли каких ошибок.

source: If this did not work you'll need to use <code>runplain.sh</code> to start I2P.
es: Si esto no funciona necesitará ejecutar <code>runplain.sh</code> para arrancar I2P.
id: Jika ini tidak berhasil, anda harus menggunakan <code>runplain.sh</code> untuk memulai I2P.
ro: Dacă acest lucru nu are efect, va trebui să utilizați <code> runplain.sh </ code> pentru a porni I2P.
ru: Если это не сработало - используйте <code>runplain.sh</code> для запуска I2P.

source: Compiling from source
es: Compilando desde las fuentes
id: Kompilasi dari kode sumber
ro: Compilarea de la sursă
ru: Компиляция из исходников

source: These steps worked to compile the wrapper for use on a mipsel system running Debian. The steps <strong>will</strong> need to be altered for your system.
es: Estos pasos han funcionado para compilar el wrapper en un sistema mipsel ejecutando debian. Estos pasos <strong>tendrán</strong> que ser cambiados dependiendo de su sistema.
id: Langkah-langkah ini berfungsi untuk mengkompilasi wrappernya agar bisa digunakan pada sistem mipsel yang menjalankan Debian. Langkah-langkah yang <strong>perlu</strong> diubah untuk sistem anda.
ro: Acești pași au lucrat pentru a compila wrapper pentru utilizare pe un sistem mipsel ce se rulează Debian. Pașii <strong> vor </ strong> trebuie să fie modificate pentru sistemul dumneavoastră.
ru: Инструкция успешно протестированна на MIPS(EL) Debian. Инструкция <strong>дожна</strong> быть подстроенна под вашу систему.

source: Download the source archive for the community version of the wrapper from <a href="http://wrapper.tanukisoftware.com/downloads">wrapper download page</a>.
es: Descargue el archivo con las fuentes para la versión del wrapper desde <a href="http://wrapper.tanukisoftware.com/downloads">la página de descarga del wrapper</a>.
id: Download arsip sumber kode wrapper untuk versi komunitas dari <a href="http://wrapper.tanukisoftware.com/downloads"halaman download wrapper</a>.
ro: Descărcați arhiva sursă pentru versiunea comunitatii de înveliș de la <a href="http://wrapper.tanukisoftware.com/downloads"> pagina de descarcare a wrapper </ a>.
ru: Скачайте архив с исходным кодом Wrapper со <a href="http://wrapper.tanukisoftware.com/downloads">страницы загрузок</a>.

source: Extract the tarball
es: Descompriba el archivo
id: Ekstrak file tarball-nya
ro: Extrage arhiva
ru: Распакуйте tar-архив

source: Set environment variables <code>ANT_HOME</code> and <code>JAVA_HOME</code>. For example, in Debian:
es: Ajuste las variables <code>ANT_HOME</code> y <code>JAVA_HOME</code>. For ejemplo en Debian:
id: Tetapkan variabel lingkungan <code>ANT_HOME</code> dan <code>JAVA_HOME</code> . Sebagai contoh, dalam Debian:
ro: Setati variabile de mediu <code> ANT_HOME </ code> și <code> JAVA_HOME </ code>. De exemplu, în Debian:
ru: Установите переменные окружения <code>ANT_HOME</code> и <code>JAVA_HOME</code>. Например, в Debian:

source: Since there isn't a Makefile for Mipsel, we'll make a copy of an already existing makefile:
es: Ya que no existe un Makefile para Mipsel, haremos una copia de un makefile ya existente:
id: Karena tidak file Makefile untuk Mipsel, kami akan membuat salinan makefile yang sudah ada:
ro: Daca nu există un Makefile pentru Mipsel, vom face o copie a unui Makefile deja existent:
ru: Так как Makefile для Mipsel отсутствует, то мы сделаем копию уже существующего файла:

source: Now we can attempt to compile the wrapper:
es: Ahora podemos intentar compilar el wrapper:
id: Sekarang kita dapat mencoba untuk mengkompilasi wrapper:
ro: Acum putem încerca pentru a compila înveliș:
ru: Теперь мы можем попытаться скомпилировать wrapper

source: use <code>./build64.sh</code> if you have a 64bit CPU and JVM
es: use <code>./build64.sh</code> si tiene una CPU y JVM de 64bit
id: gunakan <code>./build64.sh</code> jika anda memiliki CPU 64 bit dan JVM
ro: folositi <code> ./build64.sh </ code>, dacă aveți un procesor pe 64 de biți și JVM
ru: используйте <code>./build64.sh</code>, если у Вас 64-битный процессор и JVM.

source: Copy the wrapper into its proper place:
es: Copie el wrapper al su lugar correcto:
id: Salin wrapper ke tempat yang tepat:
ro: Copiați ambalajul în locul său:
ru: Скопируйте wrapper на своё место:

source: Here's an outline and rationale for a minimal WWW proxy app for use over I2P.
es: Aquí hay un esquema para una aplicación proxy WWW mínima para usar sobre I2P
id: Berikut adalah garis besar dan alasan untuk aplikasi proxy WWW minimal untuk digunakan di I2P.
ro: Iată o schiță și justificarea pentru o WWW proxy app minime pentru utilizarea cu I2P.
ru: Схема и объяснение минималистичного WWW-прокси поверх I2P.

source: HTTP operation over I2P using I2PTunnel. When the base SocketLibrary is out, the only significant difference will be the 'wrapRequest' and 'unwrapRequest' will functionally be placed in the socketLibrary, not in the router (but later versions of the SocketLibrary will be able to use selective ACK and large window sizes, allowing more ACKs to be skipped)
es: Usar HTTP sobre I2P usando un I2PTunnel. Cuando la librería base SocketLibrary esté lista, los únicos cambios significantes serán que el 'wrapRequest' y 'unwrapRequest' serán alojados funcionalmente en la librería socketLibrary, no en el ruter (pero las versiones más nuevas de SocketLibrary serán capaces de usar ACK selectivo y windows de grandes tamaños, permitiendo que sean omitidos más Acks)
id: Operasi HTTP di I2P menggunakan I2PTunnel. Ketika base SocketLibrary keluar, perbedaan signifikan hanya 'wrapRequest' dan 'unwrapRequest' yang secara fungsional akan ditempatkan di socketLibrary, bukan di router (tapi versi SocketLibrary akan mampu menggunakan ACK selektif dan ukuran jendela besar, memungkinkan lebih banyak ACKs yang akan dilewatkan)
ro: Functionarea HTTP peste I2P folosind I2PTunnel. În cazul în care SocketLibrary de bază este afară, singura diferență semnificativă va fi "wrapRequest" și 'unwrapRequest "va fi funcțional plasate în socketLibrary, nu în router (dar mai târziu versiuni ale SocketLibrary va putea utilizează ACK selective și ferestre de mari dimensiuni, care să permită mai multe ACK-uri pentru a fi ignorate)

source: An optimized form, designed to handle only 128KB [1] files and pages, can operate significantly faster:
es: Un clase optimizada, diseñada para manejar archivos y páginas de sólo128KB [1], pude funcionar mucho más rápida:
id: Bentuk yang dioptimalkan, yang hanya dirancang untuk menangani file 128KB [1] dan halaman, dapat beroperasi lebih cepat:
ro: O formă optimizată, proiectat să se ocupe doar 128KB de [1] fișiere și pagini, poate funcționează mult mai rapid:
ru: Оптимизированная форма, разработанная, чтобы обработать только 128 КБ [1] файлы и страницы, может работать значительно быстрее:
