Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/misc.po
Languages: es, id, ro, ru

source: Using JNI (Java Native Interface), a bit of C code (thanks ugha!), a little manual work and a piece of chewing gum we have made several cryptography operations quite a bit faster.
es: Usando JNI (Interfaz nativo de Java), un poco de código C (¡gracias ugha!), un poco de trabajo manual y un trozo de chicle hemos hecho que varias operaciones de cifrados sean un poco más rápidas.
id: Menggunakan JNI (Java Native Interface), sedikit kode C (terima kasih ugha!), sedikit kerja manual dan sepotong permen karet kami telah melakukan beberapa operasi kriptografi sedikit lebih cepat.
ro: Folosind JNI (Java Native Interface), un pic de cod C (datorită ugha!), Un pic lucru manual și o bucată de gumă de mestecat si le-am făcut mai multe operațiuni criptografice un pic mai repede.
ru: При помощи JNI (Java Native Interface), небольшого кода на C (спасибо, ugha!), небольшого количества ручной работы и кусочка жвачки мы заставили некоторые криптографические операции работать немного быстрее.

source: The speedup comes from the super-fast <a href="%(gmplib)s">GNU MP Bignum library (libgmp)</a>. We use a single function from libgmp - <a href="%(func)s">mpz_powm()</a> as a replacement for the <a href="%(bigint)s">Java Math library's BigInteger modPow()</a>. As modPow() is a significant computational portion of many crypto operations, this is of significant benefit.
es: El aumento de velocidad se debe a la súper rápida <a href="%(gmplib)s">librería GNU MP Bignum (libgmp)</a>. Sólo usamos una función de libgmp - <a href="%(func)s">mpz_powm()</a> como reemplazo de la <a href="%(bigint)s">modPow() BigInteger en la librería Java Math</a>. Ya que modPow() es una importante parte de los cálculos de cifrados, se consigue un beneficio sognificante.
id: Penambahan kecepatan berasal dari <a href="%(gmplib)s">GNU MP Bignum library (libgmp)</a>. Kami menggunakan satu fungsi dari libgmp - <a href="%(func)s">mpz_powm ()</a> sebagai pengganti untuk <a href="%(bigint)s">Java Math library's BigInteger modPow ()</a> . Karena modPow() adalah bagian komputasi yang signifikan dari banyak operasi kripto, ini sangat bermanfaat.
ro: Accelerare vine de la bibliotecă super-rapid <a href="%(gmplib)s"> GNU MP Bignum (libgmp) </ a>. Noi folosim o singură funcție de libgmp - <a href="%(func)s"> mpz_powm () </ a> ca un înlocuitor pentru <a href="%(bigint)s"> Java Math bibliotecii BigInteger modPow () </ a>. Ca modPow () este o porțiune de calcul semnificativă a multor operațiuni criptografice, acest lucru este deosebit de benefic.
ru: Ускорения удалось достичь за счёт использования <a href="%(gmplib)s">библиотеки GNU MP Bignum (libgmp)</a>. Мы используем одну функцию из libgmp - <a href="%(func)s">mpz_powm()</a> как замену для <a href="%(bigint)s">функции modPow() из библиотеки Java Math BigInteger</a>. А так как значительная часть вычислений использует modPow() - это позволило неплохо ускориться.

source: The standard I2P installation includes about 20 versions of the library for different platforms, each about 50KB, inside the jbigi.jar file. The initialization of the JBigI library, including CPU identification, selection, and extraction of the correct loadable module, is handled by the <a href="%(nativebigint)s">NativeBigInteger class</a>. If no module is available for the current platform, the standard <a href="%(bigint)s">Java Math library's BigInteger modPow()</a> is used.
es: La instalación estándar de I2P incluye como 20 versiones de la librería para diferentes plataformas, dentro del archivo jbigi.jar, cada una sobre 50kb. El inicio de la librería JBigl, la identificación de la CPU, selección y extracción del módulo correcto a cargar es manejado por la <a href="%(nativebigint)s">clase NativeBigInteger</a>. Si no hay un módulo disponible para la plataforma usada, se usará la librería estándar <a href="%(bigint)s">modPow() BigInteger de Java Math library</a>.
id: Instalasi I2P standar mencakup sekitar 20 versi library untuk platform yang berbeda, masing-masing sekitar 50KB, di dalam file jbigi.jar. Inisialisasi library JBigI, termasuk identifikasi CPU, seleksi, dan ekstraksi modul loadable yang benar, ditangani oleh <a href="%(nativebigint)s">NativeBigInteger class</a> . Jika tidak ada modul yang tersedia untuk platform saat ini, <a href="%(bigint)s">library mod_ower JavaI Java Math</a> standar <a href="%(bigint)s">()</a> digunakan.
ro: Instalarea standarda I2P include aproximativ 20 de versiuni ale bibliotecii pentru diferite platforme, fiecare aproximativ 50KB, în interiorul fișierul jbigi.jar. Inițializarea bibliotecii JBigI, inclusiv identificarea CPU, selecție, și extracție modulului de încărcare corecta, este manipulat de către <a href="%(nativebigint)s">clasă NativeBigInteger </ a>. Dacă modul nu este disponibil pentru platforma actuală, este utilizat standardul <a href="%(bigint)s"> Java Math bibliotecii BigInteger modPow () </ a> .
ru: Стандартная поставка I2P содержит около 20 версий библиотеки для разных платформ, каждая около 50КБ, в файле jbigi.jar. Инициализация библиотеки JBigI, включая идентификацию CPU, выбор и извлечение подходящего загрузочного модуля, управляется <a href="%(nativebigint)s">классом NativeBigInteger</a>. Если модуль недоступен для текущей платформы, то используется стандартная функция <a href="%(bigint)s">BigInteger modPow() из библиотеки Java Math</a>.

source: Rebuilding and Testing JBigI
es: Recompilando y probando JBigl
id: Membangun kembali dan Menguji JBigI
ro: Reconstruirea și testare JBigI
ru: Пересборка и Тестирование JBigI

source: Following are the instructions to build a new jbigi library for your own platform and testing its performance.
es: Aquí están las instrucciones para compilar una nueva librería jbigi para su propia plataforma y poder probar su rendimiento.
id: Berikut ini adalah petunjuk untuk membangun library jbigi baru untuk platform anda dan menguji kinerjanya.
ro: În urma sunt instructiunile pentru a construirea și testarea performanțelor bibliotecii jbigi pentru propria platforma.
ru: Ниже приведены инструкции для сборки новой библиотеки jbigi для вашей платформы и тестирования её производительности

source: Requirements
es: Dependencias
id: Persyaratan
ro: Cerințe
ru: Требования

source: This works on Linux, and with a few changes in build.sh probably also on other platforms. FreeBSD has also been reported to work too. On Kaffee the speedup is very small, because it already uses native BitInteger internally. Blackdown seems to cause strange errors. Because you are going to do compilation, you need JDK; JRE won't work.
es: Funciona en Linux con unos pocos cambios en build.sh, probablemente también en otras plataformas. En Kaffe el aumento de velocidad es muy pequeño, porque ya usa internamente el BitInteger nativo. Blackdown parece producir errores extraños. Ya que va a compilar necesita JDK; el JRE no funcionará.
id: Ini berfungsi di Linux, dan dengan beberapa perubahan build.sh mungkin juga ada pada platform lainnya. Ini dilaporkan juga berfungsi di FreeBSD. Pada Kaffee, peningkatan kecepatan sangat kecil karena sudah menggunakan native BitInteger secara internal. Blackdown tampaknya menyebabkan kesalahan aneh. Karena anda akan melakukan kompilasi, anda perlu JDK; JRE tidak akan berfungsi.
ro: Aceasta funcționează pe Linux, și cu câteva modificări în build.sh, probabil, de asemenea, cu privire la alte platforme. A fost, de asemenea, raportat lucru pe platforma FreeBSD. Pe Kaffee accelerare este foarte mica, deoarece foloseste deja BitInteger nativ pe plan intern. Blackdown pare a provoca erori ciudate. Daca aveți de gând să faci compilare, aveți nevoie de JDK, JRE nu va funcționa.
ru: Это работает на Linux, а с небольшими изменениями в build.sh вероятно и на других платформах. Сообщается, что работает в том числе и на FreeBSD. На Kaffee ускорение незначительно, так как там уже используется нативный BigInteger. Blackdown похоже вызывает странные ошибки. Так как вам потребуется компилировать, необходимо иметь JDK; с JRE не выйдет.

source: The required code is available in monotone database and the latest source tarball.
es: El código necesario está disponible en monotone y en el último tarball de las fuentes.
id: Kode yang diperlukan tersedia dalam database monoton dan sumber terbaru tarball .
ro: Codul necesar este disponibil în baza de date monoton și cele mai recente pachete cu sursa.
ru: Необходимый код доступен в бд monotone и последнем архиве с исходным кодом.

source: The GNU MP Bignum library (libgmp) needs to be installed, if it isn't included in your OS / distribution or installed already, it can be received from <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>. Even if you have already installed it as binary, it might still be worth a try to compile GMP yourself, since then it will be able to use the specific instructions of your processor. The latest GMP may also be used instead of GMP 5.0.2, but it hasn't been tested by us.
es: Necesita instalar la librería GNU MP Bignu (libgmp), si no está incluida en su OS / distribución puede obtenerla de <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>. Incluso si ya tiene instalada como un binario, vale la pena compilar GMP por usted mismo, ya que de esta forma será capaz de usar las instrucciones específicas de su procesador. Probablemente se pueda usar la última versión de GMP en vez de la 5.0.2, pero no ha sido probado por nosotros.
id: Library GNU MP Bignum (libgmp) perlu diinstal, jika itu tidak disertakan dalam OS / distribusi atau sudah diinstal, itu dapat diambil dari <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>. Bahkan jika anda telah menginstal itu sebagai file biner, itu masih mungkin patut dicoba untuk mengkompilasi GMP, setelah itu, ia akan mampu menggunakan petunjuk khusus prosesor anda. GMP terbaru dapat juga digunakan sebagai pengganti GMP 5.0.2, tapi ini belum diuji oleh kami.
ro: Biblioteca GNU MP Bignum (libgmp) trebuie să fie instalata, în cazul în care acesta nu este incluse în OS / distribuție sau instalat deja, acesta poate fi primit de la <a href="http://gmplib.org/#DOWNLOAD"> http://gmplib.org/#DOWNLOAD </ a>. Chiar dacă l-au instalat deja ca binar, ar putea fi încă în valoare de o încercare de a compila GMP-te, deoarece atunci se va putea folosi instrucțiunile specifice ale procesorul. Cel mai recent GMP poate, de asemenea, fi utilizate în locul GMP 5.0.2, dar acesta nu a fost testat de către noi.
ru: Требуется установка библиотеки GNU MP Bignum (libgmp), если она не включена в вашу ОС/дистрибутив или не установлена ранее, то её можно скачать с <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>. Даже если вы установили её ранее, может быть стоит скомпилировать GMP самостоятельно, чтобы можно было использовать специфичные инструкции вашего процессора. Также можно использовать последнюю версию GMP вместо версии GMP 5.0.2, но мы ещё не проводили тестирование.

source: Step-by-step instructions
es: Instrucciones paso a paso
id: Petunjuk langkah demi langkah
ro: Instrucțiuni Pas-cu-pas
ru: Пошаговые инструкции

source: Look at <a href="http://localhost:7657/logs.jsp">your running environment on the logs.jsp page</a>. There should be one of two status messages for JBigI - either
es: Mire en <a href="http://localhost:7657/logs.jsp">, en la web de los registros, el entorno que está ejecutando . Deberían aparecer uno o dos mensajes sobre JBigi
id: Lihatlah <a href="http://localhost:7657/logs.jsp">running environment anda di halaman logs.jsp</a>. Harus ada salah satu dari dua status pesan untuk JBigI - bisa
ro: Uită-te la <a href="http://localhost:7657/logs.jsp"> mediu de pornire pe pagina logs.jsp </ a>. Nu ar trebui să fie una dintre cele două mesaje de stare pentru JBigI - fie
ru: Посмотрите на <a href="http://localhost:7657/logs.jsp">вашу среду выполнения на странице logs.jsp</a>. Там должно быть одно из двух сообщений о статусе JBigI, любое.

source: Locally optimized native BigInteger loaded from the library path
es: Librería nativa local optimizada BigInteger has sido cargada satisfactoriamente.
id: Lokal dioptimalkan BigInteger asli diambil dari library path
ro: BigInteger nativ optimizat la nivel local încărcat de la calea bibliotecă
ru: Локально оптимизированная нативная библиотека BigInteger загружена по указанному пути

source: or
es: o
id: atau
ro: sau
ru: или

source: Native BigInteger library jbigi not loaded - using pure java
es: La librería nativa BigInteger jbigi no ha sido cargada - usando java puro.
id: Library BigInteger native jbigi tidak dimuat - menggunakan java murni
ro: BigInteger nativ biblioteca jbigi nu sunt încărcate - folosirea Java pur
ru: Нативная библиотека jbigi не загружена — используется обычная java

source: If the native BitInteger library was NOT loaded, you definitely need to compile your own. Certain platforms, such as OS X, OpenSolaris, and 64-bit systems, may require you to compile your own library. If the BigInteger library was loaded, do at least the next step to see what your performance is.
es: Si la librería nativa BigInteger NO ha sida cargada, definitivamente necesita compilarla. Algunas plataformas, como OS X, OpenSolaris y los sistemas de 64 bits, pueden necesitar que compile su propia librería. Si la librería BigInteger se ha cargado, al menos haga el siguiente paso para comprobar su rendimiento.
id: Jika library BitInteger native TIDAK dimuat, anda pasti perlu untuk mengkompilasi sendiri. Platform tertentu, seperti OS X, OpenSolaris, dan sistem 64-bit, mungkin mengharuskan anda untuk mengkompilasi library anda sendiri. Jika library BigInteger dimuat, lakukan setidaknya langkah selanjutnya untuk melihat kinerja anda.
ro: Dacă biblioteca nativa BitInteger nu a fost încărcată, cu siguranta ai nevoie pentru a compila propria biblioteca. Anumite platforme, cum ar fi OS X, OpenSolaris, și sistemele pe 64 de biți, vă pot solicita să compilați propria biblioteca. Dacă biblioteca BigInteger a fost încărcata, faceti cel puțin următorul pas pentru a vedea care performanța este.
ru: Если нативная библиотека BigInteger НЕ была загружена, то вам определенно нужно скомпилировать свою. Некоторые платформы, такие как OS X, OpenSolaris и 64-битные системы, могут потребовать компиляцию своей собственной библиотеки. Если библиотека BigInteger была загружена, проделайте хотя бы следующий шаг, чтобы определить производительность.

source: Look on <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> to see what the lifetime average values for <code>crypto.elGamal.decrypt</code> and <code>crypto.elGamal.encrypt</code> are. The numbers are times in milliseconds. Copy these somewhere so you can compare them later on. The network average for encrypt time is about 20ms. If your encrypt time is less than 50ms for a relatively new processor, or less than 100ms for an older processor, and the native BigInteger library was loaded, you are probably fine.
es: Mire en <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> para ver cuales son los valores medios del tiempo de vida para <code>crypto.elGamal.decrypt</code> y <code>crypto.elGamal.encrypt</code>. Los números son el tiempo en mili segundos. Cópielos para poder compararlos más tarde. El tiempo medio de cifrado es alrededor de 20ms. Si el tiempo de cifrado es menor de 50ms para un procesador relativamente nuevo, o menos de 100ms para un procesador viejo, y la librería BigIntefer ha sido cargada, probablemente esté todo bien.
id: Lihatlah <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a> untuk melihat nilai rata-rata seumur hidup untuk <code>crypto.elGamal.decrypt</code> dan <code>crypto.elGamal.encrypt</code> . Jumlahnya adalah waktu dalam milidetik. Salin ini ke suatu tempat sehingga anda dapat membandingkannya nanti. Rata-rata jaringan untuk mengenkripsi adalah sekitar 20ms. Jika waktu enkripsi anda kurang dari 50ms untuk prosesor yang relatif baru, atau kurang dari 100ms untuk prosesor yang lebih tua, dan library BigInteger native dimuat, anda mungkin baik-baik saja.
ro: Uită-te la <a href="http://localhost:7657/stats.jsp"> http://localhost:7657/stats.jsp </ a> pentru a vedea valorile medii de viață pentru <code> crypto.elGamal.decrypt </ code> și <code> crypto.elGamal.encrypt </ code> . Numerele sunt momente în milisecunde. Copiați aceste undeva astfel încât să puteți compara mai târziu. Media de rețea de timpul criptarii este de aproximativ 20ms. Dacă timpul dvs. de criptare este mai mic de 50ms pentru un procesor relativ nou , sau mai puțin de 100ms pentru un procesor mai vechi, și biblioteca BigInteger nativ este incarcata, valorile sunt bune .
ru: Зайдите на <a href="http://localhost:7657/stats.jsp">http://localhost:7657/stats.jsp</a>, чтобы увидеть среднее время существования значений для <code>crypto.elGamal.decrypt</code> и <code>crypto.elGamal.encrypt</code>. Значения указаны в миллисекундах. Скопируйте значения куда-нибудь так, чтобы вы могли сравнить с ними позже. Среднее время для шифрования в сети — около 20мс. Если время шифрования менее 50мс для достаточно нового процессора или менее 100мс для старого, нативная библиотека BigInteger загружена, то у вас, вероятно, всё в порядке.

source: Get the latest released source code of I2P from <a href="%(downloads)s">the download page</a>, or get the cutting-edge source out of the monotone database mtn.i2p2.de
es: Obtenga las últimas sources de I2P desde <a href="%(downloads)s">la página de descargas</a>, u obtenga el código más actualizado desde la base de datos de monotone en mtn.i2p2.de
id: Dapatkan kode sumber I2P terbaru dari <a href="%(downloads)s">halaman download</a> , atau dapatkan sumber mutakhir dari database monotone mtn.i2p2.de
ro: Obțineți cele mai recente cod-sursă eliberat de I2P de la <a href="%(downloads)s"> pagina de descărcare </ a>, sau de a lua sursa de ultimă oră din mtn.i2p2.de bazei de data monoton
ru: Скачайте последний выпущенный исходный код I2P на <a href="%(downloads)s">странице загрузок</a> или из бд monotone mtn.i2p2.de

source: Inside the source tree change directory to: <code>core/c/jbigi</code>
es: Dentro del directorio de las fuentes cambie a la carpeta: <code>core/c/jbigi</code>
id: Di dalam source tree ubah direktori ke: <code>core/c/jbigi</code>
ro: În interiorul copacului sursă schimbati directorul : <code> core / c / jbigi </ code>
ru: В директории с исходниками перейдите в :<code>core/c/jbigi</code>

source: Read the README file. If you have a /usr/lib/libgmp.so file, you do not have to download GMP. Use the 'dynamic' argument to build.sh. Otherwise, you must download GMP version 5.0.2 from from <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>, saving it to gmp-5.0.2.tar.bz2. If you decide to use a newer version, change the VER= line in <code>core/c/jbigi/build.sh</code>.
es: Lea el archivo README. Si ya tiene un archivo /usr/lib/libgmp.so, no necesita descargar GMP. Use la opción 'dynamic' para build.sh. De otra forma, también puede descargar la versión 5.0.2 de GMP desde href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>, guardándolo como gmp-5.0.2.tar.bz2. Si decide usar una versión más nueva, cambie la línea VER= en <code>core/c/jbigi/build.sh</code>.
id: Baca file README. Jika anda memiliki file /usr/lib/libgmp.so, anda tidak perlu mendownload GMP. Gunakan argumen 'dinamis' untuk build.sh. Jika tidak, anda harus mendownload GMP versi 5.0.2 dari <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>, simpan ke gmp-5.0.2.tar.bz2. Jika anda memutuskan untuk menggunakan versi yang lebih baru, ubahlah VER=line di <code>core/c/jbigi/build.sh</code> .
ro: Citiți fișierul README. Dacă aveți un / usr / lib / libgmp.so fișier, nu trebuie să descărcați GMP. Utilizați argumentul "dinamic", a build.sh. În caz contrar, trebuie să descărcați GMP versiunea 5.0.2 de la de la <a href="http://gmplib.org/#DOWNLOAD"> http://gmplib.org/ # DOWNLOAD </ a>, salvându-l ca GMP-5.0.2.tar.bz2. Dacă vă decideți să utilizați o versiune mai nouă, schimba VER = linie în <code> core / c / jbigi / build.sh </ code>.
ru: Прочитайте файл README. Если у вас есть файл /usr/lib/libgmp.so, то скачивать GMP не требуется. Используйте параметр 'dynamic' для build.sh. В противном случае вам необходимо скачать GMP версии 5.0.2 с <a href="http://gmplib.org/#DOWNLOAD">http://gmplib.org/#DOWNLOAD</a>, сохранив как gmp-5.0.2.tar.bz2. Если вы решите использовать более новую версию, то измените параметр VER= в файле <code>core/c/jbigi/build.sh</code>.

source: Take a look at <code>build.sh</code>, if your <code>JAVA_HOME</code> environment variable is set and you are using Linux then it might just work. Otherwise change the settings. Remember, you need the Java SDK installed.
es: Échele un vistazo a <code>build.sh</code>, si su variable de entorno <code>JAVA_HOME</code> está puesta y usa Linux, simplemente debería funcionar. En caso contrario, cambie las configuraciones. Recuerde, necesita tener instalado el SDK de Java.
id: Lihatlah <code>build.sh</code> , jika <code>JAVA_HOME</code> variabel lingkungan <code>JAVA_HOME</code> anda ditetapkan dan anda menggunakan Linux, maka ini mungkin berfungsi. Jika tidak, ubah pengaturannya. Ingat, anda memerlukan Java SDK.
ro: Aruncati o privire la <code> build.sh </ code>, în cazul în care variabilă de mediu <code> JAVA_HOME </ code> este setata și utilizați Linux, atunci s-ar putea funcționa. Schimba altfel setările. Amintiți-vă, ca aveți nevoie de Java SDK instalat.
ru: Просмотрите <code>build.sh</code>, если переменная окружения <code>JAVA_HOME</code> установлена и вы используете Linux, то всё это может успешно работать. Иначе, измените настройки. Не забудьте, что требуется наличие установленного Java SDK.
