Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: A tunnel to the main IRC server within I2P, Irc2P, is created when I2P is installed (see the <a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel configuration page</a>), and is automatically started when the I2P router starts. To connect to it, tell your IRC client to connect to <code>localhost 6668</code>. XChat-like client users can create a new network with the server <code>localhost/6668</code> (remember to tick &quot;Bypass proxy server&quot; if you have a proxy server configured).
id: Tunnel ke server IRC utama dalam I2P, Irc2P, dibuat saat I2P diinstal (lihat <a href=\"http://localhost:7657/i2ptunnel/index.jsp\">halaman konfigurasi I2PTunnel</a> ), dan otomatis dimulai saat router I2P dimulai. Untuk menghubungkannya, beritahu klien IRC anda untuk terhubung ke <code>localhost 6668</code> . Pengguna klien seperti XChat dapat membuat jaringan baru dengan server <code>localhost/6668</code> (ingat untuk memberi tanda "Bypass proxy server" jika anda memiliki server proxy yang dikonfigurasi).
it: Un tunnel verso il server IRC principale all'interno di I2P, Irc2P, viene creato al momento dell'installazione di I2P (consulta la <a href="http://localhost:7657/i2ptunnel/index.jsp">pagina di configurazione di I2PTunnel</a>) ed è avviato automaticamente quando si avvia il router I2P. Per connetterti, istruisci il tuo client IRC a connettersi a <code>localhost 6668</code>. I client simili a XCha possono creare una nuova rete con il server <code>localhost/6668</code> (ricorda di mettere il segno di spunta sull'opzione &quot;Bypassa il server proxyr&quot; nel caso in cui tu abbia un server proxy preconfigurato).
mg: Fantsona iray manakany amin'ny mpizara IRC ao anatin'ny I2P, Irc2P, dia miforona ho azy rehefa apetraka amin'ny voalohany (jereo ny <a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel configuration page</a>), ary velona ho azy rehefa velona i I2P. Raha hitohy aminy, teneno ny mpanjifa IRC mba hifandray amin'ny <code>localhost 6668</code>. ny mpanjifa XChat sy ny mitovy aminy , dia afaka mamorona tambazotra vaovao miaraka amin'ny mpizara <code>localhost/6668</code> ( tadidio ny mifidy &quot;Bypass proxy server&quot; raha manana mpizara proxy miasa ianao).
pt: Um túnel para o servidor IRC principal dentro do I2P, chamado Irc2P, é criado quando I2P é instalado (veja a <a href="http://localhost:7657/i2ptunnel/index.jsp">Página de configuração I2PTunnel</a>), e é automaticamente iniciado quando o roteador I2P inicia. Para conectar, diga ao seu cliente IRC para conectar em <code>localhost 6668</code>. Usuários de clientes como XChat podem criar uma nova rede com o servidor <code>localhost/6668</code> (lembre-se de assinalar &quot;Ignorar servidor de proxy&quot; se você tem um servidor de proxy configurado).
sv_se: En tunnel till huvud IRC servern inom I2P, Irc2P, skapas när I2P installeras (see <a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel konfigurationssidan</a>), och startas automatiskt när I2P-routern startar. För att ansluta till den, säg till din IRC-klient att ansluta till <code>localhost:6668</code>. XChat-lika klienter kan skapa ett nytt nätverk med servern <code>localhost:6668</code> (kom ihåg att klicka i &quot;Kringå proxy-server&quot; om du har en proxy-server inställd).

source: For security purposes, the router's admin console by default only listens for connections on the local interface. However, with a little hacking, you can make it reachable remotely:
id: Untuk tujuan keamanan, konsol admin router secara default hanya mendengarkan koneksi di interface lokal. Namun, dengan sedikit hacking, anda bisa membuatnya bisa dijangkau dari komputer lain:
it: Per motivi di sicurezza, la console admin del router di default rimane in ascolto soltanto delle connessioni sull'interfaccia locale. Tuttavia, con qualche intervento, puoi fare in modo che sia accessibile da remoto:
mg: Mba ho fitandrona ny loza, ny pejy fibaikoan ny router dia mandry ny fifandraisana eo amin'ny lafiny hita eto antoerana. Fa raha somary amboarina, dia mety ho hita ety ivelany ihany
pt: Por motivo de segurança, o painel administrativo do roteador, por padrão, apenas aguarda conexões na interface local. Entretanto, com uns ajustes, você pode torná-lo alcançável remotamente:
sv_se: Av säkerhetskäl så lyssnar routerns adminkonsol som default efter anslutningar på det lokala nätverksinterface:t. Dock så kan du med lite hackande, nå den bortifrån.

source: Open <code>~/.i2p/clients.config</code> and replace<br /> <code>clientApp.0.args=7657 ::1,127.0.0.1 ./webapps/</code><br /> with <br /> <code>clientApp.0.args=7657 0.0.0.0 ./webapps/</code>
id: Buka <code>~/.i2p/clients.config</code> dan ganti <br /> <code>clientApp.0.args=7657 ::1,127.0.0.1 ./webapps/</code> <br /> dengan <br /> <code>clientApp.0.args=7657 0.0.0.0 ./webapps/</code>
it: Apri <code>~/.i2p/clients.config</code> e sostituisci<br /> <code>clientApp.0.args=7657 ::1,127.0.0.1 ./webapps/</code><br /> con <br /> <code>clientApp.0.args=7657 0.0.0.0 ./webapps/</code>
mg: Sokafy <code>~/.i2p/clients.config</code> dia solohy<br /> <code>clientApp.0.args=7657 ::1,127.0.0.1 ./webapps/</code><br /> amin'ny <br /> <code>clientApp.0.args=7657 0.0.0.0 ./webapps/</code>
pt: Abra <code>~/.i2p/clients.config</code> e substitua<br /> <code>clientApp.0.args=7657 ::1,127.0.0.1 ./webapps/</code><br /> por <br /> <code>clientApp.0.args=7657 0.0.0.0 ./webapps/</code>
sv_se: Öppna <code>~/.i2p/clients.config</code> och ersätt<br /> <code>clientApp.0.args=7657 ::1,127.0.0.1 ./webapps/</code><br /> med <br /> <code>clientApp.0.args=7657 0.0.0.0 ./webapps/</code>

source: Go to <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> and add a console username and password if desired.
id: Kunjungi <a href=\"http://localhost:7657/configui\">http://localhost:7657/configui</a> dan tambahkan nama pengguna dan kata sandi konsol jika diinginkan.
it: Accedi a <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> e aggiungi un nome utente e password per la console se vuoi.
mg: Mandehana any amin'ny <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> dia asio anaran'olona mpampiasa sy teny miafina raha tiana.
pt: Vá para <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> e adicione nome de usuário e senha para o console, se desejado.
sv_se: Gå till <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> och ställ in ett användarnamn och lösenord om det önskas.

source: Go to <a href="http://localhost:7657/index.jsp">http://localhost:7657/index.jsp</a> and hit "Graceful restart", which restarts the JVM and reloads the client applications
id: Kunjungi <a href=\"http://localhost:7657/index.jsp\">http://localhost:7657/index.jsp</a> dan tekan \"Graceful restart\", yang me-restart JVM dan memuat ulang aplikasi klien.
it: Accedi a <a href="http://localhost:7657/index.jsp">http://localhost:7657/index.jsp</a> e fai clic su "Riavvia garbatamente", un'opzione che riavvia la JVM e ricaricare le applicazioni client.
mg: Mandehana any amin'ny <a href="http://localhost:7657/index.jsp">http://localhost:7657/index.jsp</a> dia tsindrio "Graceful restart", izay mamono ny JVM ary mamerina indray ny fampiaran'ny mpanjifa rehetra.
pt: Vá para <a href="http://localhost:7657/index.jsp">http://localhost:7657/index.jsp</a> e clique "Reiniciar educadamente", que reinicia a JVM e recarrega as aplicações do cliente
sv_se: Gå till <a href="http://localhost:7657/index.jsp">http://localhost:7657/index.jsp</a> och klicka på "Graviös omstart", vilket startar om JVM:en och laddar om klient-applikationerna

source: After that fires up, you should now be able to reach your console remotely. Reload the router at http://127.0.0.1:7657 and you will be prompted for the username and password you specified in step 2 above if your browser supports the authentication popup. Note: the <code>0.0.0.0</code> above specifies an <i>interface</i>, not a network or netmask. 0.0.0.0 means "bind to all interfaces", so it can be reachable on 127.0.0.1:7657 as well as any LAN/WAN IP.
id: Setelah itu menyala, kini anda bisa mencapai konsol anda dari jarak jauh. Muat ulang router di http://127.0.0.1:7657 dan anda akan diminta memasukkan nama pengguna dan kata sandi yang anda tentukan di langkah 2 di atas jika browser anda mendukung popup otentikasi. Catatan: <code>0.0.0.0</code> di atas menentukan <i>interface</i>, bukan jaringan atau netmask. 0.0.0.0 berarti \"bind to all interface\", sehingga dapat dicapai pada 127.0.0.1:7657 serta LAN/WAN IP.
it: Dopo d che, dovresti essere in grado di raggiungere la console da remote. Ricarica il router at http://127.0.0.1:7657 e ti sarà richiesto il nome utente e la password che indicato al punto 2 qui sopra se il tuo browser supporta i popup di autenticazione. Nota: l'indirizzo <code>0.0.0.0</code> qui sopra indica l'<i>interfaccia</i>, non la rete o il netmask. 0.0.0.0 significa "lega a tutte le interfacce", per cui può essere raggiunto su 127.0.0.1:7657 e anche da qualunque indirizzo internet di LAN o WAN.
mg: rehefa mandeha tsara, dia tokony ho voasokatra avy eny ivelany ny pejy fibaikoana. Avereno ny router eo amin'ny http://127.0.0.1:7657 dia ho hangatahina anarana sy teny miafina ianao, izay nampidirina teo amin'ny 2. eo ambony ,raha mahazaka ny popup ny fijerenao. Marihina: ny <code>0.0.0.0</code> eo ambony dia manondro <i>interface</i>, fa tsy tambazotra na netmask.0.0.0.0 izay "iombona amin'nyinterfaces rehetra", voasokatra eo amin'ny 127.0.0.1:7657 koa na eo amin'ny LAN/IP WAN.
pt: Depois que iniciar, você deve conseguir alcançar seu painel remotamente. Atualize a página do roteador em http://127.0.0.1:7657 e você será solicipado a digitar o usuário e senha indicados no passo 2 acima, se seu navegador for compatível com autenticação pop-up. Observe: o <code>0.0.0.0</code> acima indica uma <i>interface</i>, não uma rede ou máscara de rede. 0.0.0.0 significa "ligar-se a todas as interfaces", portanto ela é alcançável em 127.0.0.1:7657, assim como de qualquer IP da LAN/WAN.
sv_se: Efter det startat, så borde du nu kunna nu kunna nå din konsol från andra maskiner. Ladda om routerkonsolen på http://127.0.0.1:7657 så kommer du frågas efter det användarnamn och lösenord du angivet i steg 2 ovan om din webbläsare stödjer autentiserings popup:en. Obs: <code>0.0.0.0</code> ovan anger ett <i>interface</i>, och inte ett nätverk eller en nätmask. 0.0.0.0 betyder "bind till alla interface", så att den kan nås från 127.0.0.1:7657 och alla andra LAN/WAN IP-adresser.

source: By default, the router I2CP interface (port 7654) binds to address 127.0.0.1. To bind to 0.0.0.0, set the router advanced configuration option <tt>i2cp.tcp.bindAllInterfaces=true</tt> and restart.
id: Secara default, antarmuka I2CP router (port 7654) bind dengan alamat 127.0.0.1. Untuk mengikat/bind ke 0.0.0.0, atur opsi konfigurasi lanjutan router <tt>i2cp.tcp.bindAllInterfaces=true</tt> dan restart.
it: Come impostazione predefinita, l'interfaccia I2CP del router (porta 7654) si lega all'indirizzo 127.0.0.1. Per legarla a 0.0.0.0, imposta l'opzione di configurazione avanzata del router su router advanced configuration option <tt>i2cp.tcp.bindAllInterfaces=true</tt> e riavvia.
mg: Amin'ny voalohany, ny port 7654 'ny I2P router dia miandry eo amin'ny 127.0.0.1 . Raha hiandry eo amin'ny 0.0.0.0 dia mandehana ao amin'ny router advanced configuration dia jereo <tt>i2cp.tcp.bindAllInterfaces=true</tt> dia vonoy ary velomy indray.
pt: Por padrão, a interface I2CP do roteador (porta 7654) se liga ao endereço 127.0.0.1. Para ligá-la em 0.0.0.0, mude a opção da configuração avançada do roteador como <tt>i2cp.tcp.bindAllInterfaces=true</tt> e reinicie.
sv_se: Som standard så binder I2CP interface:t (port 7654) till adressen 127.0.0.1. För att binda den till 0.0.0.0, sätt det advancerade konfigurationsalternativet <tt>i2cp.tcp.bindAllInterfaces=true</tt> och starta om.

source: Whats an "eepsite"?
he: מה זה "eepsite"?
id: Apa itu "eepsite"?
it: Cos'è un "eepsite"?
mg: Inona no atao hoe "eepsite"?
pt: O que é um "eepsite"?
sv_se: Var är en "eepsite"?

source: An eepsite is a website that is hosted anonymously - you can access it by setting your web browser's HTTP proxy to use the web proxy (typically it listens on localhost port 4444), and browsing to the site.
id: Situs eepsite adalah situs web yang hosted secara anonim - Anda dapat mengaksesnya dengan menyetel proxy HTTP browser web Anda untuk menggunakan proxy web (biasanya terdapat pada port localhost 4444), dan browsing ke situs tersebut.
it: Un eepsite è un sito web ospitato in maniera anonima: puoi accedervi impostando il tuo proxy HTTP del browser per usare un proxy web (che di solito è in ascolto su localhost port 4444) e navigando verso il sito.
mg: Ny atao hoe eepsite dia tranonkala izay nafenina - azo atao ny mijery azy amin'ny fanamboarana ny HTTP proxy ao anaty fijerena tranonkala mba ihaino ao amin'ny 4444.
pt: Um eepsite é um site hospedado anonimamente - você pode acessá-lo configurando o proxy HTTP do seu navegador para usar o proxy da web (tipicamente, aguarda conexões em localhost, porta 4444), e navegando para site.
sv_se: En eepsite är en webbsida som hostas anonymt - du kan nå den genom att ställa in din webbläsare HTTP proxy till att använda webbproxyn (normalt sett lyssnar den på localhost port 4444) och att surfa till sajten.

source: The proxy config for different browsers is on a <a href="%(browserconfig)s"> separate page</a> with screenshots. More advanced configs with external tools are possible but could introduce leaks in your setup.
id: Konfigurasi proxy untuk browser yang berbeda ada di <a href=\"%(browserconfig)s\">halaman terpisah</a> dengan screenshot. Konfigurasi yang lebih advance dengan alat eksternal mungkin dapat dilakukan namun bisa menimbulkan kebocoran pada setup anda.
it: La configurazione del proxy per browser differenti si trova su una <a href="%(browserconfig)s"> pagina separata</a> con i relativi screenshot. Sono possibili configurazioni più avanzate con strumenti esterni ma potrebbero introdurre delle falle nella tua impostazione.
mg: Ny fanamboarana ny proxy hoan'ny fijerena isan'karazany dia eo amin'ny<a href="%(browserconfig)s"> ahitana pejy misaraka</a> misy sary. Fanamboarana lalindalina kokoa miaraka amin'ny fiasana hafa dia mety atao, fa mety hampihisy lavaka ao anaty ny fanamboarana izay nataonao.
pt: A configuração de proxy para diferentes navegadores está numa <a href="%(browserconfig)s"> página separada</a> com capturas de tela. Configurações mais avançadas com ferramentas externas são possíveis, mas podem introduzir vazamentos em sua instalação.
sv_se: Proxyinställningen för olila webbläsare finns på en <a href="%(browserconfig)s">separat sida</a> med skärmdumpar. Flera advancerade inställningar med externa verktyg är gångbara men kan introducera läckor i din installation.

source: x is the number of peers you've sent or received a message from successfully in the last minute, y is the number of peers seen in the last hour or so.
id: x jumlah peers anda telah berhasil dikirim atau diterima pesan di menit terakhir, y adalah jumlah peer yang dilihat dalam satu jam terakhir atau lebih.
it: x è il numero di peer a cui hai inviato o da cui ha ricevuto un messaggio con successo nell'ultimo minuto, y è il numero di peer visti nell'ultima ora all'incirca.
mg: x no isan'ny akama nandraisanao feo na nandefasanao feo tsara tao anatin'ny minitra farany. y dia isan'ny akama hitanao teo amin'ny adin'iray lasa.
pt: x é o nº de peers para/dos quais você enviou/recebeu uma mensagem com sucesso no último minuto, y é o nº de peers vistos na última hora aproximadamente.
sv_se: x är antalet peers du har skickat eller mottaget ett meddelande från den senaste minuten, y är antalet peers som sett på den senaste timmer eller så.

source: The SOCKS proxy is working as of release 0.7.1. SOCKS 4/4a/5 are supported. There is no SOCKS outproxy so it is of limited use.
id: Proxy SOCKS bekerja pada rilis 0.7.1. SOCKS 4/4a/5 didukung. Tidak ada outproxy SOCKS sehingga proxy SOCKS digunakan secara terbatas.
it: Il proxy SOCKS funziona a partire dalla versione 0.7.1. Sono supportati i SOCKS 4/4a/5. Non c'è alcun outproxy SOCKS per cui il suo uso è limitato.
mg: Ny SOCKS Proxy dia miasa nanomboka tamin'ny modely 0.7.1 SOCKS 4/4a/5 dia miasa avokoa. Tsy misy ny SOCKS outproxy , tsy misy ny ilaina azy.
pt: O proxy SOCKS está funcionando a partir da versão 0.7.1. Protocolos SOCKS 4/4a/5 são compatíveis. Não há proxy de saída tipo SOCKS, portanto a funcionalidade é limitada.
sv_se: SOCKS-proxyn fungerar från och med 0.7.1 SOCKS 4/4a/5 stöds. Det finns ingen SOCKS-utproxy så det begränsad nytta.

source: In addition, many applications leak sensitive information that could identify you on the Internet. I2P only filters connection data, but if the program you intend to run sends this information as content, I2P has no way to protect your anonymity. For example, some mail applications will send the IP address of the machine they are running on to a mail server. There is no way for I2P to filter this, thus using I2P to 'socksify' existing applications is possible, but extremely dangerous.
id: Selain itu, banyak aplikasi yang membocorkan informasi sensitif yang dapat mengidentifikasi anda di Internet. I2p hanya menyaring data koneksi, tetapi jika anda bermaksud untuk menjalankan program yang mengirimkan informasi ini sebagai konten, I2P tidak memiliki cara untuk menjaga keanoniman. Misalnya, beberapa aplikasi email akan mengirim alamat IP dari mesin mereka ke email server. Tidak ada cara untuk I2P untuk menyaring ini, karena itu menggunaka I2P untuk mengaplikasikan 'socks' mungkin dilakukan, tapi sangat berbahaya.
it: Inoltre, molte applicazioni rivelano informazioni sensibili che potrebbero farti identificare su Internet. I2P filtra soltanto i dati di connessione, ma se il programma che pensi di eseguire invia tali informazioni come contenuti, I2P non ha modo di proteggere il tuo anonimato. Ad esempio, alcune applicazioni di posta elettronica invieranno al server di posta elettronica l'indirizzo IP del computer su cui vengono eseguite. Non c'è modo per I2P di filtrarlo, perciò la 'socksettizzazione' di applicazioni esistenti è possibilethis, ma pericolosissima.
mg: Ary koa, maro ny fampiarana mandefa zavatra sarobidy momba anao any amin'ny internet. I2P dia manivana ny atin'ny fifandraisana, fa ny fampiarana heritreretinao ho ampiasaina dia mandefa ny vaovao ohatran'ny entana. I2P dia tsy manana fomba iarovana ny momba anao. Ohatra, misy fampiarana mailaka vitsivitsy izay mandefa ny adiresin'ny solon'tsaina ireo dia mihodina eo ambonin'ny mpizara mailaka. Tsy misy fomba ho an'i I2P ny mba hanaovana sivana an'izany, na dia hoe mampiasa an'i I2P mba hanerena ny fampiasan'ny fampiarana socks, fa tena mampididoza.
pt: Ademais, muitas aplicações vazam informações sensíveis que podem te identificar na Internet. I2P apenas filtra dados de conexão, mas se o programa que você pretende rodar envia essa informação em forma de conteúdo, I2P não tem meios de proteger seu anonimato. Por exemplo, algumas aplicações de e-mail enviam o endereço IP da máquina onde estão rodando para um servidor de e-mail. Não há meios para o I2P filtrar isso, portanto usar I2P para "socksificar" aplicações existentes é possível, mas extremamente perigoso.
sv_se: Utöver det, så kan många applikationer läcka känslig information som skulle kunna identifiera dig på internet. I2P filtrerar anslutningsdata, men om programmet du vill köra skickar denhär informationen som innehåll så kan I2P inte skydda din anonymitet. Till exempel, så skickar vissa e-post program ip-adressen av maskinen de kör som e-post-server. Det finns iget vis I2P kan filtrera detta , därför är det extremt farligt att använda I2P för att 'socksifiera' existeranda applikationer.

source: If you would like more information on the socks proxy application anyway, there are some helpful hints on the <a href="%(socks)s">socks page</a>.
id: Jika anda ingin informasi lebih lanjut tentang aplikasi proxy SOCKS, ada beberapa petunjuk di <a href=\"%(socks)s\">SOCKS page</a>.
it: Se desideri comunque ulteriori informazioni sull'applicazione di proxy socks, ecco alcuni suggerimenti utili nella <a href="%(socks)s">pagina di socks</a>.
mg: Raha mila filazana be be kokoa momba ny socks proxy, dia misy fanampiana ato <a href="%(socks)s">socks page</a>.
pt: Se quiser mais informação sobre a aplicação de proxy socks mesmo assim, há algumas dicas úteis na <a href="%(socks)s">página de socks</a>.
sv_se: Om du vill ha mer information om SOCKS-proxy applikationen iallafall, så finns det fler hjälpsamma tips på <a href="%(socks)s">SOCKS</a>-sidan.

source: Okay, here's a rundown of the default ports (everything is configurable through various settings, of course):
id: Oke, berikut ini adalah ikhtisar dari port default (segala sesuatu dikonfigurasi melalui berbagai pengaturan, tentu saja):
it: Bene, ecco un riepilogo delle porte predefinite (ogni cosa è configurabileable tramite svariate impostazioni, ovviamente):
mg: Eny ary, ireto misy lisitry ny ports ( azo ovaina araka izay ilavana azy):
pt: Beleza, aqui está um resumo das portas padrão (tudo é configurável por vários ajustes, claro):
sv_se: Okay, här är en kort lista av standardportarna (allt är konfigurerbart genom olika inställningar, så klart):

source: <b>Internet-facing ports</b> Note: New installs as of release 0.7.8 do not use port 8887; they select a random port between 9000 and 31000 when the program is run for the first time. The selected port is shown on the router <a href="http://127.0.0.1:7657/confignet.jsp">configuration page.</a>
id: Catatan: Instalasi baru pada rilis 0.7.8 tidak menggunakan port 8887; mereka memilih sebuah port secara acak antara 9000 dan 31000 ketika program dijalankan untuk pertama kalinya. Port yang dipilih ditampilkan pada router <a href=\"http://127.0.0.1:7657/confignet.jsp\">halaman konfigurasi.
it: <b>Porte per l'accesso a Internet</b> Nota: le nuove installazioni a partire dalla versione 0.7.8 non usano la porta 8887, ma selezionano invece una porta casuale compresa tra 9000 e 31000 quando il programma viene eseguito per la prima volta. Tale porta è mostrata nellla <a href="http://127.0.0.1:7657/confignet.jsp">pagina di configurazione</a> del router.
mg: <b>Port misokatra any amin'ny Internet</b> Fanamarihana : Ny modely vaovao manomboka 0.7.8 dia tsy mampiasa port 8887; mifidy port an'anjony eo anelanelan'ny 9000 sy 31000 rehefa velona amin'ny voalohany ny fampiarana. Ny port voafidy dia hita eo amin'ny router <a href="http://127.0.0.1:7657/confignet.jsp">configuration page.</a>
pt: <b>Portas em contato com a Internet</b> Atenção: Novas instalações a partir da versão 0.7.8 não usam a porta 8887; elas selecionam uma porta aleatória entre 9000 e 31000 quando o programa é rodado pela primeira vez. A porta selecionada é exibida na <a href="http://127.0.0.1:7657/confignet.jsp">página de configuração</a> do roteador.
sv_se: <b>Internet nåbara portar</b> Notis: Nya installationer sedan release 0.7.8 avänder inte port 8887, de väljer en slumpässig port mellan 9000 och 31000 när programmet körs första gången. Den valda porten visas på routerns <a href="http://127.0.0.1:7657/confignet.jsp">konfigurationssida</a>.
