Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: <a href="%(supported)s#file-sharing">File sharing:</a> ED2K and Gnutella clients, integrated BitTorrent client.
id: <a href=\"%(supported)s#file-sharing\">File sharing:</a> klien ED2K dan Gnutella, klien BitTorrent terintegrasi.
it: <a href="%(supported)s#file-sharing">File sharing:</a> client ED2K e Gnutella, client BitTorrent integrato.
mg: <a href="%(supported)s#file-sharing">Fizarana fisy:</a> ED2K and Gnutella clients, integrated BitTorrent client.
pt: <a href="%(supported)s#file-sharing">Compartilhamento de arquivos:</a> Clientes ED2K e Gnutella, cliente integrado BitTorrent.
sv_se: <a href="%(supported)s#file-sharing">Fildelning:</a> ED2K och Gnutella klienter, integrerad BitTorrent klient.

source: <a href="%(supported)s#decentralized-file-storage">Decentralized file storage:</a> Tahoe-LAFS distributed filesystem plugin.
id: <a href=\"%(supported)s#decentralized-file-storage\">Penyimpanan file yang terdesentralisasi:</a> Plugin filesystem yang didistribusikan oleh Tahoe-LAFS.
it: <a href="%(supported)s#decentralized-file-storage">Deposito file decentralizzato:</a> plugin per il filesystem distribuito Tahoe-LAFS.
mg: <a href="%(supported)s#decentralized-file-storage">Fitehirizana fisy voatsinjara:</a> Tahoe-LAFS distributed filesystem plugin.
pt: <a href="%(supported)s#decentralized-file-storage">Armazenamento descentralizado de arquivos:</a> Plugin Tahoe-LAFS para sistema de arquivos distribuído.
sv_se: <a href="%(supported)s#decentralized-file-storage">Decentraliserad fillagring:</a>Tahoe-LAFS plugin för distribuerat filsystem.

source: <a href="%(supported)s"><em>More supported applications&hellip;</em></a>
id: <a href=\"%(supported)s\"><em>Daftar aplikasi yang didukung&hellip;</em></a>
it: <a href="%(supported)s"><em>Altre applicazioni supportate&hellip;</em></a>
mg: <a href="%(supported)s"><em>Fitaovana azo mbola ampiasaina&hellip;</em></a>
pt: <a href="%(supported)s"><em>Mais aplicações compatíveis&hellip;</em></a>
sv_se: <a href="%(supported)s"><em>Fler stödda applikationer&hellip;</em></a>

source: News &amp; Updates
id: Berita &amp; Pembaruan
it: News &amp; aggiornamenti
mg: Vaovao &amp; Fanatsarana
pt: Notícias e Atualizações
sv_se: Nyheter &amp; Uppdateringar

source: Recommended Links & Resources
he: קישורים ומקורות מומלצים
id: Tautan & Sumber Daya yang Direkomendasikan
it: Link e risorse consigliate
mg: Tranonkala hafa & Fanampiana
pt: Recursos e Hiperligações Recomendados
sv_se: Rekommenderade Länkar & Resurser

source: See also the page with <a href="%(media)s">links to presentations, videos, and tutorials about I2P</a>.
id: Lihat juga halaman dengan <a href=\"%(media)s\">link ke presentasi, video, dan tutorial tentang I2P</a> .
it: "Consulta" anche la pagina con i <a href="%(media)s">link alle presentazioni, ai video e ai tutorial relativi ad I2P</a>.
mg: Jereo koa ny pejy misy <a href="%(media)s">fitohizana mankany amin'ny fampisehoana, sary mihetsika, ary fampianarana momba ny I2P</a>.
pt: Consulte também a página com as <a href="%(media)s">hiperligações para apresentações, vídeos, e tutoriais sobre o I2P</a>.
sv_se: Se också sidan med <a href="%(media)s">länkar till presentationer, videor och guider om I2P</a>.

source: I2P on the web
he: I2P ברשת האינטרנט
id: I2P di internet
it: I2P sul web
mg: I2P eo amin'ny tranonkala
pt: I2P na Web

source: Friends of I2P
he: החברים של I2P
id: Teman-teman dari I2P
it: Amici di I2P
mg: Akaman'ny I2P
pt: Amigos do I2P
sv_se: Vänner till I2P

source: More Projects and Documentation
he: פרויקטים נוספים ותיעוד
id: Proyek dan Dokumentasi Lainnya
it: Altri progetti e documentazione
mg: Tetik'asa sy kirakira samihafa
pt: Mais Projetos e Documentação
sv_se: Fler Projekt och Dokumentation

source: Press
he: לחץ
id: Untuk Press
it: Stampa
mg: Gazety
pt: Imprensa

source: Boards, newssite, others
he: לוחות, אתרי חדשות, אחרים
id: Forum, situs berita, dan lainnya
it: Bacheche, siti di notizie, altri
mg: Solaitra, toeram-baovao, ny hafa rehetra
pt: Fóruns, site de notícias, outros
sv_se: Anslagstavlor, nyhetssida, annat

source: Very Old Stuff
he: דברים מאוד ישנים
id: Bahan-bahan yang sangat lama
it: Materiale molto vecchio
mg: Rakitry ny ela
pt: Coisas Muito Antigas
sv_se: Väldigt Gamla Saker

source: Java Runtime 1.6 or higher. (<a href="%(java)s">Oracle Java Version 7</a>, <a href="%(openjdk)s">OpenJDK 7</a>, or <a href="%(icedtea)s">IcedTea7</a> recommended, except Raspberry Pi: <a href="%(oracle8)s">Oracle 8 Early Access</a>, PowerPC: <a href="%(ibmsdk7)s">IBM SDK 7</a>) <br /> <a href="%(detectjre)s">Determine your installed Java version here</a> or type <tt>java -version</tt> at your command prompt.
it: Java Runtime 1.6 o superiore (<a href="%(java)s">Oracle Java versione 7</a>, <a href="%(openjdk)s">OpenJDK 7</a>, oppure <a href="%(icedtea)s">IcedTea7</a> raccomandati, eccetto Raspberry Pi: <a href="%(oracle8)s">Oracle 8 Early Access</a>, PowerPC: <a href="%(ibmsdk7)s">IBM SDK 7</a>) <br /> <a href="%(detectjre)s">Verifica qui la versione di Java che hai installato</a> o scrivi <tt>java -version</tt> nel prompt dei comandi.

source: select alternate mirror
he: בחר מראה חלופית
it: scegli un mirror alternativo

source: T-Shirts!
he: חולצות!
it: Magliette!
sv_se: T-Shirtar!

source: Datagrams
id: Datagram
it: Datagrammi
pt: Datagramas
sv_se: Datagram

source: Protocols
he: פרוטוקולים
id: Protokol
it: Protocolli
pt: Protocolos
sv_se: Protokoll

source: Protocol stack
he: מחסנית פרוטוקולים
id: Protokol stack
it: Stack del protocollo
pt: Pilha de protocolos
sv_se: Protokollstack

source: Has enough memory been set aside for use by I2P? Look at the memory graph on <a href="http://localhost:7657/graphs">the graphs page</a> to see if the memory usage is "pegged"&mdash;the JVM is spending most of its time in garbage collection. Increase the setting <code>wrapper.java.maxmemory</code> in the file <code>wrapper.config</code>.
id: Apakah cukup memori telah disisihkan untuk digunakan oleh I2P? Lihat grafik memori pada <a href=\"http://localhost:7657/graphs\">halaman grafik</a> untuk melihat jika penggunaan memori adalah \"pegged\" &mdash; JVM menghabiskan sebagian besar waktunya dalam pengumpulan sampah. Meningkatkan pengaturan <code>wrapper.java.maxmemory</code> di file <code>wrapper.config</code> .
it: È stata assegnata sufficiente memoria per usare I2P? Controlla il grafico della memoria nella <a href="http://localhost:7657/graphs">pagina dei grafici</a> per vedere se l'utilizzo della memoria è eccessivo &mdash;, la macchina virtuale Java sta spendendo la maggior parte del tempo nella funzione di garbage collection. Aumenta l'impostazione di <code>wrapper.java.maxmemory</code> nel file <code>wrapper.config</code>.

source: Blog
he: יומן רשת
pt: Blogue
sv_se: Blogg

source: The packages hosted on <a href="https://launchpad.net/%7Ei2p-maintainers/+archive/i2p">the I2P Launchpad site</a> have been tested and <em>should </em>work on x86/x86_64 platforms running:
sv_se: Packets finns på <a href="https://launchpad.net/%7Ei2p-maintainers/+archive/i2p">I2P Launchpad sidan</a> har testats och <em>bör</em> fungera på x86/x86_64 platformer som kör:

source: <a href="#debian">Debian Linux</a> (Wheezy and newer) &amp; <a href="#nonlinux">kFreeBSD</a>
sv_se: <a href="#debian">Debian Linux</a> (Wheezy och senare) &amp; <a href="#nonlinux">kFreeBSD</a>

source: The I2P packages <em>may</em> work on systems not listed above. Please report any issues with these packages on <a href="http://%(trac)s">Trac</a> at <a href="http://%(trac)s">http://%(trac)s</a>.
sv_se: I2P-paketen <em>kan</em> fungera på system som inte listats ovan. Var god rapportera alla problem med dessa paketen på <a href="http://%(trac)s">Trac</a> at⏎ <a href="http://%(trac)s">http://%(trac)s</a>

source: Option 3: <a href="#nonlinux">Non-Linux</a> (and possibly Non-x86 architectures)
sv_se: Alternativ 3: <a href="#nonlinux">Icke-Linux</a> (och mjligen icke-x86 arkitekturer)

source: Instructions for Debian Lenny and newer
sv_se: Instruktioner för Debian Lenny och senare

source: For Squeeze you can follow the instructions <a href="#nonlinux">here</a>.
sv_se: För Squeeze så kan du följa instruktionerna <a href="#nonlinux">här</a>.

source: The steps below should be performed with root access (i.e., switching user to root with "su" or by prefixing each command with "sudo").
sv_se: Nedan steg bör utföras med root-tillgång (d.v.s. byt användare till root med "su" eller genom att använda prefixet "sudo" före alla kommandon)

source: Add the GPG key that signs the repository with the following command:
sv_se: Lägg till GPG-nyckeln som signerar repositoriet med följande kommando:

source: You'll have output like the following if the command was successful:
sv_se: Du kommer se output likt den följande om kommandot lyckades:

source: Add the following entries to <code>/etc/apt/sources.list.d/i2p.list</code>
sv_se: Lägg till följande bitar till <code>/etc/apt/sources.list.d/i2p.list</code>

source: Notify your package manager of the new PPA by entering
sv_se: Meddela din packethanterare om det nya PPA:et genom att skriva

source: This command will retrieve the latest list of software from every repository enabled on your system, including the I2P PPA added in step 1.
sv_se: Dethär kommandot kommer hämta den senaste listan av mjukvara från varje repositorie som används av ditt system, inklusive det nya I2P PPA:et som lades till i steg 1.

source: Instructions for Non-Linux / Non-x86
sv_se: Instruktioner för Icke-Linux / Icke-x86

source: The steps below should be performed with root access (i.e., switching user to root with "<code>su</code>" or by prefixing each command with "<code>sudo</code>").
sv_se: Nedan sted bör utföras med root-tillgång (d.v.s. byt användare till root med "<code>su</su>" eller genom att använda prefixet "<code>sudo</code>").

source: Download the <a href="%(ppa)s">i2p-router</a> package from the <a href="%(ppa)s">PPA</a>. Alternatively, there are unofficial packages available <a href="%(kytv)s">here</a> for <code>armel, armhf, and kfreebsd</code>.
sv_se: Hämta <a href="%(ppa)s">i2p-router</a> paketet från <a href="%(ppa)s">PPA</a>. Alternativt, finns det icke-officiella paket tillgängliga <a href="%(kytv)s">här</a> för <code>armel, armhf, and kfreebsd</code>.

source: Make sure that you have Java installed. Running <em><code>apt-get install default-jre</code></em> should be sufficient.
sv_se: Var på att du har Java installerat. Kör <em><code>apt-get install default-jre</code></em> bör räcka.

source: It is recommended to compile <a href="%(jbigi)s">jbigi</a> for your system to achieve better performance. Instructions are available <a href="%(jbigi)s">here</a>.
sv_se: Att kompilera <a href="%(jbigi)s">jbigi</a> för ditt system rekommenderas för att uppnå högre prestanda. Instruktionerna är tillgängliga <a href="%(jbigi)s">här</a>.

source: Download I2P
sv_se: Hämta I2P

source: Java Runtime 1.5 or higher. (<a href="%(java)s">Oracle Java Version 6/7</a>, <a href="%(openjdk)s">OpenJDK 6/7</a>, or <a href="%(icedtea)s">IcedTea6/7</a> recommended) <br /> <a href="http://java.com/en/download/installed.jsp?detect=jre&amp;try=1">Determine your installed Java version here</a> or type <tt>java -version</tt> at your command prompt.
sv_se: Java Runtime 1.5 eller högre. (<a href="%(java)s">Oracle Java Version 6/7</a>, <a href="%(openjdk)s">OpenJDK 6/7</a>, eller <a href="%(icedtea)s">IcedTea6/7</a> rekommenderas) <br /> <a href="http://java.com/en/download/installed.jsp?detect=jre&amp;try=1">Ta reda på vilken version av Java du har installerad här</a> eller skriv <tt>java -version</tt> i din kommandotolk.

source: I2P can also be downloaded from our project pages on <a href="https://launchpad.net/i2p/trunk">Launchpad</a> and <a href="http://code.google.com/p/i2p/">Google Code</a>.
sv_se: I2P kan också hämtas från vår projekt-sida på <a href="https://launchpad.net/i2p/trunk">Launchpad</a> och <a href="http://code.google.com/p/i2p/">Google Code</a>.

source: ElGamal/AES+SessionTags
he: ‏ElGamal/AES+תגיות סשן
sv_se: ElGamal/AES+SessionsTaggar

source: Ministreaming library
sv_se: Ministrömmande bibliotek

source: Meetings are currently on hold until a more suitable time can be chosen.
sv_se: Möten är pausade för tillfället till en mer lämplig tidpunkt kan väljas.

source: General i2p discussion
sv_se: Generell I2P-diskussion.

source: Help channel
sv_se: Hjälpkanal

source: General I2P discussion - anything that doesn't fit in a different list goes here.
sv_se: Generell I2P discussion - allt som inte hör hemma in andra mailinglistor hör hemma här.

source: While I2P has been reported to run PCs as meagre as a low-end Pentium II with 64 MB of RAM, you'll have a much better experience on a Pentium III (or better) with 128MB of RAM (or more). A <a href="http://%(trac)s/wiki/java">chart comparing the performance</a> of the various JREs can be found at <a href="http://%(trac)s/wiki/java">http://%(trac)s/wiki/java</a>, but in short: it's at all possible, use Sun/Oracle Java or OpenJDK.
sv_se: Medan I2P har rapporterats att köra på maskiner så gamla som en Pentium II med 64 MB RAM, så kommer du ha en mycket bättre upplevelse med en Pentium III (eller bättre) med 128MB RAM (eller mer). Ett <a href="http://%(trac)s/wiki/java">diagram som jämför prestandan</a> av olika JRE:er kan finnas på <a href="http://%(trac)s/wiki/java">http://%(trac)s/wiki/java</a>, men kan sammanfattas som: Om det är alls möjligt, använd Sun/Oracle Java eller OpenJDK.

source: Has enough memory been set aside for use by I2P? Look at the memory graph on <a href="http://localhost:7657/graphs">the graphs page</a> to see if the memory usage is "pegged"&mdash;the JVM is spending most of its time in garbage collection. Increase the setting <code>wrapper.java.maxmemory</code> in <code>wrapper.config</code>.
sv_se: Har tillräkligt med minne reserverats för användning av I2P? Kika på minnes-grafen på <a href="http://localhost:7657/graphs">graf-sidan</a> för att se om minnes-användningen är "maxad"&mdash;JVM:en spenderar merparten av sin tid med garbage collection. Öka inställningen <code>wrapper.java.maxmemory</code> i <code>wrapper.config</code>.

source: <a href="#debian">Debian Linux</a> (Wheezy and newer)
id: <a href=\"#debian\">Debian Linux</a> (Wheezy atau lebih baru)
pt: <a href="#debian">Linux Debian</a> (Wheezy e mais recente)

source: Instructions for Ubuntu 12.04 Precise Pangolin (and newer) and derivatives like Linux Mint &amp; Trisquel
id: Instruksi untuk Ubuntu 12.04 Precise Pangolin (dan terbaru) dan turunannya seperti Linux Mint &amp; Trisquel
pt: Instruções para o Ubuntu 12.04 Precise Pangolin (e mais recente) e derivados, como o Linux Mint & amp; Trisquel

source: Note: If the https address does not work, either:
id: Catatan: If the https address tidak berfungsi, lakukan hal-hal ini:

source: Change the repository address to http://deb.i2p2.no/
id: Ubah alamat repository ke http://deb.i2p2.no/

source: Java Runtime Version 7 or higher. (<a href="%(java)s">Oracle</a>, <a href="%(openjdk)s">OpenJDK</a>, or <a href="%(icedtea)s">IcedTea</a> Java Version 7 or 8 recommended, except Raspberry Pi: <a href="%(arm8)s">Oracle JDK 8 for ARM</a>, PowerPC: <a href="%(ibmsdk7)s">IBM Java SE 7 or 8</a>) <br /> <a href="%(detectjre)s">Determine your installed Java version here</a> or type <tt>java -version</tt> at your command prompt.
id: Java Runtime versi 7 atau lebih tinggi. (<a href=\"%(java)s\">Oracle</a>, <a href=\"%(openjdk)s\">OpenJDK</a>atau versi Java <a href=\"%(icedtea)s\">IcedTea</a> 7 atau 8 dianjurkan, kecuali Raspberry Pi: <a href=\"%(arm8)s\">Oracle JDK 8 untuk ARM</a>, PowerPC: <a href=\"%(ibmsdk7)s\">IBM Java SE 7 atau 8</a>)<br> <a href=\"%(detectjre)s\">cara menentukan versi Java yang diinstal</a> atau jenis <tt>Java -versioni</tt> pada prompt perintah anda.

source: Java 9 support is in development and it is not recommended for general use.
id: Dukungan Java 9 dalam pengembangan dan hal ini tidak dianjurkan untuk penggunaan umum.

source: Release Notes
id: Catatan Rilis
pt: Notas de Lançamento

source: Change Log
id: Change Log/Catatan Perubahan

source: Requires Android 2.3 (Gingerbread) or higher. If you earlier installed I2P, you need to reinstall because we have also changed the release keys.
he: דורש אנדרואיד 2.3 (Gingerbread) או גבוה יותר. אם התקנת I2P קודם לכן, אתה צריך להתקין מחדש, כי החלפנו גם את מפתחות השחרור.
id: Memerlukan Android 2.3 (Gingerbread) atau lebih tinggi. Jika anda sebelumnya meng-installl I2p, anda perlu menginstal ulang I2P karena kami juga telah mengubah release key.

source: Android source is in <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> and on <a href="%(github)s">Github</a>. Android builds require the I2P source. See the documentation in the Android source for additional build requirements and instructions.
id: Source code Android sudah tersedia <a href=\"%(monotoneurl)s#getting-the-i2p-code\">monoton</a> dan ada juga di <a href=\"%(github)s\">Github</a>. Versi Android memerlukan source code dari I2P. Lihat dokumentasi di dalam Android source untuk tambahan persyaratan build dan petunjuk penggunaan.

source: The files are signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
id: File ditandatangani oleh %(signer)s <a href=\"%(signingkey)s\"> yang kuncinya ada di sini</a>.

source: Since 0.9.23, some releases are signed by str4d, whose signing key has been in the router since 0.9.9. Routers older than 0.9.9 will fail to verify update files signed by str4d, and will need to be manually updated using the process below.
id: Sejak versi 0.9.23, beberapa rilis di-signed oleh str4d, di mana signing key telah ada di router sejak versi 0.9.9. Router yang lebih tua dari 0.9.9 akan gagal untuk memverifikasi file update yang ditandatangani oleh str4d, dan akan perlu diupdate secara manual menggunakan proses di bawah ini.

source: The file is signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
id: File ini ditandatangani oleh %(signer)s, <a href=\"%(signingkey)s\">yang kuncinya ada di sini</a>.

source: Proposals
id: Proposal

source: Bittorrent
he: ביטורנט
id: Bittorent

source: Verify I2P
he: אמת I2P
id: Memverifikasi I2P
pt: Verificar o I2P

source: Regularly scheduled project meetings are held on the first Tuesday of every month at 8 PM UTC. Anyone can schedule and run a meeting, by posting the agenda in <a href="%(mtgforum)s">the meetings forum</a>.
id: Pertemuan proyek yang dijadwalkan secara rutin diadakan pada hari Selasa pertama setiap bulan pukul 8 PM UTC. Siapa pun dapat menjadwal dan menjalankan pertemuan, dengan membuat agenda di <a href=\"%(mtgforum)s\">forum pertemuan</a>.

source: Please do not use these email addresses for support requests. These are not public email lists. We do not provide help via email.
he: אנא אל תשתמשו בכתובות דוא"ל אלה לבקשות תמיכה. אלה אינם רשימות תפוצה ציבוריות. אנחנו לא מספקים עזרה באמצעות דואר אלקטרוני.
id: Mohon Jangan gunakan alamat email ini untuk permintaan support. Ini bukan daftar email publik. Kami tidak memberikan bantuan melalui email.

source: Is installing Java required to use I2P?
id: Apakah menginstal Java yang diperlukan untuk menggunakan I2P?

source: An I2P router only needs to be seeded once, to join the network for the first time. Reseeding involves fetching multiple "RouterInfo" files (bundled into a signed zip-file) from at least two predefined server URLs picked from a volunteer-run group of clearnet HTTPS servers.
id: Router I2P hanya perlu mendapat seed satu kali untuk bergabung dengan jaringan untuk pertama kalinya. Reseeding melibatkan pengambilan beberapa file "RouterInfo" (dibundel menjadi file zip bertanda tangan) dari setidaknya dua URL server yang telah ditentukan yang diambil dari kelompok server clearnet HTTPS yang dikelola secara sukarela.

source: A typical symptom of a failed reseed is the "Known" indicator (on the left sidebar of the router console) displaying a very small value (often less than 5) which does not increase. This can occur, among other things, if your local firewall limits outbound traffic or if the reseed request is blocked entirely.
id: Gejala khas reseed yang gagal adalah indikator "Known" (di bilah sisi kiri konsol router) yang menampilkan nilai yang sangat kecil (seringkali kurang dari 5) yang tidak bertambah. Hal ini dapat terjadi, antara lain, jika firewall lokal anda membatasi lalu lintas keluar atau jika permintaan reseed diblokir seluruhnya.

source: If you are stuck behind an ISP firewall or filter, you can use the following manual method (non-automated technical solution) to join the I2P network.
id: Jika Anda terjebak di balik firewall atau filter ISP, anda dapat menggunakan metode manual berikut (solusi teknis non-otomatis) untuk bergabung dengan jaringan I2P.

source: Joining the I2P Network using a reseed file
id: Bergabung dengan Jaringan I2P dengan menggunakan file reseed

source: Please contact a known trustworthy friend who has a running I2P router, and ask them for help with reseeding your I2P router. Request that they send you a reseed file exported from their running I2P router. It is vital that the file is exchanged over a secure channel, e.g. encrypted to avoid external tampering (PGP Sign, Encrypt and Verified with a trusted public key). The file itself is unsigned, so please accept files only from known trusted friends. Never import a reseed file if you can not verify its source.
id: Silahkan hubungi teman terpercaya yang diketahui yang memiliki router I2P yang sedang berjalan, dan mintalah bantuan untuk memperbaiki reseed router I2P anda. Minta mereka mengirimkan reseed file dari router I2P yang sedang berjalan. Sangat penting bahwa file dikirim melalui saluran yang aman, mis. dienkripsi untuk menghindari gangguan eksternal (PGP Sign, Encrypt dan Verified with a trusted public key). File itu sendiri tidak bertanda tangan, jadi tolong terima file hanya dari teman terpercaya yang dikenal. Jangan pernah mengimpor file bekas jika anda tidak dapat memverifikasi sumbernya.

source: To import the received %(filename)s file into your local I2P router:
id: Untuk mengimpor file %(filename)s yang diterima ke router I2P lokal anda:

source: Go to <a href="%(url)s">%(url)s</a>
id: Kunjungi <a href="%(url)s">%(url)s</a>

source: Under "Manual Reseed from File" click "Browse..."
id: Di menu "Manual Reseed from File" klik "Browse..."

source: Select the %(filename)s file
id: Pilih file %(filename)s

source: Click "Reseed from File"
id: Klik "Reseed from File"

source: Check the <a href="%(url)s">log</a> for the following message:
id: Cek <a href="%(url)s">log</a> untuk pesan ini:

source: Sharing a reseed file
id: Berbagi file yang telah di-reseed

source: For trusted friends you can use your local I2P router to give them a jump start:
id: Untuk teman tepercaya, anda dapat menggunakan router I2P lokal anda untuk membantu mereka untuk memulai:

source: Under "Create Reseed File" click "Create reseed file"
id: Di menu "Create Reseed File" klik "Create reseed file"

source: Securely send the %(filename)s file to your friend
id: Kirim secara aman file %(filename)ske teman anda
