Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: Alternately, you can fetch the source from <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> or via Git from <a href="%(gitrepo)s">git.repo.i2p</a> or <a href="%(github)s">Github</a>. <br /> Run <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> then either run the GUI installer or headless install as above.
he: לחילופין, אתם יכולים להוריד את קבצי המקור מ־<a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> או דרך גיט בכתובת <a href="%(gitrepo)s">git.repo.i2p</a> או מ<a href="%(github)s">גיטהאב</a>. <br /> הריצו <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> ולאחר מכן הריצו את ההתקנה הגרפית או את ההתקנה בשורת הפקודה כפי שמתואר לעיל.
id: Atau, anda dapat mengambil source code dari <a href=\"%(monotoneurl)s#getting-the-i2p-code\">monotone</a> atau melalui Git dari <a href=\"%(gitrepo)s\">git.repo.i2p</a> atau <a href=\"%(github)s\">Github</a>. <br/> Jalankan <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> kemudian Jalankan GUI installer atau install secara headless seperti di atas.
it: In alternativa, puoi recuperare la fonte su <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> o tramite Git su <a href="%(gitrepo)s">git.repo.i2p</a> oppure <a href="%(github)s">Github</a>. <br /> Esegui <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> quindi esegui l'installazione grafica o l'installazione non interattiva come sopra.
mg: Azo atao koa ny maka ny entana avy any ampotony , eto,<a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> na avy amin'ny Git, avy eo amin'ny <a href="%(gitrepo)s">git.repo.i2p</a> or <a href="%(github)s">Github</a>. <br /> Alefaso ny <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> na koa alefaso ny mpametraka ara-grafika na mpametraka tsotra ohatran'ny eo ambony.
pt: Alternativamente, você pode buscar a fonte no <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> ou via Git em <a href="%(gitrepo)s">git.repo.i2p</a> ou <a href="%(github)s">Github</a>. <br /> Rode <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> e em seguida rode ou o instalador gráfico ou a instalação normal, conforme acima.
sv_se: Alternativt, så kan du hämta källkoden från <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> eller via Git från <a href="%(gitrepo)s">git.repo.i2p</a> eller <a href="%(github)s">Github</a>. <br /> Kör code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> och sedan antingen kör GUI installeraren eller den icke-grafiska installeraren som ovan.

source: The files are signed by zzz, <a href="%(signingkey)s">whose key is here</a>.
he: הקבצים חתומים על־ידי zzz, ‏<a href="%(signingkey)s">שהמפתח שלו נמצא כאן</a>.
it: I file sono firmati da zzz, <a href="%(signingkey)s">la cui chiave si trova qui</a>.
mg: Ny fisy dia voasonian'i zzz, <a href="%(signingkey)s">ato no ahitanao izany sonia izany</a>.
sv_se: Filerna är signerade av zzz, <a href="%(signingkey)s">vars nyckel finns här</a>.

source: Updates from earlier releases:
he: עדכונים מגרסאות קודמות:
id: Pembaruan dari rilis sebelumnya:
it: Aggiornamento da versioni precedenti:
mg: Fanavaozana avy amin'ny modely taty aoriana:
pt: Atualizações de lançamentos anteriores:
sv_se: Uppdateringar från tidigare releaser:

source: Both automatic and manual upgrades are available for the release.
he: עדכונים אוטומטיים וגם ידניים אפשריים עבור גרסת שחרור זו.
id: Upgrade otomatis dan manual sudah tersedia untuk rilis.
it: sono disponibili sia gli aggiornamenti automatici che manuali per questa versione.
mg: Ny fanatsarana otomatika sy atao an-tanana dia misy daholo hoan'ity modely ity.
pt: As atualizações automáticas e manuais estão ambas disponíveis para lançamento.
sv_se: Både automatiska och manuella uppdateringatr är tillgängliga för releasen.

source: Automatic updates
he: עדכונים אוטומטיים
id: Pembaruan otomatis
it: Aggiornamenti automatici
mg: Fanavaozana otomatika
pt: Atualizações Automáticas
sv_se: Automatiska uppdateringar

source: If you are running 0.7.5 or later, your router should detect the new release. To upgrade simply click the 'Download Update' button on your router console when it appears.
he: אם אתם מריצים 0.7.5 ומעלה, הנתב שלכם אמור לגלות את הגרסה החדשה. על־מנת לשדרג, פשוט לחצו על כפתור 'הורדת עדכון' בממשק הנתב כאשר הוא מופיע.
id: Jika anda menjalankan versi 0.7.5 atau lebih baru, router anda seharusnya mendeteksi rilis terbaru. Untuk meng-upgrade cukup klik tombol 'Download Update' pada router console anda ketika tombol tersebut muncul.
it: Se usi la versione 0.7.5 o successiva, il tuo router dovrebber rilevare la presenza di una nuova versione. Per aggiornare, fai semplicemente clic su 'Scarica aggiornamento' nel console router quando appare.
mg: Raha mampiasa modely 0.7.5 na tany aloha dia tokony ho hitan'ny router ny fanavaozana vaovao.Raha hanao fanavaozana dia tsindrio ny bokotra 'Ampidino ny fanavaozana' eo amin'ny router rehefa mipoitra izy.
pt: Se está a executar a versão 0.7.5 ou superior, o seu roteador deverá detetar o novo lançamento. Para atualizar basta clicar em 'Transferir Atualização' na consola do seu roteador quando esta aparecer.
sv_se: Om du kör 0.7.5 eller senare, bör din router hitta den nya releasen. För att uppgradera snabbt, klicka helt enkelt på "Hämta uppdatering"-knappen på din routerkonsol när den syns.

source: Due to a bug in release 0.7.6, those whose first I2P installation was that version and have not upgraded manually may get a "downloaded version is not greater than current version" error, and should use the manual update method below.
he: עקב תקלה בגרסה 0.7.6, מי שזו הייתה גרסת ההתקנה הראשונה שלו ולא ביצע עדכון ידני עשוי לקבל שגיאת "הגרסה שירדה אינה עדכנית יותר מהנוכחית", ועליו להשתמש בשיטת העדכון הידני המתוארת להלן.
it: A causa di un bug nella versione 0.7.6, chi ha installato I2P per la prima volta con quella versione e non ha aggiornato manualmente potrebbe ricevere un errore "versione scaricata non maggiore di quella attuale", e dovrebbe quindi usare il metodo di aggiornamento manuale qui sotto.
mg: Noho ny tsy fihetezana kely teo amin'ny modely 0.7.6, ho an'ireo nametraka ny I2P voalahoany amin'io modely io ka tsy nanavao dia mety mahazo "downloaded version is not greater than current version" soratra, ary tokony hanao ny fanavaozana amin'izao fomba izao.
sv_se: På grund av en bugg i 0.7.6, de vars första I2P installation var den versionen och inte har uppdaterat manuellt kan får ett "nedladdad version är inte nyare är den nuvarande versionen"-fel, och bör använda den manuella uppdatering nedan.

source: If you are running 0.7.4 or earlier, please see <a href="%(blogpost)s">the 0.7.5 release notes</a> for important information about how to configure your router to automatically receive the release.
he: אם אתם מריצים את 0.7.4 או גרסה מוקדמת יותר, נא ראו את <a href="%(blogpost)s">הערות השחרור של 0.7.5</a> המכילות מידע חשוב כיצד להגדיר את הנתב שלכם כך שיקבל את גרסת השחרור אוטומטית.
it: Se usi la versione 0.7.4 o precedente, consulta le <a href="%(blogpost)s">note della versione 0.7.5</a> per informazioni importanti su come configurare il router per ricevere la versione in automatico.
mg: Raha mampiasa modely 0.7.4 na teo aloha, azafady mba jereo ny <a href="%(blogpost)s">Filazana madinika momba ny modely 0.7.5</a> izay tsy azo tsinontsinoavana, satria io no hanomanana ny router, ny handraisany io fanatsarana io amin'ny fomba otomatika.
sv_se: Om du kör 0.7.4 eller tidigare, var god se <a href="%(blogpost)s">0.7.5 releasekommentarerna</a> för viktig information om hur du bör konfigurera din router för att automatiskt ta emot releasen.

source: If you are running 0.6.1.30 or earlier, please see <a href="%(instructions)s">instructions</a> for important information about how to configure your router to automatically receive the release.
he: אתם את מריצים את 0.6.1.30 או גרסה מוקדמת יותר, נא ראו את ה<a href="%(instructions)s">הוראות</a>, שמכילות מידע חשוב כיצד להגדיר את הנתב שלכם כך שיקבל את גרסת השחרור אוטומטית.
it: Se usi la versione 0.6.1.30 o precedente, consulta le <a href="%(instructions)s">istruzioni</a> per informazioni importanti su come configurare il router per ricevere la versione in automatico.
mg: Raha mampiasa modely 0.6.1.30 na tao aloha, azafady mba jereo ny <a href="%(instructions)s">torohevitra</a> momba ny hikarakarana ny router, ny mba handraisany ireo fanavaozana ireo amin'ny fomba otomatika.
sv_se: Om du kör 0.6.1.30 eller tidigare, var god se <a href="%(instructions)s">instruktioner</a> för viktig information om hur du konfigurerar din router för att automatiskt ta emot releasen.

source: If you have reconfigured your router following the <a href="%(instructions)s">instructions</a>, you should see a link on your <a href="http://localhost:7657/index.jsp">router console</a> allowing you to download and install the new release by just clicking on that link.
he: אם הגדרתם את תצורת הנתב על־פי ה<a href="%(instructions)s">הוראות</a>, אתם אמורים לראות קישור ב<a href="http://localhost:7657/index.jsp">ממשק הנתב</a> המאפשר להוריד ולהתקין את גרסת השחרור החדשה פשוט על־ידי לחיצה על הקישור.
it: Se hai riconfigurato il router seguendo le <a href="%(instructions)s">istruzioni</a>, dovresti vedere un link nel <a href="http://localhost:7657/index.jsp">console router</a> che ti consente di scaricare e installare la nuova versione semplicemente facendo clic sul link.
mg: Raha namboarina nifanahaka amin'ny <a href="%(instructions)s">instructions</a>, dia tokony ahita mpampifandray eo amin'ny <a href="http://localhost:7657/index.jsp">router console</a> allowing ianao ny mba ampidinana ary ny hametrahana ny fanavaozana vaovao, tsindrio fotsiny eo amin'io mpampifandray io.
sv_se: Om du har omkonfigurerat din router med hjälp av<a href="%(instructions)s">instruktioner</a>, bör du se en länk på din <a href="http://localhost:7657/index.jsp">routerkonsol</a> som låter dig hämta och installera den nya releasen genom klicka på den länken.

source: Alternately, you can use the manual method specified below.
he: לחילופין, ניתן להשתמש בשיטה הידנית המתוארת להלן.
it: In alternativa, puoi usare il metodo manuale come spiegato qui sotto.
mg: Azonao atao koa ny mampiasa ity fomba atao tanana iray ity:
sv_se: Alternativ, kan du använda den manuella metod som visas under.

source: Manual updates
he: עדכונים ידניים
id: Update manual
it: Aggiornamenti manuali
mg: Fanavaozana amin'ny tanana
pt: Atualizações manuais
sv_se: Manuella uppdateringar

source: Download that file to your I2P installation directory and <b>rename as i2pupdate.zip</b>. (alternately, you can get the source as above and run "ant updater", then copy the resulting i2pupdate.zip to your I2P installation directory). You do NOT need to unzip that file.
he: הורידו קובץ זה לתיקיית ההתקנה של I2P ו<b>שנו את שמו ל־i2pupdate.zip</b>. (לחילופין, ניתן להוריד את המקור כמתואר לעיל ולהריץ "ant updater", ואז להעתיק את הקובץ i2pupdate.zip שנוצר אל תוך תיקיית ההתקנה של I2P). <b>אינכם</b> צריכים לחלץ את הקבצים מתוך הארכיון.
id: file tersebut ke direktori instalasi I2P anda dan <b>ubah nama sebagai i2pupdate.zip</b>. (atau, anda bisa mendapatkan source code seperti di atas dan menjalankan \"ant updater\", kemudian salin\ i2pupdate.zip yang dihasilkan ke direktori instalasi I2P). anda TIDAK PERLU untuk men-unzip file tersebut.
it: Scarica il file nella cartella di installazione di I2P e <b>rinominalo come i2pupdate.zip</b>. (in alternativa, puoi ottenere il sorgente come sopra ed eseguire "ant updater", quindi copiare il file risultante nella cartella di installazione di I2P). NON occorre scompattare il file.
mg: Ampidino ho eo amin'ny toeran'ny I2P nao io fisy io dia <b>ovay anarana ho i2pupdate.zip</b>. (azo atao koa ny maka eny ampotony ohatran'ny eo ambony dia alefa ny "ant updater", ary adika ny ny i2pupdate.zip ho eo amin'ny toerana misy ny I2P). TSY ilaina ny mi-unzip io fisy io.
pt: Baixe aquele arquivo para o seu diretório de instalação do I2P e <b>renomeie como i2pupdate.zip</b>. (alternativamente, você pode pegar o código-fonte da forma acima e rodar "ant updater", então copie o i2pupdate.zip resultante para seu diretório de instalação do I2P). Você NÃO precisa descompactar esse arquivo.
sv_se: Hämta den filen till din I2P installations-mapp och <b>byt namn till i2pupdate.zip</b>. (alternativt, du kan hämta källkoden som ovan och kör "ant updater", kopiera sedan den resulterande i2pupdate.zip till din I2P installationsmapp). Du behöver INTE unzippa den filen.

source: Click <a href="http://localhost:7657/configservice.jsp">"Restart"</a>
he: לחצו <a href="http://localhost:7657/configservice.jsp">"אתחול"</a>
id: Klik <a href="http://localhost:7657/configservice.jsp">"Restart" </a>
it: Fai clic su <a href="http://localhost:7657/configservice.jsp">"Riavvia"</a>
mg: Tsindrio <a href="http://localhost:7657/configservice.jsp">"Restart"</a>
pt: Clique em <a href="http://localhost:7657/configservice.jsp">"Reiniciar"</a>
sv_se: Klicka på <a href="http://localhost:7657/configservice.jsp">"Starta om"</a>.

source: Grab a cup of coffee and come back in 11 minutes
he: קחו לכם כוס קפה וחזרו בעוד 11 דקות
id: Ambil secangkir kopi dan kembali dalam 11 menit
it: Vai a bere un caffè e ritorna tra 11 minuti
mg: Mandraisa Café, dia miandrasa 11 minitra eo ho eo
pt: Pegue numa chávena de café e volte em 11 minutos
sv_se: Hämta en kopp kaffe och kom tillbaka om 11 minuter.

source: The file is signed by zzz, <a href="%(signingkey)s">whose key is here</a>.
he: הקובץ חתום על־ידי zzz, ‏<a href="%(signingkey)s">שהמפתח שלו נמצא כאן</a>.
it: Il file è firmato da zzz, <a href="%(signingkey)s">la cui chiave si trova qui</a>.
mg: Ny fisy dia voasonian'i zzz, <a href="%(signingkey)s">ato no ahitanao izany sonia izany</a>.
sv_se: Filen är signerad av zzz, <a href="%(signingkey)s">vars nyckel finns här</a>.

source: Previous Releases
he: גרסאות קודמות
id: Rilis sebelumnya
it: Versioni precedenti
mg: Modely rehetra teo aloha
pt: Lançamentos Anteriores
sv_se: Tidigare Releaser

source: Previous releases are available on <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> and <a href="https://launchpad.net/i2p/trunk">Launchpad</a> and within the I2P network on <a href="http://%(echelon)s/">%(echelon)s</a>.
he: ניתן למצוא גרסאות קודמות ב<a href="http://code.google.com/p/i2p/downloads/list?can=1">גוגל קוד</a>, ב־<a href="https://launchpad.net/i2p/trunk">Launchpad</a> ובתוך רשת ה־I2P בכתובת <a href="http://%(echelon)s/">%(echelon)s</a>.
id: Rilis sebelumnya tersedia pada <a href=\"http://code.google.com/p/i2p/downloads/list?can=1\">Google Code</a> dan <a href=\"https://launchpad.net/i2p/trunk\">Launchpad</a> dan dalam jaringan I2P <a href=\"http://%(echelon)s/\">%(echelon)s</a>s.
it: Le versioni precedenti sono disponibli su <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> e <a href="https://launchpad.net/i2p/trunk">Launchpad</a> , nonché sulla rete I2P all'indirizzo <a href="http://%(echelon)s/">%(echelon)s</a>.
mg: Ny modely teo aloha dia azo alaina ato <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> ary <a href="https://launchpad.net/i2p/trunk">Launchpad</a> sy ao amin'ny tambazotra I2P ato amin'ny <a href="http://%(echelon)s/">%(echelon)s</a>.
pt: Versões anteriores estão disponíveis no <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> e no <a href="https://launchpad.net/i2p/trunk">Launchpad</a> bem como na rede I2P em <a href="http://%(echelon)s/">%(echelon)s</a>.
sv_se: Tidigare releaser finns tillgängliga på <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> och <a href="https://launchpad.net/i2p/trunk">Launchpad</a> och inom I2P-nätverket på <a href="http://%(echelon)s/">%(echelon)s</a>.

source: After running the installer on windows, simply click on the "Start I2P" button which will bring up the <a href="http://localhost:7657/index.jsp">router console</a>, which has further instructions.
he: לאחר הרצת תוכנת ההתקנה על חלונות, פשוט לחצו על הכפתור "התחל את I2P", מה שיפתח את <a href="http://localhost:7657/index.jsp">ממשק הנתב</a> המכיל הוראות נוספות.
id: Setelah menjalankan installer Windows, klik tombol \"Mulai I2P\" yang akan memunculkan <a href=\"http://localhost:7657/index.jsp\">router console</a>, yang memiliki instruksi lebih lanjut.
it: Dopo aver eseguito l'installazione su Windows, fai semplicemente clic sul pulsante "Avvia I2P" che richiama la <a href="http://localhost:7657/index.jsp">router console</a>, che contiene ulteriori istruzioni.
mg: Rehefa avy nandefa ny fametrahana teo amin'ny widows, dia tsindrio fotsiny ny bokotra "Start I2P" izay hanaokatra ny pejy <a href="http://localhost:7657/index.jsp">router console</a>, izay manana toromarika hafa any aloha any.
pt: Depois de executar o instalador no Windows, basta clicar em "Iniciar I2P" que mostrará a <a href="http://localhost:7657/index.jsp">consola do roteador</a>, que tem mais instruções.
sv_se: Efter installationsmjukvaran körs på windows, klicka helt enkelt på "Start I2P"-knappen som kommer öppna <a href="http://localhost:7657/index.jsp">router konsolen</a>, som har vidare instruktioner.

source: On Unix-like systems, I2P can be started as a service using the "i2prouter" script, located in the directory you selected for I2P. Changing to that directory in a console and issuing "sh i2prouter status" should tell you the router's status. The arguments "start", "stop" and "restart" control the service. The <a href="http://localhost:7657/index.jsp">router console</a> can be accessed at its usual location. For users on OpenSolaris and other systems for which the wrapper (i2psvc) is not supported, start the router with "sh runplain.sh" instead.
he: במערכות דמויות יוניקס, ניתן להריץ את I2P כשירות על־ידי שימוש בתסריט "i2prouter" הממוקם בתיקיה שבחרתם עבור I2P. מעבר לתיקיה זו והרצת הפקודה "sh i2prouter status" יאמר לכם מה מצב הנתב. הארגומנטים ‏"start", ‏"stop" ו־"restart" שולטים על השירות. ניתן להיכנס ל<a href="http://localhost:7657/index.jsp">ממשק הנתב</a> במיקום הרגיל שלו. עבור משתמשים של OpenSolaris ומערכות אחרות בהן העוטף (i2psvc) אינו נתמך, הריצו את הנתב עם הפקודה "sh runplain.sh" במקום זאת.
id: Pada sistem Unix-like, I2P dapat dimulai sebagai service menggunakan skrip \"i2prouter\", yang terletak di direktori yang dipilih untuk I2P. Mengubah ke direktori tersebut di konsol dan mengeluarkan \"sh i2prouter status\" seharusnya memberitahu router status. Argumen \"mulai\", \"berhenti\" dan \"restart\" mengendalikan service I2P. <a href=\"http://localhost:7657/index.jsp\">router console</a> dapat diakses di lokasi yang biasa. Untuk pengguna OpenSolaris atau sistem lain di mana wrapper (i2psvc) tidak didukung, start router dengan "sh runplain.sh
it: Sui sistemi Unix e simili, I2P può essere avviato come un servizio usando lo script "i2prouter" che si trova nella cartella che hai selezionato per I2P. Accedere a quella cartella in un terminale ed eseguire il comando "sh i2prouter status" dovrebbe indicarti lo stato del router. Gli argomenti "start", "stop" e "restart" controllano il servizio. Puoi accedere alla <a href="http://localhost:7657/index.jsp">router console</a> nella sua posizione usuale. Gli utenti su OpenSolaris e altri sistemi per i quali il wrapper (i2psvc) non è supportato dovrebbero invece avviare il router con "sh runplain.sh".
mg: Ho an'ny solon-tsaina mampiasa UNIX, i I2P dia azo velomina ho servisy amin'ny alalan'ny fampiasana ny baiko "i2prouter", izay hita ao anaty toerena nofidiana nampetrahana azyteny ambohaloany. Mandehana ao amin'io toerana io, ary ny "sh i2prouter status" dia hilaza ny fipetraky ny router. Ny baiko "start", "stop" and "restart" dia mibaiko ny servisy. Ny <a href="http://localhost:7657/index.jsp">router console</a> dia azo jerena ao amin'ny toerany mahazatra. Ho an'ny mampiasa OpenSolaris sy ireo solon'tsaina hafa izay tsy mahazaka ny wrapper (i2psvc) dia ity kosa no baiko ampiasaina "sh runplain.sh" .
pt: Em sistemas da família Unix, o I2P pode se iniciar como serviço usando o script "i2prouter", localizado no duretório que você selecionou para o I2P. Indo para esse diretório por um terminal e digitando "sh i2prouter status" exibirá o status do roteador. Os parâmetros "start", "stop" e "restart" controlam o serviço. O <a href="http://localhost:7657/index.jsp">console do roteador</a> pode ser acessado de sua localização usual. Para usuários do OpenSolaris e outros sistemas para os quais o wrapper (i2psvc) incompatível, dêem partida no roteador com "sh runplain.sh".
sv_se: På Unix-lika system, kan I2P startas som en tjänst, med hjälp av "i2prouter" skriptet, som finns i mappen du installerade I2P i. Byt till den mappen i en kommandotolk och skriv "sh i2prouter status" bör berätta om routerns status. Argumenten "start", "stop" och "restart" kontrollerar tjänsten. <a href="http://localhost:7657/index.jsp">Routerkonsolen</a> kan nås från sin vanliga position. För användare av OpenSolares och andra system för vilka wrappern (i2psvc) inste stöds, starta routern med "sh runplain.sh" istället.
