Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: How do I connect to IRC within I2P?
he: כיצד מתחברים ל־IRC בתוך I2P?
id: Bagaimana mengakses IRC dalam I2P?
it: Come mi connetto a IRC all'interno di I2P?
mg: Ahoana no fomba hifandraisako amin'ny IRC avy ao anaty I2P?
pt: Como eu conecto no IRC dentro do I2P?
sv_se: Hur ansluter jag till IRC inom I2P?

source: I can't access regular Internet sites through I2P.
he: אינני מצליח/ה לגשת לאתרי אינטרנט רגילים דרך I2P.
id: Saya tidak dapat mengakses situs Internet biasa melalui I2P.
it: Non riesco ad accedere a siti Internet normali tramite I2P.
mg: Tsy tafihiditra ny tranonkala ara-dalàna avy amin'i I2P aho
pt: Não consigo acessar sites regulares da Internet através do I2P.
sv_se: Jag kan inte nå vanliga internetsidor genom I2P.

source: I can't access https:// or ftp:// sites through I2P.
he: אינני יכול/ה לגשת לאתרי https://‎ או ftp://‎ דרך I2P.
id: Saya tidak dapat mengakses situs https:// atau ftp:// melalui I2P.
it: Non riesco ad accedere a siti https:// o ftp:// tramite I2P.
mg: Tsy tafihiditra https:// na ftp:// avy amin'i I2P aho.
pt: Não consigo acessar sites https:// ou ftp:// através do I2P.
sv_se: Jag kan inte nå https:// eller ftp:// -sidor genom I2P.

source: Is it possible to use I2P as a SOCKS proxy?
he: האם ניתן להשתמש ב־I2P בתור מתווך SOCKS?
id: Apakah mungkin untuk menggunakan I2P sebagai SOCKS proxy?
it: È possibile usare I2P come proxy SOCKS?
mg: Azo atao ve ny mampiasa an'i I2P ho SOCKS proxy?
pt: É possível usar I2P como um proxy SOCKS?
sv_se: Är det möjligt att använda I2P som en SOCKS5-proxy?

source: How do I configure my browser?
he: כיצד להגדיר את הדפדפן שלי?
id: Bagaimana cara mengkonfigurasi browser saya?
it: Come devo configurare il browser?
mg: Ahoana no hanomanako ny browser ko ?
pt: Como faço para configurar meu navegador?
sv_se: Hur ställer jag in min webbläsare?

source: How can I access the web console from my other machines or password protect it?
he: כיצד לגשת לממשק הרשת של הנתב ממחשבים אחרים או להגן עליו עם ססמה?
id: Bagaimana saya dapat mengakses console web dari mesin saya yang lain atau melindunginya dengan password?
it: Come posso accedere alla web console dagli altri miei computer o proteggerla con una password?
mg: Ahoana ho ahafahako mahazo ny web console avy amin'ny milina hafa ary miaro azy amin'ny teny miafina?
pt: Como posso acessar o painel web a partir das minhas outras máquinas ou protegê-lo com senha?
sv_se: Hur kan jag nå webkonsolen från mina andra maskiner eller lösenordsskydda den?

source: How can I use applications from my other machines?
he: כיצד לגשת ליישומים ממחשבים אחרים?
id: Bagaimana cara menggunakan aplikasi dari mesin saya yang lain?
it: Come posso usare le applicazioni dagli altri miei computer?
mg: Ahoana ny fomba fanaovako fampiarana avy amin'ny milina hafa?
pt: Como posso usar aplicações a partir das minhas outras máquinas?
sv_se: Hur kan jag använda applikationer från mina andra maskiner?

source: How do I reseed manually?
he: כיצד אוכל לזרוע באופן ידני?
id: Bagaimana saya melakukan reseed secara manual?
it: Come posso effettuare il reseed manualmente?
mg: Ahoana ny fomba hanaovako reseed ?
pt: Como realizo propagação manualmente?
sv_se: Hur reseed:ar jag manuellt?

source: My router is using too much CPU?!?
he: הנתב שלי משתמש ביותר מדי כוח עיבוד?!?
id: Router saya terlalu banyak menggunakan CPU?!?
it: Il mio router usa troppa CPU?!?
mg: Mampiasa CPU be loatra ny router ko ?!?
pt: Meu roteador está usando muita CPU?!?
sv_se: Min router använder för mycket CPU?!?

source: Misconception
he: תפיסה מוטעית
id: Miskonsepsi
it: Equivoci
mg: Fahadisoana teo amin'ny fanamboarana
pt: Conceito Errado
sv_se: Missförstånd

source: How do I access IRC, BitTorrent, or other services on the regular Internet?
he: כיצד לגשת ל־IRC, לביטורנט או לשירותים אחרים באינטרנט הרגיל?
id: Bagaimana cara mengakses IRC, BitTorrent, atau layanan lainnya di Internet biasa?
it: Come posso accedere a IRC, Bittorrent o altri servizi sull'Internet normale?
mg: Ahoana no ahafahako mahazo IRC, Bit Torrent, sy ny servisy hafa ao amin'ny tranonkala ara-dalana?
pt: Como acesso IRC, BitTorrent ou outros serviços na Internet normal?
sv_se: Hur kan jag nå IRC, BitTorrent, eller andra tjänster på internet?

source: Is my router an "exit node"(outproxy) to the regular Internet? I don't want it to be.
he: האם הנתב שלי משמש כמתווך יוצא כלפי האינטרנט הרגיל? אינני רוצה בכך.
id: Apakah router saya adalah \"exit node\" (outproxy) ke Internet biasa? Saya tidak ingin hal itu terjadi.
it: Il mio router è un "nodo di uscita" (outproxy) sull'Internet normale? Non voglio che lo sia.
mg: "exit node"(outproxy) mankany amin'ny tranonakala ara-dalana ve ny router ko? Tsy tiako ho izay no fiasany.
pt: Meu roteador é um "nó de saída" (proxy de saída) para a internet regular? Eu não quero que seja.
sv_se: Är min router en "exit nod" (utproxy) till det vanliga internet? Jag vill inte att den ska vara det.

source: I am opposed to certain types of content. How do I keep from distributing, storing, or accessing them?
he: אני מתנגד/ת לסוגי תוכן מסוימים. כיצד להימנע מלהפיץ אותם, לאחסן אותם או לגשת אליהם?
id: Saya menentang konten jenis tertentu. Bagaimana cara untuk tidak mendistribusikan, menyimpan atau mengakses mereka?
it: Sono contro a determinati tipi di contenuti. Come posso evitare di distribuirli, immagazzinarli o accedervi?
mg: Misy tranonkala tsy mifanahaka amin'ny fihevitro. Ahoana no hanakanako azy tsy ho voatahiry na ho tafiditro?
pt: Eu me oponho a certos tipos de conteúdo. Como posso evitar de distribuir, armazenar ou acessar esses conteúdos?
sv_se: Jag är emot vissa sorters innehåll. Hur kan jag undvika att distribuera, lagra eller nå dom?

source: Errors and Their Solutions
he: שגיאות ותיקונן
id: Error dan solusinya
it: Errori e relative soluzioni
mg: Hadisoana sy ny Vahaolana
pt: Erros e Suas Soluções
sv_se: Fel och Deras Lösningar

source: I'm using FreeBSD and when I start I2P I receive an error about <code>libm.so.4</code>!
he: אני משתמש FreeBSD וכאשר אני מתחיל I2P אני מקבל הודעת שגיאה על libm.so.4 </ code> <code>!
id: Saya menggunakan FreeBSD dan ketika memulai I2P, saya menerima pesan kesalahan tentang <code>libm.so.4</code> !
it: Uso FreeBSD e quando avvio I2P ricevo un errore relativo a <code>libm.so.4</code>!
mg: Mampiasa FreeBSD aho, ary rehefa velomiko i I2P dia mahazo sora-pahadisoana momba ny <code>libm.so.4</code>!
pt: Estou usando FreeBSD e quando inicio o I2P recebo um erro sobre <code>libm.so.4</code>!
sv_se: Jag använder FreeBSD och när jag startar I2P får jag ett fel om <code>libm.so.4</code>!

source: In <code>wrapper.log</code> I see an error stating <code>Protocol family unavailable</code> when I2P is loading
he: ב< code> wrapper.log </ code> אני רואה שגיאה המציינת <code> </ code> פרוטוקול משפחה לא זמין כאשר I2P נטען
id: <code>wrapper.log</code> saya melihat pesan error: <code>Protocol family unavailable</code> ketika I2P sedang loading
it: Nel <code>wrapper.log</code> osservo un errore relativo alla <code>famiglia di protocolli non disponibile</code> quando I2P viene caricato
mg: Ao anatin'ny <code>wrapper.log</code> dia mahita sora-pahadisoana milaza hoe <code>Protocol family unavailable</code> aho, rehefa miakatra i I2P
pt: Em <code>wrapper.log</code> eu vejo um erro onde diz <code>Protocol family unavailable</code> quando o I2P está carregando
sv_se: I <code>wrapper.log</code> ser jag ett fel som säger <code>Protocol family unavailable</code> när I2P laddas

source: link
he: קישור
it: collegamento
mg: Fifandraisana hafa
pt: hiperligação
sv_se: länk

source: While I2P has been reported to run PCs as meagre as a low-end Pentium II with 64 MB of RAM, you'll have a much better experience on a Pentium III (or better) with 128MB of RAM (or more). A <a href="%(chart)s">chart comparing the performance</a> of the various JREs can be found at <a href="%(chart)s">%(chart)s</a>, but in short: it's at all possible, use Sun/Oracle Java or OpenJDK.
id: Walau I2P telah dilaporkan untuk mampu dijalankan di PC low-end dengan prosesor Pentium II dengan RAM 64 MB, anda akan memiliki lebih banyak manfaat dengan Pentium III (atau lebih baik) dengan 128MB RAM (atau lebih). <a href=\"%(chart)s\">Grafik membandingkan kinerja</a> dari berbagai JREs dapat ditemukan di <a href=\"%(chart)s\">s%(chart)s</a>, tetapi dalam waktu singkat: jika dimungkinkan, gunakan Sun/Oracle Java atau OpenJDK.
it: Sebbene ci siano riscontri di I2P funzionante su PC con basse prestazioni addirittura come i Pentium II con 64 MB di RAM, l'esperienza sarà migliore sui Pentium III (o superiori) con 128 MB di RAM (o di più). Un <a href="%(chart)s">grafico con il confronto delle prestazioni</a> dei vari ambienti JRE può essere repirto all'indirizzo <a href="%(chart)s">%(chart)s</a>, ma per dirla in breve: se possibile, usa Sun/Oracle Java o OpenJDK.
mg: I I2P dia voalaza fa mandeha amin'ny solon' tsaina tsotra tokoa toy ny Pentium II misy RAM 64 MB, ahitana fahafinaretana kokoa ny Pentium III (na tsaratsara kokoa)misy RAM 128MB (na misimisy kokoa). Ity <a href="%(chart)s">fampitahana</a>ny karazana JREs dia mety ho hita ao amin'ny <a href="%(chart)s">%(chart)s </a>, fa raha ny tena izy: Tsy mety ho azo atao izany, mampiasà Sun/Oracle na OpenJDK.

source: I2P has been tested on Windows, Linux, FreeBSD (see the note <a href="#compat6x">below</a>), OSX, and OpenSolaris. There is work underway to bring I2P to the Android platform.
id: I2p telah diuji pada Windows, Linux, FreeBSD (Lihat catatan <a href=\"#compat6x\">di bawah</a>), OSX, dan OpenSolaris. Ada pekerjaan yang sedang dilakukan untuk membawa I2P kepada platform Android.
it: I2P è stato testato su Windows, Linux, FreeBSD (leggere la nota <a href="#compat6x">qui sotto</a>), OSX e OpenSolaris. Esistono progetti in corso per portare I2P sulla piattaforma Android.
mg: I2P dia voatsara tao amin'ny windows, Linux,Freebsd (jereo ny <a href="#compat6x">eto ambany</a>, OSX, and OpenSolaris. Misy asa atao mba ahafahana mampiasa an'i I2P ao amin'ny Android.
pt: I2P foi testado em Windows, Linus, FreeBSD (veja a nota <a href="#compat6x">abaixo</a>), OSX, e OpenSolaris. Há trabalho a ser feito para trazer o I2P para a plataforma Android.
sv_se: I2P har testats på Windows, Linux, FreeBSD (se notisen <a href="#compat6x">nedan</a>), OSX och OpenSolaris. För tillfället pågår arbete för att ge stöd för Android-platformen.

source: Here are some places, pick one or more.
he: הנה כמה מקומות, לבחור אחד או יותר.
id: Berikut adalah beberapa tempat, pilih salah satu atau lebih.
it: Ecco qualche luogo, scegline uno o di più.
mg: Misy toerana ireto, mifidiana iray na maro.
pt: Aqui tem alguns locais, escolha um ou mais.
sv_se: Här finns några platser, välj en eller flera.

source: Discuss with the developers on IRC in #i2p-dev
he: דונו עם המפתחים ב- IRC ב i2p-dev#
id: Diskusikan dengan para pengembang di IRC di #i2p-dev
it: Discuti con gli sviluppatori su IRC nel canale #i2p-dev
mg: Miresaha amin'ireo mpanantontosa eo amin'ny IRC ao amin'i #i2p-dev
pt: Converse com os programadores no IRC em #i2p-dev
sv_se: Diskuter med utvecklarna på IRC i #i2p-dev

source: Please include relevant information from the router logs and wrapper logs.
he: נא לכלול מידע רלוונטי מיומני הנתב ויומני העטיפה.
id: Mohon sertakan informasi yang relevan dari router log dan wrapper log.
it: Includi le relative informazioni prese dai log del router e del wrapper.
mg: Azafady, ampiarahao ato ny zavatra hitanao ao amin'ny fitanana an-tsoratry ny router na ny fitanana antsoratry ny wrappers.
pt: Por favor, inclua a informação relevante dos registos do roteador e dos registos da função wrapper.
sv_se: Var god inkludera relevant information från router-loggarna och wrapper-loggarna.

source: The default subscription is to http://www.i2p2.i2p/hosts.txt which is updated rarely. If you don't have another subscription, you may often have to use "jump" links which is annoying.
he: מנוי ברירת המחדל הוא http://www.i2p2.i2p/hosts.txt המתעדכן לעתים רחוקות. אם אין לך מנוי אחר, ייתכן שלעתים קרובות יש להשתמש בקישורי "jump" שזה מעצבן.
id: Berlangganan default adalah http://www.i2p2.i2p/hosts.txt yang jarang di-update. Jika anda tidak memiliki langganan yang lain, anda harus sering menggunakan \"jump\" link, yang menjengkelkan.
it: L'iscrizione predefinita è a http://www.i2p2.i2p/hosts.txt che viene raramente aggiornato. Se non disponi di un'altra iscrizione, potresti dover usare spesso i collegamenti "jump", il che è seccante.
mg: Ny fisoratana mahazatra http://www.i2p2.i2p/hosts.txt dia tsy dia maharaka andro loatra. Raha nisoratra tany ho any ianao, dia mety mampiasa ny "jump" foana izay fifandraisana mankaleo.
pt: A subscrição predefinida é para http://www.i2p2.i2p/hosts.txt. que é raramente atualizada. Se não tem outra subscrição, eventualmente terá que utilizar hiperligações "transição" o que é incómodo.
sv_se: Standard-prenumerationen är för http://www.i2p2.i2p/hosts.txt vilken sällan uppdateras. Om du inte har någon annan prenumeration, kan du behöva använda "hopp"-länkar vilket är irriterande-

source: Here are some other public addressbook subscription links. You may wish to add one or two to your <a href="http://localhost:7657/susidns/subscriptions.jsp">susidns subscription list</a>. You don't need to add all of them, as they sync with each other periodically. The links using a cgi-bin application employ various strategies to minimize the number of duplicate addresses delivered, so they should be more efficient. Note that subscribing to a hosts.txt service is an act of "trust", as a malicious subscription could give you incorrect addresses. So think about whether you want to trust any of these. The operators of these services may have various policies for listing hosts. Presence on this list does not imply endorsement.
id: Berikut adalah beberapa link berlangganan addressbook umum lainnya. Anda mungkin ingin menambahkan satu atau dua <a href=\"http://localhost:7657/susidns/subscriptions.jsp\">daftar susidns berlangganan </a>. Anda tidak perlu untuk menambahkan mereka semua, karena satu sama lain bersinkronisasi secara berkala. Link yang menggunakan aplikasi cgi-bin menggunakan berbagai strategi untuk meminimalkan jumlah duplikat dari alamat disampaikan, sehingga mereka seharusnya lebih efisien. Perhatikan bahwa berlangganan layanan hosts.txt adalah tindakan \"kepercayaan\", karena langganan jahat bisa memberikan anda alamat yang salah. Jadi pikir apakah anda ingin mempercayai ini. Operator dari layanan ini mungkin memiliki berbagai kebijakan untuk daftar host. Kehadiran daftar ini tidak menyiratkan endorsement.
it: Ecco qualche altro collegamento per la rubrica pubblica. Potresti aggioungerne uno o due al tuo <a href="http://localhost:7657/susidns/subscriptions.jsp">elenco di iscrizioni susidns</a>. Non c'è bisogno di aggiungerli tutti, perché si sincronizzano l'uno con l'altro periodicamente. I collegamenti che usano un applicazione cgi-bin application si avvalgono di svariate strategie per minimizzare il numero di indirizzi duplicati, per cui dovrebbero essere più efficienti. Ricorda che iscriversi a un servizio hosts.txt è un atto di "fiducia" perché un'iscrizione malevola potrebbe fornirti indirizzi sbagliati. Per cui rifletti se intendi fidarti o no. Gli operatori di tali servizi potrebbero avere diverse regole per gli host elencati. La presenza di un sito in questa lista non implica approvazione.
mg: Ireto misy fifandraisana maromaro momba'ny fisoratana anarana . Azonao atao ny manampy ny anao ato amin'ny <a href="http://localhost:7657/susidns/subscriptions.jsp">susidns subscription list</a>. Tsy ilaina ny mampihiditra azy rehetra, satria manao fampitahana matetika izy ireo. Ny fifandraisana mampiasa fampiharana cgi-bin dia mampiasa statejia mba hampihena ny isan'ny adiresy miverin'indroa izayvoazara, tokony azo antokoa kokoa. Fanamarihina, ny fisoratana dia mety manome anao adiresy diso. Ianao no mahalala raha tokony ho atokisana ireo na tsia. Ny mpandrindra ireo servisy ireo dia mety manana fifehezana ho azy ho an'ireo mpampiantrano lisitra. Ny fisiana eo amin'ny lisitra dia tsy midika zava-dehibe loatra.
pt: Aqui estão alguns links de assinatura de catálogos de endereços públicos. Você pode querer adicionar um ou dois à sua <a href="http://localhost:7657/susidns/subscriptions.jsp">lista de assinaturas do susidns</a>. Você não precisa adicionar todas, já que elas sincronizam-se entre si periodicamente. Os links que usam uma aplicação do tipo cgi-bin empregam várias estratégias para minimizar o número de endereços duplicados entregues, para que sejam mais eficientes. Perceba que assinar um serviço de hosts.txt é um ato de "confiança", já que uma assinatura maliciosa pode lhe dar endereços incorretos. Então pense antes de confiar em qualquer deles. Os operadores destes serviços podem ter várias políticas para listar hosts. A presença nesta lista não implica apoio ao conteúdo.
sv_se: Här är några andra publika adressboks-prenumerations länkar. Du kanske vill lägga till en eller två till din <a href="http://localhost:7657/susidns/subscriptions.jsp">susidns prenumerationslista</a>. Du behöver inte lägga till alla, eftersom dom synkroniserar med varandra periodiskt. Länkarna som använder en cgi-bin applikation använder en del strategier för att minimera antalet duplicerade adresser som delas ut och borde vara mer effektiv. Uppmärksamma att prenumerera till en hosts.txt tjänst är en handling av "tillit", eftersom illvilliga prenumerationer kan ge dig felaktiga adresser. Så tänk efter om du vill lite på några av dessa. Operatörerna av dessa tjänster kan ha vissa policy:er för att lista värdar. Närvaro på denna lista implicerar inte vårat stöd.

source: Jrandom was the lead developer of I2P and <a href="http://syndie.i2p2.de/">Syndie</a> for several years. We do not know if or when jrandom will return. The *.i2p.net domains were left in a non-functioning state after a power outage at the hosting company.
id: Jrandom adalah pengembang utama I2P dan <a href=\"http://syndie.i2p2.de/\">Syndie</a> selama beberapa tahun. Kita tidak tahu jika atau kapan jrandom akan kembali. Domain *. I2p.net dalam keadaan tidak berfungsi setelah pemadaman listrik di perusahaan hosting.
it: Jrandom è stato lo sviluppatore capo di I2P e <a href="http://syndie.i2p2.de/">Syndie</a> per diversi anni. Non sappiamo se jrandom farà ritorno o no. I dominii *.i2p.net sono stati lasciati in uno stato di non funzionamento dopo un blackout capitato all'azienda che si occupa del loro hosting.
mg: Jrandom dia anisan'ny tena nampivoatra ny I2P sy ny <a href="http://syndie.i2p2.de/">Syndie</a> naditry ny taona maro. Tsy fantatra raha hiverina i Jrandom. ny famaritan'toerana *.i2p.net dia tsy tafaverina intsony rehefa tapaka ny herin'aratra tao amin'ny mpampiantranao ny adiresy.
pt: Jrandom foi o responsável pelo desenvolvimento líder do I2P e do <a href="http://syndie.i2p2.de/">Syndie</a> durante muitos anos. Nós não sabemos se e quando o jrandom irá voltar. Os domínios *.i2p.net foram deixados num estado de não funcionamento depois de um corte de energia na empresa de hospedagem.
sv_se: Jrandom var huvudetvecklaren för I2P och <a href="http://syndie.i2p2.de/">Syndie</a> i flera år. Vi vet inte om eller när jrandom kommer komma tillbaka. *.i2p.net domänen lämnades i ett icke-fungerande tillstånd efter ett strömavbrott hos hosting-företaget.

source: See <a href="%(jrandom)s">this page</a> for jrandom's parting message and additional information on the migration of *.i2p.net to <a href="%(index)s">this website</a>.
id: Lihat <a href=\"%(jrandom)s\">Halaman ini</a> untuk jrandom di pesan perpisahan dan informasi tambahan tentang migrasi *. i2p.net ke <a href=\"%(index)s\">situs ini</a>.
it: Consulta <a href="%(jrandom)s">questa pagina</a> con il messaggio di addio di jrandom e informazioni aggiuntive sulla migrazione di *.i2p.net a <a href="%(index)s">questo sito web</a>.
mg: Jereo <a href="%(jrandom)s">ity pejy ity</a>milaza ny fandehanan'i Jrandom sy vavao samihafa momba ny fioavan'ny *.i2p.net ho <a href="%(index)s">ity tranonkala ity</a>.
pt: Veja <a href="%(jrandom)s">esta página</a> para ler a mensagem de despedida do jrandom e informações adicionais sobre a migração de *.i2p.net para <a href="%(index)s">este site</a>.
sv_se: Se <a href="%(jrandom)s">denhär sidan</a> för jrandoms avskedmeddelande och ytterliggare information om migrationen av *.i2p.net till <a href="%(index)s">den är sajten</a>.

source: I2P remains in active development.
he: I2P נשאר בפיתוח פעיל.
id: I2p tetap dalam pengembangan aktif.
it: I2P rimane in attivo sviluppo.
mg: I2P dia mizaka fiovana matetika.
pt: I2P continua em pleno desenvolvimento
sv_se: I2P förblir i aktiv utveckling.

source: There are many possible causes of high CPU usage. Here is a checklist:
he: יש הרבה סיבות אפשריות לשימוש ב- CPU הגבוה. הנה רשימה:
id: Ada banyak kemungkinan penyebab dari penggunaan CPU yang tinggi. Berikut adalah daftarnya:
it: Esistono numerose possibile cause di un elevato utilizzo della CPU. Ecco un elenco di controllo:
mg: Mety maro ny antony mahatonga ny CPU ho sempotra. Inty misy lisitra tokony ho jerena:
pt: Existem muitas causas possíveis de uma utilização elevada da CPU. Aqui tem uma lista de verificação:
sv_se: Det finns många möjliga anledningar till hög CPU-använding. Här finns en kontrollista:

source: Try to use either OpenJDK or Sun/Oracle Java if it's available for your system. You can check which version of java you have installed by typing <code>java -version</code> at a command/shell prompt. Performance tends to suffer with other implementations of java.
id: Cobalah untuk menggunakan OpenJDK atau Sun/Oracle Java jika tersedia untuk sistem operasi anda. Anda dapat memeriksa versi Java yang telah diinstal dengan mengetik <code>java -version</code> pada command prompt shell. Kinerja cenderung menurun dengan implementasi Java yang lain.
it: Prova a usare OpenJDK oppure Java di Sun/Oracle se sono disponibili sul tuo sistema. Puoi controllare la versione di java installata digitando <code>java -version</code> al prompt dei comandi o in un terminale. Le prestazioni tendono a soffrire con implementazioni di java diverse.
mg: Andramo ny fampiasana ny OpenJDK na Sun/Oracle Java raha azonao ampiasaina ao amin'ny solon'tsainao. Azonao atao ny mijery ny modelin'ny Java napetrakao teo aloha amin'ny fampidiranao ny baiko ao amin'ny terminal an'izao soratra izao <code>java -version</code> .Somary manelingelina ny fiasan'ny solon'tsaina ny fampiasana ny java.
pt: Tente usar OpenJDK ou Java se estiver disponível para seu sistema. Você pode verificar qual versão de java você tem instalada digitando <code>java -version</code> em um prompt de comando. A performance tende a diminuir com outras implementações de java.
sv_se: Försök att använda antingen OpenJDK eller Sun/Oracle Java om det finns tällgängligt för ditt system. Du kan kontrollera vilken version av java du har installerad genom att skriva <code>java -version</code> i en kommandotolk. Prestanda tenderar att vara värre med andra implementationer av java.
