Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: The reseed URL changed a few years ago. If this is your first install and you have installed an old (0.6.1.30 or earlier) release, or you have not run I2P in a long time, you must change the URL and then click "Reseed" on the console to find other routers. After your router is running, on <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>, add the line <tt>i2p.reseedURL=http://netdb.i2p2.de/</tt> OR <tt>i2p.reseedURL=http://i2pdb.tin0.de/netDb/</tt> (either should work), then click "Apply", then click the "reseed" link on the left.
id: Reseed URL telah berubah beberapa tahun yang lalu. Jika ini adalah instalasi pertama anda dan anda telah menginstal versi lama (versi 0.6.1.30 atau sebelumnya), atau anda belum menjalankan I2P dalam waktu yang lama, anda harus mengubah URL dan kemudian klik \"Reseed\" pada console untuk menemukan router lain. Setelah router anda berjalan, pada <a href=\"http://localhost:7657/configadvanced.jsp\">configadvanced.jsp</a>, menambahkan baris <tt>i2p.reseedURL= http://netdb.i2p2.de/</tt> ATAU <tt>i2p.reseedURL= http://i2pdb.tin0.de/netDb/</tt> (keduanya bisa digunakan), lalu klik \"Apply\", kemudian klik link \"reseed\" di sebelah kiri.
it: L'URL del reseed cambiò qualche anno fa. Se questa è la tua prima installazione e hai installato auan versione vecchia (0.6.1.30 o precedente), oppure se non hai eseguito I2P da tanto tempo, devi cambiare l'URL e quindi fare clic su "Reseed" nella console per trovare altri router. Una volta che il tuo router è in esecuzione, in <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>, aggiungi la riga <tt>i2p.reseedURL=http://netdb.i2p2.de/</tt> OPPURE <tt>i2p.reseedURL=http://i2pdb.tin0.de/netDb/</tt> (sia una che l'latra dovrebbero funzionare), quindi fai clic su "Applica", e sul link "reseed" sulla sinistra.
mg: Ny URL ny reseed dia niova efa taona maro izay. Raha ity ny fametrahanao voahaloahany ka ny modely antitra(0.6.1.30 na tany aloha), na tsy nampiasa ny I2P nandritry ny fotoana maromaro ianao. dia tsy maintsy ovaina ny URL ary tsindrio "Reseed" eo amin'ny pejy fibaikoana mba hitadiavana router hafa. Rehefa mandeha ny router nao, eo amin'ny <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>, dia ampio ity andalana ity <tt>i2p.reseedURL=http://netdb.i2p2.de/</tt> NA <tt>i2p.reseedURL=http://i2pdb.tin0.de/netDb/</tt> (tokony ny handeha ny iray amin'ireo), dia tsindrio ny "Apply", sy ny "reseed" mpampifandray eo amin'ny ankavia.
pt: A URL para repropagar mudou alguns anos atrás. Se essa é sua primeira instalação e você instalou uma versão antiga (0.6.1.30 ou anterior), ou você não rodou I2P por muito tempo, você deve mudar a URL e clicar "Repropagar" no painel para encontrar outros roteadores. Quando seu roteador estiver rodando, em <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>, adicione a linha <tt>i2p.reseedURL=http://netdb.i2p2.de/</tt> OR <tt>i2p.reseedURL=http://i2pdb.tin0.de/netDb/</tt> (qualquer delas funciona), então clique "Aplicar", depois clique no link "repropagar" na esquerda.
sv_se: Reseed URL:en ändrades för några år sedan. Om dethär är din första installation och du har installerat en gammal (0.6.1.30 eller tidigare) version eller om du inte har kört I2P på länge, behöver du ändra URL:en och sen klicka på "Reseeda"-knappen i routerkonsolen för att hitta andra routrar. När din router kör, på <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>, lägg till raden <tt>i2p.reseedURL=http://netdb.i2p2.de/</tt> ELLER <tt>i2p.reseedURL=http://i2pdb.tin0.de/netDb/</tt> (båda borde fungera), klicka sedan "Apply", och klicka sedan på "reseed"-länken på vänster sida.

source: This works if you are running 0.6.1.27 or later. If you are running release 0.6.1.31 or later, you probably don't need to do this. If you are running release 0.6.1.26 or earlier, either follow the <a href="#manual_reseed">manual reseed instructions</a> below or install the <a href="%(downloadslist)s">latest release</a>. Possible alternate method - add <tt>wrapper.java.additional.5=-Di2p.reseedURL=http://netdb.i2p2.de/</tt> to wrapper.config, shutdown the router completely, then start again, then click "reseed". Let us know if this works.
id: Ini berhasil jika anda menjalankan versi 0.6.1.27 atau lebih baru. Jika anda menjalankan varsi 0.6.1.31 atau lebih baru, anda mungkin tidak perlu melakukan hal ini. Jika anda menjalankan rilis 0.6.1.26 atau sebelumnya, ikuti <a href=\"#manual_reseed\">instruksi reseed manual </a> di bawah atau menginstal <a href=\"%(downloadslist)s\">rilis terbaru</a>. Metode alternatif yang tersedia - menambah <tt>wrapper.java.additional.5=-Di2p.reseedURL= http://netdb.i2p2.de/</tt> ke dalam wrapper.config, shutdown router sepenuhnya, kemudian mulai lagi, kemudian klik \"reseed\". Beri tahu kami jika ini berhasil.
it: Questo funziona se stai eseguendo la versione 0.6.1.27 o successiva. Se usi la versione 0.6.1.31 o successiva, probabilmente non ti serve. Se stai eseguendo la versinoe 0.6.1.26 o precedente, segui le <a href="#manual_reseed">istruzioni per reseed manuale</a> qui sotto oppure installa la <a href="%(downloadslist)s">versione più recente</a>. Un possibile metodo alternativo - aggiungi <tt>wrapper.java.additional.5=-Di2p.reseedURL=http://netdb.i2p2.de/</tt> a wrapper.config, arresta completamente il router, quindi riavvialo e fai clic su "reseed". Facci sapere se funziona.
mg: Mandeha ity raha mampiasa ny modely 0.6.1.27 na ny tao aoriana. Raha mampiasa ny modely 0.6.1.31 na ny tao aoriana, dia mety tsy ilaina ny hanaovanao an izao. Raha mampiasa ny modely 0.6.1.26 na ny teo aloha, dia araho ny <a href="#manual_reseed">manual reseed instructions</a>eo ambany na apetraho ny <a href="%(downloadslist)s">latest release</a>. Fomba hafa iray koa - ampio <tt>wrapper.java.additional.5=-Di2p.reseedURL=http://netdb.i2p2.de/</tt> ny wrapper.config, vonoy tanterraka ny router, dia velomy indray, ary tsindrio "reseed". Teneno izahay raha mandeha.
pt: Isso funciona se estiver rodando versão 0.6.1.27 ou mais recente. Se estiver rodando versão 0.6.1.31 ou mais recente, você provavelmente não precisa fazer isso. Se está rodando versão 0.6.1.26 ou anterior, pode-se tanto seguir <a href="#manual_reseed">as instruções de repropagação manual</a> abaixo como pode instalar <a href="%(downloadslist)s">a última versão</a>. Possível método alternativo - adicione <tt>wrapper.java.additional.5=-Di2p.reseedURL=http://netdb.i2p2.de/</tt> ao wrapper.config, desative totalmente o roteador, então ligue de novo, depois clique em "repropagar". Avise-nos se isso funcionar.
sv_se: Detta fungerar om du kör 0.6.1.27 eller senare. Om du kör release 0.6.1.31 eller senare, så behöver du trolgitvis inte göra det. Om du kör release 0.6.1.26 eller tidigare, antingen följ de <a href="#manual_reseed">manuella reseed instruktionerna</a> nedan eller installera den <a href="%(downloadslist)s">senaste releasen</a>. En möjlig alternativ metod - lägg till <tt>wrapper.java.additional.5=-Di2p.reseedURL=http://netdb.i2p2.de/</tt> till wrapper.config, stäng av routern helt, starta den sen igen och klicka slutligen på "reseed". Berätta för oss om det fungerar.

source: ...but you *really* should <a href="%(downloadslist)s">upgrade</a> to the latest version.
id: ... tapi anda *sangat* harus <a href=\"%(downloadslist)s\">meng-upgrade</a> ke versi terbaru.
it: ...ma dovresti *davvero* <a href="%(downloadslist)s">aggiornare</a> passando alla versione più recente.
mg: .... fa *tokony* hanao izao ianao <a href="%(downloadslist)s">upgrade</a> mba hanavao.
pt: ...mas você *realmente* deve <a href="%(downloadslist)s">atualizar</a> para a última versão.
sv_se: ...men du *borde* <a href="%(downloadslist)s">uppgradera</a> till den senaste versionen.

source: If your router has 10 or more active peers, everything is fine. Changes in releases 0.6.1.31 and 0.6.1.32 improved the efficiency of the router and effectively reduced the number of active peers. The router <i>should</i> maintain connections to a few peers at all times. The best way to stay "better-connected" to the network is to <a href="http://localhost:7657/config">share more bandwidth</a>.
id: Jika router anda memiliki 10 peer yang lebih aktif atau lebih banyak lagi, semuanya baik-baik saja. Perubahan dalam rilis 0.6.1.31 dan 0.6.1.32 meningkatkan efisiensi router dan mengurangi jumlah peer yang aktif secara efektif. Router <i>harus</i> menjaga hubungan dengan beberapa peer sepanjang waktu. Cara terbaik untuk tetap "better-connected" ke jaringan adalah dengan <a href=\"http://localhost:7657/config\">berbagi lebih banyak bandwidth</a>.
it: Se il tuo router ha 10 o più peer attivi, tutto va bene. Le modifiche nelle versioni 0.6.1.31 e 0.6.1.32 hanno migliorato l'efficienza del router e hanno ridotto in modo efficace il numero di peer attivi. Il router <i>dovrebbe</i> mantenere le connessioni verso pochi peer in ogni momento. Il modo migliore per avere una "connessione migliore" alla rete è di <a href="http://localhost:7657/config">condividere più banda</a>.
mg: Raha mahita Akama 10 na mihoatra ianao eo amin'ny router nao, dia mandeha tsara izy izany. Ny fiovana teo amin'ny modely 0.6.1.31 sy ny 0.6.1.32 dia nanatsara ny tanjaky ny router, sady nampihena ny isan'ny akama miasa. Ny router dia <i>tokony</i> mifandray amin'ny akama vitsivitsy foana. Ny fomba hijanonana "mifandray tsara" amin'ny tambazotra dia ny <a href="http://localhost:7657/config">share more bandwidth</a>.
pt: Se seu roteador tem 10 ou mais peers ativos, tudo está certo. Mudanças nas versões 0.6.1.31 e 0.6.1.32 melhoraram a eficiência do roteador e de fato reduziram o número de peers ativos. O roteador <i>deve</i> manter conexões com alguns poucos peers em todo o tempo. A melhor forma de manter-se "melhor conectado" à rede é <a href="http://localhost:7657/config">compartilhando mais banda</a>.
sv_se: Om din router har 10 eller fler aktiva peers, så är allting ok. Förändringar i releaserna 0.6.1.31 och 0.6.1.32 förbättrade effektiviteten hos routern och minskade antalet aktiva peers. Routern <i>borde</i> alltid bibehålla anslutningarna till ett litet antal peers. Det bästa sättat att vara "bättre ansluten" till nätverket är att <a href="http://localhost:7657/config">dela mer bandbredd</a>.

source: Is my router an "exit node" to the regular Internet? I don't want it to be.
id: Apakah router saya "exit node" ke Internet biasa? Saya tidak ingin hal itu terjadi.
it: Il mio router è un "nodo di uscita" sull'Internet normale? Non voglio che lo sia.
mg: "exit node" mankany amin'ny Internet ara-dalana ve ny router-ko? Tsy tiako ho izay no fiasany.
pt: O meu roteador é um "nó de saída" para a Internet regular? Eu não quero que este o seja.
sv_se: Är min router en "exit nod" till det vanliga internet? Jag vill inte att den ska vara det.

source: No. Unlike <a href="https://www.torproject.org/">Tor</a>, "exit nodes" or "outproxies" are not an inherent part of the network. Only volunteers who set up and run separate applications will relay traffic to the regular Internet. There are very, very few of these.
id: Tidak. Tidak seperti <a href=\"https://www.torproject.org/\">Tor</a>, "exit node" atau "outproxies" bukan bagian esensial dari jaringan. Hanya relawan yang mengatur dan menjalankan aplikasi terpisah akan me-relay lalu lintas Internet biasa. Jumlahnya sangat, sangat sedikit.
it: No. A differenza di <a href="https://www.torproject.org/">Tor</a>, i "nodi di uscita" o "outproxies" non sono una parte intrinseca della rete. Solo i volontari che impostano ed eseguono applicazioni separate ripeteranno il traffico verso la rete Internet solita. Ne esitono pochi, anzi, pochissimi.
mg: Tsia. Ohatran 'i <a href="https://www.torproject.org/">Tor</a>, "exit nodes" na "outproxies" dia tsy ahitana an'ireo ao anatin'ny tambazotra. Ny mpilatsaka an-tsitrapo izay mampiasa fampiarana manokana no manao izay hivoahana any amin'ny internet. Vitsy dia vitsy izy ireo.
pt: Não. Ao contrário do <a href="https://www.torproject.org/">Tor</a>, "portões de saída" ou "ligações externas a rede I2P" não são uma parte inerente da rede. Apenas voluntários que preparam e rodam aplicativos em separado irão redirecionar dados para a Internet normal. Existem poucos, muito poucos desses.
sv_se: Nej. Till skillnad från <a href="https://www.torproject.org/">Tor</a>, "utgångsnoder" eller "utproxies" är inte heller en del av nätverket. Bara frivilliga som ställt in och kör separata applikationer kommer vidarebefodra trafik till det vanliga internet. Det finns väldigt, väldigt få av dessa.

source: See above. There are very few HTTP "outproxies", they are not an inherent part of the network, and they may not be up. In addition, the old outproxies squid.i2p, true.i2p, and krabs.i2p have vanished. The only outproxy at the moment is false.i2p. To use it, edit your <a href="http://localhost:7657/i2ptunnel/edit.jsp?tunnel=0">i2ptunnel settings for eepProxy</a> and set your outproxy list to 'false.i2p' (only). Then stop and restart the eepProxy. If it doesn't work, the outproxy is not up. It is not I2P's fault. If your primary reason to use an anonymous network is to anonymously access sites on the regular Internet, you should probably try <a href="https://www.torproject.org/">Tor</a>.
id: Lihat di atas. Ada sangat sedikit HTTP "outproxies", mereka bukan bagian esensial dari jaringan, dan mereka mungkin tidak akan aktif. Selain itu, outproxies lama: squid.i2p, true.i2p, dan krabs.i2p sudah tidak ada lagi. Outproxy pada saat ini hanyalah false.i2p. Untuk menggunakannya, mohon edit <a href=\"http://localhost:7657/i2ptunnel/edit.jsp?tunnel=0\">pengaturan i2ptunnel untuk eepProxy</a> dan setel daftar outproxy anda untuk 'false.i2p' (saja). Kemudian hentikan lalu restart eepProxy. Jika tidak berhasil, outproxy tidak menyala. Ini bukan kesalahan I2P. Jika alasan utama anda menggunakan jaringan anonim adalah dengan mengakses situs secara anonim di Internet biasa, anda mungkin harus mencoba <a href=\"https://www.torproject.org/\">Tor</a>
it: Vedi sopra. Esistono pochissimi "outproxy" HTTP "outproxies", non fanno intrinsecamente parte della rete e potrebbero non funzionare. Inoltre, i vecchi outproxy squid.i2p, true.i2p, e krabs.i2p sono scomparsi. L'unico outproxy al momento è false.i2p. Per usarlo, modifica le tue <a href="http://localhost:7657/i2ptunnel/edit.jsp?tunnel=0">impostazioni i2ptunnel per eepProxy</a> e imposta il tuo elenco di outproxy su 'false.i2p' (only). Quindi interrompi e riavvia l'eepProxy. Se non funziona, significa che l'outproxy non funziona. Non è colpa di I2P. Se il motivo principale per usare una rete anonima è quello di accedere ai siti anonimamente sull'Internet normale, forse dovresti provare <a href="https://www.torproject.org/">Tor</a>.
mg: Jereo eo ambony. Vitsy ny HTTP "outproxies", tsy nateraka tao anaty tambazora izy ireo, ary mety tsy velona akory aza. Ary koa , ny outproxies squid.i2p taloha, true.i2p, sy krabs.i2p dia nanjavona avokoa. Ny outproxy misy amin'izao fotoana izao dia ny false.i2p. Raha ampiasa azy dia, sokafy ny <a href="http://localhost:7657/i2ptunnel/edit.jsp?tunnel=0">i2ptunnel settings for eepProxy</a> dia ataovy ho 'false.2ip' ny lisitry ny outproxy nao. Dia vonoy sy velomy indray ny eepProxy. Raha tsy mandeha, dia tsy niakatra ny outproxy. Tsy hadisoan'ny I2P. Raha te ho any amin'ny Internet ka te hanafina fihidirana any amin'ny tranon'kalana'olona, dia everinay fa tokony ho <a href="https://www.torproject.org/">Tor</a> no ampiasaina.
pt: Veja acima. Há muitos poucos "proxies de saída" tipo HTTP, eles não são parte integrante da rede, e eles podem estar desligados. Adicionalmente, os velhos proxies de saída squid.i2p, true.i2p, e krabs.i2p desapareceram. O único proxy de saída atualmente é false.i2p. Para usar, edite suas <a href="http://localhost:7657/i2ptunnel/edit.jsp?tunnel=0">configurações do Túnel I2P para eepProxy</a> e configure sua lista de proxy de saída para 'false.i2p' (apenas). Então pare e reinicie o eepProxy. Se não funcionar, o proxy de saída está desligado. Não é culpa da I2P. Se a razão principal para usar uma rede anônima é acessar sites anonimamente na Internet regular, você pode experimentar <a href="https://www.torproject.org/">Tor</a>.
sv_se: Se ovan. Det finns väldigt få HTTP "utproxies", de är inte integral del av nätverket och det kan hända att de är nere. Vidare, så har de gamla utproxierna squid.i2p, true.i2p och krabs.i2p försvunnit. Den enda utproxien för tillfället är false.i2p. För att använda den, ändra dina <a href="http://localhost:7657/i2ptunnel/edit.jsp?tunnel=0">i2ptunnel inställningar för eepProxy</a> och sätt din utproxy lista till "false.i2p" (enbart). Stanna och starta sedan om eepProxy:n. Om det inte fungerar, så är utproxyn inte uppe. Det är inte I2Ps fel. Om din huvudanledning göt att använda ett anonymt nätverk är att anonymt nå sajter på det vanliga internet, så borde du nog testa <a href="https://www.torproject.org/">Tor</a>.

source: Within I2P, there is no need for HTTPS, as all traffic is encrypted end-to-end. FTP is not supported for technical reasons.
id: I2P tidak perlu HTTPS karena semua lalu lintas dienkripsi dari ujung ke ujung.
it: All'interno di I2P non c'è bisogno di HTTPS perché tutto il traffico è criptato punto-a-punto. FTP non è supportato per motivi tecnici.
mg: Ao anaty I2P, dia tsy ilaina ny fampiasana ny HTTPS, ny fifandraisana rehetra dia nafenina avy any ampiandohana ka hatrany amin'ny farany. FTP dia tsy miasa noho ny antony ara-teknika.
pt: Dentro do I2P, não há necessidade de HTTPS, já que o tráfego é criptografado ponto-a-ponto. FTP não é compatível por razões técnicas.
sv_se: Inom I2P finns det inget behov för HTTPS, eftersom all trafik är krypterad från början till slut. Ftp stöds inte av tekniska skäl.

source: There are no FTP "outproxies" to the Internet&mdash;it may not even be possible to set up one. Any other kind of outproxy may work if it's set up with a standard tunnel. If you would like to set up some type of outproxy, carefully research the potential risks. The I2P community may or may not be able to help with the technical aspects, feel free to ask.
id: Tidak ada FTP "outproxies" ke Internet&mdash;mungkin bahkan tidak memungkinkan untuk membuatnya. Jenis outproxy lainnya dapat bekerja jika dipasang dengan tunnel standar. Jika anda ingin membuat beberapa jenis outproxy, teliti dengan seksama tentang potensi risiko. Komunitas I2P mungkin dapat atau mungkin tidak dapat membantu dalam aspek teknis, tapi mohon jangan ragu untuk bertanya.
it: Non ci sono "outproxy" FTP verso Internet&mdash;potrebbe addirittura non essere possibile impostarne uno. Qualunque altro tipo di outproxy potrebbe funzionare se viene impostato con il tunnel standard. Se desideri impostare qualche tipo di outproxy, cerca con attenzione i rischi potenziali in cui potresti incorrere. La comunità I2P potrebbe, o non potrebbe, essere in grado di darti una mano con gli aspetti tecnici, sentiti libero di porre domande.
mg: Tsy misy "outproxies" FTP manakany amin'ny Internet&mdash; Tsy mety mihitsy ny hanaovana izany. Ny outproxy hafa dia mety handeha raha atao amin'ny fantsona mahazatra. Raha toa ka te hanamboatra outproxy ianao, jereo aloha ny mety ho fiantraikan'izany. Ny fokonolona ao amin'ny I2P dia mety tsy ho afaka hanampy anao amin'izany, fa mametraha fanontaniana ihany aloha.
pt: Não há proxies de saída FTP para a internet&mdash;pode nem ser possível ativar um. Qualquer outro tipo de proxy de saída pode funcionar se for criado com um túnel padrão. Se você quiser criar um tipo de proxy de saída, pesquise atentamente os riscos. A comunidade I2P pode ou não se disponibilizar a te ajudar com os aspectos técnicos, sinta-se à vontade para perguntar.
sv_se: Det finns inga FTP "ut-proxies" till internet&mdash;det kanske inte ens är möjligt konfigurera en. Någon annan sorts ut-proxy kan fungera om det konfigureras med en standard-tunnel. Om du vill sätta upp någon sorts utproxy, leta noggrant efter potentiella risker. I2P-communityn kan eventuellt hjälpa till med de tekniska aspekterna, du är välkommen att fråga.

source: As explained several times above, any existing outproxy isn't a core part of the network. They are services run by individuals and they may or may not be operational at any given time.
id: Seperti yang telah dijelaskan beberapa kali di atas, setiap outproxy yang ada bukanlah bagian inti dari jaringan. Mereka adalah layanan yang dijalankan oleh orang lain dan mereka mungkin atau mungkin tidak beroperasi pada waktu tertentu.
it: Come spiegato tante volte in precedenza, qualunque outproxy esistente non fa parte della rete in quanto tale. Si tratta di servizi messi a disposizione da singoli individue e, come tali, potrebbero essere operativi o no in un dato momento.
mg: Araky ny efa nohazavaina hatramin'izay, ny outproxy mety ho hita dia tsy nateraka ho isan'ny tambazotra. Izy ireo dia servisy ampiasain'olona ary mety mandeha na tsia amin'ny fotoana ilàna azy.
pt: Conforme já explicado várias vezes acima, qualquer proxy de saída existente não é parte fundamental da rede. Há vários serviços rodados por indivíduos e eles podem ou não ser operacionais em determinados momentos.
sv_se: Som förklarat flera gånger tidigare ovan, inga existernade utproxies är en integral del av nätverket. Tjänsterna körs av individer och kanske inte fungerar alltid.

source: <b>Update</b>: Thanks to the work of h2ik, there is an https outproxy available for use via I2P. Starting with I2P 0.8.4 <a href="http://localhost:7657/i2ptunnel/edit?tunnel=6">the tunnel</a> is configured out of the box.<br /> In case the https outproxy is not available in your version of I2P, you can add it easily by doing the following:
id: <b>Update</b> : Berkat usaha dari h2ik, ada https outproxy yang tersedia untuk digunakan melalui I2P. Dimulai pada versi I2P 0.8.4 <a href=\"http://localhost:7657/i2ptunnel/edit?tunnel=6\">tunnel</a> dikonfigurasi out of the box. <br /> Jika outproxy https tidak tersedia di versi I2P anda, anda dapat menambahkannya dengan mudah dengan melakukan hal berikut:
it: <b>Aggiornamento</b>: grazie al lavoro di h2ik, esiste un outproxy https outproxy disponibile all'uso tramite I2P. A partire dalla versione di I2P 0.8.4 <a href="http://localhost:7657/i2ptunnel/edit?tunnel=6">il tunnel</a> è configurato senza dover intervenire.<br /> Se l'outproxy https non fosse disponibile nella tua versione di I2P, puoi aggiugerlo facilmente facendo così:
mg: <b>Vaovao</b>: Misaotra noho ny asan'i h2ik, misy https outproxy azo ampiasaina ao amin'ny I2P. Manomboka eo amin'i I2P 0.8.4 <a href="http://localhost:7657/i2ptunnel/edit?tunnel=6">ny fantsona</a>dia efa voarafitra hatrany<br /> Raha toa ka tsy mandeha ny outproxy ao amin'ny modely na I2P ampiasainao, dia azonao atao ny manampy izany toy izao:
pt: <b>Atualização</b>: graças ao trabalho do h2ik, há um proxy de saída https disponível para utilizar via I2P. Iniciando com I2P 0.8.4 <a href="http://localhost:7657/i2ptunnel/edit?tunnel=6">o túnel</a> está pré-configurado.<br /> No caso do proxy não estar disponível na sua versão do I2P, pode adicioná-lo facilmente, efetuando o seguinte:
sv_se: <b>Uppdatering</b>: Tack vare arbetet av h2ik, så finns det en https utproxy tillgänglig för som kan användas via I2P. Från och med I2P 0.8.4 är <a href="http://localhost:7657/i2ptunnel/edit?tunnel=6">tunneln</a> konfigurerad vid installation.<br /> I fallet av att https utproxyn inte är inställd i din version av I2P, så kan du lägga till den lätt genom att göra följande:
