Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: Open <a href="http://localhost:7657/i2ptunnel/index.jsp">i2p tunnel manager</a>. Scroll down to the bottom.
id: Buka <a href=\"http://localhost:7657/i2ptunnel/index.jsp\">i2p tunnel manager</a> . scroll ke bawah sampai dasar halaman.
it: Apri il <a href="http://localhost:7657/i2ptunnel/index.jsp">gestore dei tunnel i2p</a>. Scorri la pagina fino in fondo.
mg: Sokafy <a href="http://localhost:7657/i2ptunnel/index.jsp">i2p tunnel manager</a>. ampidino hatrany ambany.
pt: Abra o <a href="http://localhost:7657/i2ptunnel/index.jsp">gestor de túnel de i2p</a>. Deslize até o fim.
sv_se: Öppna <a href="http://localhost:7657/i2ptunnel/index.jsp">I2Ps tunnel hanterare</a>. Skrolla ner till botten.

source: Choose <b>CONNECT</b> from <b>New Client Tunnel</b> dropdown list, click <b>Create</b>
id: Pilih <b>CONNECT</b> dari daftar dropdown <b>New Client Tunnel</b> , klik <b>Create</b>
it: Scegli <b>CONNETTI</b> nella menu a comparsa <b>Nuovo tunnel client</b>, fai clic su <b>Crea</b>
mg: fidio <b>CONNECT</b> from <b>New Client Tunnel</b> lisitra mikoriana, tsindrio <b>Create</b>
pt: Escolha <b>CONECTAR</b> na lista <b>Novo Túnel de Cliente</b>, clique <b>Criar</b>
sv_se: Välj <b>ANSLUT</b> från <b>Ny Klient-Tunnel</b> listan, klicka på <b>Skapa</b>

source: In the new page, <b>name</b> and <b>describe</b> your new https tunnel as you like. The <b>Access Point</b> is your local port for the new https proxy recommended port's <b>4445</b>. <b>Outproxy</b> should be the outproxy's .i2p address which supports https. See this forum post of <a href="http://%(forum)s/viewtopic.php?p=31356#31356">h2ik</a>'s for the address. Make sure <b>Shared Client</b>, <b>Delay Connect</b>, <b>AutoStart</b> are checked. Other options should be left at the defaults. Click Save. In tunnel manger, click the <b>Start</b> button next to your new tunnel.
id: Di halaman baru, <b>beri nama</b> dan <b>jelaskan</b> tunnel https baru yang anda inginkan. <b>Access Point</b> adalah port lokal anda untuk port https proxy yang direkomendasikan <b>4445</b> <b>Outproxy</b> harus menjadi alamat .i2p outproxy yang mendukung https. Lihat posting forum dari <a href=\"http://%(forum)s/viewtopic.php?p=31356#31356\">h2ik</a> untuk alamatnya. Pastikan <b>Shared Client</b> , <b>Delay Connect</b> , <b>AutoStart</b> dicentang. Pilihan lainnya harus dibiarkan di default. Klik Simpan. Di tunnel manager, klik tombol <b>Start di</b> di sebelah tunnel baru anda.
it: Nella nuova pagina, <b>dai un nome</b> e <b>una descrizione</b> al nuovo tunnel https a piacere. Il <b>punto di accesso</b> è la tua porta locale consigliata <b>4445</b> per il nuovo proxy https. L'<b>outproxy</b> dovrebbe essere l'indirizzo .i2p dell'outproxy che supporta https. Consulta questo articolo del forum di <a href="http://%(forum)s/viewtopic.php?p=31356#31356">h2ik</a> per l'indirizzo. Assicurati che siano impostate le opzioni <b>Client condiviso</b>, <b>Ritarda connessione</b>, <b>Avvio automatico</b>. Le altre opzioni dovrebbero essere lasciate sui loro valori predefiniti. Fai clic su Salva. Nel gestore dei tunnel, fai clic sul pulsante <b>Avvia</b> accanto al tuo nuovo tunnel.
mg: Ao amin'ny pejy vaovao, <b>name</b> and <b>describe</b> ny fantsona https vaovao araky izay tianao. Ny <b>Access Point</b> dia port ao an-toerana hoan'ny proxy https vaovao kosa dia port <b>4445</b>no tokony ampiasaina. <b>Outproxy</b> dia tokony ho adiresin'ny outproxy.i2p izay mizaka ny https. Jereo ity toerana firesahana ity <a href="http://%(forum)s/viewtopic.php?p=31356#31356">h2ik</a>momba ny adiresy. jereo raha voafidy daholo ireto <b>Shared Client</b>, <b>Delay Connect</b>, <b>AutoStart</b> . Ny sisa dia avelao amin'ny izao, tsindrio Save. Ao anaty Tunnel Manager, tsindrio ny bokotra <b>Start</b>, eo akaikin'ny fantsona vaovao.
pt: Na nova página, <b>denomine</b> e <b>descreva</b> seu novo túnel https como quiser. O <b>Ponto de Acesso</b> é sua porta local para a nova porta <b>4445</b> recomendada para o proxy http. <b>Proxy de saída</b> deve ser o endereço do proxy de saída.i2p compatível com https. Veja essa publicação de fórum pelo <a href="http://%(forum)s/viewtopic.php?p=31356#31356">h2ik</a> para o endereço. Certifique-se de que <b>Cliente compartilhado</b>, <b>Atrasar conexão</b>, <b>Autoiniciar</b> estejam ativados. Outras opções devem ser deixadas como estão. Clique Salvar. No gerenciador de túnel, clique no botão <b>Iniciar</b> ao lado do seu novo túnel.
sv_se: På den nya sidan, <b>namnge</b> och <b>beskriv</b> din nya https tunnel precis som du vill. <b>Access-punkten</b> är din lokala port för den nya https proxyn, port <b>4445</b> rekommenderas. <b>Utproxy</b> borde vara utproxyns .i2p adress som stödjer https. Se forum-posten av <a href="http://%(forum)s/viewtopic.php?p=31356#31356">h2ik</a> för adressen. Var säker på att <b>Delad Klient</b>, <b>Försenad Anslutning</b> och <b>Autostart</b> ikryssade. Andra alternativ bör lämnas med sina standard-värden. Klicka på "Save". I tunnelhanteraren, klicka på <b>Start</b>-knappen bredvid din nya tunnel.

source: In firefox, click through <b>Tools</b>><b>Options</b>><b>Advanced</b>><b>Network</b>><b>Setting</b>. Untick <b>Use this proxy for all protocol</b>, set <b>SSL proxy:</b> to localhost:4445.
id: Di Firefox, klik <b>Tools</b> > <b>Options</b> > <b>Advanced</b> > <b>Network</b> > <b>Setting</b> Hilangkan centang di <b>Gunakan proxy ini untuk semua protokol</b> , lalu atur <b>proxy SSL:</b> ke localhost: 4445.
it: In Firefox, fai clic su <b>Strumenti</b>><b>Opzioni</b>><b>Avanzate</b>><b>Rete</b>><b>Impostazione</b>. Togli il segno di spunta a <b>Usa questo proxy per tutti i protocolli</b>, imposta il <b>proxy SSL:</b> su localhost:4445.
mg: Ao anaty firefox, tsindrio daholo ny <b>Tools</b>><b>Options</b>><b>Advanced</b>><b>Network</b>><b>Setting</b>. esory ny <b>Use this proxy for all protocol</b>, ataovy <b>SSL proxy:</b> to localhost:4445.
pt: No firefox, clique em <b>Ferramentas</b>><b>Opções</b>><b>Avançado</b>><b>Rede</b>><b>Configuração</b>. Desmarque <b>Use esse proxy para todos os protocolos</b>, ative o <b>proxy SSL:</b> para localhost:4445.
sv_se: I Firefox, klicka igenom <b>Verktyg</b>><b>Alternativ</b>><b>Advancerade</b>><b>Nätverk</b>><b>Inställningar</b>. Avkryssa <b>Använd denhär proxyn för alla protokoll</b>, sätt <b>SSL proxy:</b> till localhost:4445.

source: Done.
he: בוצע
id: Selesai.
it: Fine.
mg: Vita.
pt: Concluído.
sv_se: Färdig.

source: This is a question that only you can answer because the correct answer depends on your behaviours, your <a href="%(threatmodel)s">threat model</a>, and how much you trust the outproxy operator.
id: Ini adalah pertanyaan yang hanya bisa anda jawab karena jawaban yang benar tergantung pada perilaku anda, <a href=\"%(threatmodel)s\">threat model</a> anda, dan seberapa besar anda mempercayai operator outproxy.
it: Questa è una domanda a cui solo tu puoi dare risposta perché quella corretta dipende dal tuo comportamento, <a href="%(threatmodel)s">dal tipo di minaccia</a> e dal tuo livello di fiducia in cui fa funzionare l'outproxy.
mg: Ity fanontaniana ity dia ianao ihany no afaka mamaly azy, satria ny valiny dia miankina amin'ny fitondranao tena, ny <a href="%(threatmodel)s">threat model</a>, sy ny fahatokisanao tanteraka ny mpampiasa outproxy.
pt: Esta é uma pergunta que só você pode responder porque a resposta correta depende do seu comportamento, seu <a href="%(threatmodel)s">modelo de ameaça</a>, e o quanto você confia no operador do proxy de saída.
sv_se: Dethär är en fråga som bara du kan besvaras eftersom det korrekta svaret beror på ditt beteende, din <a href="%(threatmodel)s">hot-modell</a> och hur mycket du litar på operatören av utproxyn.

source: Like Tor, I2P does not magically encrypt the Internet. You are vulnerable to snooping by the outproxy operators. The <a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers">Tor FAQ</a> does a good job of explaining this.
id: Seperti Tor, I2P tidak secara ajaib mengenkripsi Internet. Anda rentan terhadap pengintaian oleh operator outproxy. <a href=\"https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers\">FAQ Tor</a> menjelaskan hal ini dengan baik.
it: Al pari di Tor, I2P non cripta Internet con la magia. Sei vulnerabile ai tentativi di spionaggio messi in atto dagli operatori dell'outproxy. La <a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers">FAQ di TOR</a> offre spiegazioni adeguate a questa problematica.
mg: Ohatran'i Tor, I2P tsy dia manao majia loatra mba ierena ao amin'ny internet. Afaka hidiran'ny olona mampiasa outproxy ianao. Ny <a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers">Tor FAQ</a> dia manazava an'izay tsara.
pt: Assim como Tor, I2P não criptografa, magicamente, a Internet. Você é vulnerável à bisbilhotagem dos operadores do proxy de saída. A <a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers">FAQ do Tor</a> faz um bom trabalho em explicar isso.
sv_se: Precis som Tor, kan I2P inte magiskt kryptera internet. Du är sårbar mot avlyssning av operatörerna av utproxyn. <a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers">Tor FAQ</a>:en förklarar detta på ett bra vis.

source: In addition, you may be vulnerable to collusion between the outproxy operator and operators of other I2P services, if you use the same tunnels ("shared clients"). There is additional discussion about this on <a href="http://%(zzz)s/topics/217">%(zzz)s</a>.
id: Selain itu, anda mungkin rentan terhadap kolusi antara operator outproxy dan operator layanan I2P lainnya, jika anda menggunakan tunnel yang sama ("shared clients"). Ada diskusi tambahan tentang topik ini di <a href=\"http://%(zzz)s/topics/217\">%(zzz)s</a>
it: Inoltre, potresti essere vulnerabile alle collusione tra l'operatore dell'outproxy e quelli di altri servizi I2P, se usi gli stessi tunnel ("client condivisi"). Esiste una discussione aggiuntiva in merito su <a href="http://%(zzz)s/topics/217">%(zzz)s</a>.
mg: Fanampiny, mety ho tratran'ny ny fifandonana eo amin'ny mpampiasa outproxy sy ny mpampiasa servisy hafa ao amin'ny I2P ianao , raha mampiasa fantsona mitovy ("shared clients"). Misy resaka momba izay ato amin'ny <a href="http://%(zzz)s/topics/217">%(zzz)s</a>.
pt: Além disso, você pode estar vulnerável à colusão entre o operador do proxy de saída e os operadores de outros serviços do I2P, se você usar os mesmos túneis ("clientes compartilhados"). Há informação adicional sobre isso em <a href="http://%(zzz)s/topics/217">%(zzz)s</a>.
sv_se: Utöver det, så kan du vara sårbar för sammarbete mellan utproxy operatörer och operatörerna av andra I2P-tjänster, om du använder samma tunnlar ("delade klienter"). Det finns en ytterliggare diskussion om detta på <a href="http://%(zzz)s/topics/217">%(zzz)s</a>.

source: Unless an outproxy has been set up for the service you want to connect to, this cannot be done. There are only three types of outproxies running right now: HTTP, HTTPS, and email. Note that there is not a SOCKS outproxy. If this type of service is required, try <a href="https://www.torproject.org/">Tor</a>.
id: Kecuali jika outproxy telah disiapkan untuk layanan yang ingin anda hubungi, ini tidak dapat dilakukan. Hanya ada tiga jenis outproxies yang sedang berjalan saat ini: HTTP, HTTPS, dan email. Perhatikan bahwa tidak ada outproxy SOCKS. Jika jenis layanan ini diperlukan, cobalah <a href=\"https://www.torproject.org/\">Tor</a>
it: A meno che non sia stato impostato un outproxy per il servizio a cui vuoi collegarti, non è possibile farlo. Ci sono solo tre tipi di outproxy in funzione al momento: HTTP, HTTPS e e-mail. Ricorda che non c'è un outproxy SOCKS. Se è questo il servizio che ti serve, prova <a href="https://www.torproject.org/">Tor</a>.
mg: Raha tsy hoe efa nohomanina hifandray amin'ny servisy iray ny outproxy, dia tsy azo atao izany. Telo ihany ny outproxy mihodina :HTTP, HTTPS, ary mailaka. Fanamarihina, tsy misy ny outproxy SOCKS. Raha ilaina io servisy io , andramo <a href="https://www.torproject.org/">Tor</a>.
pt: Exceto que haja um proxy de saída para o serviço que você deseja, isso não pode ser feito. Há apenas três tipos de proxies de saída rodando no momento: HTTP, HTTPS, e e-mail. Observe que não há um proxy de saída SOCKS. Se esse tipo de serviço é necessário, experimente <a href="https://www.torproject.org/">Tor</a>.
sv_se: Om en utproxy inte har blivit intesälld för tjänsten du vill ansluta till, så kan det inte göras. Det finns bara tre typer av utproxies som kör nu: HTTP, HTTPS och e-post. Notera att det inte finns en SOCKS utproxy. Om den typen av tjänst behövs, testa <a href="https://www.torproject.org/">Tor</a>.

source: If you consider every eepsite that has ever been created, yes, most of them are down. People and eepsites come and go. A good way to get started in I2P is check out a list of eepsites that are currently up. <a href="%(eepstatus)s">%(eepstatus)s</a> tracks active eepsites.
id: Jika anda mempertimbangkan setiap eepsite yang pernah dibuat, ya, sebagian besar dari mereka sedang tidak aktif. Orang dan eepsites datang dan pergi. Cara yang baik untuk memulai di I2P adalah melihat daftar eepsites yang sedang aktif. <a href=\"%(eepstatus)s\">%(eepstatus)s</a> melacak eepsites aktif
it: Se prendi in considerazione ogni singolo eepsite che sia mai stato creato, sì, la maggior parte di essi non funziona. Gli utenti e gli eepsite vanno e vengono. Un buon modo per cominciare dentro I2P è di controllare l'elenco di eepsites attualmente attivi. <a href="%(eepstatus)s">%(eepstatus)s</a> tiene traccia degli eepsite attivi.
mg: Raha jerena ny tranon'kala namboarina teto amin'ny tambazotra miafina, dia eny, maty avokoa izy ireo. Ny olona sy ny pejy dia mandeha sy miverina. Ny fomba tsara indrindra hanombohanao ny I2P dia ny fitiliana ny lisitry ny pejy mandeha. <a href="%(eepstatus)s">%(eepstatus)s</a> tracks active eepsites.
pt: Se você acredita que todo eepsite que já foi criado, sim, a maior parte deles está desligada. Pessoas e eepsites vêm e vão. Uma boa forma de se iniciar no I2P é verificar uma lista de eepsites que estão atualmente ativas. <a href="%(eepstatus)s">%(eepstatus)s</a> registra eepsites ativos.
sv_se: Om du tittar på alla eepsiter som någonsin skapats, ja, de flesta av dom är nere. Människor och eepsiter kommer och går. Ett bra sätt att komma igång med I2P är att kika på en lista av eepsiter som för tillfället är uppe. <a href="%(eepstatus)s">%(eepstatus)s</a> håller koll på aktiva eepsiter.

source: Click on the <a href="http://localhost:7658/">Website</a> link at the top of your router console for instructions.
id: Klik pada tautan <a href=\"http://localhost:7658/\">Situs Web</a> di bagian atas router consel anda untuk mendapatkan petunjuk.
it: Fai clic sul link <a href="http://localhost:7658/">Website</a> in alto nella pagina del router per le istruzioni.
mg: Tsindrio eo amin'ny <a href="http://localhost:7658/">Website</a> link eo an-tampony ny router ahitana torohevitra.
pt: Clique na hiperligação do <a href="http://localhost:7658/">site da Web</a> no topo da consola do seu roteador para instruções.
sv_se: Klicka på länken till<a href="http://localhost:7658/">Webbsidan</a> längst upp på din routerkonsol för instruktioner.

source: Why are downloads, torrents, web browsing, and everything else so slow on I2P? The encryption and routing within the I2P network adds a substantial amount of overhead and limits bandwidth. Anonymity isn't free.
id: Mengapa unduhan, torrents, browsing web, dan segala sesuatu yang lain begitu lambat pada I2P? Enkripsi dan perutean dalam jaringan I2P menambah banyak overhead dan membatasi bandwidth. Anonimitas tidak gratis.
it: Perché i download, i torrent, la navigazione web e tutto il resto sono così lenti su I2P? La cifratura e l'instradamento all'interno della rete I2P aggiungono una quantità sostanziale di informazione aggiuntiva e limitano la banda. L'anonimato ha il suo prezzo da pagare.
mg: Fa nahoana no mora loatra ny hafainganam-pandehan'ny torrents, fikirakirana tranonkala, sy ny sisa rehetra ao amin'ny i I2P? Ny fanafenana sy fitsinjarana rehetra ao anaty I2P dia mampitombo asa atao ao anaty tambazotra, ary mamaritra ny fetran'nybandwidth. Tsy dia homena fotsiny ny fierena.
pt: Por que os downloads, torrents, navegação e tudo mais está tão lento no I2P? A criptografia e roteamento dentro da rede I2P adiciona uma quantidade substancial de sobrepeso e limita a largura de banda. O anonimato não é gratuito.
sv_se: Varför är nedladdningar, torrentar, webbsurfande och allt annat så långsamt i I2P? Krypteringen och routing inom I2P-nätverket lägger till stora mängder overhead och begränsar bandbredd. Anonymitet är inte gratis.

source: In addition, you and everybody else probably need to increase your bandwidth limits. Two key settings are the inbound and outbound bandwidth limiters on <a href="http://localhost:7657/config.jsp">the configuration page</a>. With the default settings of 32KBps you will generally get no better than 15KBps data transfer in I2PSnark. Increasing the settings (but keeping within your actual connection limitations) will increase the potential transfer rate for I2PSnark and all other applications.
id: Selain itu, anda dan orang lain mungkin perlu meningkatkan batas bandwidth anda. Dua pengaturan utama adalah pembatas bandwidth inbound dan outbound pada <a href=\"http://localhost:7657/config.jsp\">halaman konfigurasi</a> Dengan pengaturan default 32KBps, anda umumnya tidak akan mendapatkan transfer data yang lebih baik dari 15KBps di I2PSnark. Meningkatkan pengaturan (tapi tetap dalam keterbatasan koneksi anda) akan meningkatkan kecepatan transfer potensial untuk I2PSnark dan semua aplikasi lainnya.
it: Inoltre, sia tu che tutti gli utenti dovreste probablimente aumentare i limiti che avete impostato per la larghezza di banda. Le due impostazioni chiave sono i limiti di banda per il traffico in entrata e in uscita nella <a href="http://localhost:7657/config.jsp">pagina di configurazione</a>. Con le impostazioni predefinite di 32 KBps, di solito non si va oltre i 15KBps come velocità di trasferimento in I2PSnark. L'aumento delle impostazioni (mantenendole entro i limiti della connessione attuale) farà crescere la velocità potenziale di trasferimento per I2PSnark e tutte le altre applicazioni.
mg: Ary koa, ianao sy ny olon'kafa rehetra dia tokony ampiakatra ny salan'ny bandwidth. Ny tena heriny dia ny fandrindrana ny mihiditra sy ny mivoaka eo amin'ny <a href="http://localhost:7657/config.jsp">the configuration page</a>. Amin'ny salan'isa efa voapetraka teo aloha izay 32KBps, dia mety tsy ahazo mihoatry ny 15KBps eo amin'i I2Psnark ianao. NY fampiakarana ny salan'isa (fa tazomina ny fetran'ny fifandraisanao efa eo) dia ampiakatra ny tanjaky ny famindrana hoan'i I2Psnark sy ny fampiarana hafa rehetra.
pt: Adicionalmente, você e todo mundo provavelmente precisam aumentar seus limites de banda. Duas configurações principais são os limitadores de entrada e de saída de banda <a href="http://localhost:7657/config.jsp">na página de configuração</a>. Com as configurações padrão de 32KBps você geralmente não consegue mais que 15KBps de transferência no I2PSnark. Aumentando as configurações (mas respeitando os limites reais da sua conexão) você aumenta o potencial de transmissão no I2PSnark e todas as outras aplicações.
sv_se: Utöver det, behöver troligtvis du och alla andra öka dina bandbredds-inställningar. De två huvudinställningarna är de inåtgående och utåtgående bandbreddsgränserna på <a href="http://localhost:7657/config.jsp">konfigurations-sidan</a>. Med standardinställningen 32KB/s så kommer du nog inte få mer än 15KB/s överföringshastighet i I2PSnark. Att öka inställningarn (men håll dom inom gränserna för vad din internetanslutning klarar) kommer öka den potentiella överföringshastigheten för I2PSnark och alla andra applikationer.

source: Also, do you have sufficient share bandwidth configured to allow participating tunnels to route through your router? Believe it or not, allowing participating traffic keeps you well-integrated in the network and helps your own transfer speeds.
id: Selain itu, apakah anda memiliki share bandwidth yang cukup dikonfigurasi untuk mengizinkan participating tunnel untuk melakukan rute melalui router anda? Percaya atau tidak, membiarkan lalu lintas yang berpartisipasi membuat anda tetap terintegrasi dengan baik dalam jaringan dan membantu kecepatan transfer anda sendiri.
it: Come se non bastasse, disponi di sufficiente banda condivisa configurata per consentire ai tunnel coinvolti l'instradamento tramite il tuo router? Credici o meno, consentire il passaggi di traffico ti mantiene ben integrato nella rete e giova alla velocità dei tuoi trasferimenti.
mg: Sy, manana bandwidth betsaka ve ianao ahafahana mandray anjara eo amin'ny fantsona izay hitondra mankany amin'ny router nao? Minoa ahy ianao na tsia, ny hanokafanao ny fandraisana anjara amin'ny serasera dia hanampy anao ho tafihiditra tsara ao amin'ny tambazotra, ary hanampy anao amin'ny hafainganana ny famindrana isan-karazany.
pt: Ademais, você tem compartilhamento suficiente de banda configurado para permitir que túneis participantes roteiem pelo seu roteador? Acredite ou não, permitir tráfego participante mantém você bem integrado na rede e ajuda suas próprias velocidades de transferência.
sv_se: Har du tillräkligt med utdelad bandbredd inställd för att kunna delta i tunnlar? Tro det eller ej, genom att delta i andras tunnlar så kommer din router bli väl integrerad i nätverket, vilket hjälper dina egna överföringshastigheter.

source: I2P is a work in progress. Lots of improvements and fixes are being implemented, and generally speaking, running the latest release will help your performance. If you haven't, <a href="%(downloadslist)s">install the latest release</a>.
id: I2P adalah proyek yang sedang berjalan. Banyak peningkatan dan perbaikan sedang diterapkan, dan secara umum, menjalankan rilis terbaru akan membantu kinerja anda. Jika belum, <a href=\"%(downloadslist)s\">instal rilis terbaru</a>.
it: I lavori su I2P sono tuttora in corso. Ci sono tanti miglioramenti e risoluzoni di problemi che vengono implementati e, di solito, eseguire la versione più recente aiuta a migliorare le prestazioni. Se non l'hai già fatto, <a href="%(downloadslist)s">installa la versione più recente</a>.
mg: I2P dia mivaotra isan'andro. Betsaka ny fanatsarana sy fanamboarana efa natao, ary amin'ny ankapobeny , ny fampiasana ny modely farany dia hampiova zavatra be dia be. Raha ts yefa nataonao dia, <a href="%(downloadslist)s">install the latest release</a>.
pt: I2P é um trabalho em progresso. Muitas melhorias e consertos estão sendo implementados, e em geral, rodar a última versão ajudará sua performance. Se você não tem, <a href="%(downloadslist)s">instale a última versão</a>.
sv_se: I2P förbättras hela tiden. Massor av förbättringar och fixar implementeras och generellt sett, så förbättras din prestanda av att köra den senaste versionen. Om du inte gjort det redan, <a href="%(downloadslist)s">installera den senaste releasen</a>.

source: See the <a href="http://%(forum)s/viewtopic.php?t=2068">I2P Bittorrent FAQ</a>
id: Lihat <a href=\"http://%(forum)s/viewtopic.php?t=2068\">FAQ Bittorrent I2P</a>
it: Consulta la <a href="http://%(forum)s/viewtopic.php?t=2068">FAQ per Bittorrent di I2P</a>
mg: Jereo ny <a href="http://%(forum)s/viewtopic.php?t=2068">I2P Bittorrent FAQ</a>
pt: Veja o⏎ <a href="http://%(forum)s/viewtopic.php?t=2068">I2P Bittorrent FAQ</a>
sv_se: Se <a href="http://%(forum)s/viewtopic.php?t=2068">I2P Bittorrent FAQ</a>:en
