Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: <b>Outbound UDP from the random port noted on the <a href="http://127.0.0.1:7657/confignet.jsp">configuration page</a> to arbitrary remote UDP ports, allowing replies</b>
id: Outbound UDP dari port acak yang tercantum pada <a href=\"http://127.0.0.1:7657/confignet.jsp\">halaman konfigurasi</a> untuk arbitrary remote UDP ports, memungkinkan balasan
it: <b>UDP in uscita dalla porta casuale indicata nella <a href="http://127.0.0.1:7657/confignet.jsp">pagina di configurazione</a> verso porte UDP remote arbitrarie, per consentire le risposte</b>
mg: <b>UDP mivoaka avy amin'ny port voafidy an'anjony voamarika eo amin'ny<a href="http://127.0.0.1:7657/confignet.jsp">configuration page</a> mankany amin'ny port UDP voafaritra, manaiky fifamaliana</b>
pt: <b>Saída de UDP pela porta aleatória mencionada na <a href="http://127.0.0.1:7657/confignet.jsp">página de configuração</a> rumo a indeterminadas portas UDP, permitindo respostas</b>
sv_se: <b>Utåtgående UDP från den slumpmässiga porten visas på <a href="http://127.0.0.1:7657/confignet.jsp">konfigurationssidan</a> till olika fjärran UDP portar, som gör svar möjligt</b>

source: <b>Outbound TCP from random high ports to arbitrary remote TCP ports</b>
id: Outbound TCP dari random high ports kepada arbitrary remote TCP ports
it: <b>TCP in uscita da porte casuali alte verso porte TCP remote arbitrarie</b>
mg: <b>TCP mivoaka avy amin'ny port nalaina an'anjony makany amin'ny port TCP fantatra</b>
pt: <b>Saída de TCP por portas altas aleatórias rumo a indeterminadas portas TCP remotas</b>
sv_se: <b>Utåtgående TCP från slumpmässiga höga portar till olika fjärran TCP portar</b>

source: <b>(optional, but recommended) Inbound UDP to the port noted on <a href="http://127.0.0.1:7657/confignet.jsp">configuration page</a> from arbitrary locations</b>
id: <b>(opsional, tetapi disarankan) Inbound UDP port yang tercantum pada <a href=\"http://127.0.0.1:7657/confignet.jsp\">halaman konfigurasi</a> dari lokasi arbitrary</b>
it: <b>(facoltativo, ma consigliato) UDP in entrata verso la porta indicata nella <a href="http://127.0.0.1:7657/confignet.jsp">pagina di configurazione</a> da posizioni arbitrarie</b>
mg: <b>(fanampiny hafa, tokony atao) UDP mihiditra mankany amin'ny port voalaza eto <a href="http://127.0.0.1:7657/confignet.jsp">configuration page</a> avy amin'ny toerana voafaritra</b>
pt: <b>(opcional, mas recomendado) Entrada de UDP pela porta mencionada na <a href="http://127.0.0.1:7657/confignet.jsp">página de configuração</a> a partir de indeterminadas localizações</b>
sv_se: <b>(valfri, men rekommenderar) Inåtgående UDP till porten som visas på <a href="http://127.0.0.1:7657/confignet.jsp">konfigurationssidan</a> från olika platser</b>

source: <b>(optional, but recommended) Inbound TCP to the port noted on <a href="http://127.0.0.1:7657/confignet.jsp">configuration page</a> from arbitrary locations</b><br /> Inbound TCP may be disabled on the <a href="http://127.0.0.1:7657/confignet.jsp">configuration page.</a>
id: <b>(opsional, tetapi disarankan) Inbound TCP port yang tercantum pada <a href=\"http://127.0.0.1:7657/confignet.jsp\">halaman konfigurasi</a> dari lokasi yang arbitrary</b><br>Inbound TCP mungkin dinonaktifkan pada <a href=\"http://127.0.0.1:7657/confignet.jsp\">halaman konfigurasi.</a>
it: <b>(facoltativo, ma consigliato) TCP in entrata verso la porta indicata nella <a href="http://127.0.0.1:7657/confignet.jsp">pagina di configurazione</a> da posizioni arbitrarie</b> </b><br /> TCP in entrata potrebbe essere disattivato nella <a href="http://127.0.0.1:7657/confignet.jsp">pagina di configurazione.</a>
mg: <b>(fanampiny hafa,tokony atao)TCP mihiditra manakany amin'ny port voalaza ato <a href="http://127.0.0.1:7657/confignet.jsp">configuration page</a> avy amin'ny toerana voafaritra</b><br/> Ny TCP mihiditra dia azo esorina ato amin'ny <a href="http://127.0.0.1:7657/confignet.jsp">configuration page.</a>
pt: <b>(opcional, mas recomendado) Entrada de TCP pela porta mencionada na <a href="http://127.0.0.1:7657/confignet.jsp">página de configuração</a> a partir de indeterminadas localizações</b><br /> Entrada de TCP pode ser desativada na <a href="http://127.0.0.1:7657/confignet.jsp">página de configuração.</a>
sv_se: <b>(valfri, men rekommenderar) Inåtgående UDP till porten som visas på <a href="http://127.0.0.1:7657/confignet.jsp">konfigurationssidan</a> från olika platser</b><br /> Inåtgående TCP kan slås av på <a href="http://127.0.0.1:7657/confignet.jsp">konfigurationssidan</a>.

source: <b>Outbound UDP on port 123, allowing replies</b><br /> This is necessary for I2P's internal time sync (via SNTP - querying a random SNTP host in pool.ntp.org or another server you specify)
id: <b>Outbound UDP pada port 123 memungkinkan balasan</b><br>Hal ini diperlukan untuk sinkronisasi waktu internal I2P's (melalui SNTP - query sejumlah SNTP acak di pool.ntp.org atau server lain yang anda tentukan)
it: <b>UDP in uscita sulla porta 123, per consentire le risposte</b><br /> Questa è necessaria per la sincronizzazione interna dell'orario in I2P (tramite SNTP - con query verso un host SNTP casuale sul server pool.ntp.org o u altri di tua impostazione)
mg: <b>UDP mivoaka eo amin'ny port 123, manakasitraka famaliana</b><br/> Ilaina io mba ahafahan'ny ora ao amin'ny I2P mifandrindra (amin'ny SNTP - na mifidy an'anjony mpizara SNTP iray ao amin'ny pool.ntp.org na hafa izay lazainao)
pt: <b>Saída de UDP pela porta 123, permitindo respostas</b><br /> Isso é necessário para sincronização interna do horário do I2P's (via SNTP - questionando um host aleatório em pool.ntp.org ou outro servidor que você indicar)
sv_se: <b>Utåtgående UDP på port 123, som möjliggör svar</b><br /> Detta är nödvändigt för I2Ps interna tidssynkronisering (via SNTP - fråga en slumpmässig SNTP-värd i pool.ntp.org eller en annan server om du valt det)

source: <b>Local I2P ports</b>, listening only to local connections by default, except where noted:
id: Port lokal I2P</b>, mendengarkan hanya koneksi lokal secara default, kecuali di mana:
it: <b>Porte I2P locali</b>, in ascolto solo delle connessioni locali come impostazione predefinita, eccetto dove specificato:
mg: <b>port I2P an-toerana</b>, mihaino ny fifandraisana eo an-toerana, raha tsy hoe voalaza ohatr'izao:
pt: <b>Portas I2P locais</b>, aguardando apenas conexões locais por padrão, exceto onde indicado:
sv_se: <b>Lokala I2P portar</b>, lyssnar bara på lokala anslutningar som standard, förutom där det påpekas:

source: <b>1900:</b> UPnP SSDP UDP multicast listener. <i>Cannot be changed. Binds to all interfaces. May be disabled on <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
id: <b>1900:</b> UPnP SSDP UDP multicast listener. <i>Tidak dapat diubah.</i> Bind ke semua interface. Dapat dinonaktifkan di <a href=\"http://localhost:7657/confignet.jsp\">confignet.jsp</a>.
it: <b>1900:</b> ascolto multicast UDP SSDP UPnP. <i>Non può essere cambiata. Si lega a tutte le interfacce. Può essere disattivata su <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
mg: <b>1900:</b>UPnP SSDP UDP multicast listener. <i>Tsy azo soloina. Mihaino ny interface rehetra. Azo esorina eo amin'ny <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
pt: <b>1900:</b> Escuta multicast de UPnP SSDP UDP. <i>Não pode ser alterada. Liga-se a todas as interfaces. Pode ser desativada em <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
sv_se: <b>1900:</b> UPnP SSDP UDP multcast-lyssnar. <i>Kan inte ändras. Binder till alla interface. Kan slås av på <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>

source: <b>2827:</b> BOB bridge, a higher level socket API for clients <i>Disabled by default. May be enabled/disabled on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. May be changed in the bob.config file.</i>
id: 2827:</b> BOB bridge, socket API tingkat lebih tinggi untuk klien <i>dinonaktifkan secara default.</i> Dapat diaktifkan/dinonaktifkan pada <a href=\"http://localhost:7657/configclients.jsp\">configclients.jsp</a>. Dapat diubah dalam bob.config file.
it: <b>2827:</b> BOB bridge, un'API socket di livello più alto per i client <i>Disattivata per impostazione predefinita. Può essere attivata/disattivata su <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Può essere modificata nel file the bob.config.</i>
mg: <b>2827:</b>Fiampitana BOB, API socket ambony hoan'ny mpanjifa <i>Tsy nalefa amin'ny voaloany. Azo alefa/vonoina eo amin'ny <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Azo amboarina ao amin'ny fisy bob.config.</i>
pt: <b>2827:</b> Ponte BOB, uma API de encaixe de alto nível para clientes <i>Desativada por padrão. Pode ser ativada/desativada em <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Pode ser alterada no arquivo bob.config.</i>
sv_se: <b>2827:</b> BOB bryggan, ett högnivå socket API för klienter <i>Avslagen som standard. Kan slås av/på på <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Kan eventuellt ändras i bob.config filen.</i>

source: <b>4444:</b> HTTP proxy <i>May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.</i>
id: <b>4444:</b> HTTP proxy <i>dapat dinonaktifkan atau diubah pada halaman i2ptunnel di console router.</i> Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
it: <b>4444:</b> proxy HTTP <i>Può essere disattivata o modificata nella pagina di i2ptunnel nel console router. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce.</i>
mg: <b>4444:</b> HTTP proxy <i> Azo vonoina na ovaina avy eo amin'ny faritry'ny fantsona i2p eo amin'ny takela fibaikoana by router. Azo atao koa ny mampihaino azy eo amin'ny fari-pifandraisana iray na izy rehetra.</i>
pt: <b>4444:</b> Proxy HTTP <i>Pode ser desativado ou alterado na página Túnel i2p no painel do roteador. Também pode ser configurado para se ligar a uma interface específica ou todas as interfaces.</i>
sv_se: <b>4444:</b> HTTP proxy <i>Kan slås av eller ändras på i2ptunnel-sidan i routerkonsolen. Kan även konfigureras till att lyssna på ett specifikt interface ller alla interface.</i>

source: <b>4445:</b> HTTPS proxy <i>May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.</i>
id: <b>4445:</b> HTTPS proxy <i>dapat dinonaktifkan atau diubah pada halaman i2ptunnel di console router.</i> Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
it: <b>4445:</b> proxy HTTPS <i>Può essere disattivata o modificata nella pagina di i2ptunnel nel console router. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce.</i>
mg: <b>4445:</b> HTTPS proxy <i> Azo vonoina na ovaina avy eo amin'ny faritry'ny fantsona i2p eo amin'ny takela fibaikoana by router. Azo atao koa ny mampihaino azy eo amin'ny fari-pifandraisana iray na izy rehetra.</i>
pt: <b>4445:</b> Proxy HTTPS <i>Pode ser desativado ou alterado na página Túnel i2p no painel do roteador. Também pode ser configurado para se ligar a uma interface específica ou a todas as interfaces.</i>
sv_se: <b>4445:</b> HTTPS proxy <i>Kan slås av eller ändras på i2ptunnel-sidan i routerkonsolen. Kan även konfigureras att lysna på ett specifikt interface eller alla interface.</i>

source: <b>6668:</b> IRC proxy <i>May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.</i>
id: <b>6668:</b> IRC proxy <i>dapat dinonaktifkan atau diubah pada halaman i2ptunnel di console router.</i> Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
it: <b>6668:</b> proxy IRC <i>Può essere disattivata o modificata nella pagina di i2ptunnel nel console router. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce.</i>
mg: <b>6668:</b>IRC proxy <i> Azo vonoina na ovaina avy eo amin'ny faritry'ny fantsona i2p eo amin'ny takela fibaikoana by router. Azo atao koa ny mampihaino azy eo amin'ny fari-pifandraisana iray na izy rehetra.</i>
pt: <b>6668:</b> proxy IRC <i>Pode ser desativado ou alterado na página Túnel i2p no painel do roteador. Também pode ser configurado para se ligar a interfaces específicas ou a todas as interfaces.</i>
sv_se: <b>6668:</b> IRC proxy <i>Kan slås av eller ändras på i2ptunnel-sidan i routerkonsolen. Kan även konfigureras till att lyssna på ett specifikt interface eller alla interfaces.</i>

source: <b>7652:</b> UPnP HTTP TCP event listener. <i>Binds to the LAN address. May be changed with advanced config i2np.upnp.HTTPPort=nnnn. May be disabled on <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
id: <b>7652:</b> UPnP HTTP TCP event listener. <i>Bind kepada alamat LAN.</i> Dapat diubah dengan konfigurasi lanjutan di i2np.upnp.HTTPPort=nnnn. Dapat dinonaktifkan di <a href=\"http://localhost:7657/confignet.jsp\">confignet.jsp</a>.
it: <b>7652:</b> ascolto degli eventi TCP HTTP UPnP. <i>Si lega all'indirizzo LAN. Può essere cambiata con la configurazione avanzata i2np.upnp.HTTPPort=nnnn. Può essere disattivata su <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
mg: <b>7652:</b>UPnP HTTP TCP mpihaino zava-miseho. <i>Mihaino eo amin'ny adiresin'ny LAN. Azo ovaina avy eo amin'ny advanced config i2np.upnp.HTTPPort=nnnn. Azo vonoina eo amin'ny <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
pt: <b>7652:</b> Escuta de eventos UPnP HTTP TCP. <i>Liga-se ao endereço da LAN. Pode ser alterada com a configuração avançada i2np.upnp.HTTPPort=nnnn. Pode ser desativada em <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
sv_se: <b>7652:</b> UPnP HTTP TCP händelse-lyssnare. <i>Binder till LAN-adressen. Kan ändras med advancerad konfig i2np.upnp.HTTPPort=####. Kan slås av på <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>

source: <b>7653:</b> UPnP SSDP UDP search response listener. <i>Binds to all interfaces. May be changed with advanced config i2np.upnp.SSDPPort=nnnn. May be disabled on <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
id: <b>7653:</b>UPnP SSDP UDP search response listener. <i>Bind ke semua interface.</i> Dapat diubah dengan konfigurasi lanjutan di i2np.upnp.SSDPPort=nnnn. Dapat dinonaktifkan di <a href=\"http://localhost:7657/confignet.jsp\">confignet.jsp</a>.
it: <b>7653:</b> ascolto risposta ricerca UDP SSDP UPnP. <i>Si lega a tutte le interfacce. <i>Può essere cambiata con la configurazione avanzata i2np.upnp.SSDPPort=nnnn. Può essere disattivata su <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
mg: <b>7653:</b> UPnP SSDP UDP mpihaino valiny. <i>Mihaino eo amin'ny interfaces rehetra. Azo ovaina avy eo amin'ny advanced config i2np.upnp.SSDPPort=nnnn. Azo vonoiny eo amin'ny <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
pt: <b>7653:</b> Escuta de resposta de pesquisa UPnP SSDP UDP. <i>Liga-se a todas as interfaces. Pode ser alterada na configuração avançada i2np.upnp.SSDPPort=nnnn. Pode ser desativada em <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>
sv_se: <b>7653:</b> UPnP SSDP UDP sök-svars lyssnare. <i>Binder till alla interface. Kan ändras med advancerad konfig i2np.upnp.SSDPPort=####. Kan slås av på <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>.</i>

source: <b>7654:</b> I2P Client Protocol port, used by client apps. <i>May be changed to a different port on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a> but this is not recommended. May be to bind to a different interface or all interfaces, or disabled, on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.</i>
id: <b>7654:</b> I2P Client Protocol port, yang digunakan oleh aplikasi klien. <i>Dapat diubah ke port yang berbeda pada <a href=\"http://localhost:7657/configclients.jsp\">configclients.jsp</a> , tetapi hal ini tidak dianjurkan.</i> Dapat bind ke interface yang berbeda atau semua interface, atau dinonaktifkan, pada <a href=\"http://localhost:7657/configclients.jsp\">configclients.jsp</a>.
it: <b>7654:</b> porta di protocollo client I2P, usata dalle applicazione client. <i>Può essere cambiata con una porta diversa su <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a> ma non è consigliato. Può essere impostata per legarsi a una interfaccia diversa o a tutte le interfacce, oppure disattivata su <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.</i>
mg: <b>7654:</b> Protocole port I2P hoan'ny mpanjifa, ampiasain'ny mpanjifa ho'an ny fampiarany. <i>Azo hovaina ho port hafa eo amin'ny <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a> fa tsy dia amporisihina ny fampiasana izany. Azo atao ny mampihaino azy eo amin'ny iterface iray na izy rehetra, na vonoina, eo amin'ny <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.</i>
pt: <b>7654:</b> Porta I2P para Protocolo de Cliente, usada por apps clientes. <i>Pode ser alterada para outra porta em <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a> mas não é recomendado. Pode ser ligada numa diferente interface, ou em todas, ou desativada, em <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.</i>
sv_se: <b>7654:</b> I2P Klient Protokoll port, används av klient-appar. <i>Kan ändras till en annan port på <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a> men det rekommenderas inte. Kan ändras till ett annat interface eller alla interface, eller slås av, på <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.</i>

source: <b>7655:</b> UDP for SAM bridge, a higher level socket API for clients <i>Only opened when a SAM V3 client requests a UDP session. May be enabled/disabled on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. May be changed in the clients.config file with the SAM command line option sam.udp.port=nnnn.</i>
id: <b>7655:</b> UDP untuk SAM bridge, socket API tingkat lebih tinggi untuk klien <i>hanya dibuka ketika klien SAM V3 meminta sesi UDP.</i> Dapat diaktifkan/dinonaktifkan pada <a href=\"http://localhost:7657/configclients.jsp\">configclients.jsp</a>. Dapat diubah dalam file clients.config dengan opsi SAM command lline sam.udp.port=nnnn.
it: <b>7655:</b> UDP per SAM bridge, un'API socket di più alto livello per i client <i>Aperta solo quando un client SAM V3 richiede una sessione UDP. Può essere attivata o disattivata su <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Può essere modificata nel file clients.config con l'opzione per riga di comando SAM sam.udp.port=nnnn.</i>
mg: <b>7655:</b> UDP hoan'ny mpampiepita UDP, API socket ambony hoan'ny mpanjifa <i>Misokatra rehefa mangataka UDP ny mpanjifa SAM V3. Azo velomina/vonoina eo amin'ny <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Azo ovaina ao amin'ny fisin'ny clients.config amin'ny fampiasana ny safidin'ny sora-pibaikoanan'i SAM sam.udp.port=nnn.</i>
pt: <b>7655:</b> UDP para a ponte SAM, uma API de encaixe de mais alto nível para clientes <i>Aberta apenas quando um cliente SAM V3 solicita uma seção UDP. Pode ser ativada/desativada em <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Pode ser alterada no arquivo clients.config com a opção de linha de comando da SAM sam.udp.port=nnnn.</i>
sv_se: <b>7655:</b> UDP för SAM brydda, ett högnivå socket API för klienter <i>Öppnas endast när en SAM V3-klient begär en UDP session. Kan slås på/av på <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Kan ändras i clients.config filen med SAM alternativet sam.udp.port=####§.</i>

source: <b>7656:</b> SAM bridge, a higher level socket API for clients <i>Disabled by default for new installs as of release 0.6.5. May be enabled/disabled on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. May be changed in the clients.config file.</i>
id: <b>7656:</b> SAM bridge, socket API tingkat lebih tinggi untuk klien <i>dinonaktifkan secara default untuk menginstall baru pada rilis 0.6.5.</i> Dapat diaktifkan/dinonaktifkan pada <a href=\"http://localhost:7657/configclients.jsp\">configclients.jsp</a>. Dapat diubah dalam clients.config file.
it: <b>7656:</b> SAM bridge, un'API socket di livello più alto per i client <i>Disattivata per impostazione predefinita per le nuove installazioni a partire dalla versione 0.6.5. Può essere attivata/disattivata su <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Può essere modificata nel file the clients.config.</i>
mg: <b>7656:</b>Mpampiepita SAM , socket API ambony hoan'ny mpanjifa <i> Tsy novelomina teny am-bohalohany hoan'ny fametrahana vaovao nanomboka teo amin'ny modely 0.6.5 Azo velomina/vonoina eo amin'ny <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Azo ovaina ao amin'ny fisy clients.config .</i>
pt: <b>7656:</b> Ponte SAM, uma API de encaixe de nível mais alto para clientes <i>Desativada por padrão para novas instalações a partir da versão 0.6.5. Pode ser ativada/desativada em <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Pode ser alterada no arquivo clients.config.</i>
sv_se: <b>7656:</b> SAM brygga, ett högnivå socket API för klienter <i>Avslaget som standard för nya installationer sedan release 0.6.5. Kan slås av/på på <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>. Kan ändras i clients.config filen.</i>

source: <b>7657:</b> Your router console <i>May be disabled in the clients.config file. May also be configured to be bound to a specific interface or all interfaces in that file.</i>
id: <b>7657:</b> Console router anda <i>mungkin dinonaktifkan dalam clients.config file.</i> Dapat juga dikonfigurasi untuk bind ke interface tertentu atau semua interface pada file yang sama.
it: <b>7657:</b> il console router <i>Può essere disattivata o modificata nel file clients.config. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce in quel file.</i>
mg: <b>7657:</b>Ny takela fibaikoana ny router <i>Azo vonoina eo amin'ny fisy clients.config. Azo atao koa ny mampihaino azy eo amin'ny interface iray voatondro na izy rehetra ao amin'io fisy io.</i>
pt: <b>7657:</b> Painel do seu roteador <i>Pode ser desativado no arquivo clients.config. Também pode ser configurado para se ligar numa interface específica ou a todas as interfaces daquele arquivo.</i>
sv_se: <b>7657:</b> Din routerkonsol <i>Kan slås av i clients.config filen. Kan även konfigureras till att binda till ett specifikt interface eller alla interface i den filen.</i>
