Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: Do not reveal this file in any case to unknown users, since it contains sensitive private data (100 RouterInfo) from your own I2P router! In order to protect your anonymity: you may wait a few random hours/days before you share the file with your trusted friend. It is also advisable to use this procedure sparingly (< 2 per week).
id: Jangan mengungkapkan file ini dalam hal apapun kepada pengguna yang tidak dikenal, karena berisi data pribadi yang sensitif (100 RouterInfo) dari router I2P anda sendiri! Untuk melindungi anonimitas anda: anda mungkin menunggu beberapa jam / hari secara acak sebelum anda berbagi file dengan teman tepercaya anda. Sebaiknya gunakan prosedur ini dengan jarang (<2 per minggu).

source: General guidelines for manual reseeding of I2P
id: Pedoman umum untuk reseeding I2P secara manual

source: Do not publicly publish the reseed file or share these files with a friend of a friend!
id: Jangan publikasikan file yang sudah di-reseed ulang atau bagikan file ini dengan teman dari teman!

source: This file should be used only for a very limited number of friends (< 3)!
id: File ini harus digunakan hanya untuk jumlah teman yang sangat terbatas (<3)!

source: The file is valid only a few days (< 20)!
id: File ini valid beberapa hari (<20)!

source: While the main I2P client implementation requires Java, there are several <a href="%(alt)s">alternative clients</a> which don't require Java.
id: Sementara implementasi klien I2P utama membutuhkan Java, ada beberapa <a href=\"%(alt)s\">alternatif klien</a> yang tidak memerlukan Java.

source: Reseed
pt: Ressemear

source: Monotone
pt: Monótono

source: Purple I2P (I2Pd) Development talk
he: Purple I2P (I2Pd) שיחת פיתוח
pt: I2P Purple (I2Pd) Conversa de Desenvolvimento

source: Mirror:
he: מראה

source: Our F-Droid repository
he: מאגר F-דרואיד שלנו

source: Development Builds
he: גרסאות פיתוח

source: API
he: ממשק תכנות (API)

source: Abscond browser bundle discussion and development
he: חבילת דפדפן חמקן- דיונים ופיתוח
