Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: <b>7658:</b> Your eepsite <i>May be disabled in the clients.config file. May also be configured to be bound to a specific interface or all interfaces in the jetty.xml file.</i>
id: <b>7658:</b> Eepsite anda <i>mungkin dinonaktifkan dalam clients.config file.</i> Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface dalam jetty.xml file.
it: <b>7657:</b> il console router <i>Può essere disattivata o modificata nel file clients.config. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce in quel file.</i>
mg: <b>7658:</b> Ny pejy eepsite-nao <i>Azo vonoina ao anatin'ny fisy clients.config . Azo atao koa ny mampihaino azy eo amin'ny interface iray voatondro na izy rehetra ao amin'ny fisy jetty.xml.</i>
pt: <b>7658:</b> Seu eepsite <i>Pode ser desativado no arquivo clients.config. Também pode ser configurado para se ligar a uma interface específica ou a todas as interfaces do arquivo jetty.xml.</i>
sv_se: <b>7658:</b> Din eepsite <i>Kan slås av i clients.config filen. Kan även konfigureras till att binda till ett specifikt interface eller alla interface i jetty.xml filen.

source: <b>7659:</b> Outgoing mail to smtp.postman.i2p <i>May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.</i>
id: <b>7659:</b> Outgoing mail ke smtp.postman.i2p <i>dapat dinonaktifkan atau berubah pada halaman i2ptunnel di console router.</i> Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
it: <b>7659:</b> e-mail in uscita verso smtp.postman.i2p <i>Può essere disattivata o modificata nella pagina di i2ptunnel nel console router. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce.</i>
mg: <b>7659:</b> Fivoahan'ny mailaka mankany amin'ny smtp.postman.i2p <i>Azo vonoina na ovaina eo amin'ny faritry ny fantsona i2p eo amin'ny pejy fibaikoana ny router. Azo atao ny mampihaino azy eo amin'ny interface iray na ny interfaces rehetra.</i>
pt: <b>7659:</b> Envio de E-mail para smtp.postman.i2p <i>Pode ser desativada ou alterada na página Túnel i2p no painel do roteador. Também pode ser configurada para se ligar a uma interface específica ou a todas elas.</i>
sv_se: <b>7659:</b>Utåtgående mail till smtp.postman.i2p <b>Kan slås av eller ändras på i2ptunnel-sidan i routerkonsolen. Kan även konfigureras till att binda till ett specifikt interface eller alla interface.</i>

source: <b>7660:</b> Incoming mail from pop.postman.i2p <i>May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.</i>
id: <b>7660:</b> Email yang masuk dari pop.postman.i2p <i>dapat dinonaktifkan atau diubah pada halaman i2ptunnel di console router.</i> Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
it: <b>7660:</b> e-mail in arrivo da pop.postman.i2p <i>Può essere disattivata o modificata nella pagina di i2ptunnel nel console router. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce.</i>
mg: <b>7660:</b> Fiavian'ny ny mailaka avy eo amin'ny pop.postman.i2p <i>Azo vonoina na ovaina eo amin'ny faritry ny fantsona i2p eo amin'ny pejy fibaikoana ny router. Azo atao ny mampihaino azy eo amin'ny interface iray na ny interfaces rehetra.</i>
pt: <b>7660:</b> Recebimento de e-mail por pop.postman.i2p <i>Pode ser desativada ou alterada na página Túnel i2p no painel do roteador. Também pode ser configurada para se ligar a uma interface específica ou a todas elas.</i>
sv_se: <b>7660:</b> Inkommande e-post från pop.postman.i2p <i>Kan slås av eller ändras på i2ptunnel-sidan i routerkonsolen. Kan även ändras till att binda till ett specifikt interface eller alla interface.</i>

source: <b>8998:</b> mtn.i2p2.i2p (Monotone - disabled by default) <i>May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.</i>
id: <b>8998:</b> mtn.i2p2.i2p (monoton - dinonaktifkan secara default) <i>dapat dinonaktifkan atau diubah pada halaman i2ptunnel di console router. Juga dapat dikonfigurasi untuk bind ke interface tertentu atau semua interface.
it: <b>8998:</b> mtn.i2p2.i2p (Monotone: disattivato come impostazione predefinita) <i>Può essere disattivata o modificata nella pagina di i2ptunnel nel console router. Può anche essere configurata per legarsi a un'interfaccia specifica o a tutte le interfacce.</i>
mg: <b>8998:</b>mtn.i2p2.i2p (Monotone - maty any amboalohany) <i>Azo vonoina na ovaina eo amin'ny faritry ny fantsona i2p eo amin'ny pejy fibaikoana ny router. Azo atao ny mampihaino azy eo amin'ny interface iray na ny interfaces rehetra.</i>
pt: <b>8998:</b> mtn.i2p2.i2p (Monotone - desativada por padrão) <i>Pode ser desativada ou alterada na página Túnel i2p no painel do roteador. Também pode ser configurada para se ligar a uma interface específica ou a todas elas.</i>
sv_se: <b>8998:</b> mtn.i2p2.i2p (Monotone - avslaget som standard) <i> Kan slås av eller ändras på i2ptunnel-sidan i routerkonsolen. Kan även konfigureras till att binda till ett specifikt interface eller alla interface.</i>

source: <b>31000:</b> Local connection to the wrapper control channel port. <i>Outbound to 32000 only, does not listen on this port. Starts at 31000 and will increment until 31999 looking for a free port. To change, see the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. For more information see <a href="#port32000">below</a>.</i>
id: <b>31000:</b> Koneksi lokal ke wrapper control channel port. <i>Outbound untuk 32000 saja, tidak mendengarkan pada port ini.</i> Dimulai pada 31000 dan akan naik sampai 31999 untuk mencari sebuah port yang tidak digunakan. Untuk mengubahnya, lihat <a href=\"http://wrapper.tanukisoftware.com/doc/english/prop-port.html\">dokumentasi wrapper</a>. Untuk informasi lebih lanjut lihat <a href=\"#port32000\">di bawah</a>.
it: <b>31000:</b> connessione locale alla porta del canale di controllo del wrapper. <i>In uscita solo su 32000, non ascolta su tale porta. Parte a 31000 e incrementa fino a 31999 in cerca di una porta libera. Per modificarla, consulta la <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentazione del wrapper </a>. Per ulteriori informazioni, vedi <a href="#port32000">più oltre</a>.</i>
mg: <b>31000:</b>fifandraisana anatiny mankany amin'ny port ny zotran'ny wrapper control . <i>Mivoaka manankany amin'ny 32000 fotsiny, tsy mihaino eo amin'io port io. Manomboka eo amin'ny 31000 dia miakatra tsikelikely mankany amin'ny 31999 ny fijerena port malalaka. Raha hanao fanovana, jereno ny <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. Raha mila fanampiana jereo ny <a href="#port32000">below</a>.</i>
pt: <b>31000:</b> Conexão local para a porta do canal de controle do empacotador. <i>Apenas saída para 32000, não escuta nesta porta. Começa em 31000 e aumenta até 31999 a procura de uma porta livre. Para alterar, veja a <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentação do empacotador</a>. Para mais informações, veja <a href="#port32000">abaixo</a>.</i>
sv_se: <b>31000:</b> Lokal anslutning till wrapper kontroll kanal porten. <i>Utåtgående till 32000 enbart, lyssnar inte på denna port. Börjar på 31000 och ökar till 31999 letanders efter en ledig port. För att ändra se <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper dokumentationen</a>. Fär mer information se <a href="#port32000">nedan</a>.</i>

source: <b>32000:</b> Local control channel for the service wrapper. <i>To change, see the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. For more information see <a href="#port32000">below</a>.</i>
id: <b>32000:</b> Kontrol local channel untuk service wrapper. <i>Untuk mengubahnya, lihat <a href=\"http://wrapper.tanukisoftware.com/doc/english/prop-port.html\">dokumentasi wrapper</a>.</i> Untuk informasi lebih lanjut lihat <a href=\"#port32000\">di bawah</a>.
it: <b>32000:</b> canale di controllo locale per il servizio wrapper. <i>Per modificarla, consulta la <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentazione del wrapper </a>. Per ulteriori informazioni, vedi <a href="#port32000">più oltre</a>.</i>
mg: <b>32000:</b>Zotram'pifehezana anaty ho'an ny servisy wrapper. <i>Raha hanao fanovana, jereo ny <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. Raha mila fanampiny jereo ny <a href="#port32000">below</a>.</i>
pt: <b>32000:</b> Canal de controle local para o empacotador de serviço. <i>Para alterar, veja a <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentação do empacotador</a>. Para mais informação, veja <a href="#port32000">abaixo</a>.</i>
sv_se: <b>32000:</b> Lokal kontroll kanal för tjänstwrappern. <i>För att ändra se <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper dokumentationen</a>. För mer information se <a href="#port32000">nedan</a>.</i>

source: The local I2P ports and the I2PTunnel ports do not need to be reachable from remote machines, but *should* be reachable locally. You can also create additional ports for I2PTunnel instances via http://localhost:7657/i2ptunnel/ (and in turn, would need to get your firewall to allow you local access, but not remote access, unless desired).
id: Port I2P lokal dan port I2PTunnel tidak perlu dapat dicapai dari remote machine, tetapi *harus* dapat dijangkau oleh komputer anda secara locakl anda juga dapat membuat tambahan port untuk I2PTunnel instances melalui http://localhost:7657/i2ptunnel / (dan pada gilirannya, akan perlu membuat firewall anda untuk memungkinkan anda akses lokal, tetapi akses remote tidak, kecuali jika diinginkan).
it: Non occorre che le porte I2P locali e le porte I2PTunnel siano raggiungibili da computer remoti, ma *dovrebbero* essere raggiungibili in locale. Puoi anche creare porte aggiuntive per le istanze I2PTunnel tramite http://localhost:7657/i2ptunnel/ (e successivamente dovrebbero riuscire a raggiungere il tuo firewall per consentire l'accesso locale, ma non quello da remoto, a meno di non volerlo).
mg: Ny port I2P eo antoerana sy ny port'ny fantsona I2P dia tsy hilaina ny mahita azy any amin'ny solon'tsaina hafa, fa *tokony* ho hita eo an-toerana. Azo atao ny mamorona port fanampiny ho an'ny fantsona hafa avy eo amin'ny http://localhost:7657/i2ptunnel/ (ary, tokony sokafana ny rindrin'afo mba ahafahana mifandray samy eo antoerana, fa tsy avela ihiditra ny avy any ivelany, raha tsy hoe tiana atao).
pt: As portas locais do I2P e as portas do I2PTunnel não precisam ser alcançáveis por computadores distantes, mas *devem* ser alcançáveis localmente. Também é possível criar novas portas para instâncias do I2PTunnel pelo http://localhost:7657/i2ptunnel/ (Em contrapartida, tua parede de fogo precisaria permitir o acesso local, mas não acesso remoto, a menos se desejado).
sv_se: De lokala I2P-portarna och I2PTunnel-portarna behöver inte vara nåbara för fjärran maskiner, men *borde* vara nåbara lokalt. Du kan skapa flera portar för I2PTunnel instanser via <a href="http://localhost:7657/i2ptunnel/">http://localhost:7657/i2ptunnel/</a> (och efter det behöver du få din brandvägg att ge dig lokal åtkomst, men inte fjärran åtkomst, om det inte önskas).

source: So, to summarize, nothing needs to be reachable by unsolicited remote peers, but if you can configure your NAT/firewall to allow inbound UDP and TCP the <a href="http://localhost:7657/config">outbound facing port</a>, you'll get better performance. You will also need to be able to send outbound UDP packets to arbitrary remote peers (blocking IPs randomly with something like PeerGuardian only hurts you - don't do it).
id: Jad kesimpulannya, tidak ada yang perlu dicapai oleh remote peer yang tidak diketahui, tetapi jika anda dapat mengkonfigurasi NAT/firewall anda supaya inbound UDP dan TCP <a href=\"http://localhost:7657/config\">outbound facing port </a>, anda akan mendapatkan kinerja yang lebih baik. Anda juga perlu untuk dapat mengirimkan paket-paket UDP outbound kepada arbitrary remote peers (memblokir IP secara acak dengan aplikasi seperti PeerGuardian hanya menyulitkan anda - jangan melakukan hal ini).
it: Quindi, per riassumere, non c'è niente che debba per forza essere raggiungibile da peer remoti, ma puoi configurare il tuo NAT o firewall per consentire i flussi UDP e TCP in entrata per la <a href="http://localhost:7657/config">porta verso l'esterno</a>, otterrai prestazioni migliori. Dovrai anche essere in grado di inviare pacchetti UDP in uscita verso peer remoti (bloccare indirizzi IP a caso con qualcosa tipo PeerGuardian ti nuocerà e basta, non farlo).
mg: Ka, raha fintinina, tsy dia ilaina loatra ny ahitan'olon'kafa ny zavatra ao aminao, nefa raha mety ho amboarina ny NAT/rindrin'afo ahafahana mampihiditra ny UDP sy TCP ny<a href="http://localhost:7657/config">outbound facing port</a>, dia ahazo fiovana tsara ianao. Tokony ho afaka mandefa UDP packets any amin'ny olona voatondro iray ianao ( tsy dia mety loatra ny fanakanana IP amin'ny fampiasana ny PeerGuardian - aza atao izany).
pt: Então, resumindo, nada precisa ser alcançável por peers remotos não solicitados, mas se você puder configurar seu NAT/firewall para permitir entrada de UDP e TCP, <a href="http://localhost:7657/config">a porta exposta à Internet</a> terá melhor performance. Também será necessário enviar pacotes UDP pela saída para peers remotos indefinidos (bloquear IPs aleatoriamente com algo como PeerGuardian apenas te prejudicará - não faça isso).
sv_se: Så, för att summera, ingenting behöver vara nåbart av ovälkomna fjärran peers, men om du kan konfigurera din NAT/brandvägg till tillåta inåtgående UDP och TCP på den <a href="http://localhost:7657/config">utåt öppna porten</a>, så kommer du få bättre prestanda. Du kommer också behöva kunna skicka utåtgående UDP-paket till olika fjärrna peers (att blockera IP-adresser slumpmässigt med något som PeerGuardina skadar bara dig - gör det inte).

source: Why is I2P listening on port 32000?
he: למה I2P מאזין בפורט 32000?
id: Mengapa I2P mendengarkan pada port 32000?
it: Perché I2P rimane in ascolto sulla porta 32000?
mg: Fa nahoana no mihaino eo amin'ny port 32000 ny I2P?
pt: Por que o I2P está escutando na porta 32000?
sv_se: Varför lyssnar I2P efter anslutningar på port 32000?

source: The Tanuki java service wrapper that we use opens this port&mdash;bound to localhost&mdash;in order to communicate with software running inside the JVM. When the JVM is launched it is given a key so it can connect to the wrapper. After the JVM establishes its connection to the wrapper, the wrapper refuses any additional connections.
id: Tanuki Java service wrapper yang kita gunakan membuka port ini &mdash; terikat kepada localhost &mdash; untuk berkomunikasi dengan software yang berjalan di dalam JVM. Ketika JVM diluncurkan, JVM diberikan kunci sehingga dapat terhubung ke wrapper tersebut. Setelah JVM membuat koneksi ke wrapper, wrapper menolak koneksi tambahan.
it: Il wrapper di servizio java Tanuki che usiamo apre questa porta&mdash;la lega a localhost&mdash;per poter comunicarecon il software in esecuzione dentro la JVM. Quando la JVM viene lanciata, le viene assegnata una chiave in modo da potersi collegare al wrapper. Dopo che la JVM stabilisce la propria connessione al wrapper, quest'ultimo rifiuta qualunque altra eventuale connessione aggiuntiva.
mg: Ny wrapper n'ny Taniky Java service izay ampiasaina dia manokatra ity port ity port&mdash;bound to localhost&mdash;mba ahafahana mifandray amin'ny fampiarana hita ao anaty ny JVM. Rehefa alefa ny JVM, dia mhazo fanalahidy iray izy mba ahafahany mifandray amin'ny wrapper. Rehefa voaraikitry ny JVM ny fifandraisany amin'ny wrapper, dia lavin'ny wrapper daholo ny fifandraisana ambiny.
pt: O serviço empacotador Tanuki que usamos abre esta porta&mdash;limitada ao localhost&mdash;visando se comunicar com softwares rodando dentro da JVM. Quando a JVM é lançada, ela recebe uma chave para se conectar ao empacotador. Depois da JVM estabelecer sua conexão com o empacotador, ele recusa quaisquer conexões adicionais.
sv_se: Taniki java service wrappern vi använder öppnar denhär porten&mdash;bunden till localhost&mdash;för att kunna kommunicera med mjukvaran som kör i JVM:en. När JVM:en startas ges den en nyckel så att den kan ansluta till wrappen. Efter JVM:en etablerat sin anslutning till wrappern, så avvisar wrappern alla efterkommande anslutningar.

source: More information can be found in the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>.
id: Informasi lebih lanjut dapat ditemukan dalam <a href=\"http://wrapper.tanukisoftware.com/doc/english/prop-port.html\">dokumentasi wrapper</a>.
it: Ulteriori informazioni possono essere reperite nella <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentazione del wrapper </a>.
mg: Ny fanazavana fanampiny dia hita ao amin'ny <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>.
pt: Mias informações podem ser encontradas em ⏎ <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentação da embalagem</a>.
sv_se: Mer information kan finnas i <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper dokumentationen</a>.

source: An I2P router only needs to be seeded once, to join the network for the first time. Reseeding is nothing more than sending plain HTTP GET requests to fetch a directory listing and download multiple "routerInfo" files from a predefined reseed URL.
it: Il seed di un router I2P è sufficiente che avvenga una sola volta per unirsi alla rete per la prima volta. Il reseed non è altro che l'invio di semplici richieste HTTP GET per ottenere un elenco delle directory e scaricare molteplici file di "routerInfo" da un URL predefinito di reseed.
mg: Mba ahafahany mamonjy ny tambazotra, eny ambohalaohany, dia ilaina ny mamahana indray mandeha ny router. Ny famahanana dia fandefasana fangatahana HHTP GET mba ahazoahana lisitra ary mampihidina "routerInfo" files avy amin'ny URL toeram'pamahanana.
pt: Um roteador I2P só precisa ser propagado uma vez, para entrar na rede pela primeira vez. Repropagar é nada mais que enviar requisições HTTP GET simples para buscar uma lista de diretórios e baixar vários arquivos "routerInfo" de uma URL predefinida.
sv_se: En I2P router behöver bara seedas en gång, för att kunna gå med i nätverket första gången. Reseedande är inget mer än att skicka enkla HTTP GET förfrågor för att hämta en lista över en mapp och ladda ner flera "routerInfo" filer från en fördefinierad reseed URL.

source: A typical symptom of a failed reseed is the "Known" indicator (on the left sidebar of the router console) displaying a very small value (often less than 5) which does not increase. This can occur, among other things, if your firewall limits outbound traffic, and blocked the reseed request.
it: Un simbolo tipico di un reseed fallito è l'indicatore "Conosciuti" (presente nella barra laterale sinistra del console router) indicante un valore molto piccolo (spesso inferiore a 5) che non aumenta. Ciò può verificarsi, tra le altre cose, se il tuo firewall limita il traffico in uscita e blocca la richiesta di reseed.
mg: Raha tsy nety ny famahanana dia hita eto amin'ny seho "Known" (eo amin'ny faritra ankavian'ny fibaikoana ny router) izay mampiseho zanak'isa kely (matetika ambanin'ny 5) izay tsy ahitana fiovana. Mety mitranga izany, raha manao fanohanana ny ridrin'afo, no sady manohana ny fangataham'mpahanana.
pt: Um sintoma típico de repropagação falha é o indicador "Conhecidos" (na barra esquerda do painel do roteador) mostrando um um valor muito baixo (geralmente menor que 5) que não aumenta. Isso pode ocorrer, dentre outras coisas, se seu firewall limita o tráfego de saída, e bloqueou a solicitação de repropagação.
sv_se: Ett typisk symptom för en misslyckad reseed är att "Kända" indikatorn (på vänster sida av routerkonsolen) visar ett väldigt lågt värde (ofta färre än 5) och inte ökar. Detta kan hända, bland annat om din brandvägg begränsar utgående trafik och blockerade reseed förfrågan.

source: To reseed an I2P router manually, do the following:
it: Per effettuare il reseed di un router IP2 manualmente, segui questi punti:
mg: Araho ireto toromarika ireto raha hamahana ny router I2P amin'ny tanana ianao:
pt: Para repropagar um roteador I2P manualmente, faça o seguinte:
sv_se: För att reseed en I2P router manuellt, gör följande:

source: Stop your I2P router
he: עצור את נתב ה-I2P שלך
it: Arresta il router I2P
mg: Ajanony ny Router I2P
pt: Parar seu roteador I2P
sv_se: Stanna din I2P router

source: Open <a href="http://netdb.i2p2.de/">http://netdb.i2p2.de/</a> using a web browser
it: Apri <a href="http://netdb.i2p2.de/">http://netdb.i2p2.de/</a> con un browser web
mg: sokafy <a href="http://netdb.i2p2.de/">http://netdb.i2p2.de/</a> amin'ny fampiasana fijerevana
pt: Abra <a href="http://netdb.i2p2.de/">http://netdb.i2p2.de/</a> usando um browser
sv_se: Öppna <a href="http://netdb.i2p2.de/">http://netdb.i2p2.de/</a> med en webbläsare

source: Save a dozen "routerInfo" files to your I2P "netDb" directory
it: Salva una dozzina di file "routerInfo" nella cartella I2P "netDb"
mg: Mitehiriza fisy "routerInfo" maro ao amin'ny toeran'ny "netDb" ao amin'ny I2P
pt: Guarde uma dúzia de arquivos "routerInfo" no diretório "netDb" do seu I2P
sv_se: Spara ett dussin "routerInfo" filer till din I2P "netDb" mapp

source: Start your I2P router
he: התחל את נתב ה-I2P שלך
it: Avvia il router I2P
mg: Velomy ny router I2P
pt: Iniciar seu roteador I2P
sv_se: Starta din I2P router

source: When trying to start the router using "i2prouter start", you may see output like the following:
id: Ketika mencoba untuk menghidupkan router dengan menggunakan "i2prouter start", anda dapat melihat output seperti berikut:
it: Quando provi ad avviare il router usando "i2prouter start", potrebbe essere visualizzato quanto segue:
mg: Rehefa manandrana mamelona ny router amin'ny "i2prouter start", dia mety ahita an'izao manaraka izao ianao:
pt: Quando tentares iniciar o roteador usando "i2prouter start", poderás ver um resultado como o seguinte:
sv_se: När du försöker starta routern med "i2prouter start", kan du komma att se output som den följande:
