Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: Blog Category
he: קטגוריית יומן רשת
id: Kategori Blog
it: Categoria blog
mg: Sokajin'ny Blog
pt: Categoria do Blogue
sv_se: Bloggkategori

source: I2P Blog ATOM Feed for Category: %(category)s
he: זרם Atom ליומן הרשת של I2P עבור קטגוריה: %(category)s
id: I2P Blog ATOM Feed untuk Kategori: %(category)s
it: Feed ATOM blog I2P per categoria: %(category)s
mg: I2P blog ATOM fahana isan'tsokajy: %(category)s
pt: Feed ATOM do Blogue do I2P para a Categoria: %(category)s
sv_se: I2P Blogg ATOM Flöde för Kategori: %(category)s

source: I2P Blog ATOM Feed
he: זרם Atom של יומן הרשת של I2P
it: Feed ATOM blog I2P
mg: I2P Blog sy fahana ATOM
pt: Feed ATOM do Blogue do I2P
sv_se: I2P Blogg ATOM flöde

source: Posted %(date)s by %(author)s
he: פורסם ב־%(date)s על־ידי %(author)s
id: Dikirimkan %(date)s oleh %(author)s
it: Pubblicato in data %(date)s da %(author)s
mg: Nosoratana tamin'ny %(date)s nataon'i %(author)s
pt: Publicado em %(date)s por %(author)s
sv_se: Skriven %(date)s av %(author)s

source: More blog posts&hellip;
he: רשומות נוספות&hellip;
id: Lebih banyak kiriman&hellip;
it: Altri post del blog&hellip;
mg: Blog fanampiny&hellip;
pt: Mais artigos do blogue&hellip;
sv_se: Fler blogg-poster&hellip;

source: Posted:
he: זמן פרסום:
id: Dikirimkan:
it: Pubblicato:
mg: Nosoratana:
pt: Publicado:
sv_se: Skrivet:

source: Author:
he: יוצר:
id: Penulis:
it: Autore:
mg: Mpanoratra:
pt: Autor:
sv_se: Författare:

source: Debian I2P Packages
he: חבילות I2P לדביאן
id: Paket I2P Debian
it: Pacchetti I2P di Debian
mg: Entana I2P ho an'ny Debian
pt: Pacotes do I2P para Debian
sv_se: Debian I2P Packet

source: The Debian packages have been tested and <em>should </em>work on x86/x86_64 platforms running:
he: החבילות לדביאן נבדקו ו<em>אמורות</em> לעבוד על פלטפורמות x86/x86_64 המריצות:
id: Paket Debian telah diuji dan <em>dapat </em>bekerja pada platform x86/x86_64 yang menjalankan:
it: I pacchetti Debian sono stati testati e <em>dovrebbero </em>funzionare sulle piattaforme x86/x86_64 su cui gira:
mg: Ny entana Debian dia voatsara ary <em>tokony>/em> handeha amin'ny fitaovana x86/x86_64 mampiasa:
pt: Os packs do Debian foram testados e <em>podem </em>funcionar em plataformas a correr x86/x86_64:

source: <a href="#ubuntu">Ubuntu</a> (Precise <em>12.04</em> and newer)
he: ‏<a href="#ubuntu">אובונטו</a> (החל מגרסה Precise 12.04)
id: <a href="#ubuntu">Ubuntu</a> (Precise <em>12.04</em> dan terbaru)
it: <a href="#ubuntu">Ubuntu</a> (Precise <em>12.04</em> e più recenti)
mg: <a href="#ubuntu">Ubuntu</a> (Precis <em>12.04</em> sady vaovao)
pt: <a href="#ubuntu">Ubuntu</a> (Precise <em>12.04</em> e mais recente)
sv_se: <a href="#ubuntu">Ubuntu</a> (Precise <em>12.04</em> och senare)

source: <a href="#debian">Debian Linux</a> (Squeeze and newer) &amp; kFreeBSD
it: <a href="#debian">Debian Linux</a> (Squeeze e più recenti) &amp; kFreeBSD
mg: <a href="#debian">Debian Linux</a> (Squeeze sy ny taty aoriana) &amp; kFreeBSD

source: The I2P packages <em>may</em> work on systems not listed above. Please report any issues with these packages on <a href="%(trac)s">Trac</a> at <a href="%(trac)s">https://trac.i2p2.de</a>.
he: החבילות של I2P <em>עשויות</em> לעבוד על מערכות שאינן רשומות למעלה. אנא דווחו על בעיות בחבילות אלה ב־<a href="%(trac)s">Trac</a> at <a href="%(trac)s">https://trac.i2p2.de</a>.
id: Paket I2P <em>mungkin</em> bekerja pada sistem yang tidak didaftarkan diatas. Silahkan laporkan semua masalah dengan paket tersebut <a href="%(trac)s">Trac</a> di <a href="%(trac)s">https://trac.i2p2.de</a>.
it: I pacchetti I2P <em>potrebbero</em> funzionare su sistemi non elencati qui sopra. Riporta eventuali problemi con questi pacchetti su <a href="%(trac)s">Trac</a> all'indirizzo <a href="%(trac)s">https://trac.i2p2.de</a>.
mg: Ny entana I2P <em>mety</em>handeha amin'ny fitaovana tsy voalaza eo ambony. Azafady manaova tatitra amin'ny tsy fihetezana hita amin'ireo entana ireo ao amin'ny <a href="%(trac)s">Trac</a> at <a href="%(trac)s">https://trac.i2p2.de</a>.

source: Option 1: <a href="#ubuntu">Recent versions</a> of Ubuntu and its derivatives (<em>Try this if you're not using Debian)</em>
he: אפשרות 1: <a href="#ubuntu">גרסאות עדכניות</a> של אובונטו ושל נגזרותיה (<em>נסו זאת אם אינכם משתמשים בדביאן</em>)
id: Pilihan 1: Ubuntu <a href="#ubuntu">versi baru-baru ini</a> dan turunannya (<em>Cobalah ini jika Anda tidak menggunakan Debian)</em>
it: Opzione 1: <a href="#ubuntu">Versioni recenti</a> di Ubuntu e le sue derivate (<em>Prova questa se non usi Debian)</em>
mg: Tetika 1: <a href="#ubuntu">Modely taty aoriana</a> an'i Ubuntu sy ny sampany (<em>Andramo ity raha tsy mapiasa Debian ianao)</em>
pt: Opção 1: <a href="#ubuntu">Versões recentes</a> do Ubuntu e seus derivados (<em>Tente este se não estiver usando Debian)</em>
sv_se: Alternativ 1: <a href="#ubuntu">Nya versioner</a> av Ubuntu och dess derivat(<em>Testa detta om du inte använder Debian</em>)

source: Option 2: <a href="#debian">Debian</a> (including Debian-derivatives)
he: אפשרות 2: <a href="#debian">דביאן</a> (כולל נגזרות של דביאן)
id: Pilihan 2: <a href="#debian">Debian</a> (termasuk turunannya)
it: Opzione 2: <a href="#debian">Debian</a> (incluse le derivate di Debian)
mg: Tetika 2: <a href="#debian">Debian</a> (miaraka amin'ny sampan'i Debian)
pt: Opção 2: <a href="#debian">Debian</a> (incluindo derivados do Debian)
sv_se: Alternativ 2: <a href="#debian">Debian</a> (inklusive Debian-derivat)

source: Instructions for Ubuntu Precise Pangolin (and newer) and derivatives like Linux Mint &amp; Trisquel
it: Istruzioni per Ubuntu Precise Pangolin (e più recenti) e derivate come Linux Mint &amp; Trisquel
mg: Toromarika hoan'i Ubuntu Precise Pangolin (sy ny taty aoriana) ary ny sampana toy ny Linux Mint &amp; Trisquel
sv_se: Instruktioner fär Ubuntu Precise Pangolin (och senare) ich derivat som Linux Mint &amp; Trisquel

source: Adding the PPA via the command line and installing I2P
he: הוספת ה־PPA דרך שורת הפקודה והתקנת I2P
id: Menambahkan PPA melalui baris perintah dan memasang I2P
it: Aggiunta di PPA tramite riga di comando e installazione di I2P
mg: Fanampiana ny PPA avy amin'ny command line ary mametraka ny I2P
pt: Adicionando o PPA por linha de comando e instalando I2P
sv_se: Lägger till PPA via kommandotolken och installerar I2P

source: Open a terminal and enter:
he: פתחו מסוף והזינו:
id: Buka terminal dan masukkan:
it: Apri un terminale e inserisci:
mg: Sokafy ny terminal dia ampidiro:
pt: Abra um terminal e digite:
sv_se: Öppna en terminal ock skriv:

source: This command will add the PPA to /etc/apt/sources.list.d and fetch the gpg key that the repository has been signed with. The GPG key ensures that the packages have not been tampered with since being built.
he: פקודה זו תוסיף את ה־PPA ל־‎/etc/apt/sources.list.d ‏ותייבא את מפתח ה־gpg שבאמצעותו נחתם המאגר. מפתח ה־GPG מבטיח כי לא נערכו שינויים זדוניים בחבילות לאחר יצירתן.
id: Perintah ini akan menambahkan PPA ke /etc/apt/sources.list.d dan menagmbil kunci gpg yang repositori sudah tanda tangani. Kunci GPG memastikan bahwa paket tidak dirusak sejak dibangun.
it: Questo comando aggiungerà il PPA a /etc/apt/sources.list.d e recupererà la chiave gpg con cui il repository è stato firmato. La chiave GPG garantisce che quei pacchetti non sono stati manomessi dopo la loro compilazione.
mg: Ity baiko ity dia hanampy ny PPA ao amin'ny /etc/apt/sources.list.d ary hisintona ny fanalahidy gpg izay nosoniavin'ny toeram'pitahirizana. Ny fanalahidy GPG dia manamarina fa ny entana dia tsy nisy niova hatramin'ny nanamboarana azy.
pt: Este comando vai adicionar o PPA em /etc/apt/sources.list.d e buscar a chave gpg com a qual o repositório foi assinado. A chave GPG assegura que os pacotes não foram violados/alterados após seu empacotamento.
sv_se: Dethär kommandor kommer lägga till PPA:n till /etc/apt/sources.list.d och hämta den gpg-nyckel som repositoriet har signerats med. GPG-nyckeln försäkrar att paketet inte har fifflats med sedan det byggdes.

source: Notify your package manager of the new PPA by entering:
he: יידעו את מנהל החבילות שלכם על ה־PPA החדש על־ידי הזנת:
id: Beritahukan pengelola paket Anda tentang PPA baru dengan memasukkan:
it: Notifica al tuo gestore di pacchetti il nuovo PPA inserendo:
mg: Hilazao ny mpitsinjara entan'ny PPA vaovao amin'izao fomba izao:
pt: Notifique seu gerenciador de pacotes sobre o novo PPA digitando:
sv_se: Meddela din packet-hanterar om det nya PPA:et genom att skriva:

source: This command will retrieve the latest list of software from each repository that is enabled on your system, including the I2P PPA that was added with the earlier command.
he: פקודה זו רשימת התוכנות העדכנית מכל מאגר המאופשר במערכת שלכם, כולל ה־PPA של I2P שנוסף קודם לכן.
id: Perintah ini akan mencari keterangan daftar perangkat lunak terbaru dari setiap repositori yang diaktifkan pada sistem Anda, termasuk PPA I2P yang telah ditambahkan dengan perintah sebelumnya.
it: Questo comando recupererà l'elenco di programmi più recenti da ciascun repository attivato sul sistema, incluso il PPA aggiuntio con il comando di prima.
mg: Ity baiko ity dia hisintona ny lisitry ny fampiarana farany avy amin'ny toeram-pitahirizana izay efa vonona ao amin'ny fitaovanao, miaraka ny PPA an'ny I2P izay efa nampiana teo aloha.
pt: Esse comando vai ler a última lista de software de cada repositório ativado em seu sistema, incluindo o PPA do I2P que foi adicionado com o comando anterior.
sv_se: Dethär kommandot kommer hämta den senaste listan av mjukvara från varje repositorie som används av systemet, inklusive I2P PPA:et som lades till med det tidigare kommandot.

source: You are now ready to install I2P!
he: כעת אתם מוכנים להתקנת I2P!
id: Sekarang Anda sudah siap untuk memasang I2P!
it: Adesso sei pronto per l'installazione di I2P!
mg: Vonona ianao izao hametraka an'i I2P!
pt: Agora está pronto para instalar o I2P!
sv_se: Du är nu redo att installera I2P!

source: Adding the PPA Using Synaptic
he: הוספת ה־PPA דרך Synaptic
id: Menambahkan PPA Dengan Menggunakan Synaptic
it: Aggiunta del PPA usando Synaptic
mg: Fanampiana ny PPA amin'ny fampiasana ny Synaptic
pt: Adicionar o PPA, Utilizando Synaptic
sv_se: Lägga till PPA:et Med Synaptic

source: Open Synaptic (System -&gt; Administration -&gt; Synaptic Package Manager).
he: פתחו את Synaptic (מערכת -&gt; ניהול -&gt; מנהל החבילות Synaptic).
id: Buka Synaptic (System -&gt; Administration -&gt; Synaptic Package Manager).
it: Apri Synaptic (Sistema -&gt; amministrazione -&gt; Gestore dei pacchetti Synaptic).
mg: Vao misokatra ny Synaptic, fidio <em>Repositories</em>eo amin'ny <em>Settings</em>menu.
pt: Abra o Synaptic (Sistema -&gt; Administração -&gt; Gerenciador de Pacotes Synaptic).
sv_se: Öppna Synaptic (System -&gt; Administration -&gt; Synaptic Packet Hanterare)

source: Once Synaptic opens, select <em>Repositories</em> from the <em>Settings</em> menu.
he: לאחר ש־Synaptic נפתח, בחרו באפשרות <em>מאגרים</em> מתפריט <em>הגדרות</em>.
id: Setelah Synaptic dibuka, pilih <em>Repositories</em> dari menu <em>Settings</em>.
it: Quando Synaptic si apre, seleziona <em>Repository</em> dal menu <em>Impostazioni</em>.
mg: Rehefa misokatra ny Synaptic, dia fidio <em>Repositories</em> avy eo amin'ny <em>Settings</em> menu.
pt: Assim que o Synaptic abrir, selecione <em>Repositórios</em> no menu <em>Configurações</em>.
sv_se: När Synaptic öppnas, välj <em>Repositorier</em> från <em>Inställnings</em> menyn.

source: Click the <em>Other Sources</em> tab and click <em>Add</em>. Paste <code>ppa:i2p-maintainers/i2p</code> into the APT-line field and click <em>Add Source</em>. Click the <em>Close</em> button then <em>Reload</em>.
he: עברו ללשונית <em>מקורות אחרים</em> (Other Software) ולחצו על <em>הוספה</em> (Add). הדביקו את השורה <code>ppa:i2p-maintainers/i2p</code> לשדה <em>שורת APT</em> ולחצו על <em>הוספת מקור</em> (Add Source). לחצו על <em>סגירה</em> ולאחר מכן על <em>רענון</em>.
id: Klik tab <em>Other Sources</em> dan klik <em>Add</em>. Tempel <code>ppa:i2p-maintainers/i2p</code> kedalam field APT-line dan klik <em>Add Source</em>. Klik tombol <em>Close</em> kemudian <em>Reload</em>.
it: Fai clc sulla scheda <em>Altre fonti</em> e su <em>Aggiungi</em>. Incolla <code>ppa:i2p-maintainers/i2p</code> nel campo dedicato alla riga APT e fai clic su <em>Aggiungi fonte</em>. Fai clic sul pulsante <em>Chiudi</em> quindi su <em>Ricarica</em>.
mg: Tsindrio ny <em>loharanon'entana hafa</em> tab ary click <em>Ampio</em>. Araiketo<code>ppa:i2p-maintainers/i2p</code> ao anaty ny andalan'ny APT dia tsindrio<em>Ampio loharon'entana</em>. Tsindrio <em>Hidio</em> ny bokotra ary <em>Avereno ampiakarina</em>.
pt: Clique na aba <em>Outras fontes</em> e clique em <em>Adicionar</em>. Cole <code>ppa:i2p-maintainers/i2p</code> no campo APT-line e clique em <em>Adicionar fonte</em>. Clique no botão <em>Fechar</em> e em <em>Atualizar</em>.
sv_se: Klicka på <em>Andra Källor</em>-tabben och klicka <em>Lägg till</em>. Klista in <code>ppa:i2p-maintainers/i2p</code>i APT-fälter och klicka <em>Lägg till källa</em>. Klicka <em>Stäng</em>-knappen och sedan <em>Ladda Om</em>.

source: In the Quick Filter box, type in <code>i2p</code> and press enter. When <code>i2p</code> is returned in the results list, right click <code>i2p</code> and select <em>Mark for Installation</em>. After doing so you may see a <em>Mark additional required changes?</em> popup. If so, click <em>Mark</em> then <em>Apply</em>.
he: בתיבת הסינון המהיר, הזינו i2p ולחצו Enter. כאשר <code>i2p</code> מופיע ברשימת התוצאות, לחצו עליו לחיצה ימנית ובחרו <em>סימון עבור התקנה</em>. לאחר מכן ייתכן שתישאלו האם <em>לסמן שינויים נחוצים נוספים</em>. במקרה כזה לחצו על <em>סימון</em> ולאחר מכן על <em>בצע</em>.
id: Dalam box Quick Filter, masukkan <code>i2p</code> lalu tekan enter. Ketika <code>i2p</code> kembali dalam daftar hasil, klik kanan <code>i2p</code> dan pilih <em>Mark for Installation</em>. Setelah melakukan hal itu Anda akan melihat popup <em>Mark additional required changes?</em>. Jika demikian, klik <em>Mark</em> kemudian <em>Apply</em>.
it: Nel riquadro di filtro rapido, digita <code>i2p</code> e premi Invio. Quando <code>i2p</code> compare nell'elenco dei risultati, fai clic con il pulsante destro del mouse su <code>i2p</code> e seleziona <em>Contrassegna per l'installazione</em>. Dopo di che, potrebbe apparire un messaggio di popup <em>Contrassegna modifiche necessarie aggiuntive?</em>. Se capita, fai clic su <em>Contrassegna</em> quindi su <em>Applica</em>.
mg: Ao anaty vata fanasarahana, ampidiro ny <code>i2p</code> dia tsindrio enter. Rehefa<code>i2p</code>no hita eo amin'ny valiny, tsindry havanana <code>i2p</code>dia fidio<em>Mariho ho apetraka</em>. Rehefa vita izay dia mety ahita soaratra mivoaka<em>Asiana fanampiny?</em>. raha izay, tsindrio <em>Mariho</em>ary<em>Apetraho</em>.
pt: Na caixa Filtro Rápido, digite <code>i2p</code> e pressione enter. Quando <code>i2p</code> aparecer na lista, clique com o botão direito em <code>i2p</code> e selecione <em>Marcar para Instalação</em>. Após isso você deve ver um popup <em>Marcar mudanças adicionais necessárias?</em> . Se isso ocorrer, clique <em>Marcar</em> e em <em>Aplicar</em>.
sv_se: I snabb-filter-boxen, skriv <code>i2p</code> och tryck enter. När <code>i2p</code> returneras i resultat-listan, högerklicka <code>i2p</code> och välj <em>Markera för installation</em>. Efter det gjorts kan du eventuellt se <em>Markera ytterliggare nödvändiga ändringar?</em>-popup:en. Om det händer, klicka på <em>Markera</em> och sedan <em>Verkställ</em>

source: After the installation process completes you can move on to the next part of <a href="#Post-install_work">starting I2P</a> and configuring it for your system.
he: לאחר סיום תהליך ההתקנה אתם יכולים לעבור לחלק הבא <a href="#Post-install_work">הרצת I2P</a> ולהגדיר את התצורה של I2P עבור המערכת שלכם.
id: Setelah proses pemasangan selesai Anda dapat melanjutkan ke bagian berikutnya <a href="#Post-install_work">memulai I2P</a> dan mengkonfigurasikannya untuk sistem Anda.
it: Dopo il completamento della procedura di installazione, puoi passare alla sezione successiva per <a href="#Post-install_work">avviare I2P</a> e configurarlo per il tuo sistema.
mg: Rehefa vita ny ny fametrahana dia afaka mandroso any amin'ny fandaharana manaraka izay ao anatin'ny<a href="#Asa aorian'ny fametrahana">mamelona an'i I2P</a>ary mandamina azy hifandahatra amin'ny fitaovanao.
pt: Após completar o processo de instalação, você pode passar para a próxima parte da <a href="#Post-install_work">inicialização do I2P</a> e da configuração do I2P em seu sistema.
sv_se: Efter installationsprocessen blivit färdig kan du gå vidare till nästa del av <a href="#Post-install_work">starta I2P</a> och konfigurera I2P för ditt system.

source: Instructions for Debian
he: הוראות עבור דביאן
id: Instruksi untuk Debian
it: Istruzioni per Debian
mg: Toromarika hoan i Debian
pt: Instruções para Debian

source: Note: The steps below should be performed with root access (i.e., switching user to root with "su" or by prefixing each command with "sudo").
he: הערה: יש לבצע את הצעדים שלהלן עם הרשאות ניהול (כלומר לעבור למשתמש ה־root בעזרת "su" או להקליד "sudo" לפני כל פקודה).
id: Catatan: Langkah-langkah dibawah ini harus dilaksanakan dengan akses root (misalnya, pengguna beralih ke root dengan "su" atau dengan mengawali setiap perintah dengan "sudo").
it: Nota: i punti sottostanti dovrebbe essere eseguiti con un accesso di amministratore (ad esempio, passando da utente normale a root con "su" o facendo precedere ogni comando da "sudo").
mg: Fanamarihana: Ireto andalana manaraka ireto dia totonsaina avy amin'ny alalan'i root

source: Add lines like the following to <code>%(file)s</code>.
he: הוסיפו שורות כמו אלה לקובץ <code>%(file)s</code>.
id: Tambahkan baris seperti berikut ke <code>%(file)s</code>.
it: Aggiungi linee come le seguenti a <code>%(file)s</code>.
mg: Ampio andalana mitovy an'izao eo amin'ny <code>%(file)s</code>.
pt: Adicione linhas da forna a seguir em <code>%(file)s</code>.

source: Download <a href="%(repokey)s">the key used to sign the repository</a> and add it to apt:
he: הורידו את <a href="%(repokey)s">המפתח המשמש לחתימה על המאגר</a> והוסיפו אותו ל־apt:
id: Unduh <a href="%(repokey)s">kunci yang digunakan untuk menandai repositori</a> dan menambahkannya ke apt:
it: Scarica <a href="%(repokey)s">la chiave usata per firmare il repository</a> e aggiungila ad apt:
mg: Ampidino <a href="%(repokey)s">ny fanalahidy dia nampiasaina hanaova sonian' ny toeram'pitehirizana</a> ary ampio ao amin'ny apt:

source: Notify your package manager of the new repository by entering
he: יידעו את מנהל החבילות שלכם על המאגר החדש על־ידי הזנת:
id: Beritahukan pengelola paket Anda tentang repositori baru dengan memasukkan
it: Notifica al tuo gestore di pacchetti il nuovo repository inserendo
mg: Hilazao ny mpitsinjara entan'ny PPA vaovao amin'izao fomba izao
pt: Informe seu gerenciador de pacotes do novo repositório inserindo

source: This command will retrieve the latest list of software from every repository enabled on your system, including the I2P repository added in step 1.
he: פקודה זו תוריד את רשימת התוכנות העדכנית מכל מאגר המאופשר במערכת שלכם, כולל המאגר של I2P שנוסף בצעד 1.
id: Perintah ini akan mencari keterangan daftar perangkat lunak terbaru dari setiap repositori yang diaktifkan pada sistem Anda, termasuk repositori I2P yang ditambahkan pada langkah 1.
it: Questo comando recupererà l'elenco di programmi più recenti da ogni repository attivato sul sistema, incluso quello I2P aggiunto nel punto 1.
mg: Ity baiko ity dia hisintona ny fampiarana farany avy amin'ny fitehirizan'entana rehetra hita anaty fitaovanao, miaraka ny fitehirizana an'i I2P izay natao teo amin'ny ambaratonga 1.

source: You are now ready to install I2P! Installing the <code>i2p-keyring</code> package will ensure that you receive updates to the repository's GPG key.
he: כעת אתם מוכנים להתקנת I2P! התקנת החבילה <code>i2p-keyring</code> תבטיח שתקבלו עדכונים למפתח ה־GPG של המאגר.
id: Sekarang Anda sudah siap untuk memasang I2P! Memasang paket <code>i2p-keyring</code> akan memastikan bahwa Anda menerima pembaruan ke repositori kunci GPG.
it: Sei pronto a installare I2P! L'installazione del pacchetto <code>i2p-keyring</code> farà in modo di farti ricevere gli aggiornamenti della chiave GPG del repository.
mg: Vonona ny hametraka an'i I2P ianao! mametraka<code>i2p-keyring</code> ny entana rehetra dia manamarina fa ho voarainao ny fanavaozana rehetra ao amin'ny fitehirizana ny fanalahidy GPG.

source: After the installation process completes you can move on to the next part of <a href="#Post-install_work">starting I2P</a> and configuring it for your system.
he: לאחר השלמת תהליך ההתקנה אתם יכולים להמשיך הלאה לשלב הבא, <a href="#Post-install_work">הרצת I2P</a>, ולהגדיר את התצורה של I2P עבור המערכת שלכם.
id: Setelah proses pemasangan selesai Anda dapat melanjutkan ke bagian berikutnya <a href="#Post-install_work">memulai I2P</a> dan mengkonfigurasikannya untuk sistem Anda.
it: Dopo il completamento della procedura di installazione, puoi passare alla sezione successiva per <a href="#Post-install_work">avviare I2P</a> e configurarlo per il tuo sistema.
mg: Rehefa vita ny fametrahana dia afaka mandroso ao amin'ny ambaratonga manaraka toy ny <a href="#Asa aorian'ny fametrahana">mamelona an'i I2P</a>ary mandamina sy mampifandrindra azy amin'ny fitaovanao.
pt: Após completar o processo de instalação, você pode passar para a próxima parte de <a href="#Post-install_work">inicialização</a> e configuração do I2P em seu sistema.
sv_se: Efter installationprocessen avslutas kan du gå vidare till nästa del av <a href="#Post-install_work">starta I2P</a> och konfigurera det för ditt system.

source: Post-install work
he: צעדים לאחר ההתקנה
id: Beritahukan pemasangan bekerja
it: Post-installazione
mg: Asa aorian'ny fametrahana
pt: Trabalho de pós-instalação
sv_se: Efter-installations arbete

source: Using these I2P packages the I2P router can be started in the following three ways:
he: על־ידי שימוש בחבילות של I2P ניתן להריץ את נתב ה־I2P בשלוש הדרכים הבאות:
id: Menggunakan paket I2P tersebut maka router I2P dapat dimulai dalam tiga cara berikut:
it: Usando questi pacchetti I2P, il router I2P può essere arriavo nei tre modi che seguono:
mg: Raha ireo entana I2P ireo no ampiasaina, dia afaka velomina torak'izao ny router I2P fomba telo:
pt: Usando estes pacotes do I2P, o roteador I2P pode ser iniciado das seguintes três formas:
sv_se: Med hjälp av dessa I2P-packet kan I2P routern startas på följande tre sätt:
