Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: In order to be inclusive and try to ensure that I2P will run on as many systems as possible, up until I2P 0.8.9 we used a <a href="http://wrapper.tanukisoftware.com/">java wrapper</a> compiled for FreeBSD 6.x. If you're receiving this error you most likely are missing the necessary compatibility libraries. These libraries may be installed by performing the following steps:
id: Supaya untuk menjadi inklusif dan memastikan bahwa I2P akan berjalan pada sistem sebanyak mungkin, sampai sampai I2P 0.8.9 kami menggunakan <a href=\"http://wrapper.tanukisoftware.com/\">java wrapper</a> yang disusun untuk FreeBSD 6.x. Jika anda mendapat error ini, kemungkinan besar anda akan kehilangan compatibility libraries yang diperlukan. Library tersebut dapat diinstal dengan melakukan langkah-langkah berikut:
it: Per essere inclusivo e cercare di assicurare che I2P sia eseguito su quanti più sistemi possibili, fino alla version I2P 0.8.9 abbiamo usato un <a href="http://wrapper.tanukisoftware.com/">wrapper java </a> compilato per FreeBSD 6.x. Se ricevi questo errore, probabilmente ti mancano le librerie di compatibilità necessarie. Tali librerie possono essere installate seguendo questi punti:
mg: Mba ho matotra sy mba ahafahana mampiasa an'i I2P eo amin'ny solon'tsaina samihafa araky izay azo atao, hatreo amin'ny I2P 0.8.9 dia nampiasa <a href="http://wrapper.tanukisoftware.com/">java wrapper</a> natao hoa an'ny FreeBSD 6.x izahay. Raha sendra ka tojo ity hadisoana ity ianao dia fantaro fa mety tsy ampy ny zavatra ilaina , toy ny libraries. Ireo libraries ireo dia azo hapetraka amin'izao fomba izao:
pt: Para que o I2P seja inclusivo e visando garantir que ele rodará em quantos sistemas possíveis, até a versão 0.8.9 nós usamos um <a href="http://wrapper.tanukisoftware.com/">empacotador java</a> compilado para FreeBSD 6.x. Se você está recebendo este erro, você provavelmente não tem as bibliotecas necessárias. Essas bibliotecas podem ser instaladas seguindo os seguintes passos:
sv_se: För att vara inklusiv och att försöka försäkra att I2P kommer köra på så många system som möjligt, använde vi till release 0.8.9 en <a href="http://wrapper.tanukisoftware.com/">java wrapper</a> kompilerad fär FreeBSD 6.x. Om du får dethär felet så saknar du nog de kompabilitetsbiblioteken som behövs. Dessa bibliotek kan installeras på följande vis:

source: Switch to the root user with <code>su</code> or log in as <code>root</code>.
id: Beralih ke user root dengan <code>su</code> atau log in sebagai <code>root</code> .
it: Passa all'utente amministratore con <code>su</code> oppure effettua il login come <code>root</code>.
mg: Avadiho ho root ny mpampiasa amin'ny alalan'ny <code>su</code> na mihidira toy ny <code>root</code>.
pt: Alterne para usuário root com <code>su</code> ou faça login como <code>root</code>.
sv_se: Byt till root användaren med <code>su</code> eller logga in som <code>root</code>.

source: If you cannot install these compatibility libraries (or do not want to), other possibilities would be to compile the wrapper for <a href="%(manualwrapper)s">your system</a>, starting I2P with the <code>runplain.sh</code> script, or you can replace the wrapper with one from the source tarball.
id: Jika anda tidak dapat menginstal compatibility libraries tersebut (atau tidak mau menginstall), kemungkinan lain yang dapat dilakukan adalah mengkompilasi wrapper untuk <a href=\"%(manualwrapper)s\">sistem operasi anda</a>, nyalakan I2P dengan script <code>runplain.sh</code> , atau anda dapat mengganti wrapper dengan satu dari tarball source code.
it: Se non riesci a installare queste librerie di compatibilità (o non vuoi farlo), le altre possibilità a tua disposizione potrebbero esser la compilazione del wrapper per <a href="%(manualwrapper)s">il tuo sistema</a>, l'avvio di I2P con lo script <code>runplain.sh</code> oppure la sostituzione del wrapper con uno contenuto nel file sorgente compresso con tar.
mg: Raha tsy afaka mametraka ireo compatibility libraries (na tsy tiana ho atao), ny fomba afa dia ny manakambana ny wrapper hoan'ny <a href="%(manualwrapper)s">your system</a>, mamelona ny I2P amin'ny alalan'ny kaody <code>runplain.sh</code>, dia ahafahana manova ny wrapper amin'ny fiaviana tarball.
pt: Se não puderes instalar essas bibliotecas de compatibilidade (ou não quiser), outras possibilidades são compilar o embalador para <a href="%(manualwrapper)s">teu sistema</a>, iniciar I2P com o programa <code>runplain.sh</code>, ou podes substituir o embalador por outro do tarball com código-fonte.
sv_se: Om du inte kan installera dessa kompabilitetsbibliotek (eller inte vill), så är en annan möjlighet att kompilera wrappern för <a href="%(manualwrapper)s">ditt system</a>, starta I2P med <code>runplain.sh</code> skriptet, eller att byta ut wrappern med en från källkods tarball:en.

source: For the 0.8.9 release of I2P, the wrapper was upgraded to v3.5.12 and compiled on systems running FreeBSD 7.2.
id: Untuk rilis 0.8.9 dari I2P, wrapper di-upgrade ke v3.5.12 dan disusun untuk sistem yang menjalankan FreeBSD 7.2.
it: Per la versione 0.8.9 di I2P, il wrapper è stato aggiornata alla versione 3.5.12 e compilato su sistemi FreeBDS 7.2.
mg: Hoan'ny modelin'ny I2P 0.8.9, dia nampiakarina ho v3.5.12 ny wrapper ary natambatra hoan ny fiataovana mampiasa FreeBSD 7.2
pt: Para a versão 0.8.9 do I2P, o empacotador foi atualizado para v3.5.12 e compilado em sistemas rodando FreeBSD 7.2.
sv_se: För 0.8.9 releasen av I2P, uppdaterades wrappern till v3.5.12 och kompilerades på system som körde FreeBSD 7.2.

source: In <code>wrapper.log</code> I see an error that states "<code>Protocol family unavailable</code>" when loading the Router Console
id: Di <code>wrapper.log</code> saya melihat error yang menyatakan \" <code>Protocol family unavailable</code> \" ketika loading console router
it: Nel <code>wrapper.log</code> osservo un errore relativo alla <code>famiglia di protocolli non disponibile</code> quando viene caricato il console router.
mg: Ao anatin'ny <code>wrapper.log</code> Dia ahitako sora-pahadisoana izay mampiseho "<code>Protocol family unavailable</code>" rehefa mampiakatra ny fibaikoana ny router.
pt: Em <code>wrapper.log</code> vejo um erro que diz "<code>Protocol family unavailable</code>" quando carrego o Painel do Roteador
sv_se: I <code>wrapper.log</code> ser jag fel som säger "<code>Protocol family unavailable</code>" när routerkonsolen laddas

source: Often this error will occur with any network enabled java software on some systems that are configured to use IPv6 by default. There are a few ways to solve this:
id: Seringkali error ini akan terjadi dengan software Java yang jaringannya diaktifkan pada beberapa sistem operasi yang dikonfigurasi untuk menggunakan IPv6 secara default. Ada beberapa cara untuk memecahkan masalah ini:
it: Spesso tale errore si verifica con qualunque software java abilitato per le reti su alcuni sistemi che sono configurati per l'uso di IPv6 come impostazione predefinita. Esistono alcuni modi per risolvere questo problema:
mg: Ity hadisoana ity dia ho hita matetika eo amin'ny tambazotra mampiasa java eo amin'ny fitaovana izay natao ampiasa IPV6. Misy fomba vitsivitsy ialana amin'izany:
pt: Normalmente esse erro ocorrerá em qualquer software que acessa a rede em alguns sistemas configurados para usar IPv6 por padrão. Há alguns modos de resolver isso:
sv_se: Ofta inträffar dethär felet när ett nätverksanvändande java-program är konfigurerat att använda IPv6 som standard på vissa system. Det finns några sätt att lösa detta:

source: On Linux based systems, you can <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
id: Pada sistem berbasis Linux, anda dapat<code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
it: Sui sistemi basati su Linux, è possibile eseguire <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
mg: Eo amin'ny Linux, dia azo atao <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
pt: Em sistemas baseados em Linux, podeis usar o seguinte comando: <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
sv_se: På Linux-baserade system kan du köra <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>

source: Look for the following lines in <code>wrapper.config</code>.
id: Cari baris berikut dalam <code>wrapper.config</code> .
it: Cerca le seguenti righe nel <code>wrapper.config</code>.
mg: Jereo ireto andalana ireo ao amin'ny <code>wrapper.config</code>.
pt: Procure pelas seguintes linhas no arquivo <code>wrapper.config</code>.
sv_se: Leta efter följande rader i <code>wrapper.config</code>.

source: If the lines are there, uncomment them by removing the "#"s. If the lines are not there, add them without the "#"s.
id: Jika baris tersebut ada, hilangkan tanda komentar dengan menghapus "#". Jika baris tersebut tidak tambahkan mereka tanpa "#".
it: Se tali righe esistono, rimuovi i loro simboli di commento "#". Se non esistono, aggiungile senza i simboli "#".
mg: Raha eo ireo andalana ireo, esory ny "#". Raha tsy eo kosa izy ireo, ampio fa tsy asiana ny "#".
pt: Se essas linhas estiverem lá, remove os "#". Se as linhas não estão lá, adicione-as sem os "#".
sv_se: Om raderna finns där, okommentera dom genom att ta bort "#". Om raderna inte finns där, lägg till dom utan "#".

source: Another option would be to remove the <strong>::1</strong> from <code>~/.i2p/clients.config</code>
id: Pilihan lain adalah menghapus <strong>::1</strong> di<code>~/.i2p/clients.config</code>
it: Un'altra opzione potrebbe essere quella di rimuovere <strong>::1</strong> da <code>~/.i2p/clients.config</code>
mg: Tetika iray hafa ny manaisotra ny <strong>::1</strong> from <code>~/.i2p/clients.config</code>
pt: Outra opção seria a remoção de <strong>::1</strong> do arquivo <code>~/.i2p/clients.config</code>
sv_se: Ett annat alternativ är att ta bort <strong>::1</strong> från <code>~/.i2p/clients.config</code>

source: <strong>WARNING</strong>: For any changes to <code>wrapper.config</code> to take effect, you must completely stop the router and the wrapper. Clicking <em>Restart</em> on your router console will NOT reread this file! You must click <em>Shutdown</em>, wait 11 minutes, then start I2P.
id: <strong>PERINGATANn</strong>: untuk setiap perubahan <code>wrapper.config</code> dapat bekerja, anda harus benar-benar menghentikan router dan wrapper. Mengklik <em>Restart</em> console router tidak akan mengaktifkan file ini! Anda harus klik <em>Shutdown</em>, tunggu 11 menit, kemudian mulai lagi I2P.
it: <strong>ATTENZIONE</strong>: perché <code>wrapper.config</code> abbia qualche possibilità di avere effetto, devi interrompere completamento il router e il wrapper. Fare clic su <em>Riavvia</em> nel console router NON eseguirà una rilettura del file! Devi fare clic su<em>Arresta</em>, attendere 11 minuti, quindi avviare I2P.
mg: <strong>TANDREMO</strong>: Mba ahafahan'ny <code>wrapper.config</code>miasa, dia tsy maintsy vonoina ny router sy ny wrapper. Ny fanindriana ny <em>Restart</em> eo amin'ny fibaikoana ny router dia TSY hamaky an'ity fisy ity! Tsy maintsy tsindriana ny <em>Shutdown</em>,ary miandrasa 11 minitra, dia velomy i I2P.
pt: <strong>AVISO</strong>: Para quaisquer mudanças no arquivo <code>wrapper.config</code> fazerem efeito, é necessário parar completamente o roteador e o embalador. Clicar <em>Reiniciar</em> em teu painel do roteador NÃO irá reler esse arquivo! É necessário clicar <em>Desligar</em>, esperar onze minutos, então iniciar o I2P.
sv_se: <strong>VARNING</strong>: För alla ändringar i <code>wrapper.config</code> krävs en omstart av routern för att de ska träda i kraft. Att klicka på <em>Starta Om</em> i din routerkonsol kommet *inte* läsa om denhär filen! Du måste klicka på <em>Stäng ner</em>, vänta i 11 minuter och sedan starta I2P.

source: Great! Find us on IRC irc.freenode.net #i2p or post to the <a href="http://%(forum)s/">forum</a> and we'll post it here (with the answer, hopefully).
id: Bagus! Cari kami di IRC irc.freenode.net #i2p atau posting ke <a href=\"http://%(forum)s/\">forum</a> dan kami akan posting di sini (dengan jawabannya, mudah-mudahan).
it: Fantastico! Ci puoi trovare su IRC all'indirizzo irc.freenode.net nel canale #i2p oppure postare sul <a href="http://%(forum)s/">forum</a> e noi provvederemo a postare qui (con la risposta, si spera).
mg: Milay e! Jereo ao amin'ny IRC irc.freenode.net #i2p na manorata eo amin'ny <a href="http://%(forum)s/">forum</a> dia ho apetrakay eto(miaraka ny valiny,enga anie).
pt: Ótimo! Encontre-nos no IRC pelo irc.freenode.net #i2p ou publique no <a href="http://%(forum)s/">fórum</a> que nós publicaremos aqui (possivelmente com a resposta).
sv_se: Toppen! Hitta oss på IRC irc.freenode.net #i2p eller post:a på <a href="http://%(forum)s/">forumet</a> så kommer vi skriva det här (med svaret, förhoppningsvis).

source: German laws
he: חוקים גרמניים
id: Hukum di Jerman
it: Legislazione tedesca
mg: Lalàna Allemana
pt: Leis alemãs.
sv_se: Tyska lagar

source: I2P Anonymous Network
he: הרשת האנונימית I2P
id: Jaringan Anonim i2p
it: Rete anonima I2P
mg: I2P Tambazotra miafina
pt: I2P Rede Anônima
sv_se: I2P Anonymt Nätverk

source: Anonymous peer-to-peer distributed communication layer built with open source tools and designed to run any traditional Internet service such as email, IRC or web hosting.
id: Anonymous peer-to-peer distributed communication layer dibangun dengan alat open source dan dirancang untuk menjalankan layanan Internet tradisional seperti email, IRC atau web hosting.
it: Livello di comunicazione distribuito peer-to-peer anonimo compilato con strumenti open source e progettato per funzionare con qualunque servizio Internet come e-mail, IRC o web hosting.
mg: Fifandraisan'ny akama-sy-akama izay namboarina tamin'ny fitaovana azon'ny rehetra alaina ary natao ampiasaina ny fitaovana internet mahazatra toy ny mailaka, IRC na fampiantranoina tranon'kala
pt: Interface para comunicação anónima baseada em mensagens distribuídas ponto-a-ponto, construída com ferramentas de código aberto, feita para funcionar com serviços tradicionais da Internet, como e-mail, IRC ou hospedagem de sites.
sv_se: Anonymt peer-to-peer distribuerat kommunikationslager byggt med open source-verktyg och designat för att köra alla traditionella internet-tjänster så som e-post, IRC och webb-hosting.

source: What does I2P do for you?
he: מה I2P עושה עבורך ?
id: Apa yang dilakukan I2P untuk anda?
it: Che cosa fa I2P per te?
mg: Inona no ataon'i I2P ho anao?
pt: O que o I2P faz por você?
sv_se: Vad gör I2P för dig?

source: The I2P network provides strong privacy protections for communication over the Internet. Many activities that would risk your privacy on the public Internet can be conducted anonymously inside I2P.
id: Jaringan I2P menyediakan perlindungan privasi yang kuat untuk komunikasi melalui Internet. Banyak kegiatan yang berisiko privasi di Internet dapat dilakukan secara anonim dalam I2P.
it: La rete I2P fornisce una forte protezione della privacy per le comunicazioni su Internet. Molte delle attività che metterebbero in pericolo la tua privacy su Internet pubblica possono essere condotte in modo anonimo all'interno di I2P.
mg: Ny I2P dia tambazotra afaka manafina tsara ny fifandraisana atao eo amin'ny Internet. Maro ireo zavatra ampiasaina mety ahitana ny momba anao rehetra ao amin'ny Internet, ny I2P dia afaka manafina izany rehetra izany.
pt: A rede I2P fornece fortes proteções de privacidade para a comunicação através da Internet. Muitas atividades que arriscam a sua privacidade na Internet pública pode ser realizada de forma anônima dentro I2P.
sv_se: I2P-nätverket ger ett starkt intergritets-skydd för kommunikation över internet. Många aktiviteter som skulle riskera din intergritet på det publika internet kan göras anonymt inom I2P.

source: Get I2P %(version)s
id: Dapatkan I2P %(version)s
it: Ottieni I2P %(version)s
mg: Alaivo ny I2P %(version)s
pt: Obter o I2P %(version)s
sv_se: Hämta I2P %(version)s

source: What is I2P?
he: מה הוא I2P?
id: Apa itu I2P?
it: Cos'è I2P?
mg: Inona no atao hoe I2P?
pt: O que é o I2P?
sv_se: Vad är I2P?

source: I2P is an anonymous overlay network - a network within a network. It is intended to protect communication from dragnet surveillance and monitoring by third parties such as ISPs.
id: I2p adalah jaringan anomim berlapis - jaringan dalam jaringan. Hal ini dimaksudkan untuk melindungi komunikasi dari pemantauan oleh pihak ketiga seperti ISP.
it: I2P è una rete di copertura anonima, una rete dentro la rete. Il suo scopo è di proteggere le comunicazioni dal controllo a tappeto e dal monitoraggio di terze parti come gli ISP.
mg: I2P dia tambazotra miafina - tambazotra ao anatin'ny tambazotra . Natao mba iarovana ny fifandraisana rehetra ataon'ny dragnet andrimaso sy orinasa hafa, toy ny ISPs.
pt: A I2P é uma rede overlay anônima - uma rede dentro de outra rede. É destinada a proteger comunicações da vigilância e monitoramento por terceiros, tais como provedores de acesso à internet.
sv_se: I2P är ett anonymt överdrags-nätverk - ett nätverk inuti ett nätverk. Det är avsett att skydda kommunikation från massövervakning av 3dje parter som internet leverantörer.

source: I2P is used by many people who care about their privacy: activists, oppressed people, journalists and whistleblowers, as well as the average person.
id: I2P digunakan oleh banyak orang yang peduli dengan privasi mereka: aktivis, orang tertindas, wartawan dan pelapor, serta orang-orang biasa.
it: I2P è usato da molte persone che ci tengono alla propria privacy: attivisti, oppressi, giornalisti e gole profonde, e anche persone normali.
mg: I2P dia ampiasain'ny olona maro te hilamin'tsaina tsy tia sembanana toy ny : Aktivista, olona voahenjika lava, mpanao gazety sy ny mpanohitra ary ny olon-tsotra.
pt: I2P é usado por muitas pessoas que se importam com a sua privacidade online: activistas, povos de países de opressão institucional, jornalistas e informantes, assim como qualquer outra pessoa normal preocupada com a sua privacidade.
sv_se: I2P används av många människor som bryr sig om sin integritet: aktivister, förtryckta människor, journalister och visselblåsare men även genomsnittliga personer.

source: No network can be "perfectly anonymous". The continued goal of I2P is to make attacks more and more difficult to mount. Its anonymity will get stronger as the size of the network increases and with ongoing academic review.
id: Tidak ada jaringan yang bisa "anonim sempurna". Tujuan berlanjutan dari I2P adalah membuat serangan semakin sulit untuk dilakukan. Anonimitasnya akan semakin kuat seiring bertambahnya ukuran jaringan dan dengan tinjauan akademis yang sedang berlangsung.
it: Nessuna rete può essere "perfettamente anonima". L'intento continuo di I2P è di rendere gli attacchi sempre più difficili da lanciare. Il suo anonimato si rafforzerà all'aumentare delle dimensioni e degli studi accademici che verranno continuamente condotti.
mg: Tsy misy tambazotra tena "manafina tanteraka". Ny tanjon'ny I2P dia ny hanasarotra kokoa ny fanafihana izay hataon'ny olon'kafa anao. Ny fierena dia ho hatanjaka kokoa isaky ny mitombo ny isan'ny olona ao anaty tambazotra, ary koa arakaraky ny fikarohana ataon'ny akademia.
sv_se: Inga nätverk kan vara "totalt anonymt". De kontinuerliga målet för I2P är att göra attacker svårare och svårare att utföra. Dess anonymitet kommer bli starkare allt eftersom nätverkets storlek ökar och pågående akademisk undersökning.

source: I2P is available on desktops, embedded systems (like the Raspberry Pi) and Android phones. Help spread the word!
id: I2P tersedia di desktop, embedded system (seperti Raspberry Pi) dan ponsel Android. Bantulah menyebarkan berita!
it: I2P è disponibile per desktop, sistemi integrati (come il Raspberry Pi) e i telefonini Android. Dacci una mano con il passaparola!
mg: I I2P dia misy hoan'ny solon'tsaina lehibe , sy ny solon'tsaina farany izay kely indrindra (toy ny Rasperry Pi) sy ny findray Android. Ampio izahay hanaparitaka ny momba izany.
sv_se: I2P är tillgängligt för desktops, inbyggda system (som Raspberry Pi) och Android telefoner. Hjälp till att sprida order!

source: Read more&hellip;
id: Baca lebih banyak&hellip;
it: Leggi tutto&hellip;
mg: Tohizo ny famakiana&hellip
pt: Ler mais&hellip;
sv_se: Läs mer&hellip;

source: What can you do with I2P?
he: מה אתה יכול לעשות עם I2P?
id: Apa yang bisa anda lakukan dengan I2P?
it: Che cosa puoi fare con I2P?
mg: Inona no azo ampiasaina ny I2P?
pt: O que pode fazer com o I2P?
sv_se: Vad kan du göra med I2P?

source: <a href="%(supported)s#email">Email:</a> Integrated web mail interface, plugin for serverless email.
id: <a href=\"%(supported)s#email\">Email:</a> Intrface email web terpadu, plugin untuk email serverless.
it: <a href="%(supported)s#email">Email:</a> interfaccia web integrata per la posta elettronica, plugin per la posta elettronica senza server.
mg: <a href="%(supported)s#email">Mailaka:</a> Mailaka anatiny, tovana hoan'ny mailaka tsy misy mpizara.
pt: <a href="%(supported)s#email">E-mail:</a> Interface web para e-mail, plugin para e-mail sem servidor.
sv_se: <a href="%(supported)s#email">E-post:</a> Integrerat webb-epost interface, plugin för serverlös e-post.

source: <a href="%(supported)s#web-browsing">Web browsing:</a> Anonymous websites, gateways to and from the public Internet.
id: <a href=\"%(supported)s#web-browsing\">Web browsing:</a> Situs web anonim, gateway ke dan dari Internet publik.
it: <a href="%(supported)s#web-browsing">Navigazione web:</a> siti web anonimi, gateway verso e dallInternet pubblica.
mg: <a href="%(supported)s#web-browsing">Fijerevana:</a> Anonymous websites, gateways to and from the public Internet.
pt: <a href="%(supported)s#web-browsing">Navegação:</a> Sites anônimos, acessos (gateways) para e da Internet pública.
sv_se: <a href="%(supported)s#web-browsing">Surfande:</a> Anonyma sajter, portaler till och från det publika internet.

source: <a href="%(supported)s#blogging-and-forums">Blogging and forums:</a> Blogging and Syndie plugins.
id: <a href=\"%(supported)s#blogging-and-forums\">Blogging dan forum:</a> plugin Blogging dan Syndie.
it: <a href="%(supported)s#blogging-and-forums">Blog e forum:</a> plugin per gestire blog e per Syndie.
mg: <a href="%(supported)s#blogging-and-forums">Blog sy firesahana:</a> Blogging and Syndie plugins.
pt: <a href="%(supported)s#blogging-and-forums">Blogging e fórums:</a> Blogging e plugins Syndie.
sv_se: <a href="%(supported)s#blogging-and-forums">Bloggande och forum:</a> Bloggande och Syndie plugins.

source: <a href="%(supported)s#website-hosting">Website hosting:</a> Integrated anonymous web server.
id: <a href=\"%(supported)s#website-hosting\">Website hosting:</a> server web anonim terpadu.
it: <a href="%(supported)s#website-hosting">Host di siti web:</a> web server anonimo integrato.
mg: <a href="%(supported)s#website-hosting">Fampiantranona tranonkala:</a> Integrated anonymous web server.
pt: <a href="%(supported)s#website-hosting">Hospedagem de sites:</a> Servidor web anônimo integrado.
sv_se: <a href="%(supported)s#website-hosting">Webbhosting:</a> Integrerad anonym webbserver.

source: <a href="%(supported)s#real-time-chat">Real-time chat:</a> Instant messaging and IRC clients.
id: <a href=\"%(supported)s#real-time-chat\">Real-time chat:</a> Klien pesan instan dan klien IRC.
it: <a href="%(supported)s#real-time-chat">Chat in tempo reale:</a> messaggistica immediata e client IRC.
mg: <a href="%(supported)s#real-time-chat">Firesahana eo noho eo:</a> Instant messaging and IRC clients.
pt: <a href="%(supported)s#real-time-chat">Chat em tempo real:</a> Mensagens instantâneas e clientes IRC.
sv_se: <a href="%(supported)s#real-time-chat">Realtids chat:</a> Instant messaging och IRC klienter.
