Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: &quot;on demand&quot; using the i2prouter script. Simply run &quot;<code>i2prouter start</code>&quot; from a command prompt. (Note: Do <strong><u>not</u></strong> use sudo or run it as root!)
he: ‏&quot;לפי הצורך&quot; באמצעות התסריט i2prouter. פשוט הריצו &quot;<code>i2prouter ‏start</code>&quot; בשורת הפקודה. (הערה: <strong><u>אל</u></strong> תריצו כמשתמש root ואל תשתמשו ב־sudo!)
id: &quot;on demand&quot; menggunakan script i2prouter. Jalankan saja &quot;<code>i2prouter start</code>&quot; dari command prompt. (Catatan: <strong><u>JANGAN</u></strong> gunakan sudo ataupun menjalankannya sebagai root!)
it: &quot;a richiesta&quot; usando lo script i2prouter. Ti basta eseguire &quot;<code>i2prouter start</code>&quot; da riga di comando. (Nota: <strong><u>non</u></strong> usare sudo e non eseguirlo con privilegi di amministrazione!)
mg: &quot;raha ilaina&quot; ny mampiasana ny script'ny router i2p. dia alefaso &quot;<code>i2prouter start</code>&quot;avy amin'ny baiko an-tsoratra. (fanamarihana: <strong><u>Aza</u></strong> mampiasa sudo na mandefa azy raha root ianao!)
pt: &quot;sob demanda&quot; usando o script i2prouter. Basta rodar &quot;<code>i2prouter start</code>&quot; de um prompt de comando. (Atenção: <strong><u>Não</u></strong> use sudo nem rode como root!)
sv_se: &quot;på begäran&quot; används i2prouter skriptet. Kör &quot;<code>i2prouter start</code>&quot; från kommandotolken. (Notera: Använd <strong><u>inte</u></strong> sudo eller använd det som root!)

source: &quot;on demand&quot; without the <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (needed on non-Linux/non-x86 systems) by running "<code>i2prouter-nowrapper</code>". (Note: Do <strong><u>not</u></strong> use sudo or run it as root!)
he: ‏&quot;לפי הצורך&quot; ללא ה־<a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (נדרש במערכות שאינן מריצות גנו/לינוקס או שאינן x86) על־ידי הרצת "<code>i2prouter-nowrapper</code>". (הערה: <strong><u>אל</u></strong> תריצו כמשתמש root ואל תשתמשו ב־sudo!)
id: &quot;on demand&quot; tanpa <a href=\"http://wrapper.tanukisoftware.com/\">java service wrapper</a>(diperlukan untuk sistem operasi non-Linux/non-x86) dengan menjalankan \"<code>i2prouter-nowrapper</code> (Catatan: <strong><u>jangan gunakan</u></strong> sudo atau jangan jalankan sebagai root!)
it: &quot;a richiesta&quot; senza il <a href="http://wrapper.tanukisoftware.com/">wrapper di servizi java</a> (necessario su sistemi diversi da Linux o diversi da x86) eseguendo "<code>i2prouter-nowrapper</code>". (Nota: strong><u>non/u></strong> usare sudo e non eseguirlo con privilegi di amministrazione!)
mg: &quot;raha ilaina&quot; tsy misy ny <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (izay ilaina amin'ny fitaovana tsy mampiasa linux/na fitaovana tsy x86) amin'ny alalan'ny fandefasana "<code>i2prouter-nowrapper</code>". (Note: <strong><u>aza</u></strong> mampiasa sudo raha root ianao!)
pt: &quot;Sob demanda&quot; sem o <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (necessário em sistemas não-Linux/não-x86) rodando "<code>i2prouter-nowrapper</code>". (Atenção: <strong><u>Não</u></strong> use sudo nem rode como root!)
sv_se: &quot;på begäran&quot; utan <a href="http://wrapper.tanukisoftware.com/">java tjänst wrappern</a> (behövs på Icke-Linux / Icke-x86 system) genom att köra "<code>i2prouter-nowrapper</code>". (Uppmärksamma: Används <strong><u>inte</u></stong> sudo eller kör root!)

source: as a service that automatically runs when your system boots, even before logging in. The service can be enabled with "<code>dpkg-reconfigure i2p</code>" as root or using sudo. This is the recommended means of operation.
he: כשירות שרץ באופן עצמאי כאשר המערכת עולה, עוד לפני שהמשתמש נכנס. ניתן להפעיל את השירות עם "<code>dpkg-reconfigure ‏i2p</code>" בתור root או על־ידי שימוש ב־sudo. זהו אופן השימוש המומלץ.
id: sebagai service yang otomatis berjalan ketika sistem operasi dihidupkan, bahkan sebelum log in. Layanan ini dapat diaktifkan dengan \" <code>dpkg-reconfigure i2p</code> " sebagai root atau menggunakan sudo. Ini adalah cara operasi yang direkomendasikan.
it: come servizio che viene eseguito automaticamente all'avvio del sistema, anche prima di effettuare l'accesso. Il servizio può essere attivato con "<code>dpkg-reconfigure i2p</code>" con privilegi di amministrazione o usando sudo. Questa è la modalità consigliata.
mg: Servisy velona miaraka amin'ny solon'tsaina ,ary alohan'ny hidiranao ao anaty ny solon'tsainao koa aza. Ny servisy dia azovelomina amin'ny "<code>dpkg-reconfigure i2p</code>" raha root na mampiasa sudo. Hafatra momba ny fampiasana azy.
pt: Como um serviço que automaticamente roda durante o boot, antes mesmo do login. O serviço pode ser ativado com "<code>dpkg-reconfigure i2p</code>" como root ou usando sudo. Este é o modo de operação recomendado.
sv_se: som en tjänst som automatiskt körs när systemet startas, även före inloggning. Tjänsten kan slås på med "<code>dpkg-reconfigure i2p</code>" som root eller sudo. Detta är det rekommenderade sättet att köra I2P.

source: When installing for the first time, please remember to <b>adjust your NAT/firewall</b> if you can. The ports to forward can be found on the <a href="http://127.0.0.1:7657/confignet"> network configuration page</a> in the router console. If guidance with respect to forwarding ports is needed, you may find <a href="http://portforward.com">portforward.com</a> to be helpful.
he: בעת ההתקנה בפעם הראשונה, אנא זכרו להגדיר את ה־<b>NAT/חומת האש</b> שלכם אם אתם יכולים. ניתן למצוא את הפתחות שיש להעביר ב<a href="http://127.0.0.1:7657/confignet"> עמוד הגדרות הרשת</a> בממשק הנתב. אם אתם זקוקים להדרכה כיצד להעביר פתחות, ‏<a href="http://portforward.com">portforward.com</a> יכול לעזור.
id: Ketika anda menginstal I2P untuk pertama kalinya, harap ingat untuk <b>menyesuaikan NAT/firewall anda</b> jika anda dapat melakukannya. Semua port yang dapat di-forward dapat dilihat pada <a href=\"http://127.0.0.1:7657/confignet\"> network configuration page</a> di router console. Jika petunjuk untuk port forwarding diperlukan, silakan baca <a href=\"http://portforward.com\">portforward.com</a>.
it: Per la primissima installazione, ricorda di <b>regolare il tuo NAT o firewall</b> se puoi. Le porte da inoltrare possono essere trovate nella <a href="http://127.0.0.1:7657/confignet"> pagina di configurazione di rete</a> nel console router. Se serve aiuto in merito al port forwarding, è possibile trovare qualche dritta su <a href="http://portforward.com">portforward.com</a>.
mg: Rehefa mametraka ny i2p amin'ny voalohany, tadidio ny<b>manamboatra ny NAT/rindrin'afo</b>n raha hainao. Ny port izay ho tondroina dia hita ato amin'ny <a href="http://127.0.0.1:7657/confignet"> pejy fanamboarana ny tambazotra</a> ao anaty fibaikona ny router. Raha ilaina ny fanoroana momban'ny fampiasana ny port, dia jereo ny <a href="http://portforward.com">portforward.com</a>.
pt: Quando estiveres instalando pela primeira vez, lembra-te de <b>ajustar teu NAT/parede de fogo</b> se puderes. As portas a serem redirecionadas podem ser encontradas na <a href="http://127.0.0.1:7657/confignet">página de configuração da rede</a> no painel do roteador. Se precisares de ajuda para entender como redirecionar portas, talvez <a href="http://portfoward.com">portfoward.com</a> pode ser útil.
sv_se: När du installerar för första gången, kom ihåg att <b>justera din brandvägg/NAT</b> om du kan. Portarna som ska vidarebefodras finns på sidan för<a href="http://127.0.0.1:7657/confignet">nätverkskonfiguration</a> i routerkonsolen. Om du behöver hjälp med hur man vidarebefodrar portar, så kan <a href="http://portforward.com">portforward.com</a> vara till hjälp.

source: Please review and <b>adjust the bandwidth settings</b> on the <a href="http://127.0.0.1:7657/config.jsp">configuration page</a>, as the default settings of 96 KB/s down / 40 KB/s up are fairly conservative.
he: אנא בדקו את <b>הגדרות רוחב־הפס</b> ב<a href="http://127.0.0.1:7657/config.jsp">עמוד הגדרות התצורה</a>, מאחר והגדרות ברירת המחדל (96 ק"ב/שניה בהורדה ו־40 ק"ב/שניה בהעלאה) די נמוכות.
id: Harap meninjau dan <b>menyesuaikan pengaturan bandwidth</b> pada <a href=\"http://127.0.0.1:7657/config.jsp\">halaman konfigurasi</a>, karena pengaturan default 96 KB/s unduh / 40 KB/s unggah adalah cukup konservatif."
it: Esamina e <b>modifica le impostazioni della larghezza di banda</b> nella <a href="http://127.0.0.1:7657/config.jsp">pagina di configurazione</a>, perché le impostazioni predefinite di 96 KB/s per il download e 40 KB/s per l'upload sono abbastanza conservative.
mg: Azafady jereo ary <b>amboary ny salan'ny bandwidth</b>eo amin'ny<a href="http://127.0.0.1:7657/config.jsp">pejy fanitsiana</a>, mba ho 96 KB/s down / 40 KB/s up, izay hita fa antonony.
pt: Favor revisar e <b>ajustar as configurações de banda</b> na<a href="http://127.0.0.1:7657/config.jsp">página de configuração</a>, tendo em vista que a configuração padrão de 96 KB/s para receber e 40 KB/s para enviar são bem conservadoras.
sv_se: Var god läs igenom och <b>justera bandbreddsinställningar</b> på <a href="http://127.0.0.1:7657/config.jsp">inställiningssidan</a>, eftersom standardinställningarna 96 KB/s ner / 40 KB/s upp är tämligen konservativa.

source: If you want to reach eepsites via your browser, have a look on the <a href="%(browserconfig)s">browser proxy setup</a> page for an easy howto.
he: אם אתם רוצים לגלוש ל־eepsites דרך הדפדפן, ראו את העמוד <a href="%(browserconfig)s">הגדרת מתווך רשת לדפדפן</a> להדרכה פשוטה.
id: Jika anda ingin membuka eepsites melalui browser anda, lihat halaman <a href=\"%(browserconfig)s\">pengaturan proxy di browser</a> untuk cara penggunaan yang mudah.
it: Se vuoi raggiungere gli eepsite con il tuo browser, dai un'occhiata alla pagina <a href="%(browserconfig)s">impostazione proxy del browser</a> per delle semplici istruzioni.
mg: Raha te ahita pejy eepsites avy amin'ny fikirakiranao ianao, jereo ny pejy <a href="%(browserconfig)s">browser proxy setup</a> ahitanao fanoroana mora.
pt: Se você quer acessar eepsites pelo seu browser, dê uma olhada na opagina de <a href="%(browserconfig)s">configuração de proxy do browser</a> para um fácil manual.
sv_se: Om du vill nå en eepsida via din webbläsare, titta på <a href="%(browserconfig)s">webbläsar-proxy inställnings</a>-sidan för en enkel guide.

source: Download
he: הורדה
id: Unduh
mg: Ampidino
pt: Transferir
sv_se: Hämta

source: Dependency
he: תלות
it: Dipendenze
mg: Fanampiny
pt: Dependência
sv_se: Beroende

source: Java Runtime 1.5 or higher. (<a href="%(java)s">Oracle Java Version 7</a>, <a href="%(openjdk)s">OpenJDK 7</a>, or <a href="%(icedtea)s">IcedTea7</a> recommended, except Raspberry Pi: <a href="%(oracle8)s">Oracle 8 Early Access</a>, PowerPC: <a href="%(ibmsdk7)s">IBM SDK 7</a>) <br /> <a href="%(detectjre)s">Determine your installed Java version here</a> or type <tt>java -version</tt> at your command prompt.
mg: Java Runtime 1.5 na ambony. (<a href="%(java)s">Oracle Java Version 7</a>, <a href="%(openjdk)s">OpenJDK 7</a>, or <a href="%(icedtea)s">IcedTea7</a> no ilaina, afa tsy Raspberry Pi: <a href="%(oracle8)s">Oracle 8 Early Access</a>, PowerPC: <a href="%(ibmsdk7)s">IBM SDK 7</a>) <br /> <a href="%(detectjre)s">Lazao eto eo amin'ny fibaikona ara-tsoratra ny modely ny Java ao aminao</a> or type <tt>java -version</tt>.

source: Clean installs
he: התקנות נקיות
id: Install dari nol
it: Pulisci installazioni
mg: Fametrahana madio
pt: Instalações Novas
sv_se: Rena installationer

source: select alternate link
mg: Fidio ny lalan-kafa
sv_se: välj alternativ länk

source: Download that file and run it.
he: הורידו את הקובץ והריצו אותו.
id: Unduh lalu jalankan file tersebut
it: Scarica il file ed eseguilo.
mg: Alaivo ity fisy ity dia ampiaro
pt: Transfira o ficheiro e execute-o.
sv_se: Hämta den filen och kör den.

source: Download that file and double-click it (if that works) or type <code>java -jar i2pinstall_%(i2pversion)s.jar</code> in a terminal to run the installer. You may be able to right-click and select &quot;Open with Java&quot;.
he: הורידו את הקובץ ולחצו עליו לחיצה כפולה (אם זה עובד), או הריצו את <code>java -jar i2pinstall_%(i2pversion)s.jar</code> במסוף על־מנת להריץ את תוכנת ההתקנה. ייתכן שתוכלו ללחוץ לחיצה ימנית ולבחור ‏&quot;פתיחה באמצעות Java&quot;.
id: Unduh file tersebut lalu klik dua kali (jika ini klik dua kali dapat dilakukan) atau ketik <code>java -jar i2pinstall_%(i2pversion)s.jar</code> dalam terminal untuk menjalankan program installer. anda dapat klik kanan lalu pilih &quot;Buka dengan Java&quot;.
it: Scarica il fil e fari doppio clic su di esso (se la cosa funziona) oppure digita <code>java -jar i2pinstall_%(i2pversion)s.jar</code> in un terminale per eseguire il programma di installazione. Potrebbe essere possibile fare clic con il pulsante destro del mouse e selezionare &quot;Apri con Java&quot;.
mg: Ampidino io fisy io dia tsindrio indroa (raha mandeha) na soaraty ao anaty terminal ny <code>java -jar i2pinstall_%(i2pversion)s.jar</code> mba handehanan'ny mpametraka. Mety ho azo atao ny manindry ankavanana dia fidio ny &quot;sokafy avy amin'i Java&quot;.
pt: Transfira esse ficheiro e duplo clique no mesmo (se isso funcionar) ou digite <code>java -jar i2pinstall_%(i2pversion)s.jar</code> num terminal para executar o instalador. Poderá conseguir clicar com o botão direito e selecionar &quot;Abrir com Java&quot;.
sv_se: Hämta den filen genom att dubbelklicka på den (om det fungerar) eller skriva <code>java -jar i2pinstall_%(i2pversion)s.jar</code> i en terminal för att köra installeraren. Du kan kanske högerklicka och välja &quot;Öppna med Java&quot;.

source: Command line (headless) install:
he: התקנה בשורת הפקודה (headless):
id: Instalasi dengan command line (headless):
it: Installazione da riga di comando (non interattiva):
mg: Baiko (headless)fametrahana ara-tsoratra:
pt: Instalação pela linha de comando (headless):
sv_se: Kommandotolks (utan skärm) installation:

source: Download the %(i2pversion)s OSX graphical installer file above and run <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> from the command line.
he: הורידו את קובץ ההתקנה גרפית של גרסה %(i2pversion)s שלמעלה והריצו את <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> בשורת הפקודה.
id: Unduh %(i2pversion)s file OSX graphical installer di atas lalu jalankan <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> dari command line.
it: Scarica il file del programma di installazione grafica per OSX %(i2pversion)s e esegui <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> da riga di comando.
mg: Ampidino ny %(i2pversion)s fametrahana ara-tsary natao hoan'i OSX ary alefaso amin'ny alalan'ny baiko ara-tsoratra <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code>
pt: Baixe o %(i2pversion)s arquivo instalador gráfico para OSX acima e rode <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> da linha de comando.
sv_se: Hämta release %(i2pversion)s av den grafiska installeraren för OSX och kör <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> från kommandotolken.

source: Download that file and double-click it (if that works) or type <code>java -jar i2pinstall_%(i2pversion)s.jar</code> in a terminal to run the installer. On some platforms you may be able to right-click and select &quot;Open with Java&quot;.
he: הורידו את הקובץ ולחצו עליו לחיצה כפולה (אם זה עובד), או הריצו את <code>java -jar i2pinstall_%(i2pversion)s.jar</code> במסוף על־מנת להריץ את תוכנת ההתקנה. בפלטפורמות מסוימות ייתכן שתוכלו ללחוץ לחיצה ימנית ולבחור ‏&quot;פתיחה באמצעות Java&quot;.
id: Unduh file tersebut lalu klik dua kali (jika ini klik dua kali dapat dilakukan) atau ketik <code>java -jar i2pinstall_%(i2pversion)s.jar</code> dalam terminal untuk menjalankan program installer. Pada beberapa platform, anda dapat klik kanan lalu pilih &quot;Buka dengan Java&quot;.
it: Scarica il fil e fari doppio clic su di esso (se la cosa funziona) oppure digita <code>java -jar i2pinstall_%(i2pversion)s.jar</code> in un terminale per eseguire il programma di installazione. Su alcune piattaforme potrebbe essere possibile fare clic con il pulsante destro del mouse e selezionare &quot;Apri con Java&quot;.
mg: Ampidino io fisy io dia asio tsindry in-droa (raha mety) dia soratyao anaty terminal ity <code>java -jar i2pinstall_%(i2pversion)s.jar</code> mba hampandeha ny mpametraka amin'ny ny solo-tsain hafa mety ho azonao atao ny manao tsindry havanana dia mifidy ny &quot;Open with java&quot;.
pt: Baixe esse arquivo e dê clique-duplo nele (se isso funciona) ou digite <code>java -jar i2pinstall_%(i2pversion)s.jar</code> num terminal para rodar o instalador. Em algumas plataformas você pode conseguir clicando com botão direito e selecionando &quot;Abrir com Java&quot;.
sv_se: Hämta den filen och dubbel-klicka på den (om det fungerar) eller skriv <code>java -jar i2pinstall%(i2pversion)s.jar</code> i en terminal och kör installationen. På vissa platformar kan du behöva högerklicka och välj &quot;Öppna med&quot;.

source: Download the graphical installer file above and run <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> from the command line.
he: הורידו את קובץ ההתקנה הגרפית שלמעלה והריצו את <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> בשורת הפקודה.
id: Download file graphical installer di atas lalu jalankan <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> dari command line.
it: Scarica il file del programma di installazione grafica e esegui <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> da riga di comando.
mg: Ampidino io mpametraka ara-grafika io ambony io dia alefaso avy eo amin'ny baiko ara-tsoratra ity <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code>.
pt: Baixe o arquivo do instalador gráfico acima e rode <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> pela linha de comando.
sv_se: Hämta den grafiska installerar-filen ovan och kör <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> från kommandotolken.

source: Packages for Debian &amp; Ubuntu are available.
he: קיימות חבילות לדביאן ולאובונטו.
id: Paket untuk Debian & Ubuntu telah tersedia.
it: Sono disponibili i pacchetti per Debian &amp; Ubuntu.
mg: Ny entana natao hoan 'i Debian &amp; Ubuntu dia efa azo alaina.
pt: Pacotes para Debian &amp; Ubuntu estão disponíveis.
sv_se: Packet för Debian &amp; Ubuntu finns.

source: Outside I2P
he: I2P חיצוני
it: Al di fuori di I2P
mg: Ivelan'i I2P

source: Inside I2P
he: I2P פנימי
it: All'interno di I2P
mg: Anatin'i I2P

source: The above file is the current release build. The latest dev build is version %(devbuild)s, and is available from <a href="%(str4durl)s">str4d's eepsite</a>.
it: Il file precedente rappresenta la versione attuale. La build di sviluppo più recente è la versione %(devbuild)s ed è disponibile sull'<a href="%(str4durl)s">eepsite di str4d</a>.
mg: Ireo fisy eo ambony ireo dia ny zava-bita farany. Ny zavabita-farany dia mitondra ny laharana faha %(devbuild)s, ary azo alaina ao amin'ny <a href="%(str4durl)s">str4d's eepsite</a>.
sv_se: Den ovanstående filen är den nuvarande releasen. Den senaste utvecklingsversionen %(devbuild)s, är tillgänglig från <a href="%(str4durl)s">str4d's eepsite</a>.

source: The I2P Android app is in development and does NOT currently provide strong anonymity.
he: אפליקצית I2P לאנדרואיד בשלבי פיתוח ואינה מספקת בשלב זה אנונימיות חזקה.
it: L'app di I2P per Android è in sviluppo e attualmente NON fornisce un robusto anonimato
mg: ny I2P hoan'ny Android dia mbola andalam-panamboarana, mbola tsy azo antoka ny fomba hanaovany fierena.

source: Requires Android 2.2 (Froyo) or higher.
it: È richiesto Android 2.2 (Froyo) o superiore.
mg: Android 2.2 (Froyro) na ambony no ilaina.

source: 512 MB RAM minimum; 1 GB recommended.
he: מינימום RAM 512 MB; מומלץ 1 GB.
id: 512 MB RAM minimal; 1 GB direkomendasikan.
it: 512 MB di RAM minimo; 1 GB raccomandato.
mg: 512 MB RAM farafahakeliny, 1GB no faniriana.
pt: mínimo 512 MB RAM; Recomendado 1 GB.

source: The release and dev versions of the I2P APK are not compatible, as they are signed by zzz and str4d respectively. Uninstall one before installing the other.
he: גרסאות השחרור והפיתוח של ה-APK של I2P אינן מתואמות, משום שהן חתומות על־ידי zzz ועל־ידי str4d בהתאמה. הסירו אחת שאתם מתקינים את השניה.
id: Versi rilis dan dev I2P APK tidak kompatibel kerena yang di-signed oleh zzz atau str4d. Hapus versi sebelumnya sebelum menginstal versi yang lain.
it: Le versioni per il pubblico e quelle di sviiluppo dell'APK di I2P non sono compatibili perché sono firmate rispettivamente da zzz e str4d. Disinstallane una prima di installare l'altra.
mg: Ny modely ny I2P miseho amin'ny hendrika APK dia tsy mety, ireo dia nosoniavin'i zzz sy str4d. Esory tanteraka alohan'ny hametrahana ny hafa.
pt: O lançamento e versões para desenvolvedores da APK do I2P não são compatíveis, já que são assinadas pelo zzz e str4d, respectivamente. Desinstale uma antes de instalar a outra.
sv_se: Releasen och utvecklings-versioner av I2P APK är inte kompatibla, eftersom dom är signerade av zzz och str4d respektive. Avinstallera en före du installerar den andra.

source: Source package
he: חבילת מקור
id: Paket source code
it: Pacchetto sorgente
mg: Entana am-potony
pt: Pacote originário
sv_se: Källkods-paket
