Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: When installing for the first time, please remember to <b>adjust your NAT/firewall</b> if you can, bearing in mind the Internet-facing ports I2P uses, <a href="%(faq)s#ports">described here</a> among other ports. If you have successfully opened your port to inbound TCP, also enable inbound TCP on the <a href="http://localhost:7657/confignet.jsp">configuration page</a>.
he: בעת ההתקנה בפעם הראשונה, אנא זכרו <b>להגדיר את ה־NAT/חומת האש</b> אם אתם יכולים. שימו לב לפתחות הפונות כלפי האינטרנט בהן I2P משתמשת ‏<a href="%(faq)s#ports">המתוארות כאן</a>. אם פתחתם בהצלחה את הפתחה לתקשורת TCP נכנסת, אפשרו תקשורת TCP נכנסת גם ב<a href="http://localhost:7657/confignet.jsp">עמוד הגדרות התצורה</a>.
id: Ketika meng-instalasi untuk pertama kalinya, harap ingat untuk <b>menyesuaikan NAT/firewall anda</b> jika anda dapat melakukannya, mengingat bahwa I2P menggunakan port yang digunakan untuk internet,<a href=\"%(faq)s#ports\">dijelaskan di sini</a> antara port lain. Jika anda telah berhasil membuka port anda untuk inbound TCP, juga nyalakan inbound TCP pada <a href=\"http://localhost:7657/confignet.jsp\">halaman konfigurasi</a>.
it: Quando lo installi per la prima volta, ricorda di <b>regolare il tuo NAT o firewall</b> se puoi, tenendo presente le porte usate da I2P per l'accesso a Internet, <a href="%(faq)s#ports">descritte qui</a> tra le altre porte. Se hai aperto correttamente la porta per il traffico TCP in entrata, attiva il traffico TCP in entrata anche nella <a href="http://localhost:7657/confignet.jsp">pagina di configurazione</a>.
mg: Rehefa mametraka eny ambohalohany , dia tadidio ny <b> manao fanamboarana ny NAT/rindrin'afo</b> raha hainao, sady jereo tsara ny port makany amin'ny internet izay ampiasain'i I2P, <a href="%(faq)s#ports">voalaza eto</a>. Raha tafasokatra ara-dalana ny ports izay mamela ny TCP mihiditra, dia velomy koa ny TCP mihiditra ao amin'ny <a href="http://localhost:7657/confignet.jsp">configuration page</a>.
pt: Ao instalar pela primeira vez, lembre-se de <b>ajustar seu NAT/firewall</b> Se puder, tendo em mente as portas que o I2P expõe à internet, <a href="%(faq)s#ports">descritas aqui</a> dentre outras portas. Se você conseguiu abrir sua porta para entrada de TCP, habilite também a entrada de TCP na <a href="http://localhost:7657/confignet.jsp">página de configuração</a>.
sv_se: När du installlerar för förtsa gången, var god kom ihåg att <b>justera din NAT/brandvägg</b> om du kan, kom ihåg att de internet nåbara portarna I2P använder, <a href="%(faq)s#ports">beskrivs här</a> bland andra portar. Om du har lyckats öppna din på för inåtgående TCP, slä även på TCP på <a href="http://localhost:7657/confignet.jsp">instälningssidan</a>.

source: Also, please review and <b>adjust the bandwidth settings</b> on the <a href="http://localhost:7657/config.jsp">configuration page</a>, as the default settings of 96 KBps down / 40 KBps up are fairly slow.
he: כמו כן, אנא בדקו את <b>הגדרות רוחב הפס</b> ב<a href="http://localhost:7657/config.jsp">עמוד הגדרות התצורה</a>, שכן הגדרות ברירת המחדל של 96 ק"ב/שניה בהורדה ו־40 ק"ב/שניה בהעלאה הן די איטיות.
id: Juga, harap meninjau dan <b>menyesuaikan pengaturan bandwidth</b> pada <a href=\"http://localhost:7657/config.jsp\">halaman konfigurasi</a>, karena kecepatan default 96 KBps unduh / 40 KBps unggah masih cukup lambat.
it: Inoltre, esamina e <b>modifica le impostazioni della larghezza di banda</b> nella <a href="http://localhost:7657/config.jsp">pagina di configurazione</a>, perché le impostazioni predefinitie di of 96 KBps per il download e 40 KBps per l'upload sono abbastanza lente.
mg: Jereo indray mandeha sady <b>adjust the bandwidth settings</b> eo amin'ny <a href="http://localhost:7657/config.jsp">configuration page</a>, satria somary maivana ny of 96 KBps down / 40 KBps up , izay efa eo.
pt: Além disso, reveja e <b>ajuste as configurações de largura de banda</b> na <a href="http://localhost:7657/config.jsp">página de configuração</a>, já que as configurações padrão de 96 KBps para download / 40 KBps para upload são bem lentas.
sv_se: Var också god att läs kika på och <b>justera bandbreddinställningarna</b> på <a href="http://localhost:7657/config.jsp">inställningssidan</a>, eftersom standardinställningartna 96/40 KB/s upp/ner är tämligen långsamma.

source: Downloading...
he: מוריד...
id: Mengunduh...
it: Scaricamento in corso...
mg: Mampihidina...
pt: A transferir...

source: Your download will begin shortly. If it doesn't start within 5 seconds, click <a href="%(url)s">here</a>.
he: ההורדה תתחיל תוך זמן קצר. אם היא לא מתחילה תוך 5 שניות, לחצו <a href="%(url)s">כאן</a>.
id: Unduhan anda akan dimulai segera. Jika unduhan tidak dimulai dalam 5 detik, klik <a href=\"%(url)s\">di sini</a>.
it: Lo scaricamento comincerà tra poco. Se non inizia entro 5 secondi, clicca <a href="%(url)s">qui</a>.
mg: Hanomboka ny fampidinanao, raha tsy mandeha ao anatin'ny 5 segondra dia tsindrio ny <a href="%(url)s">Eto</a>.

source: Mirror selection
he: בחירת מראה
id: Pilihan Mirror
it: Selezione mirror
mg: Ffifidianana Kaopia
pt: Seleção do espelho
sv_se: Spegelval

source: File:
he: קובץ:
mg: Fisy:
pt: Ficheiro:
sv_se: Fil:

source: Any mirror
he: כל מראה
id: Miror mana saja
it: Qualsiasi mirror
mg: Kaopia Karazany
pt: Qualquer espelho
sv_se: Vilken spegel som helst

source: To claim the bounty the author must not be paid by other organizations or teams for this work (e.g. GSoC students are not valid).
he: על־מנת לדרוש את המענק, אסור שהיוצר יקבל תשלום מארגונים או צוותים אחרים על אותה העבודה (לדוגמה סטודנטים המשתתפים ב־GSoC לא יתקבלו).
id: Untuk mengklaim hadiah, penulis harus tidak dibayar oleh organisasi lain atau tim yang melakukan pekerjaan ini (misalnya siswa GSoC tidak valid).
it: Per ritirare i premi, l'autore non deve essere pagato da altre organizzazioni o team per il lavoro svolto (per esempio, non sono valide le domande degli studenti del Google Summer of Code).
mg: Raha angataka hasin'tanana dia tsy tokony handray vola avy amin'ny orinasa na vondron'olona momba ity asa ity (ohatra. ny mpianatra GSOC dia tsy manan-kery).
pt: Para pedir a recompensa o autor não pode ser pago por outras organizações ou equipes por este trabalho (ex.: estudantes do GSoC não são válidos).
sv_se: För att göra anspråk på belöningen måste författaren inte vara betald av andra organisationer eller team för dethär arbetet (t.ex. GSoC students are not valid).

source: Bounty amounts may be increased by further donations. Do you think these are important? <a href="%(donate)s">Add in your donation</a>, marking the amount for the %(donatename)s bounty!
id: Jumlah hadiah dapat ditingkatkan oleh sumbangan lebih lanjut. Apakah anda pikir ini penting? <a href=\"%(donate)s\">Tambahkan di donasi</a>, menandai jumlah hadiah s%(donatename)s!
it: L'ammontare dei premi può essere aumentato da ulteriori donazioni. Credi siano importanti? <a href="%(donate)s">Aggiungi la tua</a>, evidenziando il valore della %(donatename)s sovvenzione!
mg: Ny hasin'tanana dia azo ampiakarina amin'ny alalan'ny fanomezana ataon'ny olona. Everinao fa misy dikany ve izany? <a href="%(donate)s">Ampio ato ny fanomezanao</a>, soraty ny vola hoan'ny hasin'tanan'i %(donatename)s !
pt: O valor dos prêmios pode ser aumentado por mais doações. Acreditas que esses são importantes? <a href="%(donate)s">Inclua sua doação</a>, marcando o valor para o prêmio do %(donatename)s!
sv_se: Belöningssummor kan ökas genom vidare donationer. Tycker du att dom är viktiga? <a href="%(donate)s">Lägg till din donation</a>, markera summan för %(donatename)s belöning!

source: Not found
he: לא נמצא
id: Tidak ditemukan
it: Non trovato
mg: Tsy hita
pt: Não encontrado
sv_se: Hittades inte

source: Yep... the resource, you were searching for, is named differently, doesn't exist or was removed.
he: כן ... המשאב, אותו חיפשת, קיים בשם שונה, לא קיים או הוסר.
id: Betul... sumber daya yang sedang anda cari dinamai berbeda, tidak ada, atau dihapus.
it: Già... la risorsa che stavi cercando ha un nome diverso, non esiste oppure è stata rimossa.
mg: Eny... Ny loaharanon'entana , izay tadiavinao, dia misoratra amin'ny anarana hafa, tsy misy na noesorina.
pt: Sim... o recurso que está à procura tem outro nome, não existe ou foi removido.
sv_se: Yep.. resursen du letade efter, herter något annat, finnes inte eller har tagits bort.

source: Server error
he: שגיאת שרת
it: Errore del server
mg: Olana ao amin'y serveur
pt: Erro do servidor
sv_se: Serverfel

source: 500 Server error
he: 500 שגיאת שרת
it: Errore del server 500
mg: olana 500 ao amin'ny serveur
pt: 500 - Erro do servidor
sv_se: 500 Serverfel

source: Umm... the server encountered some sort of error.
he: אמממ... השרת נתקל בבעיה כלשהי.
id: Eh... server mengalami sebuah error.
it: Uhm... si è verificato un qualche tipo di errore nel server.
mg: Hmmm .. nisy olana kely ny serveur
pt: Hum... o servidor encontrou um tipo de erro.
sv_se: Ehmm.. servern träffade på någon sorts problem.

source: Mirrors
he: אתרי מראה
it: Mirror
mg: Kaopia
sv_se: Speglar

source: Secure
he: מאובטח
it: Sicuro
mg: Voa-aro
sv_se: Säkert

source: Misc.
he: שונות
it: Varie
mg: Samihafa.
sv_se: Blandat

source: Links
he: קישורים
id: Link
it: Collegamenti
mg: Fifandraisana hafa
pt: Hiperligações
sv_se: Länkar

source: Impressum
he: יצירת קשר
mg: Fandinihinao ny zavava-bita

source: Europe
he: אירופה
it: Europa
mg: Eoropa
sv_se: Europa

source: USA
he: ארה"ב
it: Stati Uniti
mg: Etazonia

source: Donate
he: תרומה
id: Donasi
it: Dona
mg: Fanomezana
pt: Doar
sv_se: Donera

source: Skip navigation
he: דלג על ניווט
id: Lewati navigasi
it: Salta navigazione
mg: Dingana
pt: Ignorar navegação
sv_se: Hoppa över navigation

source: I2P Logo
he: הסמליל של I2P
id: Logo I2P
it: Logo I2P
mg: Logo I2P
pt: Logótipo do I2P

source: The Invisible Internet Project
he: פרויקט האינטרנט הבלתי נראה
it: Il progetto Internet invisibile
mg: Tetik 'asa momba ny Tranonkala Miafina
pt: O Projeto da Internet Invisível

source: This page was last updated in %(lastupdated)s and is accurate for router version %(accuratefor)s.
he: עמוד זה עודכן לאחרונה ב־%(lastupdated)s והוא מדויק עבור גרסת הנתב %(accuratefor)s.
id: Halaman ini terakhir diperbarui pada s%(lastupdated)s dan akurat untuk router versi %(accuratefor)s.
it: L'aggiornamento più recente di questa pagina risale a %(lastupdated)s e si riferisce alla versione del router %(accuratefor)s.
mg: Ity pejy ity dia navaozina tamin'ny %(lastupdated)s ary mifanaraka amin'ny router modely %(accuratefor)s.
pt: A última atualização desta página foi em %(lastupdated)s, e é a exata para a versão do roteador %(accuratefor)s.
sv_se: Denhär sidan uppdaterades senast %(lastupdated)s och är korrekt för routerversionen %(accuratefor)s.

source: This page was last updated in %(lastupdated)s.
he: עמוד זה עודכן לאחרונה ב־%(lastupdated)s.
id: Halaman ini terakhir diperbarui pada s%(lastupdated)s.
it: L'aggiornamento più recente di questa pagina risale a %(lastupdated)s.
mg: Ity pejy ity dia navaozina tamin'ny %(lastupdated)s.
pt: A última atualização desta página foi em %(lastupdated)s.
sv_se: Denhär sidan uppdaterades senast %(lastupdated)s.

source: This page is accurate for router version %(accuratefor)s.
he: עמוד זה מדויק עבור גרסת הנתב %(accuratefor)s.
id: Halaman ini akurat untuk router versi %(accuratefor)s.
it: Questa pagina si riferisce alla versione del router %(accuratefor)s.
mg: Ity pejy ity dia mifanaraka amin'ny router modely %(accuratefor)s.
pt: Esta página é a exata para a versão do roteador %(accuratefor)s.
sv_se: Denhär sidan är korrekt för routerversion %(accuratefor)s.

source: Previous
he: הקודם
id: Sebelumnya
it: Precedente
mg: Teo Aloha
pt: Anterior
sv_se: Föregående

source: Next
he: הבא
id: Berikutnya
it: Successivo
mg: Pejy Manaraka
pt: Seguinte
sv_se: Nästa

source: Posted in
he: פורסם ב
id: Diposting di
it: Pubblicato in
mg: Nosoratana tao amin'ny
pt: Publicado em
sv_se: Skriven i

source: About
he: אודות
id: Tentang
it: Informazioni su
mg: Momba
pt: Sobre
sv_se: Om

source: Introduction to I2P
he: מבוא ל־I2P
id: Pengantar I2P
it: Introduzione a I2P
mg: Teny fampidirana momban'i I2P
pt: Introdução ao I2P
sv_se: Introduktion till I2P

source: Comparisons
he: השוואות
id: Perbandingan
it: Confronti
mg: Fampitahana
pt: Comparações
sv_se: Jämförelser

source: Overview of comparisons
he: תמצית ההשוואות
id: Ikhtisar dari perbandingan
it: Riepilogo dei confronti
mg: Fampitahana amin'ny ankapobeny
pt: Resumo de comparações
sv_se: Överblick av jämförelser

source: Other anonymous networks
he: רשתות אנונימיות אחרות
id: Jaringan anonim lain
it: Altre reti anonime
mg: Ireo tambazotra miafina samihafa
pt: Outras redes anónimas
sv_se: Andra anonyma nätverk

source: Documentation
he: תיעוד
id: Dokumentasi
it: Documentazione
mg: Kirakira
pt: Documentação
sv_se: Dokumentation

source: Documentation index
he: אינדקס תיעוד
id: Indeks dokumentasi
it: Indice della documentazione
mg: Fitsinjarana ny Kirakira
pt: Índex da Documentação
sv_se: Dokumentationsindex

source: How does it work?
he: איך זה עובד?
id: Bagaiman cara kerjanya?
it: Come funziona?
mg: Ahoana ny fiasany?
pt: Como é que funciona?
sv_se: Hur fungerar det?

source: Gentle intro
he: מבוא עדין
id: Intro mudah
it: Introduzione leggera
mg: Teny fampidirana tsotra
pt: Introdução Simples
sv_se: Försiktig intro

source: Tech intro
he: מבוא טכני
id: Intro teknis
it: Introduzione tecnica
mg: Teny fampidirana ara teknika
pt: Introdução Técnica

source: Threat model
he: מודל איום
it: Modello di rischio
mg: Karazana Loza
pt: Modelo da ameaça
sv_se: Hotmodell

source: Garlic routing
he: ניתוב שום (Garlic routing)
it: Routing garlic
mg: Tongolo Routing
pt: Encaminhamento de alho

source: Network database
he: מסד נתוני רשת
id: Database jaringan
it: Database di rete
mg: Fanangonana momba ny tambazotra
pt: Base de dados da rede
sv_se: Nätverksdatabas

source: Tunnel routing
he: ניתוב מסלולים
it: Routing tunnel
mg: Fantsona Routing
pt: Encaminhamento de Túnel
sv_se: Tunnelrouter

source: Peer selection
he: Выбор пира
id: Pemilihan Peer
it: Selezione peer
mg: Fifidianana Akama
pt: Seleção de ponto
sv_se: Peerval

source: Cryptography
he: בחירת עמיתים
id: Kriptografi
it: Cifratura
mg: Fanafenana
pt: Criptografia
sv_se: Kryptografi

source: Specifications
he: ספציפיקציות
id: Spesifikasi
it: Specifiche
mg: Filazalazana
pt: Especificações
sv_se: Specifikationer

source: Blockfile
it: File di blocco
mg: Vonga-pisy
sv_se: Blockfil

source: Common structures
he: מבנים שכיחים
it: Strutture comuni
mg: Fehiny iraisana
sv_se: Vanliga strukturer

source: Configuration files
he: קובצי הגדרות תצורה
it: File di configurazione
mg: Fisy fanamboarana
sv_se: Konfigurationsfiler

source: GeoIP files
he: קובצי GeoIP
it: File GeoIP
mg: Fisy GeoIP
sv_se: GeoIP filer

source: Plugins
he: תוספים
id: Plugin
it: Plugin
mg: Tovana
sv_se: Plugin:er

source: Streaming library
he: ספריית הזרמה
it: Libreria di streaming
mg: Tahiry fampielezana
pt: Biblioteca de transmissão
sv_se: Strömmande bibliotek

source: Tunnel creation
he: יצירת מסלולים
it: Creazione tunnel
mg: Fanamboarana fantsona
sv_se: Tunnelskapelse

source: Tunnel messages
he: הודעות מסלול
it: Messaggi tunnel
mg: Filazana momba ny fantsona
sv_se: Tunnelmeddelanden

source: Software updates
he: עדכוני תוכנה
it: Aggiornamenti software
mg: Fanavaozana ny Fampiarana
sv_se: Mjukvaru-uppdatering

source: Applications
he: יישומים
id: Aplikasi
it: Applicazioni
mg: Fampiarana
pt: Aplicações
sv_se: Applikationer

source: Supported applications
he: יישומים נתמכים
id: Aplikasi yang didukung
it: Applicazioni supportate
mg: Fampiarana azo ampiasaina
pt: Aplicações suportadas
sv_se: Stödda applikationer

source: Transports
he: פרוטוקולי תעבורה
id: Transport
it: Trasporti
mg: Fampitana
pt: Transportes
sv_se: Transporter

source: Transport layer overview
he: סקירת שכבת התעבורה
id: Ikhtisar tentang transport layer
it: Informazioni generali sul livello di trasporto
mg: Fampitana amin'ny antsipiriany
pt: Resumo da camada de transporte
sv_se: Transport-nivå överblick

source: Tunnels
he: מסלולים
id: Saluran
it: Tunnel
mg: Fantsona
pt: Túneis
sv_se: Tunnlar

source: Tunnel implementation
he: מימוש המסלולים
id: Implementasi tunnel
it: Implementazione tunnel
mg: Fampiarana ny fantsona
pt: Implementação de túnel

source: Unidirectional tunnels
he: מסלולים חד־כיווניים
id: Saluran searah
it: Tunnel unidirezionali
mg: Fantsona lalan'tokana
pt: Túneis unidirecionais
sv_se: Enkelriktade tunnlar

source: Old implementation
he: המימוש הישן
id: Implementasi lama
it: Implementazione precedente
mg: Fomba fiasa taloha
pt: Implementação antiga
sv_se: Gammal implemenation

source: Naming and addressbook
he: נתינת שמות וספר הכתובות
id: Penamaan dan addressbook
it: Nominativi e rubrica
mg: Fanomezana anarana sy bokin'adiresy
pt: Livro de endereços e nomes
sv_se: Namn och adressbok

source: Team
he: צוות
id: Tim
it: Squara
mg: Ny ekipa
pt: Equipa
sv_se: Utvecklargrupp

source: Hall of Fame
he: היכל התהילה
it: Galleria dei migliori
mg: Rindrina fankasitrahana
pt: Sala da Fama

source: Academic papers and peer review
he: מסמכים אקדמיים וביקורת עמיתים
id: Makalah akademik dan peer review
it: Saggi accademici e recensioni dei peer
mg: Fijerin'ny akademia sy ny akama
pt: Papéis académicos e revisão de ponto
sv_se: Akademiska artiklar och sakutlåtande

source: Presentations, tutorials and articles
he: מצגות, מדריכים וכתבות
id: Presentasi, tutorial, dan artikel
it: Presentazioni, tutorial e articoli
mg: Fampisehoana, fampianarana sy hain'tsoratra
pt: Apresentações, tutoriais e artigos
sv_se: Presentationer, guider och artiklar

source: Contact us
he: צרו קשר
id: Hubungi kami
it: Contattaci
mg: Manorata aty aminay
pt: Contacte-nos
sv_se: Kontakta oss

source: Help
he: עזרה
id: Bantuan
it: Aiuto
mg: Vonjy
pt: Ajuda
sv_se: Hjälp

source: FAQ
he: שאלות נפוצות
mg: Fanontaniana Maro Samihafa
pt: FAQs

source: How to browse I2P
he: כיצד לגלוש ב־I2P
id: Cara browsing I2P
it: Come sfogliare I2P
mg: Ahoana ny fomba fikirakirana ny I2P
pt: Como explorar o I2P
sv_se: Hur du surfar på I2P

source: Glossary
he: מילון מונחים
id: Glosarium
it: Glossario
mg: Fanatontoloana
pt: Glossário
sv_se: Ordlista

source: Performance
he: ביצועים
id: Kinerja
it: Prestazioni
mg: Tanjany
pt: Desempenho
sv_se: Prestanda

source: Forums
he: פורומים
id: Forum
it: Forum
mg: Toerana fifaneraserana
pt: Fóruns
sv_se: Forum

source: Volunteer
he: מעורבות
id: Relawan
it: Volontario
mg: Filatsahana an-tsitrapo
pt: Voluntário
sv_se: Volontera

source: Get involved!
he: קחו חלק!
id: Ikut serta!
it: Partecipa anche tu!
mg: Mandrosoa Ampio izahay!
pt: Participe!
sv_se: Medverka!

source: Develop
he: פיתוח
id: Mengembangkan
it: Sviluppo
mg: Fanamboarana
pt: Desenvolver
sv_se: Utveckla

source: Licenses
he: תנאי שימוש
id: Lisensi
it: Licenze
mg: Lisansy
pt: Licenças
sv_se: Licenser

source: Release signing keys
he: מפתחות חתימת שחרורים
id: Signing key dari rilis
it: Chiavi di firma per il pubblico
mg: Fanomezana fanalahidy sonia
pt: Lançar chaves de assinatura
sv_se: Release signeringsnycklar

source: Signed keys
he: מפתחות חתומים
id: Signed key
it: Chiavi firmate
mg: Fanalahidy voasonia
pt: Chaves assinadas
sv_se: Signerade nycklar

source: Developers keys
he: מפתחות המפתחים
id: Developer key
it: Chiavi per gli sviluppatori
mg: Fanalahidin'ny Mpanantontosa
pt: Chaves de programadores
sv_se: Utvecklares nycklar

source: Bug tracker
he: מערכת ניהול תקלות
it: Tracker dei bug
mg: Fanarahana ny tsy mety
pt: Rastreador de Erros
sv_se: Bugg-tracker

source: Academic research
he: מחקר אקדמי
id: Penelitian akademik
it: Ricerca accademica
mg: Fikaroana ara-akademika
pt: Pesquisa Académica
sv_se: Akademisk forskning

source: Open research questions
he: שאלות מחקר פתוחות
id: Pertanyaan penelitian terbuka
it: Domande di ricerca aperte
mg: Fanontaniana samihafa momba ny fikaroana
pt: Abrir perguntas de pesquisa

source: Guides
he: מדריכים
id: Panduan
it: Guide
mg: Fanoroan'dalana
pt: Guias
sv_se: Guider

source: New developers
he: מפתחים חדשים
id: Pengembang baru
it: Nuovi sviluppatori
mg: Mpamorona Vaovao
pt: Novos programadores
sv_se: Nya utvecklare

source: Using an IDE with I2P
he: שימוש בסביבת פיתוח מובנית (IDE) עם I2P
id: Menggunakan IDE dengan I2P
it: Utilizzo di IDE con I2P
mg: Fampiasana IDE avy amin'ny alalan'i I2P
pt: Utilizando um IDE com o I2P
sv_se: Använda en IDE med I2P

source: Developer guidelines and coding style
he: מדריכים למפתחים וסגנון קוד
id: Panduan pengembang dan coding style
it: Linee guida di sviluppo e stile di programmazione
mg: Fanoroan'dalana hoan'ny mpamorona sy fomba fanaovana codes
pt: Diretrizes de desenvolvimento e estilo de codificação
sv_se: Utvecklar-riktlinjer och kodstil

source: New translators
he: מתרגמים חדשים
id: Penerjemah baru
it: Nuovi traduttori
mg: Mpandika teny Vaovao
pt: Novos tradutores
sv_se: Nya översättare

source: Bounties
he: מענקים
id: Hadiah
it: Premi
mg: Hasin'tanana
pt: Generosidades
sv_se: Belöningar

source: Meetings
he: פגישות
id: Pertemuan
it: Riunioni
mg: Fivoariana
pt: Reuniões
sv_se: Möten

source: Roadmap
he: מפת דרכים
mg: Lalana mbola ho aleha
pt: Mapa de Desenvolvimento
sv_se: Utvecklingsplan

source: Task list
he: רשימת מטלות
id: Daftar tugas
it: Attività
mg: Asa ho atao
pt: Lista de Tarefas
sv_se: Uppdragslista

source: Language
he: שפה
id: Bahasa
it: Lingua
mg: Fiteny
pt: Idioma
sv_se: Språk

source: Logs of past I2P meetings
he: יומנים של ישיבות I2P קודמות
id: Log pertemuan-pertemuan I2P terdahulu
it: Log delle riunioni I2P precedenti
mg: Tahiry rehetra momban'ny fivoriana hoan'ny I2P
pt: Registos das reuniões anteriores do I2P
sv_se: Loggar av tidigare I2P möten

source: I2P Meetings ATOM Feed
he: זרם Atom של ישיבות I2P
id: Pertemuan I2p ATOM Feed
it: Feed ATOM riunioni I2P
mg: Fivoriana I2P famahanana amin'ny alalan'ny ATOM
pt: Feed ATOM das Reuniões do I2P
sv_se: I2P Mötes ATOM flöde

source: We do not currently have regularly scheduled meetings. Anyone can schedule and run a meeting, by posting the agenda in <a href="%(mtgforum)s">the meetings forum</a>.
he: כרגע הישיבות שלנו אינן מתקיימות במועדים קבועים. כל אחד יכול לקבוע ולהריץ ישיבה, על־ידי פרסום האג'נדה ב<a href="%(mtgforum)s">פורום הישיבות</a>.
it: Attualmente, non abbiamo pianificato incontri periodici. Chiunque può pianificare e gestiew una riunione, lasciando un messaggio nell'agenda sul <a href="%(mtgforum)s">forum delle riunioni</a>.
mg: Tsy manana fivoriana aram-potoana na efa voalamina isika. Afaka mandamina izany na iza na iza ary miantso fivoriana amin'ny fanoratana eo amin'ny agenda in <a href="%(mtgforum)s">the meetings forum</a>.

source: If you have something to discuss, please find the developers on IRC in #i2p-dev. <a href="%(blogindex)s">Status updates</a> from developers are also available.
he: אם יש לכם משהו לדון עליו, אנא מצאו את המפתחים ב־IRC בערוץ ‎#i2p-dev. ‏ישנם גם <a href="%(blogindex)s">עדכוני מצב</a> מהמפתחים.
id: Jika anda memiliki sesuatu untuk mendiskusikan, silakan temui para pengembang di IRC di #i2p-dev. <a href=\"%(blogindex)s\">Status update</a> dari pengembang juga tersedia.
it: Se hai qulcosa da discutere, cerca gli sviluppatori su IRC nel canale #i2p-dev. Sono disponibili anche gli <a href="%(blogindex)s">Aggiornamenti di stato</a> degli sviluppatori.
mg: Raha manana zavatra tiana ho resahina ianao dia , jereo ato ny mpanamboatra an'i I2P IRC in #i2p-dev. <a href="%(blogindex)s">Status updates</a> dia azo alaina avy amin'ny mpanamboatra koa.
pt: Se tem algo para discutir, por favor, encontre os programadores no IRC em #i2p-dev. <a href="%(blogindex)s">estado das atualizações</a> dos programadores que também estão disponíveis.
sv_se: Om du har något att diskutera, hitta utvecklarna på IRC i rummt #i2p-dev. <a href="%(blogindex)s">Status-uppdateringar</a> från utvecklar är också tillgängliga.
