Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: I2P Development Meeting %(id)s
he: ישיבת פיתוח של I2P מס' %(id)s
id: Pertemuan Pengembangan i2p %(id)s
it: Riunione di sviluppo I2P %(id)s
mg: Fivoriana %(id)s momba ny fanamboarana ny I2P
pt: Reunião de Desenvolvimento do I2P %(id)s
sv_se: I2P Utvecklarmöten %(id)s

source: Full IRC Log
he: יומן IRC מלא
id: Log IRC yang lengkap
it: Log IRC completo
mg: Filazalazana feno momban'ny IRC
pt: Registo Completo do IRC
sv_se: Full IRC Logg

source: By topic
he: לפי נושא
id: Berdasarkan topik
it: Per argomento
mg: Ara tsokajy
pt: Por tópico
sv_se: Efter ämne

source: By date
he: לפי תאריך
id: Berdasarkan tanggal
it: Per data
mg: Araka ny Daty
pt: Por data
sv_se: Efter datum

source: By author
he: לפי יוצר
id: Berdasarkan penulis
it: Per autore
mg: Araky ny mpanoratra
pt: Por autor
sv_se: Efter författare

source: Please send new or corrected entries to <a name="contact"><span class="email">%(email)s</span></a>.<br /> If you can, please format them as BibTeX; see our <a href="%(bibtex)s">BibTeX source page</a> for examples.<br /> Remember to include URLs if possible: <a href="%(citeseer)s">offline papers are less useful</a>.
he: נא שלחו רשומות חדשות או מתוקנות לכתובת <a name="contact"><span class="email">%(email)s</span></a>.<br /> אם אתם יכולים, נא סדרו אותן כ־BibTex; ראו את ‏<a href="%(bibtex)s">עמוד המקור של BibTex</a> לדוגמאות.<br /> זכרו לכלול כתובות רשת אם הדבר אפשרי: ‏<a href="%(citeseer)s">מסמכים לא־מקוונים הם פחות שימושיים</a>.
id: Silakan kirim entri baru atau koreksi kepada <a name=\"contact\"><span class=\"email\">%(email)s</span></a>.<br>Jika anda bisa, silahkan gunakan format BibTeX; Lihat <a href=\"%(bibtex)s\">halaman sumber BibTeX</a> untuk contoh.<br>Jangan lupa untuk menyertakan URL jika memungkinkan: <a href=\"%(citeseer)s\">makalah offline kurang berguna</a>.
it: Invia voci nuove o corrette a <a name="contact"><span class="email">%(email)s</span></a>.<br /> Se puoi, formattale come BibTeX; consulta la nostra <a href="%(bibtex)s">pagina di risorse BibTeX</a> con qualche esempio.<br /> Ricorda di includere gli URL se possibile: <a href="%(citeseer)s">i documenti offline sono meno utili</a>.
mg: Azafady, ny zavatra voahitsy na vaovao alefaso ato amin'i <a name="contact"><span class="email">%(email)s</span></a>.<br /> raha azonao atao, ataovy format BibTeX; jereo ny <a href="%(bibtex)s">BibTeX source page</a> for examples.<br /> Asio URLs mpampifandray raha azo atao: <a href="%(citeseer)s">Ny tena taratasy tsy dia mety ho ampiasaina tsinona</a>.
pt: Por favor, envie novas entradas ou corrigidas para <a name="contact"><span class="email">%(email)s</span></a>.<br /> Se possível, por favor, formate-as como BibTeX; consulte a nossa <a href="%(bibtex)s">página de código fonte BibTeX</a> para exemplos.<br /> Lembre-se de incluir os URLs, se possível: <a href="%(citeseer)s">papéis off-line são menos úteis</a>.
sv_se: Var god att skicka en nya eller korrigerat innehåll till <a name="contact"><span class="email">%(email)s</span></a>.<br /> Om du kan, var god formatera dom som BibTex, se vår <a href="%(bibtex)s">BibTeX källkod</a> till exempel.<br /> Kom ihåg att inkludera URL:er om möjligt: <a href="%(citeseer)s">offline-artiklar är mindre användbara</a>.

source: The source code for this page was adapted from <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.
he: קוד המקור של עמוד זה הותאם מ<a href="%(anonbib)s">הביבליוגרפיה של Free Haven על אנונימיות</a>.
id: Source code untuk halaman ini diadaptasi dari <a href=\"%(anonbib)s\">Free Haven's anonymity bibliography</a>.
it: Il codice sorgente di questa pagina è stato adattato dalla <a href="%(anonbib)s">bibliografia sull'anonimato di Free Haven</a>.
mg: Ny fototry ny kaody eto amin'ity pejy ity dia mifanarakara amin'ny <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.

source: Contact
he: יצירת קשר
id: Kontak kami
it: Contatto
mg: Fifandraisana
pt: Contacto
sv_se: Kontakt

source: Email
he: דוא"ל
mg: Mailaka

source: Our primary IRC network is the Irc2P network within I2P; a default tunnel to this network is set up with new router installs. We are also present on multiple standard networks like <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> and <a href="http://freenode.net/">Freenode</a>. All I2P-related channels on all these network are linked to the main channels on Irc2P via relay bots.
he: רשת ה־IRC הראשית שלנו היא רשת ה־Irc2P שבתוך I2P; מסלול ברירת מחדל לרשת זו מותקן בעת התקנת הנתב. אנחנו נמצאים גם ברשתות סטנדרטיות אחדות כמו <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, ‏<a href="http://www.einirc.de/">EIN</a> ו־<a href="http://freenode.net/">Freenode</a>. כל הערוצים הקשורים ל־I2P ברשתות אלה מקושרים לערוצים הראשיים ב־Irc2P דרך רובוטי ממסור.
id: Jaringan IRC utama kami adalah jaringan Irc2P di dalam I2P; sebuah tunnel default ke jaringan ini diatur dengan menginstall router baru. Kami juga hadir pada beberapa standar jaringan seperti <a href=\"http://www.oftc.net/oftc/OFTC\">OFTC</a>, <a href=\"http://www.einirc.de/\">EIN</a> dan <a href=\"http://freenode.net/\">Freenode</a>. Semua saluran terkait I2P pada semua jaringan terhubung ke saluran utama pada Irc2P melalui bot relay.
it: Le nostre reti IRC principali sono la rete Irc2 presente all'interno di I2P; un tunnel predefinito a questa rete viene impostato al momento dell'installazoine di un nuovo router. Siamo anche prsenti su molteplici reti standard come <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> e <a href="http://freenode.net/">Freenode</a>. Tutti i canali relativi a I2P su tutte queste reti sono collegati ai canali principali su Irc2P tramite dei bot di ripetizione.
mg: Ny tambazotranay IRC voalahoany dia ny tambazotra Irc2P ao anaty I2P, ny fantsona nampiasaina dia ny fantsona izay hita raha vaomanao fametrahana router vaovao. Izahay dia hita koa any amin'ny tambazotra hitovizana toy ny <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> and <a href="http://freenode.net/">Freenode</a>. Ny sampana rehetra I2P ao amin'ny tambazotra dia mifandray amin'ny Irc2P amin'ny alalan'ny mpampitohy bots.
pt: A nossa rede de IRC primária é a rede Irc2P dentro do I2P; um túnel predefinido para esta rede está configurado com as novas instalações do roteador. Nós também estamos presentes em múltiplas redes padrão, tal como <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> e <a href="http://freenode.net/">Freenode</a>. Todos os canais relacionados com o I2P em todas essas redes estão interligados aos principais canais de Irc2P via bots de retransmissão.
sv_se: Vårt primära IRC-nätverk är Irc2P nätverket inom I2P, en standardtunnel för dethär nätverket är konfigurerat på nya I2P installationer. Vi är och närvarande på flera vanliga IRC-nätverk som <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>,⏎ <a href="http://www.einirc.de/">EIN</a> och <a href="http://freenode.net/">Freenode</a>. Alla I2P-relaterade kanaler på dessa nätverk är länkade till huvudkanalen på Irc2P via relay bottar.

source: Channel list:
he: רשימת ערוצים:
id: Daftar channel
it: Elenco canali:
mg: Lisitry ny Toerana firesahana:
pt: Lista de canais:
sv_se: Kanal-lista

source: General i2p discussion and help channel
he: דיון i2p כללי וערוץ עזרה
it: Discussioni generali su I2P e canale di aiuto
mg: Resaka momban'i i2P amin'ny ankapobeny sy fifanampiana
pt: Discussão geral do I2P e canal de ajuda

source: Offtopic
he: מחוץ לנושא
mg: Tsy misy ifandraisany
sv_se: Utanför samtalsämnde

source: Development talk
he: דיון פיתוח
it: Conferenza di sviluppo
mg: Resaka momba ny fampiarana
pt: Conversa sobre o desenvolvimento
sv_se: Utvecklingsprat

source: Most of the discussion about I2P's development happens on the <a href="http://%(zzz)s">I2P developer forum</a>. This is usually the best place to start with inquiries, if the dev IRC channel is inactive.
he: רוב הדיונים על הפיתוח של I2P מתרחשים ב<a href="http://%(zzz)s">פורום המפתחים של I2P</a>. זהו בדרך כלל המקום הכי טוב להתחיל לשאול בו, אם ערוץ הפיתוח ב־IRC אינו פעיל.
id: Sebagian besar diskusi tentang pengembangan I2P diadakan di<a href=\"http://%(zzz)s\">I2P developer forum</a>. Ini biasanya tempat terbaik untuk memulai pertanyaan jika saluran IRC dev tidak aktif.
it: La maggior parte delle discussioni sullo sviluppo di I2P ha luogo sul <a href="http://%(zzz)s">forum degli sviluppatori I2P</a>. Questo è solitamente il miglior luogo dove cominciare a fare domande, se il canale IRC degli sviluppatori non è attivo.
mg: Ny ankamaroan'ny resaka momba ny fanamboarana ny I2P dia hita ao amin'ny <a href="http://%(zzz)s">I2P developer forum</a>. Ao no toerana tsara indrindra raha hametraka fanontaniana, raha tsy mandeha ny sampana dev IRC.
pt: A maior parte da discussão sobre o desenvolvimento do I2P ocorre no <a href="http://%(zzz)s">Fórum de desenvolvimento do I2P</a>. Este é normalmente o melhor lugar para começar com consultas, se o canal IRC dos desenvolvedores estiver inativo.
sv_se: De flesta av discussionerna om I2P's utveckling händer på <a href="http://%(zzz)s">I2Ps utvecklarforum</a>. Detta är ofta det bästa stället att fråga om #i2p-dev kanalen är inaktiv.

source: Mailing lists
he: רשימות תפוצה
id: Milis
it: Liste di distribuzione
mg: Lisitra na mailaka
pt: Listas de Discussão
sv_se: E-post-lista

source: I2P does have a mailing list, but it is rarely used as the current small team of developers prefer to communicate via IRC or the developer forum. This may change in future.
he: ל־I2P יש רשימת תפוצה, אבל היא בשימוש מועט מאוד מאחר וצוות המפתחים הקטן מעדיף לתקשר דרך IRC או בפורום המפתחים. זה עשוי להשתנות בעתיד.
id: I2p memiliki milis, tetapi jarang digunakan karena saat ini tim pengembang lebih memilih untuk berkomunikasi melalui IRC atau developer forum. Hal ini dapat berubah di masa depan.
it: I2P dispone di una lista di distribuzione, ma viene raramente usata perché il team di sviluppo attuale è relativamente piccolo e preferisce comunicare tramite IRC o sul forum. Questa situazione potrebbe cambiare in futuro.
mg: I2P dia manana lisitra mailaka, fa tsy dia ampiasaina loatra satria ny andian'ny mpanamboatra dia mankafy kokoa ny miresaka amin'ny IRC na ny toeram-piresahan'ny mpanamboatra. Mety ihisy fiovana izany any aoriana any.
pt: I2P tem, sim, uma lista de discussão, mas ela raramente é usada porque a pequena equipe de desenvolvedores prefere se comunicar pelo IRC ou pelo fórum de desenvolvedores. Isso pode mudar no futuro.
sv_se: I2P har en mailinglista, men den används sällan eftersom det nuvarande utvecklarteamet föredrar att kommunicera via IRC eller utvecklar-forumet. Detta kan förändras i framtiden.

source: Subscribing
he: הרשמה
id: Berlangganan
it: Iscrizione
mg: Fisoratana anarana
pt: Subscrever
sv_se: Prenumerara

source: To subscribe to a mailing list, go to the list information page (linked below) and fill out the form. I2P-internal email addresses (foobar@mail.i2p) can be used.
he: על־מנת להירשם לרשימת התפוצה, היכנסו לדף המידע של הרשימה (קישור למטה) ומלאו את הפרטים. ניתן להשתמש בכתובות דוא"ל פנימיות ל־I2P ‏(foobar@mail.i2p).
id: Untuk berlangganan milis, kunjungi halaman daftar informasi (link di bawah) dan isi formulir. Alamat email i2p-internal (foobar@mail.i2p) dapat digunakan.
it: Per iscriversi a una lista di distribuzione, accedi alla pagina informativa della lista (il link è indicato qui sotto) e compila il modulo. Possono essere usati indirizzi di posta elettronica interni di I2P (foobar@mail.i2p).
mg: Raha te hisoratra anarana ao amin'ny lisitra mailaka ianao dia mandehana ao amin'ny pejin'ny filazam-baovao momba ny lisitra (fitohizana eo ambany) dia fenohy ny pejy. Ny mailaka anaty ao amin'ny I2P (ohatra, foobar@mail.i2p) dia azo ampiasaina.
pt: Para se inscrever-se em uma lista de discussão, acesse a página de informações da lista (link abaixo) e preencha o formulário. Endereços I2P-internos (foobar@mail.i2p) podem ser usados.
sv_se: För att prenumerera på mailinglista, go till informationssidan för mailinlinstan (länkad till nedan) och fyll i formuläret. I2P-interna e-post addresser (foobar@mail.i2p) kan användas.

source: Unsubscribing
he: הסרת הרשמה
id: Berhenti berlangganan
it: Annullamento dell'iscrizione
mg: Fanesorana ny anarana
pt: Cancelar subscrição
sv_se: Avprenumerera

source: To unsubscribe from a mailing list or edit your subscription options, go to the list information page (linked below) and enter your subscription email address.
he: על־מנת להסיר את ההרשמה לרשימת התפוצה או לערוך את ההגדרות ההרשמה, היכנסו לדף המידע של הרשימה (קישור למטה) והזינו את כתובת הדוא"ל איתה נרשמתם.
id: Untuk berhenti berlangganan milis atau mengedit pilihan langganan anda, kunjuni halaman daftar informasi (link di bawah) dan masukkan alamat email anda yang digunakan untuk berlangganan.
it: Per annullare la propria iscrizione alla lista di distribuzione o modificare le opzioni di iscrizione, accedi alla pagina informativa della lista (il link è indicato qui sotto) e inserisci l'indirizzo di posta elettronica usato per iscriverti.
mg: Raha iala amin'ny lisitra mailaka na hanova ny fomba fisoratana , dia mandehana ao amin'ny filazam-baovaon'ny lisitry mailaka (jereo eo ambany), dia ampidiro ao ny adiresy mailaka-nao.
pt: Para cancelar a inscrição a partir de uma lista de discussão ou editar as suas opções de inscrição, acesse a página de informações da lista (link abaixo) e digite o seu endereço de email de inscrição.
sv_se: För att avprenumerera från mailinglistan eller ändra dina prenumerationsinställningar, gå till informationssidan för mailinglista (länkad till nedan) och fyll i dinprenumerations-adress.

source: Lists
he: רשימות
id: Daftar
it: Liste
mg: Lisitra
pt: Listas
sv_se: Listor

source: Archive
he: ארכיון
id: Arsip
it: Archivio
mg: Rakitry ny ela
pt: Arquivo
sv_se: Arkiv

source: I2P developer discussions - anything related to development of I2P
he: דיוני מפתח I2P - כל הקשור לפיתוח של I2P
id: Diskusi pengembang I2P - apapun yang berhubungan dengan pengembangan I2P
it: Discussioni dello sviluppatore I2P: qualunque argomento relativo allo sviluppo di I2P
mg: Firesahana rehetra momba ny fanatontosana ny I2P - izay rehetra mifandraiky amin'ny zay

source: General I2P discussion - anything that doesn't fit in a different list goes here
he: דיון כללי I2P - כל דבר שאינו מתאים לרשימה אחרת הולך לכאן
id: Diskusi Umum I2P - apa pun yang tidak cocok dalam daftar
it: Discussioni generali su I2P: qualunque argomento non sia pertinente in una diversa categoria può essere inserito qui.
mg: Firesahana momba ny I2P amin'ny ankapobeny - izay rehetra tsy tafihiditra ao anaty lisitra dia mandeha eto

source: You don't like mailing lists? Then this is for you. All mailing lists are available via NNTP as well.
he: אינכם אוהבים רשימות תפוצה? אז זה בשבילכם. כל רשימות התפוצה זמינות גם דרך NNTP.
id: Anda tidak suka milis? Maka ini adalah untuk anda. Semua milis juga tersedia melalui NNTP.
it: Non ti piacciono le liste di distribuzione? Allora questa opzione fa per te: tutte le liste di distribuzione sono disponibili anche tramite NNTP.
mg: Tsy tia lisitra mailaka ianao? Ity dia natao ho anao. Ny lisitra mailaka rehetra dia hita ao amin'ny NNTP koa .
pt: Não gosta das listas de discussão? Então isto é para si. Todas as listas de discussão também estão disponíveis via NNTP.
sv_se: Gillar du inte mailinglistor? Då är dethär för dig. Alla mailinglistor finns tillgängliga via NNTP med.

source: Group-List-mapping:
he: מיפוי רשימת הקבוצות:
it: Mappatura gruppi-liste:
mg: Fitsinjaran'ny vondrona lisitra:
pt: Mapa de Lista de Grupo:
sv_se: Grupp mailinglists-mappning:

source: Servers:
he: שרתים:
id: Server:
it: Server:
mg: Mpandroso:
pt: Servidores:
sv_se: Servrar:

source: Frequently Asked Questions
he: שאלות נפוצות
it: Domande poste frequentemente
mg: Fanontaniana Mateti- Mpitranga
pt: Perguntas Mais Frequentes
sv_se: Vanliga frågor

source: Index
he: אינדקס
it: Indice
mg: Tondro

source: General
he: כללי
id: Umum
it: Generale
mg: Ankapobeny
pt: Geral
sv_se: Allmänt

source: What systems will I2P run on?
he: על אילו מערכות תרוץ I2P?
id: Sistem apa I2P akan dijalankan?
it: Su quali sistemi gira I2P?
mg: Inona ny solon-tsaina handehanan'ny I2P?
pt: Em que sistemas é que o I2P funciona?
sv_se: Vilka system kan I2P köras på?

source: Whats an "eepsite" and how do I configure my browser so I can use them?
he: מהו "eepsite" וכיצד עלי להגדיר את הדפדפן שלי כך שאוכל להשתמש בהם?
id: Apakah itu \"eepsite\" dan bagaimana cara mengkonfigurasi browser sehingga saya dapat menggunakannya?
it: Che cos'è un "eepsite" e come configura il browser per accedervi?
mg: Inona ny atao hoe "eepsite" dia ahoana ny atao mba ahafahan'ny Fitadiavako mampiasa izany?
pt: O que é um "eepsite" e como é que eu configuro o meu navegador para os utilizar?
sv_se: Vad är en "eepsite" och hur kan jag konfigurera min webbläsare så att jag kan använda dom?

source: My router has very few active peers, is this OK?
he: לנתב שלי יש מעט מאוד עמיתים פעילים, האם זה תקין?
id: Router memiliki peer aktif yang sangat sedikit, apakah ini OK?
it: Il mio router ha pochissimi peer attivi, è normale?
mg: Vitsy loatra ny Peers miasa eto amin'ny router-ko, tsy misy atahorana?
pt: Meu roteador tem poucos peers ativos, isso está certo?
sv_se: Min router har väldigt få aktiva peers, är det OK?

source: What do the Active x/y numbers mean in the router console?
he: מה המשמעות של מספרי x\y בקונסולת הנתב?
id: Apakah arti dari Active x/y numbers di router console?
it: Che cosa significano i numeri relativi a x/y attivi nel console router?
mg: Inona ny dikan'ny Active x/y isa eo amin'ny route console ?
pt: O que quer dizer os números "x/y Ativos" no painel do roteador?
sv_se: Vad betyder Aktiva x/y nummerna i routerkonsolen?

source: My active peers / known peers / participating tunnels / connections / bandwidth vary dramatically over time! Is anything wrong?
he: העמיתים הפעילים / העמיתים המוכרים / המסלולים המשתתפים / החיבורים / רוחב הפס שלי משתנים מאוד במשך הזמן! האם משהו אינו כשורה?
id: Peer aktif saya / known peers / participating tunnels / connections / bandwidth bervariasi secara dramatis dari waktu ke waktu! Apakah ada sesuatu yang salah?
it: I miei peer attivi / peer conosciuti / tunnel partecipanti / connessioni / larghezza di banda variano in modo drammatico nel tempo! C'è qualcosa che non va?
mg: Ny active peers /known peers/participating tunnels/connections / bandwidth dia miovaova izay tsy izay isan'andro! Inona ny olana ?
pt: Meus peers ativos / peers conhecidos / túneis participantes / conexões / largura de banda variam dramaticamente ao longo do tempo! Tem algo errado?
sv_se: Mina aktiva peers / kända peers / deltagande tunnlar / anslutningar / bandbredd varierar dramatisk över tid! Är något fel?

source: Is using an outproxy safe?
he: האם השימוש במתווך יוצא בטוח?
id: Apakah aman untuk menggunakan outproxy?
it: L'utilizzo di un outproxy è sicuro?
mg: Mampanahy ve ny fampiasana ny Outproxy ?
pt: Está usando um outproxy seguro?
sv_se: Är det säkert att använda en utproxy?

source: Most of the eepsites within I2P are down?
he: רוב ה־eepsites ב־I2P אינם פעילים?
id: Sebagian besar eepsites dalam I2P tidak aktif?
it: La maggior parte degli eepsite all'interno di I2P non funziona?
mg: Maty ny ankamaroan'ny tranonkala ao amin'ny I2P?
pt: A maioria dos eepsites dentro do I2P estão fora do ar?
sv_se: De flesta "eepsites" inom I2P är nere?

source: What ports does I2P use?
he: באילו פתחות I2P משתמשת?
id: Port apa saya yang digunakan I2P?
it: Quali porte usa I2P?
mg: Inona ny ports ampiasain'i I2P?
pt: Que portas é que o I2P utiliza?
sv_se: Vilka portar använder I2P?

source: Why is I2P listening for connections on port 32000?
he: מדוע I2P מאזינה לחיבורים על פתחה 32000?
id: Mengapa I2P listening untuk koneksi pada port 32000?
it: Perché I2P si mette in ascolto per le connessioni sulla porta 32000?
mg: Fa maninona i I2P no mihaino eo amin'ny varavarana 32000?
pt: Por que o I2P está aguardando conexões na porta 32000?
sv_se: Varför lyssnar I2P efter anslutningar på port 32000?

source: I think I found a bug, where can I report it?
he: נראה לי שמצאתי תקלה, היכן אפשר לדווח עליה?
id: Saya rasa saya menemukan bug, ke mana saya dapat melaporkannya?
it: Credo di aver trovare un bug, dove lo segnalo?
mg: Ohatran'ny nahita lesoka aho, aiza no fanaovako tatitra ?
pt: Eu acho que encontrei um erro, onde eu posso reportá-lo?
sv_se: Jag tror jag hittade en bugg, var kan jag rapportera den?

source: What happened to *.i2p.net? What happened to jrandom? Is I2P dead?
he: מה קרה ל־‎*.i2p.net ? מה קרה ל־jrandom? האם הפרויקט מת?
id: Apa yang terjadi pada *. i2p.net? Apa yang terjadi dengan jrandom? Apakah I2P mati?
it: Che cos'è successo a *.i2p.net? Che cos'è successo a jrandom? I2P è morto?
mg: Inona ny nanjo an'i *.i2p.net? sy jrandom? Maty ve ny I2P?
pt: O que houve com *.i2p.net? O que houve com jrandom? A I2P está morta?
sv_se: Vad hände med *.i2p.net? Vad hände med jrandom? Är I2P dött?

source: I have a question!
he: יש לי שאלה!
id: Saya punya pertanyaan!
it: Ho una domanda!
mg: Misy fanontaniana!
pt: Eu tenho uma pergunta!
sv_se: Jag har en fråga!

source: Setup
he: התקנה
id: Setelan
it: Impostazione
mg: Fampiomanana
pt: Configuração
sv_se: Inställningar

source: My router has been up for several minutes and has zero or very few connections
he: הנתב שלי פועל כבר במשך כמה דקות אבל יש לו חיבורים מעטים מאוד או שאין בכלל
id: Router saya telah aktif selama beberapa menit dan memiliki koneksi nol atau sangat sedikit
it: Il mio router è stato impostato da diversi minuti e ha zero o pochissime connessioni.
mg: Ny router ko dia velona nandritry ny fotoana maromaro dia tsy ahitako fifandraisana mihitsy eo aminy
pt: Meus roteador está funcionando há vários minutos mas tem zero ou poucas conexões
sv_se: Min router har var igång i flera minuter och har noll eller väldigt få anslutningar

source: Why is I2P so slow?
he: מדוע I2P איטית כל־כך?
id: Mengapa adalah I2P begitu lambat?
it: Perché I2P è così lento?
mg: Maninona no milanto loatra i I2P?
pt: Por que o I2P está tão lento?
sv_se: Varför är I2P så långsamt?

source: I'm missing lots of hosts in my addressbook. What are some good subscription links?
he: חסרות לי הרבה כתובות מארחים בספר הכתובות. אפשר לקבל קישורי הרשמה?
id: Saya kehilangan banyak host di addressbook saya. Apa ada link yang bagus untuk berlangganan?
it: Mi mancano un sacco di host nella rubrica. Potete suggerirmi qualche buon link a cui iscrivermi?
mg: Tsy ampy betsaka ny hosts ato amin'ny bokin' adiresiko. Aiza no mety ahitako fifandraisana tsaratsara kokoa?
pt: Dei falta de vários hosts em meu catálogo de endereços. Quais são os bons links de assinatura?
sv_se: Jag saknar en massa av hosts i min adressbok. Vilka prenumerationslänkar är bra?

source: How do I set up my own eepsite?
he: כיצד ליצור eepsite משלי?
id: Bagaimana cara mengatur eepsite saya sendiri?
it: Come posso impostare il mio eepsite personale?
mg: Ahoana no fomba hanaovako ny pejiko eto amin'ny tranonkala eepsite?
pt: Como eu crio meu próprio eepsite?
sv_se: Hur sätter jag igång min egen "eepsite"?

source: Bittorrent / I2PSnark / Azureus I2P Plugin Questions?
he: שאלות על התוספים: ביטורנט / Azureus / I2PSnark?
id: Ada pertanyaan tentang plugin BitTorrent / I2PSnark / Azureus I2P?
it: Domande sui plugin Bittorrent / I2PSnark / Azureus per I2P?
mg: Fanontaniana momba ny Bittorrent / I2PSnark / Azureus I2P Plugin ?
pt: Perguntas sobre Bittorrent / I2PSnark / Plugin I2P para Azureus?
sv_se: Bittorrent / I2PSnark / Azureus I2P Plugin Frågor?
