Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: he, id, it, mg, pt, sv_se

source: Are you running a BitTorrent client over I2P? Try reducing the number of torrents, the bandwidth limits, or try turning it off completely to see if that helps.
id: Apakah anda menjalankan klien BitTorrent di dalam I2P? Coba kurangi jumlah torrent, batasan bandwidth, atau coba matikan, lihat apakah hal ini bisa membantu.
it: Hai un client BitTorrent in esecuzione su I2P? Prova a ridurre il numero di torrent, i limiti di banda oppure spegnerlo completamente per vedere se aiuta a risolvere il problema.
mg: Mampiasa BitTorrent eo ambonin'i I2P ve ianao ? Andramo ny mampihena ny isan'ny torrents, ny haben'ny bandwidth, na koa vonoy tanteraka, mety manampy ihany izany.
pt: Você está usando um cliente BitTorrent sobre I2P? Experimente reduzir o número de torrents, os limites de banda, ou tente desativá-lo completamente para ver se ajuda.
sv_se: Kör du en BitTorrent-klient över I2P? Försök att minska antalet torrents, bandbredds-gränserna eller försök stända av den helt och se om det hjälper.

source: Are your bandwidth limits set too high? It is possible that too much traffic is going through your I2P router and it is overloaded. Try reducing the setting for <em>share bandwidth percentage</em> on the <a href="http://localhost:7657/config">configuration</a> page.
id: Apakah batas bandwidth diatur terlalu tinggi? Apakah terlalu banyak lalu lintas akan melalui router I2P sehingga kelebihan beban. Cobalah mengurangi setting untuk <em>persentase berbagi bandwidth</em> pada halaman <a href=\"http://localhost:7657/config\">konfigurasi</a>
it: I limiti della larghezza di banda sono impostati troppo in alto? È possibile che stia passando troppo traffico nel tuo router I2P che è quindi sovraccarico. Prova ad abbassare l'impostazione della<em>percentuale di condivisione della banda</em> nella pagina di <a href="http://localhost:7657/config">configurazione</a>.
mg: Ambony loatra ve ny fampiakarana ny bandwidth?. Mety be loatra ny fifandraisana miseho ao anaty router dia lasa misy ny fikatsoana.Andramo ny mampihena ny <em>share bandwidth percentage</em> eo amin'ny pejy <a href="http://localhost:7657/config">configuration</a> .
pt: Seus limites de largura de banda estão muito altos? É possível que seja tráfego demais para seu roteador I2P e ele esteja sobrecarregado. Experimente reduzir a configuração para <em>percentagem de compartilhamento de banda</em> na página de <a href="http://localhost:7657/config">configuração</a> .
sv_se: Är dina bandbredds-gränser för höga? Det är möjligt att för mycket traffik går igenom din I2P-router och att den är överbelastad. Försök minska inställningarna för <em>utdelad bandbredds-procent</em> på <a href="http://localhost:7657/config">konfigurations</a>-sidan.

source: Make sure that you're running the latest version of I2P to get the benefits of increased performance and bug fixes.
he: ודא שאתה מפעיל את הגרסה האחרונה של I2P כדי לקבל את היתרונות של תיקוני באגים וביצועים מוגברים.
id: Pastikan bahwa anda sedang menjalankan versi terbaru dari I2P untuk mendapatkan manfaat dari peningkatan kinerja dan perbaikan bug.
it: Assicurati di avere la versione più recente di I2P in esecuzione per avvantaggiarti delle prestazioni migliorate e dei problemi risolti.
mg: Mba ahazoanao zavatra tsara dia ampiasao ny modely I2P farany.
pt: Certifique-se de que você está rodando a última versão do I2P para conseguir os melhores benefícios do aumento de performance e correções de defeitos.
sv_se: Var säker på att du kör den senaste versionen av I2P för att få tillgång till förbättrad prestanda och bugg-fixar.

source: Is the CPU usage simply higher than you would like, or is it pegged at 100&#37; for a long time? If it's pegged, this could be a bug. Look in the logs for clues.
id: Apakah penggunaan CPU lebih tinggi daripada yang anda inginkan, atau dipatok pada 100 &#37; untuk waktu yang lama? Jika itu dipatok ini bisa menjadi sebuah bug. Lihat di log untuk petunjuk.
it: L'utilizzo della CPU è semplicemente più elevato di quanto vorresti oppure rimane fisso su 100&#37; per un periodo di tempo molto lungo? Se è fisso, ciò potrebbe essere dovuto a un bug. Cerca nei log per eventuali indizi.
mg: Ambony noho ny fitiavanao azy ny fampiasana ny CPU, sa mihitsoka eo amin'ny 100&#37; mandritry ny fotoana maromaro? Raha mihitsoka, dia mety misy tsy fihetezany kely. Jereo ny firaiketana an'tsoratra.
pt: A carga da CPU está simplesmente mais alta do que você gostaria, ou está fixa em 100&#37; por muito tempo? Se está presa, isso pode ser um bug. Veja os logs por pistas.
sv_se: Är CPU-användningen helt enkelt högre än du vill att den ska vara eller är den fast vid 100&#37; under längre tid? Om den är fast vid 100&#37;, så kan det vara en bug. Titta i loggarna efter ledtrådar.

source: You may be using the Java-based BigInteger library instead of the native version, especially if you are running on a new or unusual OS or hardware (OpenSolaris, mipsel, etc.). See the <a href="%(jbigi)s">jbigi page</a> for instructions on diagnosing, building, and testing methods.
id: Anda dapat menggunakan library BigInteger berbasis Java bukan versi yang asli, terutama jika anda menjalankannya pada OS atau perangkat baru atau yang tidak umum (OpenSolaris, mipsel, dll.) Lihat <a href=\"%(jbigi)s\">halaman jbigi</a> untuk petunjuk mendiagnosa, membangun, dan metode pengujian.
it: Forse stai usando la libreria BigInteger basata su Java invece della versione originale, specialmente se stai usandoo un sistema operativo o un hardware insolito o nuovo (OpenSolaris, mipsel, ecc.). Consulta la <a href="%(jbigi)s">pagina jbigi</a> per istruzioni sui metodi di diagnosi, compilazione e collaudo.
mg: Met mampiasa Java-based BigInteger library ankoatry ny efa eo ianao, indrindra rehefa solon'tsaina tsy mahazatra , na fitaovana hafa (OpenSolaris, mipsel, sns.). Jereo ny <a href="%(jbigi)s">jbigi page</a> misy torohevitra momban'ny fitiliana, fanamboarana, sy fitsapana samihafa.
pt: Você pode usar a biblioteca BigInteger, baseada em Java, ao invés da versão nativa, especialmente se estiver rodando num SO ou hardware novo (OpenSolaris, mipsel, etc.). Veja <a href="%(jbigi)s">a página jbigi</a> para instruções de métodos de diagnóstico, construção e teste.
sv_se: Du kanske använder det Java-baserade BigInteger-biblioteket istället för platforms-specifika versionen, i synnerhet om du kör på ny eller ovanlig hårdvara eller OS (OpenSolaris, mipsel, etc.). See <a href="%(jbigi)s">jbigi</a>-sidan för instruktion om diagnosticering, byggande och test-metoder.

source: If your native jbigi library is working fine, the biggest user of CPU may be routing traffic for participating tunnels. This uses CPU because at each hop a layer of encryption must be decoded. You can limit participating traffic in two ways - by reducing the share bandwidth on <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>, or by setting <tt>router.maxParticipatingTunnels=nnn</tt> on <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.
id: Jika library jbigi asli anda bekerja dengan baik, pengguna terbesar CPU mungkin routing lalu lintas untuk participating tunnel. Ini menggunakan CPU karena di setiap hop, setiap lapisan enkripsi harus diterjemahkan. Anda dapat membatasi lalu lintas participating dengan dua cara - dengan mengurangi sharing bandwidth pada <a href=\"http://localhost:7657/confignet.jsp\">confignet.jsp</a>, atau dengan menetapkan <tt>router.maxParticipatingTunnels=nnn</tt> pada <a href=\"http://localhost:7657/configadvanced.jsp\">configadvanced.jsp</a>.
it: Se la tua libreria jbigi originale funziona senza problemi, l'utente più esoso di CPU potrebbe instradare il traffico per i tunnel partecipanti. Questo fa uso di CPU perché con ciascun salto uno strato di cifratura deve essere decodificato. Puoi limitare il traffico partecipanti in due modi: riducendo la banda condivisa su <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>, oppure impostando <tt>router.maxParticipatingTunnels=nnn</tt> su <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.
mg: Raha tsy misy olana ny jbigi library , ny tena mety mpampiasa ny CPU dia ny fampielezana ny zotra hoan'ny fantsona mpandray anjara. Mampiasa CPU izany satria isaky ny hop dia tsy maiky vakiana ny fanafenana . Misy fomba roa azo atao mba hampihena ny fandraisana anjara - Atao mihena ny bandwidth zaraina eo amin'ny <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>, na ovaina ny <tt>router.maxParticipatingTunnels=nnn</tt> on <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.
pt: Se sua biblioteca jbigi nativa funciona bem, quem mais exige da CPU pode ser o roteamento de tráfego para túneis participantes. Isso usa CPU porque em cada salto uma camada de criptografia é decodificada. Você pode limitar o tráfego participante de duas formas - reduzindo a banda compartilhada em <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>, ou configurando <tt>router.maxParticipatingTunnels=nnn</tt> em <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.
sv_se: Om ditt platforms-specifika jbigi-bibliotek fungerar, kan den största användaren av CPU vara routing av trafik fär deltagande tunnlar. Det använder CPU för att för varje hopp avkrypteras ett lager av kryptering. Du kan begränsa din deltagande traffik på två vis - genom att minska den utdelade bandbredden på <a href="http://localhost:7657/confignet.jsp">confignet.jsp</a>,⏎ eller genom att sätta <tt>router.maxParticipatingTunnels=###</tt> på <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.

source: Hmm. I2P is an anonymous network, so that's a tricky one. I2P is designed to withstand censorship, providing a means for everyone to communicate freely. The best way to keep your PC free of (encrypted) traffic that you dislike is to not use I2P. Freedom of speech has some costs. But let's address your question in three parts:
id: Hmm. I2p adalah jaringan anonim, jadi ini rumit. I2p dirancang untuk menangkal sensor, menyediakan sarana bagi setiap orang untuk berkomunikasi secara bebas. Cara terbaik untuk menjaga PC anda bebas dari lalu-lintas (dienkripsi) yang tidak anda sukai adalah dengan tidak menggunakan I2P. Kebebasan berpendapat harus membuat pengorbanan. Tapi mari kita jawab pertanyaan anda dalam tiga bagian:
it: Uhm. I2P è una rete anonima, quindi questa è una questione complicata. I2P è progettato per resistere alla censura offrendo un mezzo che tutti possono usare per comunicare liberamente. Il modo migliore di tenere il tuo computere libero da traffico (criptato) che non è di tuo gradimento è quello di non usare affatto I2P. La libertà di parola ha dei costi. Ma vediamo di analizzare il problema dividendolo in tre parti:
mg: Hmm. I2P dia tambazotra miafina , sarotra be izany. I2P dia natao hanohitra ny sivana, amin'ny fanomezana fiasana mba ahafan'ny tsirairay mifandray ankalalahana. Ny fomba tsara ialana amin'ny zotra miafina izay tsy tianao dia ny tsy fampiasanao ny I2P. Ny fahalalahan'ny resaka dia misy vidiny. Fa andao ho zarain-tsika telo ny fanontanianao:
pt: Hmm. I2P é uma rede anônima, então essa é complicada. I2P é projetada para resistir à censura, fornecendo meios para que todos se comuniquem livremente. A melhor forma de manter seu PC livre de tráfego (criptografado) que você não gosta é não usando I2P. Liberdade de expressão tem seus custos. Mas vamos tratar sua pergunta em três partes:
sv_se: Hmm. I2P är ett anonymt nätverk, så det är en svår fråga. I2P är designat för att stå emor censur och att tillhandahålla ett sätt för alla att kommunicera fritt. Det bästa sättethålla din PC fri från (krypterad) traffik som du ogillar är att inte använda I2P. Yttrandefrihet har en kostnad. Men vi kan besvara din fråga i tre delar:

source: <b>Distribution</b> - All traffic on I2P is encrypted in multiple layers. You don't know a message's contents, source, or destination. All traffic you route is internal to the I2P network, you are not an <a href="#exit">exit node</a> (outproxy). Your only alternative is to refuse to route <i>any</i> traffic, by setting your share bandwidth or maximum participating tunnels to 0 (see above). It would be nice if you didn't do this, you should help the network by routing traffic for others. Over 95&#37; of users route traffic for others.
id: <b>Distribusi</b> - Semua lalu lintas pada I2P dienkripsi dalam beberapa lapisan. Anda tidak tahu isi pesan, sumber, atau tujuan. Semua lalu lintas yang di-route adalah internal di jaringan I2P, anda bukan <a href=\"#exit\">exit node</a> (outproxy). Alternatifnya adalah untuk menolak untuk me-route lalu lintas <i>apapun,</i> dengan menetapkan share bandwidth atau maximum participating tunnel ke 0 (lihat di atas). Akan lebih baik jika anda tidak melakukan ini, anda harus membantu jaringan dengan routing lalu lintas untuk orang lain. Lebih dari 95 &#37; pengguna me-route lalu lintas untuk orang lain.
it: <b>Distribuzione</b> - Tutto il traffico I2P è cifrato a strati multipli. Non si può sapere il contenuto di un messaggio, la sua fonte e la sua destinazione. Tutto il traffico che indirizzi è interno alla rete I2P, tu non sei un <a href="#exit">nodo di uscita</a> (outproxy). La tua unica alternativa è di rifiutare di indirizzare <i>qualsivoglia</i> traffico, impostando a 0 la larghezza di banda condivisa o il numero massimo di tunnel partecipanti (vedi sopra). Ti saremmo grati se evitassi di assumere un comportamento del genere, dovresti invece dare una mano alla rete indirizzando il traffico per altri. Più del 95&#37; degli utenti lo fa.
mg: <b>Fizarana</b> - Ny zotra rehetra eo amin'ny I2P dia voahafina ao anaty lafiny maro. Tsy hay ny ao anatin'ny mailaka, ny fiaviany, sy ny ho alehany. Ny zotra rehetra dia mihodina ao anatin'ny tambazotra I2P, ianao dia tsy <a href="#exit">exit node</a> (outproxy). Ny safidinao farany dia ny fandavanao ny tsy handefa ny zotra. <i>na zotra inona na inona</i> , amin'ny fampihenana ny bandwidth na ny fantsona fandraisana anjara mba ho 0 (jereo eo ambony]. Tsara raha tsy manao izany ianao, tokony ampianao ny tambazotra amin'ny fandefasanao ny zotran'ny sasany. Ambonin'ny 95&#37; ny salan'isa ny olona mandefa zotra hoan'ny sasany.
pt: <b>Distribuição</b> - Todo o tráfego na I2P é criptografado em múltiplas camadas. Você não sabe o conteúdo, origem e destino de uma mensagem. Todo o tráfego que você roteia é interno dentro da I2P, você não é um <a href="#exit">nó de saída</a> (proxy de saída). Sua única alternativa é recusar-se a rotear <i>todo</i> o tráfego, configurando seu compartilhamento de banda ou sua participação em túneis para 0 (veja acima). Será legal se você não fizer isso, você deve ajudar a rede roteando tráfego para outros. Mais de 95&#37; usuários roteiam tráfego para outros.
sv_se: <b>Distribution</b> - All trafik i I2P är krypterad i flera lager. Du kan inte veta ett meddelandes innehåll, källa eller destination. All trafik du routar är intern för I2P-nätverket, du är inte en <a href="#exit">utgångsnod</a> (utproxy). Ditt enda alternativ är att vägra att routa <a>all</a> trafik, genom att ställa in din utdelade bandbredd eller maximalt deltagande tunnlar till 0 (se ovan). Det vore bra om du inte gör detta, du borde hjälpa nätverket genom att routa trafik åt andra. Över 95&#37; av användare routar trafik åt andra.

source: <b>Storage</b> - I2P does not do distributed storage of content. You must be thinking of <a href="http://freenetproject.org/">Freenet</a>. Nobody's content is being stored on your computer by running I2P.
id: <b>Penyimpanan</b> - I2P tidak melakukan distribusikan penyimpanan konten. Anda tanpaknya menyamakan I2p dengan <a href=\"http://freenetproject.org/\">Freenet</a>. Tidak ada konten yang disimpan pada komputer anda dengan menjalankan I2P.
it: <b>Deposito</b> - I2P non effettua la distribuzione di depositi di contenuti. Devi pensare a <a href="http://freenetproject.org/">Freenet</a>. Sul tuo computer non viene depositato il contenuto di nessuno eseguendo I2P.
mg: <b>Fitehirizana</b> - I2P dia tsy mitahiry na mizara. Mety <a href="http://freenetproject.org/">Freenet</a>.no heritreretinao. Tsy misy zavatra'olona voatahiry ao aminao mandritry ny fampiasanao I2P.
pt: <b>Armazenamento</b> - I2P não pratica armazenamento distribuído de conteúdo. Você deve estar confundindo com <a href="http://freenetproject.org/">Freenet</a>. Ao rodar I2P, você não armazena o conteúdo de ninguém.
sv_se: <b>Lagring</b> - I2P gör ingen distribuerad lagring av innehåll. Du måste tänka på <a href="http://freenetproject.org/">Freenet</a>. Ingens innehåll lagras på din dator genom att köra I2P.

source: <b>Access</b> - If there are some eepsites you don't like, don't go there. Or, use a blocking proxy like Privoxy or some type of "net nanny".
id: <b>Akses</b> - jika ada beberapa eepsites yang tidak anda sukai, jangan pergi ke sana. Atau, gunakan proxy memblokir seperti Privoxy atau beberapa jenis "net nanny".
it: <b>Accesso</b> - Se ci sono degli eepsite che non ti piacciono, non visitarli. Altrimenti usa un proxy di blocco come Privoxy o qualche tipo di "balia della rete".
mg: <b>Fidirana</b> - Raha misy eepsites tsy tianao, dia aza mankany. Na, mampiasà proxy manakana toy ny Privoxy na karany toy ny "net nanny".
pt: <b>Acesso</b> - Se há alguns eepsites que você não gosta, não vá lá. Ou use um proxy que os bloqueie, como o Privoxy ou algum tipo de "controle parental".
sv_se: <b>Tillgång</b> - om Det finns eepsites som du inte gillar, besök inte dom. Eller använd en blockerand proxy som Privoxy eller någon sorts "net nanny".

source: No. This is normal. All routers adjust dynamically to changing network conditions and demands.
id: Tidak. Ini normal. Semua router menyesuaikan secara dinamis untuk mengubah kondisi dan tuntutan jaringan.
it: No. Questo è normale.Tutti i router si regolano in maniera dinamica al cambiare delle condizioni della rete e delle richieste.
mg: Tsia. Ara-dalana izany. Ny routers rehetra dia mandahatra ny tenany amin'ny fiovaovan'ny tambazotra sy ny fangatahana.
pt: Não. Isso é normal. Todos os roteadores ajustam-se dinamicamente às mudanças de condições da rede e suas demandas.
sv_se: Nej. Det är normalt. Alla routrar justerar sig dynamiskt efter förändrande nätverksförhållande och behov.

source: You may need to reseed your I2P router. With recent versions of I2P you can go to <a href="http://localhost:7657/configreseed">http://localhost:7657/configreseed</a> and click the <em>Save Changes and Reseed Now</em> button. If this method doesn't work&mdash;or you're using a very old version&mdash;you may need to <a href="#manual_reseed">reseed manually</a>.
id: Anda mungkin perlu reseed router I2P anda. Dengan versi terbaru dari I2P, anda dapat mengunjungi <a href=\"http://localhost:7657/configreseed\">http://localhost:7657 configreseed</a> dan klik tombol <em>Save Changes and Reseed Now</em> . Jika metode ini tidak berhasil &mdash; atau anda menggunakan versi yang sangat tua&mdash;anda mungkin perlu untuk <a href=\"#manual_reseed\">reseed secara manual</a>.
it: Potrebbe essere necessario fare il reseed del tuo router I2P. Con le versioni recenti di I2P, puoi accedere a <a href="http://localhost:7657/configreseed">http://localhost:7657/configreseed</a> e fare clic sul pulsante <em>Salva modifiche e fail il reseed adesso</em>. Se questo metodo non funziona&mdash;o se stai usando una versione molto vecchia&mdash;potrebbe rendersi necessario fare il <a href="#manual_reseed">reseed manualmente</a>.
mg: Tokony ho ataonao reseed ny router I2P nao. Ny modely faran'ny I2P dia ahafahanao mandeha ato <a href="http://localhost:7657/configreseed">http://localhost:7657/configreseed</a> dia tsindrio ny bokotra <em>Save Changes and Reseed Now</em> . Raha tsy mandeha izany &mdash; na mampiasamodely efa tena antitra &mdash; mety ilainao ny <a href="#manual_reseed">reseed manually</a>.
pt: Você pode precisar repropagar seu roteador I2P. Em versões mais recentes do I2P você pode ir para <a href="http://localhost:7657/configreseed">http://localhost:7657/configreseed</a> e clicar no botão <em>Salvar Alterações e Repropagar Agora</em>. Se esse método não funciona&mdash;ou você usa uma versão muito velha&mdash;você precisa <a href="#manual_reseed">repropagar manualmente</a>.
sv_se: Du kan behöva reseeda din I2P-router. Med nyare versioner av I2P kan gå till <a href="http://localhost:7657/configreseed">http://localhost:7657/configreseed</a> och klicka <em>Spara inställningar och Reseeda Nu</em>-knappen. Om denhär metoden inte fungerar&mdash;eller du använder en väldigt gammal verion&mdash;kan du behöva att <a href="#manual_reseed">reseeda manuellt</a>.
