Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/research.po
Languages: az, es, ro, zh

source: Academic Research
az: Akademik Araşdırma
es: Investigación académica
ro: Cercetarea academica
zh: 学术研究

source: May 2018
ro: Mai 2018

source: Introduction
es: Introducción
ro: Introducere

source: Research on the I2P Network
ro: Cercetări în rețeaua I2P

source: I2P is a very unique project that unfortunately has not received the wider academic attention it deserves. To date, most research focus on anonymous and onion-routing technology has been around Tor, and while those papers benefit us as well, there is a great need for I2P-focused research. This plays a key role in both maintaining the security and integrity of the network, as well as opening doors for more impactful future development.
ro: I2P este un proiect foarte unic, care, din păcate, nu a primit cea mai larga atenție academică pe care o merită. Până în prezent, cele mai multe cercetări se concentrează pe anonimat și tehnologia de dirijare-ceapa a fost în jurul lui Tor, iar în timp ce acele lucrări ne avantajează de asemenea, există o mare nevoie de cercetare axată pe I2P. Aceasta joacă un rol esențial atât în ​​menținerea securității și integrității rețelei, cât și deschiderea ușilor pentru o dezvoltare viitoare mai impactantă.

source: There is a large research community investigating a wide range of aspects of anonymity. For a current and comprehensive list of relevant papers, see the <a href="%(anonbib)s">Free Haven Anonymity Bibliography</a>. I2P benefits from much of the research into Tor and onion routing, but there is little dedicated research interest into the theory behind I2P, and the choices and tradeoffs that the network makes. This presents a unique opportunity for original research.
az: Anonimliyin geniş aspektlərini araşdıran böyük araşdırma icması var. Müvafiq sənədlərin cari və hərtərəfli siyahısı üçün, <a href="%(anonbib)s">Free Haven Anonymity Bibliography</a>ya baxın. I2P, Tor və "soğan" istiqamətləndirici üzərinə araşdırmalardan yararlanır, ancaq I2P-nin arxasındakı nəzəriyyəni, qərarları və şəbəkənin səs verməsini araşdırmağa maraq azdır. Bu, orijinal araşdırma üçün unikal imkandır.
es: Hay una gran comunidad investigando un amplio rango de aspectos sobre el anonimato. Para una lista actualizada y completa de trabajos, vea la <a href="%(anonbib)s">bibliografía de anonimato del proyecto Free Haven</a>. I2P se beneficia mucho de la investigación acerca deTor y el enrutamiento onion, pero hay poco interés dedicado al estudio de la teoría tras I2P, y sobre las elecciones y equilibrios que produce la red. Esto presenta una oportunidad única para la investigación original.
ro: Exista o comunitate larga de cercetare ca re investighează o gama larga de aspecte de anonimitate.Pentru o listă curentă și completă a documentelor relevante puteti vedea<a href="%(anonbib)s">Bibliografie gratuita adăpostului anonimat</a>Beneficiile I2P reies din cercetările rețelei Tor și onion-rutarii,dar exista si mici cercetări dedicate teorie I2P, alegerilor și compromise rețelei
zh: 有一个调查匿名性方面范围广泛的大型研究社区 .当前综合有关论文列表，请参阅<a href="%(anonbib)s">自由避风港匿名参考书目</a>. I2P 得益于对 Tor 和裕 洋葱路由的大量研究. 不过, 对I2P后面的理论以及网络做出的选择和权衡的研究几乎没有. 这为原创研究提供了一个独特的条件.

source: A list of known published papers about I2P is available <a href="%(papers)s">here</a>.
az: Burada I2P haqqında tanınmış məqalələrin siyahısı <a href="%(papers)s">mövcuddur </a>.
es: Una lista de ensayos publicados sobre I2P está disponible <a href="%(papers)s">aquí</a>.
ro: O listă de lucrări cunoscute publicate despre I2P este disponibila<a href="%(papers)s">aici</a>.
zh: 已知的已发表的有关 I2P 的论文在<a href="%(papers)s">这里</a>可以找到。

source: This page aims to outline the most needed fields of research, notes to potential researchers, our general safety guidelines as well as an expanding list of open questions that you can begin on at any time.
ro: Această pagină își propune să contureze cele mai necesare domenii de cercetare, notează potențiali cercetători, orientările noastre generale privind siguranța, precum și o extindere listei de întrebări deschise cu care puteți începe oricând.

source: Notes to Researchers:
ro: Note pentru cercetători:

source: Defensive Research
ro: Cercetare defensivă

source: While all research on the I2P network is beneficial and appreciated, there are certain areas which are more in need than others - most so in defensive research. Most people enjoy coming up with fun ways to launch offensives against anonymous software, and this is further reinforced by the incentives in academic institutions. While we know it is often not the first choice for researchers, We would certainly appreciate any and all work towards ways to fortify the network!
ro: Deși toate cercetările din rețeaua I2P sunt benefice și apreciate, există anumite zone care au nevoie mai mult decât altele - cel mai mult în defensivă cercetare. Majoritatea oamenilor le place să vină cu modalități distractive de a lansa ofensive împotriva software-ului anonim, iar acest lucru este consolidat în continuare de stimulentele din instituții academice. Deși știm că nu este de multe ori prima alegere cercetătorilor, cu siguranță, am aprecia orice și toate lucrările pentru modalități de a fortifica rețeaua!

source: Offensive and Analytic Tests
ro: Teste ofensive și analitice

source: If you've decided on a research topic that aims to hands-on investigate the I2P network or solve a problem of large proportions we ask you to <b>please</b> <a href="%(contact)s">communicate your ideas</a> to the development team, the sooner the better. I2P is under constant development and a significant amount of roadmapping occurs, therefore your problem may have already been identified and flagged for update or patch. In the unlikely event you are conducting testing that overlaps with / would be of interest to another research project already in motion, we are also able to make you aware of this (with their permission, of course), and possibly open the door for collaboration. There is also a chance that the test itself may significantly harm the network or regular users, and the team may have ideas or suggestions to mitigate that risk and increase the safety of your testing.
ro: Dacă te-ai decis asupra unui subiect de cercetare care are drept scop investigarea practică a I2P în rețea sau rezolvați o problemă de proporții mari, <b>vă rugăm</b> sa <a href="%(contact)s">comunică-ți ideile</a> cu echipa de dezvoltare, cu cat mai devreme, cu atat mai bine. I2P este în continuă dezvoltare și o cantitate semnificativă de foaie de parcurs , prin urmare, problema dvs. a fost deja identificată și semnalizata pentru actualizare sau patch. În cazul puțin probabil pe care îl conduceți testarea că se suprapune cu / ar interesa un alt proiect de cercetare deja în mișcare, putem, de asemenea, să vă facem conștienți de acest lucru (cu permisiunea lor desigur) și, eventual, deschideți ușa pentru colaborare. Există de asemenea, o șansă ca testul în sine să afecteze în mod semnificativ rețeaua sau utilizatorii obișnuiți și echipa poate avea idei sau sugestii pentru atenuarea acestui risc și creșterea siguranței testării dvs.

source: Research Ethics &amp; Testing the Network
ro: Cercetarea eticii și testarea rețelei

source: General Guidelines
ro: Orientări generale

source: <ol> <li> Consider the benefits and risks - is there any doubt that the research provides more value than danger? </li> <li> If the research can be done on a test network then that is the preferred method </li> <li> If you must operate on the live network, the safest route is only collecting data about yourself </li> <li> If you need 'bigger data', It is recommended to first see if you can use data sets from previous experiments or other third party resources is recommended </li> <li> If you must collect data on the live network, ensure it is safe for publication and collect as little as possible </li> <li> After testing and before publish, review that all data which is to be published publicly is <b><i>not</i></b> intended to be private by the originator </li> </ol>
ro: <ol> <li> Luați în considerare beneficiile și riscurile - există vreo îndoială că cercetarea oferă mai multă valoare decât pericol? </li> <li> Dacă cercetarea poate fi făcută într-o rețea de testare, atunci aceasta este cea mai preferată metodă </li> <li> Dacă trebuie să funcționați în rețeaua live, cea mai sigură rută este doar colectarea datelor despre tine </li> <li> Dacă aveți nevoie de „date mai mari”, se recomandă să vedeți mai întâi dacă puteți utiliza seturi de date din experimente anterioare sau alte resurse terțe sunt recomandat </li> <li> Dacă trebuie să colectați date în rețeaua live, asigurați-vă că acestea sunt sigure pentru publicarea și colectarea este cât mai puțin posibil </li> <li> După testare și înainte de publicare, verificați toate datele care trebuie să fie publicate public <i>nu</i></b>sunt destinate să fie private de către inițiator </li> </ol>

source: Using a Test Network to Attack I2P
ro: Utilizarea unei rețele de testare pentru a ataca I2P

source: I2P can be run as a separate test network by controlling the locations that a new router reseeds from so that it only finds other test routers. The standard mode of operation is to have one JVM per router instance; hence running multiple copies of I2P on a single machine is inadvisable, both due to the potential resource drain and the certain port conflicts. To better facilitate setting up small test networks, I2P has a multirouter mode which enables multiple distinct routers to be run in the same JVM. MultiRouter can be started from the i2p base directory by running the below command.
ro: I2P poate fi rulat ca o rețea de testare separată prin controlul locațiilor care router-ul nou le transformă astfel încât să găsească doar alte routere de testare. Modul de operare standard este să aibă un JVM pentru fiecare instanță de router; prin urmare rularea mai multor copii ale I2P pe o singură mașină este inadmisibilă, atât datorită scurgerea potențială a resurselor și anumite conflicte portuare. Pentru facilitarea mai buna configurarii rețelelor de testare mici, I2P are un mod multirouter care permite rularea mai multor routere distincte în același JVM. MultiRouter poate fi pornit din directorul de bază i2p rulând comanda de mai jos.

source: Additionally, I2P can be started in a virtual network mode. This mode disables all transports, allowing the router to be tested in isolation without network traffic. To enable this mode, add <code>i2p.vmCommSystem=true</code> to the router.config before starting.
ro: În plus, I2P poate fi pornit într-un mod de rețea virtuală. Acest mod dezactivează toate transporturile, permițând testarea routerului în mod izolat, fără trafic din rețea . Pentru a activa acest mod, adăugați <code>i2p.vmCommSystem = true</code> la router.config înainte de a începe.

source: Testing on the Live I2P Network
ro: Testare în rețeaua I2P Live

source: As stated above in the researcher notes, please <a href="%(contact)s">contact us</a> before you commence your testing. While we do not discourage researchers from responsibly testing their ideas on the live network, if an attack becomes apparent and we don't have any line of communication then we will end up taking countermeasures which could interfere with the test.
ro: După cum s-a menționat mai sus în notele cercetătorului, vă rugăm să <a href="%(contact)s"> ne contactați</a> înainte de a începe testarea. În timp ce nu ne descurajăm cercetătorii de la testarea responsabilă a ideilor lor în rețeaua live, dacă atacul devine evident și nu avem nicio linie de comunicare atunci va ajunge să luam măsuri care ar putea interfera cu testul.

source: Router Family Configuration
az: İstiqamətləndiricinin ailə quraşdırması
es: Configuración de familia de routers I2P
ro: Configurare familie router
zh: 路由器系列配置

source: As of release 0.9.25, I2P supports a router family configuration. This provides researchers who run multiple routers with the means to publicly identify those routers. In turn, this helps the I2P project understand that these routers are not running an attack on the network. It also will prevent other routers from including multiple routers of the family in a single tunnel, which could lead to deanonymization. Routers that appear to be colluding but do not have a declared family may be assumed to be an attack on the network, and may be blocked. The best way to ensure the success of your research project is to work with us directly.
ro: De la versiunea 0.9.25, I2P acceptă o configurație a familiei de routere. Acest lucru oferă cercetătorilor care rulează mai multe routere cu mijloacele de a le identifica public routere. La rândul său, acest lucru ajută proiectul I2P să înțeleagă că aceste routere nu execută un atac în rețea. De asemenea, va preveni alte routere inclusiv multiple routere ale familiei într-un singur tunel, care ar putea conduce la deanonimizare. Router-urile care par coluzionante, dar nu au o familia declarată poate fi presupusă a fi un atac la rețea și poate fi blocat. Cel mai bun mod de a vă asigura succesul proiectului dvs. de cercetare este să lucrați cu noi direct.

source: A router family shares a private key so that participation in the family cannot be spoofed. To configure a router family, click on the 'I2P Internals' link in the router console, and then on the 'Family' tab. Follow the instructions there to generate the private key for the first router in the family. Then, export the key from that router, and import it to other members of the family.
ro: O familie de routere partajează o cheie privată, astfel încât participarea la familie nu poate fi răsfățat. Pentru a configura o familie de routere, faceți clic pe linkul „I2P Internals” din consola de router, apoi pe fila „Family”. Urmați instrucțiunile de acolo pentru a genera cheia privată pentru primul router din familie. Apoi, export cheia de la acel router și importați-o în alți membri ai familiei.

source: Open research questions
az: Tədqiqatın açıq sualları
es: Preguntas de investigación
ro: întrebări de cercetare deschise
zh: 开放式的研究问题

source: Network database
az: Şəbəkə verilənlər bazası
es: Base de datos de red
ro: Baza de date a rețelei
zh: 网络数据库

source: Transports
az: Nəqliyyatlar
es: Transportes
ro: Transporturi
zh: 传输

source: Tunnels and Destinations
az: Tunel və istiqamətlər
es: Túneles y destinos
ro: Tuneluri și Destinații
zh: 隧道和目标

source: Peer selection
az: Bənzərlərin seçimi
es: Selección de Par (peer)
ro: Selectarea partenerului
zh: 节点选择

source: Unidirectional tunnels
az: Tək istiqamətli tunellər
es: Túneles unidireccionales
ro: Tuneluri unidirecționale
zh: 单向隧道

source: Message routing
az: İsmarış istiqaməti
es: Enrutamiento de mensajes
ro: Rutarea mesajelor
zh: 消息路由

source: Anonymity
es: Anonimato
ro: Anonimat

source: Network Related
ro: Legat de rețea

source: Vulnerability Response Process
az: Həssaslığı bildirən proses
es: Proceso de respuesta a la vulnerabilidad (VRP)
ro: Procesul de răspuns la vulnerabilitate

source: January 2017
az: Yanvar 2017
es: Enero de 2017
ro: Ianuarie 2017

source: This process is subject to change. Please refer to this page for the current VRP.
az: Bu proses dəyişdirilə bilər. Mövcud VRP üçün bu səhifəyə baxın.
es: Este proceso está sujeto a cambio. Por favor, refiérase a esta página para el actual VRP.
ro: Acest proces poate fi modificat. Vă rugăm să consultați această pagină pentru actualul VRP.

source: Point of Contact for Security Issues
az: Təhlükəsizlik məsələləri üzrə təmas nöqtəsi
es: Punto de contacto para problemas de seguridad
ro: Punct de contact pentru probleme de securitate

source: Security Response Team
az: Təhlükəsizlik tədbirlər qrupu
es: Equipo de respuesta de seguridad
ro: Echipa de răspuns la securitate

source: Only the following members have access to the security point of contact:
az: Yalnız aşağıdakı üzvlər əlaqəli təhlükəsizlik təmas nöqtəsinə daxil ola bilərlər:
es: Sólo los siguientes miembros tienen acceso al punto de contacto de seguridad.
ro: Doar următorii membri au acces la punctul de contact de securitate:

source: Incident Response
az: Hadisəyə cavab
es: Respuesta al incidente
ro: Răspuns la incident

source: Researcher submits report via one or both of two methods:
az: Araşdırmaçı hesabatı bir və ya hər iki üsuldan istifadə edərək təqdim edir:
es: El investigador entrega un informe a través de uno o de ambos métodos:
ro: Cercetătorul prezintă raportul prin una sau ambele două metode:

source: Response Team designates a Response Manager who is in charge of the particular report based on availability and/or knowledge-set.
az: Cavab qrupu yararlılıq və/ və ya məlumat dəstinə əsaslanan konkret hesabata cavabdeh müdir təyin edir.
es: El equipo de respuesta designa un gestor de respuesta que se ocupa del informe en particular en base a la disponibilidad y/o al conjunto de conocimientos.
ro: Echipa de răspuns desemnează un manager de răspuns care este responsabil de raport particular bazat pe disponibilitate și / sau set de cunoștințe.

source: In no more than %(limit)s working days, Response Team should gratefully respond to researcher using only encrypted methods.
az: %(limit)siş günündən çox olmamaqla, Response Team yalnız şifrəli üsullardan istifadə edən tədqiqatçıya cavab verir.
es: El equipo de respuesta debe responder en cortesía al investigador, en no más de %(limit)s días laborables, usando sólo métodos cifrados.
ro: În cel mult %(limit)s zile lucrătoare, echipa de răspuns ar trebui să fie recunoscut răspuns cercetătorului folosind doar metode criptate.

source: Response Manager makes inquiries to satisfy any needed information and to confirm if submission is indeed a vulnerability.
az: Cavab meneceri hər hansı zəruri məlumatı təmin etmək üçün sorğu göndərir və təqdimatın həqiqətən zəiflik olduğunu təsdiqləyir.
es: El gestor de respuesta formula preguntas para satisfacer cualquier información necesaria y para confirmar si la entrega efectivamente indica una vulnerabilidad.
ro: Managerul de răspuns face anchete pentru a satisface orice informație necesară și pentru confirmarea dacă transmiterea este într-adevăr o vulnerabilitate.

source: If submission proves to be vulnerable, proceed.
az: Təqdimatın zəif olduğu təsqilənirsə, davam edin.
es: Si la entrega prueba indicar una vulnerabilidad, se continúe.
ro: Dacă depunerea se dovedește a fi vulnerabilă, continuați.

source: If not vulnerable:
az: Zəif deyilsə:
es: Si no indica vulnerabilidad:
ro: Dacă nu este vulnerabil:

source: Response Manager responds with reasons why submission is not a vulnerability.
az: Cavab meneceri təqdimatın zəif olmadığına dair səbəbləri açıqlayır.
es: El gestor de respuesta responde con las razones por las que la entrega no indica una vulnerabilidad.
ro: Managerul de răspuns răspunde cu motivele pentru care transmiterea nu este o vulnerabilitate.

source: Response Manager moves discussion to a new or existing ticket on public Trac if necessary.
az: Cavab meneceri müzakirəni zəruri hallarda ictimai Trac-da yeni və ya mövcud biletə keçirir.
es: Si es necesario, el gestor de respuesta mueve la conversación a un 'ticket' nuevo o existente en un Trac público.
ro: Managerul de răspuns mută discuția la un bilet nou sau existent pe Trac public, dacă este necesar.

source: If over email, Response Manager opens a HackerOne issue for new submission.
az: E-poçt vasitəsilə cavab veribsə, cavab meneceri yeni təqdimat üçün HackerOne məsələsini açır.
es: Si se realiza por correo electrónico, el gestor de respuesta abre un 'issue' (asunto) en HackerOne para una nueva entrega.
ro: Dacă aveți un e-mail, Managerul de răspuns deschide o problemă HackerOne pentru trimitere nouă.

source: Establish severity of vulnerability:
az: Zəifliyin səviyyəsini müəyyən etmə:
es: Establezca la gravedad de la vulnerabilidad:
ro: Stabiliți severitatea vulnerabilității:

source: Effects network as a whole, has potential to break entire network or is on a scale of great catastrophe.
az: Effekt şəbəkəsi bütöv bir şəbəkəni pozmaq potensialına malikdir və ya böyük fəlakət miqyasındadır.
es: Repercute en la red como conjunto, tiene potencial para desbaratar la red entera o está al nivel de una gran catástrofe.
ro: Rețeaua cu efecte în ansamblu, are potențialul de a rupe întreaga rețea sau este la scară de mari catastrofe.

source: Effects individual routers, or must be carefully exploited.
az: Fərdi istiqamətləndiricilərə təsir edir və ya diqqətlə istismar edilməlidir.
es: Repercute en los routers I2P individuales, o ha de ser explotada con cuidado.
ro: Efectează routere individuale sau trebuie exploatate cu atenție.

source: Is not easily exploitable.
az: Asan istifadə edilə bilməz.
es: No es explotable con facilidad.
ro: Nu este ușor de exploatat.

source: Respond according to the severity of the vulnerability:
az: Zəiflik səviyyəsinə uyğun cavab verin:
es: Responda de acuerdo a la gravedad de la vulnerabilidad:
ro: Răspundeți în funcție de gravitatea vulnerabilității:

source: HIGH severities must be notified on website and news feed within %(limit)s working days of classification.
az: YÜKSƏK səviyyə veb səhifələrdə və xəbər lentində %(limit)stəsnifat iş günləri daxilində bildirilməlidir.
es: Las de gravedad ALTA deben notificarse en el sitio web y en la suscripción de novedades en %(limit)s días laborables desde su clasificación.
ro: Gravitatea ridicată trebuie notificată pe site-ul web și în fluxul de știri %(limit)s zile lucrătoare de clasificare.

source: The notification should list appropriate steps for users to take, if any.
az: Bildirişdə istifadəçilər üçün müvafiq addımlar göstərilməlidir.
es: La notificación debe, en su caso, enumerar los pasos adecuados a seguir por los usuarios.
ro: Notificarea trebuie să enumere pașii adecvați pentru utilizatori, dacă este cazul.

source: The notification must not include any details that could suggest an exploitation path.
az: Bildirişə istismar yolunu təklif edən hər hansı məlumat daxil edilməməlidir.
es: La notificación no debe incluir detalle alguno que pudiera sugerir una vía para explotar la vulnerabilidad.
ro: Notificarea nu trebuie să includă detalii care ar putea sugera o exploatare cale.

source: The latter takes precedence over the former.
az: Sonuncu öncəkindən üstündür.
es: La última toma precedencia sobre la anterior.
ro: Acesta din urmă are prioritate asupra primului.

source: MEDIUM and HIGH severities will require a Point Release.
az: ORTA və YÜKSƏK səviyyə Point Release tələb edəcək.
es: Las de gravedad MEDIA y ALTA requerirán una versión puntual.
ro: Severitatea medie și înaltă va necesita o eliberare de punct.

source: LOW severities will be addressed in the next Regular Release.
az: AŞAĞI səviyyəyə növbəti müntəzəm buraxılışda baxılacaq.
es: Las de gravedad BAJA serán abordadas en la siguiente versión regular.
ro: Gravitatea scăzută va fi abordată în următoarea versiune periodică.

source: Response Team applies appropriate patch(es).
az: Cavab qrupu müvafiq yama(lar) tətbiq edir.
es: El equipo de respuesta aplica el/los parche(s) apropiado(s).
ro: Echipa de răspuns aplică patch-uri adecvate.

source: Response Manager designates a PRIVATE monotone "hotfix branch" to work in.
az: Cavab meneceri işləmək üçün ÖZƏL bir monoton "düzəltmə bölməsi" təyin edir.
es: El gestor de respuesta designa un "hotfix branch" (ramal de corrección urgente) PRIVADO de monotone en el que trabajar.
ro: Response Manager desemnează o „ramură de remediere rapidă” monotonă PRIVATĂ pentru a lucra.

source: Patches are reviewed with the researcher.
az: Yamalar tədqiqatçı tərəfindən nəzərdən keçirilir.
es: Los parches se revisan con el investigador.
ro: Patch-urile sunt revizuite cu cercetătorul.
