Repository: i2p/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/research.po
Languages: az, es, ro, zh

source: Any messages associated with PUBLIC commits during the time of review should not make reference to the security nature of the PRIVATE branch or its commits.
az: Baxış zamanı İCTİMAİ ilə əlaqəli hər hansı məlumat ÖZƏL bölmə və ya onun öhdəlliklərinin təhlükəsizliyinə istinad etməməlidir.
es: Cualquier mensaje asociado con consignaciones (commits) PÚBLICAS durante el periodo de revisión no debe hacer referencia a la naturaleza de seguridad del ramal (branch) PRIVADO o de sus consignaciones.
ro: Orice mesaj asociat cu angajamentele PUBLIC în timpul revizuirii nu trebuie face referire la natura de securitate a sucursalei PRIVATE sau a angajamentelor acesteia.

source: Vulnerability announcement is drafted.
az: Zəiflik elanları hazırlanıb.
es: Se crea el borrador del anuncio de vulnerabilidad.
ro: Anunțul de vulnerabilitate este redactat.

source: Include severity of vulnerability.
az: Zəiflik səviyyəsini əlavə edin.
es: Incluye la gravedad de la vulnerabilidad.
ro: Includeți severitatea vulnerabilității.

source: Include systems/apps effected.
az: Təsirlənən sistemləri/tətbiqetmələri daxil edin.
es: Incluye los sistemas/aplicaciones afectados.
ro: Includeți sisteme / aplicații efectuate.

source: Include solutions (if any) if patch cannot be applied.
az: Yamalar tətbiq oluna bilməzsə,(əgər varsa) həll yollarını daxil edin.
es: Incluye soluciones (en su caso) por si no se puede aplicar el parche.
ro: Includeți soluții (dacă există) dacă patch-ul nu poate fi aplicat.

source: Release date is discussed.
az: Təqdimat tarixi müzakirə edilir.
es: Se discute la fecha de publicación.
ro: Data de lansare este discutată.

source: At release date, Response Team coordinates with developers to finalize update:
az: Təqdimat tarixində cavab qrupu yeniləməni yekunlaşdırmaq üçün işi yaradıcılarla koordinasiya edir.
es: En la fecha de publicación, el equipo de respuesta se coordina con los desarrolladores para culminar la actualización:
ro: La data lansării, echipa de răspuns se coordonează cu dezvoltatorii pentru finalizarea actualizării:

source: Response Manager propagates the "hotfix branch" to trunk.
az: Cavab meneceri "düzəltmə bölməsi"ni magistral xəttə yayır.
es: El gestor de respuesta propaga el "hotfix branch" (ramal de corrección urgente) a trunk (ramal troncal).
ro: Response Manager propagă „ramura de remediere rapidă” în portbagaj.

source: Response Manager includes vulnerability announcement draft in release notes.
az: Cavab meneceri buraxılış qeydlərinə zəiflik elanı layihəsini daxil edir.
es: El gestor de respuesta incluye el borrador de anuncio de vulnerabilidad en las notas de la versión.
ro: Response Manager include proiectul de anunț de vulnerabilitate în notele de lansare.

source: Proceed with the Point or Regular Release.
az: Point və ya Regular Release ilə davam edin.
es: Continuar con la versión puntual o regular.
ro: Continuați cu eliberarea punctuală sau regulată.

source: Post-release Disclosure Process
az: Buraxılışdan sonra açıqlama prosesi
es: Proceso de divulgación post-publicación
ro: Procesul de divulgare post-eliberare

source: Response Team has %(limit)s days to fulfill all points within section III.
az: Cavab qrupunun III hissədəki bütün nöqtələri yerinə yetirmək üçün %(limit)s günü var.
es: El equipo de respuesta tiene %(limit)s días para satisfacer todos los puntos dentro de la sección III.
ro: Echipa de răspuns are %(limit)s zile pentru îndeplinirea tuturor punctelor din secțiunea III.

source: If the Incident Response process in section III is successfully completed:
az: III bölmədə hadisəyə cavab prosesi uğurla başa çatdıqda:
es: Si el proceso de respuesta a incidente en la sección III se completa con éxito:
ro: Dacă procesul de răspuns la incident în secțiunea III este finalizat cu succes:

source: Response Manager contacts researcher and asks if researcher wishes for credit.
az: Cavab meneceri tədqiqatçı ilə əlaqə qurur və onun kredit istəyib-istəmədiyini soruşur.
es: El gestor de respuesta contacta con el investigador y le pregunta si desea aparecer en los créditos.
ro: Managerul de răspuns contactează cercetătorul și îl întreabă dacă cercetătorul dorește credit.

source: Finalize vulnerability announcement draft and include the following:
az: Zəiflik elanı layihəsini yekunlaşdırın və aşağıdakıları daxil edin:
es: Finalice el borrador de anuncio de vulnerabilidad e incluya lo siguiente:
ro: Finalizați proiectul de anunț pentru vulnerabilitate și includeți următoarele:

source: Project name and URL.
az: Layihənin adı və URL.
es: Nombre del proyecto y URL.
ro: Numele proiectului și adresa URL.

source: Versions known to be affected.
az: Təsirə məruz qalan versiyalar.
es: Versiones que se sabe que están afectadas.
ro: Versiuni despre care se știe că sunt afectate.

source: Versions known to be not affected (for example, the vulnerable code was introduced in a recent version, and older versions are therefore unaffected).
az: Təsirə məruz qalmayan versiyalar (məsələn, son versiyada zəif kod tətbiq olundu və bu səbəbdən öncəki versiyalar təsirlənmədi).
es: Versiones que se sabe que no están afectadas (por ejemplo, si el código vulnerable fue introducido en una versión reciente, las versiones anteriores no están afectadas).
ro: Versiunile despre care se știe că nu sunt afectate (de exemplu, codul vulnerabil a fost introdus într-o versiune recentă, iar versiunile mai vechi nu sunt afectate).

source: Versions not checked.
az: Versiyalar yoxlanmadı.
es: Versiones no comprobadas.
ro: Versiunile nu sunt verificate.

source: Type of vulnerability and its impact.
az: Zəiflik növü və onun təsiri.
es: Tipo de vulnerabilidad y su impacto.
ro: Tipul de vulnerabilitate și impactul acesteia.

source: If already obtained or applicable, a CVE-ID.
az: Əldə edilmiş və ya tətbiq oluna bilən CVE-ID.
es: Si ya se obtuvo o se aplica, un CVE-ID (identificador de vulnerabilidades).
ro: Dacă este deja obținut sau aplicabil, un CVE-ID.

source: The planned, coordinated release date.
az: Planlaşdırılmış, razılaşdırılmış təqdimat tarixi.
es: La fecha planeada de publicación coordinada.
ro: Data de lansare planificată și coordonată.

source: Mitigating factors (for example, the vulnerability is only exposed in uncommon, non-default configurations).
az: Azaldıcı amillər (məsələn, zəiflik yalnız qeyri-standart quraşdırmalarda müşahidə olunur).
es: Factores de mitigación (por ejemplo, la vulnerabilidad sólo se expone con configuraciones infrecuentes, y no predeterminadas).
ro: Factorii de atenuare (de exemplu, vulnerabilitatea este expusă numai în configurații neobișnuite, care nu sunt implicite).

source: Workarounds (configuration changes users can make to reduce their exposure to the vulnerability).
az: Müvəqqəti həllər (isifadəçilər zəifliyə məruz qalmalarını azaltmaq üçün quraşdırma dəyişiklikləri edə bilər).
es: Soluciones auxiliares (cambios que el usuario puede hacer en la configuración para reducir su exposición a la vulnerabilidad).
ro: Rezolvări (modificările de configurare pe care le pot face utilizatorii pentru a reduce expunerea la vulnerabilitate).

source: If applicable, credits to the original reporter.
az: Mümkündürsə, əsas müxbirə kredit verin.
es: Si se aplica, créditos al informante original.
ro: Dacă este cazul, credite către reporterul inițial.

source: Release finalized vulnerability announcement on website and in news feed.
az: Vebdə və xəbər lentində yekunlaşdırılmış zəiflik elanının buraxılışı.
es: Anuncio de fin de la vulnerabilidad mediante la versión en el sitio web y en la suscripción de novedades.
ro: Eliberați anunțul de vulnerabilitate finalizat pe site-ul web și în fluxul de știri.

source: For HIGH severities, release finalized vulnerability announcement on well-known mailing lists:
az: YÜKSƏK səviyyə üçün, yekunlaşdırılmış zəiflik elanını tanınan göndəriş siyahılarına yayın:
es: Para severidades ALTAs, anuncio de fin de la vulnerabilidad mediante la versión en listas de correo bien-conocidas:
ro: Pentru severități înalte, eliberați anunțul de vulnerabilitate finalizat pe listele de corespondențe cunoscute:

source: If applicable, developers request a CVE-ID.
az: Mümkündürsə, yaradıcılar CVE-ID tələb edir.
es: Si se aplica, los desarrolladores solicitan un CVE-ID (identificador de vulnerabilidad).
ro: Dacă este cazul, dezvoltatorii solicită un ID CVE.

source: The commit that applied the fix is made reference too in a future commit and includes a CVE-ID.
az: Düzeltməni tətbiq edən versiya, gələcək fiksasiyada da qeyd olunur və bura CVE-ID daxildir.
es: Se hace referencia también a la consignación (commit) que aplicó la corrección en una futura consignación, y se incluye un CVE-ID.
ro: Angajamentul care a aplicat remedierea se face referire și la un angajament viitor și include un CVE-ID.

source: If the Incident Response process in section III is *not* successfully completed:
az: III bölmədə hadisəyə cavab prosesi uğurla başa *çatmadıqda*:
es: Si el proceso de respuesta a incidente en la sección III *no* se completó con éxito:
ro: Dacă procesul de răspuns la incident în secțiunea III nu este * finalizat cu succes:

source: Response Team and developers organize an IRC meeting to discuss why/what points in section III were not resolved and how the team can resolve them in the future.
az: Cavab qrupu və yaradıcılar İİİ bölmədəki niyə/hansı nöqtələrin həll olunmadığını və gələcəkdə onları necə həll edə biləcəyini müzakirə etmək üçün IRC görüşünü təşkil edir.
es: El equipo de respuesta y los desarolladores organizan una reunión en el IRC para discutir por qué y qué puntos de la sección III no se resolvieron, y cómo puede el equipo resolverlos en el futuro.
ro: Echipa de răspuns și dezvoltatorii organizează o întâlnire IRC pentru a discuta de ce / ce puncte în secțiunea III nu au fost soluționate și modul în care echipa le poate rezolva în cadrul viitor.

source: Any developer meetings immediately following the incident should include points made in section V.
az: Hadisədən sonra yaradıcıların istənilən görüşü V bölmədəki bəndləri nəzərə almalıdır.
es: Cualquier reunión de desarrolladores inmediatamente a continuación del incidente debe incluir los puntos en la sección V.
ro: Orice reuniuni de dezvoltatori imediat după incident ar trebui să includă puncte realizat în secțiunea V.

source: If disputes arise about whether or when to disclose information about a vulnerability, the Response Team will publicly discuss the issue via IRC and attempt to reach consensus.
az: Zəiflik haqqında məlumatın açıqlanması yaxud nə zaman açıqlanması ilə əlaqədar anlaşılmazlıq yaranarsa, cavab qrupu məsələni İRC vasitəsilə açıq müzakirə edərək, ortaq məxrəcə gəlməyə çalışacaq.
es: Si surgen disputas acerca de si divulgar o no información acerca de una vulnerabilidad, o cuándo hacerlo, el equipo de respuesta discutirá públicamente el problema en el IRC e intentará alcanzar un consenso.
ro: În cazul în care apar dispute cu privire la dacă sau când trebuie dezvăluite informații despre o vulnerabilitate, echipa de răspuns va discuta în mod public problema prin IRC și încearca de a ajunge la consens.

source: If consensus on a timely disclosure is not met (no later than %(limit)s days), the researcher (after %(limit)s days) has every right to expose the vulnerability to the public.
az: Əgər vaxtında açıqlama verməyə dair konsensus (%(limit)sgündən gec olmayaraq) əldə olunmursa, tədqiqatçı (%(limit)sgündən sonra) zəifliyi ictimaiyyətə açıqlamaq hüququna sahibdir.
es: Si no se alcanza un conseso para una divulgación a tiempo (no más tarde de %(limit)s días), el investigador (tras %(limit)s días) está totalmente legitimado para exponer la vulnerabilidad al público.
ro: Dacă nu este îndeplinit consensul privind divulgarea la timp (nu mai târziu de %(limit)s zile), cercetătorul (după %(limit)s zile) are tot dreptul să expună vulnerabilitate pentru public.

source: Incident Analysis
az: Hadisənin təhlili
es: Análisis del incidente
ro: Analiza incidentelor

source: Isolate codebase
az: Kodbazasını ayırın
es: Aislar el código base
ro: Izolați baza de coduri

source: Response Team and developers should coordinate to work on the following:
az: Cavab qrupu və yaradıcılar işləmək üçün aşağıdakı məsələlərlə bağlı koordinasiya etməlidirlər:
es: El equipo de respuesta y los desarrolladores deben coordinarse para trabajar en lo siguiente:
ro: Echipa de răspuns și dezvoltatorii ar trebui să se coordoneze pentru a lucra la următoarele:

source: Problematic implementation of classes/libraries/functions, etc.
az: Siniflərin/ kitabxanaların/funksiyaların və s. problemli tətbiqi
es: Implementaciones problemáticas de clases/librerías/funciones, etc.
ro: Implementarea problematică a claselor / bibliotecilor / funcțiilor etc.

source: Focus on apps/distro packaging, etc.
az: Tətbiqetmə/distro qablaşdırmaya diqqət edin və s.
es: Orientarse al empaquetado de aplicaciones/distribuciones, etc.
ro: Concentrați-vă pe aplicații / ambalaje distro etc.

source: Operator/config error, etc.
az: Operator/quraşdırma xətası və s.
es: Errores de operador/configuración, etc.
ro: Eroare operator / configurare etc.

source: Auditing
az: Təftiş
es: Auditoría
ro: Audit

source: Auditing of problem area(s) as discussed in point 1.
az: 1-ci bənddə qeyd edildiyi kimi problemli sahə(lər)in auditi.
es: Auditado de la(s) área(s) problemáticas tal como se discutió en el punto 1.
ro: Auditarea zonei (zonelor) problemelor descrise la punctul 1.

source: Generate internal reports and store for future reference.
az: Daxili hesabatlar yaradın və gələcək arayış üçün saxlayın.
es: Generar informes internos y almacenarlos para futura referencia.
ro: Generați rapoarte interne și stocați pentru referințe viitoare.

source: If results are not sensitive, share with the public via IRC or public Trac.
az: Nəticələr həssas deyilsə, IRC və ya ictimai Trac vasitəsilə ictimaiyyətlə bölüşün.
es: Si los resultados no son información sensible, compartirlos con el público vía IRC o mediante el Trac público.
ro: Dacă rezultatele nu sunt sensibile, împărtășiți-le publicului prin IRC sau Trac public.

source: Response Team has %(limit)s days following completion of section III to ensure completion of section V.
az: Cavab qrupunun İİİ bölümü bitirdikdən sonra V bölmənin bitməsini təmin etmək üçün %(limit)s günü var.
es: El equipo de respuesta dispone de %(limit)s días tras completar la sección III para asegurar el completado de la sección V.
ro: Echipa de răspuns are %(limit)s zile după finalizarea secțiunii III pentru a se asigura completarea secțiunii V.

source: Resolutions
az: Qərarlar
es: Resoluciones
ro: rezoluţiile

source: Any further questions or resolutions regarding the incident(s) between the researcher and response + development team after public disclosure can be addressed via the following:
az: Tədqiqatçı və cavab + inkişaf qrupu arasında istənilən əlavə suallar və ya hadisə(lər)lə bağlı qərarlar ictimai açıqlamadan sonra növbəti qaydada həll edilə bilər:
es: En relación a el/los incidente(s), cualquier pregunta o resolución adicional entre el investigador y el equipo de respuesta y desarrollo tras la divulgación pública, puede ser abordado mediante lo siguiente:
ro: Orice întrebări sau rezoluții suplimentare privind incidentul (incidentele) dintre cercetător și echipă de răspuns + dezvoltare după divulgarea publică poate fi adresate prin următoarele:

source: Continuous Improvement
az: Davamlı inkişaf
es: Mejora continua
ro: Imbunatatire continua

source: Response Team and developers should hold annual meetings to review the previous year's incidents.
az: Cavab qrupu və yaradıcılar əvvəlki illərin hadisələrini nəzərdən keçirmək üçün illik görüşlər keçirməlidirlər.
es: El equipo de respuesta y los desarrolladores deben mantener reuniones anuales para revisar los incidentes del año anterior.
ro: Echipa de răspuns și dezvoltatorii ar trebui să organizeze întâlniri anuale pentru a revizui cele anterioare incidente de anul.

source: Response Team or designated person(s) should give a brief presentation, including:
az: Cavab qrupu və ya təyin edilmiş şəxs(lər) qısa təqdimat hazırlamalıdır, o cümlədən:
es: El equipo de respuesta o la(s) persona(s) designada(s) debe(n) proporcionar una presentación breve, incluyendo:
ro: Echipa de răspuns sau persoana (persoanele) desemnate (e) ar trebui să prezinte o prezentare succintă, inclusiv:

source: Areas of I2P affected by the incidents.
az: Hadisələrin təsir etdiyi I2P sahələri.
es: Áreas de I2P afectadas por los incidentes.
ro: Zonele I2P afectate de incidente.

source: Any network downtime or monetary cost (if any) of the incidents.
az: Hadisələrin istənilən şəbəkə kəsilməsi və ya (varsa) pul xərcləri.
es: Cualquier periodo de inactividad de la red o coste monetario (en su caso) de los incidentes.
ro: Orice întrerupere a rețelei sau costuri monetare (dacă există) ale incidentelor.

source: Ways in which the incidents could have been avoided (if any).
az: Hadisələrin qarşısını ala biləcək yollar (əgər varsa).
es: Maneras en las que los incidentes podrían haber sido evitados (en su caso).
ro: Modalități în care incidentele ar fi putut fi evitate (dacă există).

source: How effective this process was in dealing with the incidents.
az: Bu proses hadisələrlə mübarizədə nə dərəcədə səmərəli oldu.
es: En qué medida fue efectivo este proceso para encargarse de los incidentes.
ro: Cât de eficient a fost acest proces în tratarea incidentelor.

source: After the presentation, Response Team and developers should discuss:
az: Təqdimatdan sonra cavab qrupu və yaradıcılar müzakirə etməlidirlər:
es: Tras la presentación, el equipo de respuesta y los desarrolladores deben discutir:
ro: După prezentare, echipa de răspuns și dezvoltatorii ar trebui să discute:

source: Potential changes to development processes to reduce future incidents.
az: Gələcək hadisələri azaltmaq üçün inkişaf proseslərinə potensial dəyişikliklər.
es: Cambios potenciales en el desarrollo de procesos para reducir futuros incidentes.
ro: Modificări potențiale ale proceselor de dezvoltare pentru a reduce incidentele viitoare.

source: Potential changes to this process to improve future responses.
az: Gələcək cavabları yaxşılaşdırmaq üçün bu prosesə potensial dəyişikliklər.
es: Cambios potenciales en este proceso para mejorar futuras respuestas.
ro: Modificări potențiale ale acestui proces pentru a îmbunătăți răspunsurile viitoare.

source: Multihoming
az: Çoxsaylı ünvan
es: Alojamiento redundante (multihoming)
zh: 多宿主

source: Email
es: Correo electrónico

source: February 2016
zh: 2016年2月

source: Academic research and analysis of I2P is an important part of ensuring that the software and network performs as expected and is safe for users in hostile environments.
zh: I2P 的学术研究和分析是重要的部分, 这确保软件和网络按预期执行且对在敌对环境中的用户来说是安全的.

source: Testing Attacks on I2P
zh: 攻击测试 I2P

source: I2P can be run as a separate test network by controlling the locations that a new router reseeds from so that it only finds other test routers.
zh: I2P 可以作为一个单独的测试网络运行, 通过控制 新路由器的补种位置,这样它就只会找到其他的测试路由器.

source: The standard mode of operation is to have one JVM per router instance; hence running multiple copies of I2P on a single machine is inadvisable, both due to the potential resource drain and the certain port conflicts. To better facilitate setting up small test networks, I2P has a multirouter mode which enables multiple distinct routers to be run in the same JVM.
zh: 运作的标准模式是每个路由器实例有一个JVM ；因此在一台机器上运行 I2P 的多个副本是不可取的,既由于潜在资源的流失又由于某些端口冲突。为更好地的方便设置小测试网络，I2P 有一个 multirouter 模式，它可以让多个不同路由器在同一个 JVM 中运行.

source: MultiRouter can be started from the i2p base directory by running the below command.
zh: 起动MultiRouter, 可以在 i2p 基目录通过运行以下命令.

source: Additionally, I2P can be started in a virtual network mode. This mode disables all transports, allowing the router to be tested in isolation without network traffic. To enable this mode, add <code>i2p.vmCommSystem=true</code> to the router.config before starting.
zh: 此外，I2P 可以在虚拟网络模式下起动。这种模式下禁用所有传输，允许路由器在没有网络交通流量下进行隔离测试。要启用此模式，在起动前，向 router.config 添加<code>i2p.vmCommSystem=true</code>.

source: Testing the Live I2P Network
zh: 测试在线的 I2P 网络

source: If you are planning on conducting research on the live I2P network, please <a href="%(contact)s">contact us</a> before you commence your testing. While we do not discourage researchers from responsibly testing their ideas on the live network, if an attack becomes apparent and we don't have any line of communication then we will end up taking countermeasures which could interfere with the test.
zh: 如果你打算调查研究目前在线的 I2P 网络，请在着手你的测试前<a href="%(contact)s">联络我们</a>。虽然我们不阻挠研究员负责任地测试在线的 I2P 网络，但如果没有收到任何联络通知并且攻击性很明显，我们可能采取相应的对策，可能干扰到“测试”行动。
