{% extends "_layout.html" %}
{% block title %}T&eacute;l&eacute;chargements{% endblock %}
{% block content %}
<h1>T&eacute;l&eacute;charger I2P</h1>      
<h3>Pr&eacute;requis</h3>
Java Runtime 1.5 ou plus r&eacute;cent.
(<a href="http://java.com/download/">Oracle/Sun Java Version 6</a>,
<a href="http://openjdk.java.net/install/">OpenJDK 6</a>, ou
<a href="http://icedtea.classpath.org/wiki/Main_Page">IcedTea6</a>
 recommand&eacute;)
<br>
<a href="http://java.com/en/download/installed.jsp?detect=jre&try=1">D&eacute;terminez la version de Java install&eacute;e</a>
ou tapez <tt>java -version</tt> &agrave; l'invite de commande.
<h3>Installation initiale</h3>
<ul class="downloadlist">
<li>Installeur graphique:<br />
    <a href="http://mirror.i2p2.de/i2pinstall_0.8.3.exe">i2pinstall_0.8.3.exe</a>
    (SHA256
91207badb1f6fbcb90398f77eca6a59b3e7ac7aa1d16d5e9d57cd3037aa004c5
    <a href="http://mirror.i2p2.de/i2pinstall_0.8.3.exe.sig">sig</a>)<br /> 
    T&eacute;l&eacute;chargez ce fichier et ex&eacute;cutez-le.  Si vous n'&ecirc;tes pas sur Windows, vous pouvez 
    taper <code>java -jar i2pinstall_0.8.3.exe</code> (non, &ccedil;a n'est pas une blague!)</li>
<li>Installation en ligne de commande (facile):<br />
    T&eacute;l&eacute;chargez le fichier de l'installeur graphique ci-dessus et
    ex&eacute;cutez <code>java -jar i2pinstall_0.8.3.exe -console</code> sur la ligne de commande.
    &Ccedil;a marche sous Windows, Linux, et Mac (vraiment).
</li>
<li>&Agrave; partir des sources:<br />
    <a href="http://mirror.i2p2.de/i2psource_0.8.3.tar.bz2">i2psource_0.8.3.tar.bz2</a>
    (SHA256
4f57e252af52bf7c1ed1b95e08f41636e8cd1b5095d1643f6bf44e5d6e95ae4d
     <a href="http://mirror.i2p2.de/i2psource_0.8.3.tar.bz2.sig">sig</a>)<br />
    Vous pouvez si vous pr&eacute;f&eacute;rez r&eacute;cup&eacute;rer les sources sur  <a href="newdevelopers">monotone</a>.
    <br/>
    Ex&eacute;cuter <code>(tar xjvf i2psource_0.8.3.tar.bz2 ; cd i2p-0.8.3 ; ant pkg)</code> puis, soit
    lancer l'installeur graphique, soit passer par la ligne de commande.</li>
</ul>

Les fichiers sont sign&eacute;s par zzz, 
<a href="release-signing-key.html">dont la signature est ici</a>.

<h3>Apr&egrave;s l'installation</h3>

<p>Sous Windows, une fois l'installation effectu&eacute;e, cliquez tout simplement sur l'ic&ocirc;ne "Start I2P". Ceci lance le 
routeur I2P et vous pr&eacute;sente la page web de <a href="http://localhost:7657/index.jsp">gestion du router</a> (dite console),
 qui affiche plus d'instructions.</p>

<p>Sur les syst&egrave;mes de style Unix, I2P peut &ecirc;tre lanc&eacute; en tant que service en utilisant le script
"i2prouter", situ&eacute; dans le r&eacute;pertoire que vous avez choisi pour installer I2P.
Rendez-vous dans ce r&eacute;pertoire par un terminal et lancez la commande "sh i2prouter status" qui vous 
indiquera l'&eacute;tat du routeur. Les arguments "start", "stop" et "restart" contr&ocirc;lent le service.
La <a href="http://localhost:7657/index.jsp">console</a> est accessible &agrave; son emplacement habituel.
Pour les utilisateurs de OpenSolaris et autres syst&egrave;mes sur lesquels l'interface syst&egrave;me (le wrapper i2psvc) n'est
 pas support&eacute;, lancez le routeur avec la commande "sh runplain.sh".
</p>

<p>Apr&egrave;s l'installation initiale, pensez &agrave; <b>r&eacute;gler votre NAT et/ou pare-feu</b> si vous pouvez,
 en gardant &agrave; l'esprit les ports tourn&eacute;s vers Internet qu'I2P utilise,
<a href="faq#ports">d&eacute;crits ici</a> parmi les autres.
Quand vous aurez ouvert votre port d'entr&eacute;e TCP d&eacute;di&eacute; &agrave; I2P, activez alors les connexions entrantes TCP dans la 
<a href="http://localhost:7657/config.jsp">page de configuration</a>.
</p>

<p>R&eacute;glez aussi votre <b>bande passante</b> sur la 
<a href="http://localhost:7657/config.jsp">page de configuration</a>, 
car les r&eacute;glages de base  (96 ko/s entrants et 40 ko/s) sont volontairement tr&egrave;s faibles.
</p>

<p>
Si vous voulez acc&eacute;der aux sites eep avec votre navigateur, consultez la page <a href="htproxyports.html">r&eacute;glage du proxy du navigateur</a> pour des instructions simples
 (mais si vous &ecirc;tes en train de lire ceci, c'est que vous avez d&eacute;j&agrave; trouv&eacute; cette information ailleurs, p.e. sur une page du web classique).
</p>

<h3>Mises &agrave; jour d'anciennes versions:</h3>
<p>
Les mises &agrave; jour automatiques et manuelles sont possibles.
</p><p>
Si vous &ecirc;tes en v0.7.5 ou ult&eacute;rieure, votre routeur doit d&eacute;tecter la nouvelle version.
 Pour mettre &agrave; jour, cliquez le lien ...'Mettre &agrave; jour' en haut de la console lors qu'il appara&icirc;t.
</p><p>
En raison d'un bug dans la v0.7.6, si c'&eacute;tait votre installation initiale et que vous n'avez pas fait une mise &agrave; jour manuelle, 
 vous recevrez un message d'erreur "La version t&eacute;l&eacute;charg&eacute;e n'est pas plus r&eacute;cente que l'actuelle" 
("downloaded version is not greater than current version"). Il vous faudra suivre la m&eacute;thode manuelle d&eacute;crite ci-dessous.
</p><p>
Si vous &ecirc;tes en v0.7.4 ou ant&eacute;rieure, merci de voir <a href=release-0.7.5.html>les notes de version de la v0.7.5</a>
 pour une importante information concernant la configuration du routeur en vue de la r&eacute;ception automatique de 
la derni&egrave;re version.
</p><p>
Si vous &ecirc;tes en v0.6.1.30 ou ant&eacute;rieure, voyez dans ces <a href=upgrade-0.6.1.30.html>instructions</a> comment configurer
 le routeur en vue de la r&eacute;ception automatique de la derni&egrave;re version.
</p>

<ol>
<li>Si vous avez reconfigur&eacute; votre routeur suivant ces <a href=upgrade-0.6.1.30.html>instructions</a>, vous devriez y voir un lien 
 dans la <a href="http://localhost:7657/index.jsp">console de gestion</a> vous permettant simplement en y cliquant dessus
 de t&eacute;l&eacute;charger et d'installer la derni&egrave;re version.</li>
<li>Vous pouvez &eacute;galement utiliser la m&eacute;thode manuelle d&eacute;crite ci-dessous.</li>
</ol>

<h3>Mises &agrave; jour de versions plus anciennes (m&eacute;thode manuelle):</h3>
<ol>
<li>T&eacute;l&eacute;chargez <a href="http://mirror.i2p2.de/i2pupdate_0.8.3.zip">i2pupdate_0.8.3.zip</a>
    (SHA256
102ab3acfe4f95c1bdd12518788393f533e0c18291dddf8d1938c3d9eb05318c
     <a href="http://mirror.i2p2.de/i2pupdate_0.8.3.zip.sig">sig</a>) dans votre r&eacute;pertoire d'installation d'I2P 
    et <b>renommez-le i2pupdate.zip</b>.
    (sinon, prenez les sources - voir plus haut - et lancez "ant updater", puis copiez/d&eacute;placez le i2pupdate.zip g&eacute;n&eacute;r&eacute; 
 vers votre r&eacute;pertoire d'installation d'I2P). Il n'est pas n&eacute;cessaire de d&eacute;compresser ce fichier.</li>
<li>Cliquez sur <a href="http://localhost:7657/configservice.jsp">"R&eacute;d&eacute;marrage respectueux"</a>,</li> 
<li>servez-vous un caf&eacute; et revenez dans 11 minutes</li>
</ol>

Le fichier est sign&eacute; par zzz,
<a href="release-signing-key.html">dont la signature est ici</a>.

{% endblock %}
