<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>


<body>

{% extends "_layout_fr.html" %}
{% block title %}FAQ{% endblock %}
{% block content %}
<h1>I2P - Foire aux questions</h1>

<h3 id="bug">Je pense avoir trouv&eacute; un bug, comment vous en faire part ?
<span class="permalink">(<a href="#bug">lien</a>)</span></h3>


<p>
Voici les endroits ou vous pouvez le faire, utilisez en un ou plus :
</p>

<ul>


  <li><a href="http://trac.i2p2.i2p/newticket">trac.i2p2.i2p</a> ticket
  </li>

  <li><a href="http://forum.i2p/viewforum.php?f=10">forum.i2p</a>
  </li>

  <li><a href="http://paste.i2p2.i2p/">paste.i2p2.i2p</a> et suivez le sur IRC #i2p
  </li>

  <li>Discutez avec les d&eacute;veloppeurs d'I2P sur IRC #i2p
  </li>

</ul>


<p></p>


<p>
Merci d'inclure dans tout rapport de bug toute information pertinente sur le routeur et sur les logs.
</p>



<h3 id="subscriptions">Il me manque beaucoup d'h&ocirc;tes dans mon fichier d'adresses (addressbook). Quels sont les bons fichiers de souscription ?
<span class="permalink">(<a href="#subscriptions">liens</a>)</span></h3>


<p>La souscription par d&eacute;faut est http://www.i2p.i2p/hosts.txt
qui est rarement mis &agrave; jour.
Si vous n'avez pas d'autres souscriptions, vous aurez souvent &agrave;
utiliser un service de saut 'jump' ce qui se r&eacute;v&egrave;lera
fastidieux.
</p>

<p>Vous trouverez ci dessous d'autres liens de souscription publics, vous devriez en ajouter un ou deux
&agrave; votre <a href="http://localhost:7657/susidns/subscriptions.jsp">susidns souscriptions listes</a>.
Vous n'avez pas besoin de toutes les ajouter, elles se synchronisent ensembles r&eacute;guli&egrave;rement.
Les liens utilisent un logiciel cgi-bin qui emploie diverses strat&eacute;gies pour minimiser 
le nombre d'adresses identiques qui sont d&eacute;livr&eacute;es, ils doivent se r&eacute;v&eacute;ler plus efficaces.
IMPORTANT : accepter une liste d'h&ocirc;tes est un acte de confiance. Un acte malveillant pourrait vous donner 
de fausses adresses, donc r&eacute;fl&eacute;chissez avant d'accepter.
La pr&eacute;sence sur cette liste ne signifie pas l'aval d'I2P.
</p>

<div class="links">
<ul>


  <li><a href="http://i2host.i2p/cgi-bin/i2hostetag">http://i2host.i2p/cgi-bin/i2hostetag</a>
  </li>

  <li><a href="http://stats.i2p/cgi-bin/newhosts.txt">http://stats.i2p/cgi-bin/newhosts.txt</a>
  </li>

  <li><a href="http://tino.i2p/hosts.txt">http://tino.i2p/hosts.txt</a>
  </li>

</ul>


</div>


<p></p>



<h3 id="jrandom">
Qu'est il arriv&eacute; &agrave; *.i2p.net ? Qu'est il arriv&eacute; &agrave; jrandom ? Est ce qu'I2P est mort ?
<span class="permalink">(<a href="#jrandom">lien</a>)</span></h3>


<p>
Jrandom &eacute;tait le d&eacute;veloppeur responsable d'I2P et de <a href="http://syndie.i2p2.de/">Syndie</a> pendant de nombreuses ann&eacute;es.
Les domaines *.i2p.net sont rest&eacute; non fonctionnels suite &agrave; une panne de l'h&eacute;bergement.
</p>

<p>
Regardez <a href="jrandom-awol.html">cette page (en englais)</a> pour avoir plus d'informations sur le d&eacute;part de Jrandom et la migration des sites vers
<a href="index.html">celui ci</a>.
</p>

<p>
I2P n'est pas mort, il est en d&eacute;veloppement actif et nous avons anticip&eacute; plusieurs versions en&nbsp;2010.
</p>



<h3 id="CPU">Mon routeur consomme trop de ressources processeur&nbsp;!
<span class="permalink">(<a href="#CPU">lien</a>)</span></h3>


<p>
Il y a plusieurs causes &agrave; une&nbsp;charge excessive du processeur. En voici quelques unes :
</p>

<ul>


  <li>
Utilisez vous Java de Sun ou une autre version ? (tapez la commande java -version dans une console pour le savoir).
Nous avons plusieurs retours concernant une grande charge processeur lorsqu'on utilise d'autres versions de Java.
  </li>

  <li>Si vous utilisez un client bittorent avec I2P (Vuze, ...), vous
pouvez tenter de baisser le nombres de torrent simultan&eacute;s ou
bien&nbsp;le couper compl&egrave;tement pour surveiller si la charge
diminue.
  </li>

  <li>
Est ce que votre r&eacute;glage de bande passante n'est pas trop haut ? Trop de trafic rout&eacute;
&agrave; travers votre pc peut charger le processeur.
Essayez dans ce cas de r&eacute;duire la bande passante partag&eacute;e dans la config.
  </li>

  <li>Pensez &agrave; mettre I2P &agrave; jour &agrave; chaque nouvelle
version, chaque version apporte son lot de nouveaut&eacute;es et
augmente les performance du logiciel. Les bugs rapport&eacute;s sont
aussi corrig&eacute;s.
  </li>

  <li>Avez vous configur&eacute; avec suffisament de m&eacute;moire ?
Regardez le graphique m&eacute;moire sur "graphs.jsp" pour voir si
l'utilisation m&eacute;moire est coinc&eacute;e en charge maximum, ce
qui sous entends que JVM passe sont temps &agrave; faire le "ramasse
miettes" ou "garbage collector - gc -".
Dans ce cas, augmentez le param&egrave;tre "wrapper.java.maxmemory"
dans "wrapper.config" </li>

  <li>
La charge du CPU est seuleument plus haute que ce que vous attendez ou il reste longtemps &agrave; 100% de charge ?
Si il est en charge souvent c'est peut &ecirc;tre un bug, cherchez des informations pouvant le confirmer dans les logs.
  </li>

  <li>Vous devriez peut &ecirc;tre utiliser la "Java-based BigInterger
library" &agrave; la place de celle install&eacute;e en natif surtout
si
vous utilisez un nouveau syst&egrave;me d'exploitation ou bien un
nouveau mat&eacute;riel (64 bits, os X, opensolaris etc.)
Voir la page de <a href="jbigi.html">jbigi</a> pour avoir des informations sur les mani&egrave;res de construire, tester et diagnostiquer.
  </li>

  <li>
If your native jbigi library is working fine, the biggest user of
CPU may be routing traffic for participating tunnels. This uses CPU
because at each hop a layer of encryption must be decoded.
You can limit participating traffic in two ways - by reducing the
share bandwidth on
    <a href="http://localhost:7657/config.jsp">config.jsp</a>,
or by setting <tt>router.maxParticipatingTunnels=nnn</tt> on
    <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a>.
  </li>

</ul>



<h3 id="content">Je m'oppose &agrave; certains types de contenus.
Comment ne pas les relayer, ne pas les d&eacute;tenir, ne pas y
acc&eacute;der ?
<span class="permalink">(<a href="#content">link</a>)</span></h3>


<p>
Hem. I2P &eacute;tant un r&eacute;seau anonyme, c'est une question d&eacute;licate.
I2P est con&ccedil;u pour tout le monde, pas pour censurer tel ou tel type de donn&eacute;es.
Le meilleur moyen de de pr&eacute;server votre ordinateur du trafic que vous n'aimez pas, c'est de ne pas utiliser I2P..
La libert&eacute; d'expression a un prix.
Mais voyons votre question en trois points:
</p>

<ul>


  <li><b>Diffusion</b> - Le trafic sous I2P est crypt&eacute; dans
plusieurs couches. Vous ne connaissez ni le contenu, ni
l'&eacute;metteur, ni le destinatiare d'un message.
Tout le trafic que vous relayez est interne au r&eacute;seau i2P, vous
n'&ecirc;tes pas un diffuseur (<a href="#exit">exit node</a>).
La seule alternative serait de refuser 
    <i>tout</i> trafic, en mettant &agrave; z&eacute;ro la bande passante partag&eacute;e ou les tunnels participants (voir ci-dessus).
Cela serait sympathique de ne pas le faire, et d'aider le r&eacute;seau en relayant le trafic des autres participants.
Plus de 95% des participants relaient du trafic pour les autres.
  </li>

  <li><b>D&eacute;tention</b> - I2P ne fait pas dans la distribution de contenu. Vous devez confondre avec
    <a href="http://freenetproject.org/">Freenet</a>.
Vous ne d&eacute;tenez pas le contenu de quelqu'un d'autre.
  </li>

  <li><b>Acc&egrave;s</b> - S'il y a des sites que vous n'aimez pas, n'y allez pas..
Ou utilisez un filtre comme Privoxy ou autre "nounou" de r&eacute;seau.
  </li>

</ul>


<p></p>



<h3 id="vary">Mes pairs actifs et connus, mes tunnels participants, mes
connexions et ma bande passante varient consid&eacute;rablement dans le
temps ! Est ce normal ?
<span class="permalink">(<a href="#vary">link</a>)</span></h3>


<p>Oui. Tous les routers s'adaptent en dynamique aux conditions et aux demandes changeantes du r&eacute;seau.
</p>



<h3 id="reseed">Mon routeur est lanc&eacute; depuis plusieurs minutes et a z&eacute;ro ou tr&egrave;s peu de connexions.
<span class="permalink">(<a href="#reseed">link</a>)</span></h3>


<p>L'URL de&nbsp;reseed a chang&eacute;. Si c'est votre premi&egrave;re
installation d'une vieille version (0.6.1.30 ou
pr&eacute;c&eacute;dente), ou si vous n'avez pas ex&eacute;cut&eacute;
I2P depuis longtemps, vous devez changer l'URL et cliquer sur "Reseed"
sur la console pour trouver d'autres routeurs. Une fois le routeur
lanc&eacute;, ajouter sur <a href="http://localhost:7657/configadvanced.jsp">configadvanced.jsp</a> la ligne : <tt>i2p.reseedURL=http://netdb.i2p2.de/</tt>
   OR <tt>i2p.reseedURL=http://i2pdb.tin0.de/netDb/</tt> (les deux doivent marcher),
   puis cliquer sur "Apply", puis cliquer sur le lien "reseed" &agrave; gauche.
</p>

<p>Cela marche si vous &ecirc;tes sous la version 0.6.1.27 ou suivante.
Si vous &ecirc;tes sous la version 0.6.1.31 ou suivante, vous n'avez
probablement pas besoin de faire cela. Si vous &ecirc;tes sous la
version 0.6.1.26 ou pr&eacute;c&eacute;dente, suivez le <a href="#manual_reseed">manual reseed instructions</a> ou installez la derni&egrave;re version (<a href="download.html">latest release</a>).
</p>



<h3 id="peers">Mon routeur a tr&egrave;s peu de pairs, est-ce normal ?
<span class="permalink">(<a href="#peers">link</a>)</span></h3>


<p>Oui s'il en a 10 ou plus. Les &eacute;volutions des versions
0.6.1.31 et 0.6.1.32 ont am&eacute;lior&eacute; l'efficacit&eacute; des
routeurs et r&eacute;duit de fait le nombre de pairs actifs.
Le routeur <span style="font-style: italic;">doit</span> maintenir
des connexions avec quelques pairs &agrave; tout moment. Le meilleur
moyen pour &ecirc;tre "mieux connect&eacute;" est de partager plus de
bande passante.
</p>



<h3 id="exit">Mon routeur est-il un "noeud sortant" vers l'internet normal ? Je ne le souhaite pas.&nbsp;
<span class="permalink">(<a href="#exit">link</a>)</span></h3>


<p>
   Non. Contrairement &agrave;&nbsp;<a href="http://www.torproject.org/">Tor</a>,
les "noeuds sortants" et les "outproxies" ne font pas partie
int&eacute;grante du r&eacute;seau. Seuls les volontaires qui
installent et ex&eacute;cutent des applications s&eacute;par&eacute;es
peuvent relayer du trafic vers l'internet normal. Il y en a tr&egrave;s
peu.
</p>



<h3 id="outproxy">Je ne peux pas acc&eacute;der aux sites de l'internet normal sous I2P.
<span class="permalink">(<a href="#outproxy">link</a>)</span></h3>


<p> Voir ci-dessus. Il y a tr&egrave;s peu de "Outproxies" HTTP, ils ne
font pas partie int&eacute;grante du r&eacute;seau et peuvent ne pas
&ecirc;tre &agrave; jour. De plus, les anciens proxies&nbsp;squid.i2p,
true.i2p, and krabs.i2p ont disparu. Le seul outproxy actuel est
false.i2p. Pour l'utiliser, &eacute;ditez les param&egrave;tres&nbsp;<a href="http://localhost:7657/i2ptunnel/edit.jsp?tunnel=0">i2ptunnel settings for eepProxy</a>
et param&eacute;trez votre liste de outproxy &agrave; 'false.i2p'
(seulement). Puis arr&eacute;tez et red&eacute;marrez l'eepProxy. Si
cela ne marche pas, l'outproxy n'est pas &agrave; jour. Ce n'est pas la
faute de I2P. Si votre motivation principale est d'acc&eacute;der
anonymement aux sites de l'internet normal, le mieux est
d'essayer&nbsp; <a href="http://www.torproject.org/">Tor</a>.
</p>



<h3 id="https">Je ne peux pas acc&eacute;der aux sites https:// et ftp:// sous I2P.
<span class="permalink">(<a href="#https">link</a>)</span></h3>


<p>Sous I2P, pas besoin de HTTPS car tout le trafic est crypt&eacute;
de bout en bout. Le FTP n'est pas maintenu, pour des raisons
techniques.
</p>

<p>Aucun "outproxy" HTTPS ni FTP n'est maintenu pour les acc&egrave;s
HTTPS et FTP sur l'internet normal. Le HTTPS est possible, si quelqu'un
veut bien s'en occuper. Le FTP ne l'est probablement pas. En fait,
&agrave; peu pr&egrave;s n'importe quel outproxy pourrait marcher,
essayez d'en monter un avec un tunnel standard, et voyez ce que cela
donne. Comme vu plus haut, les diff&eacute;rents types de "outproxy" ne
font pas partie int&eacute;grante du r&eacute;seau, ce sont des
services ex&eacute;cut&eacute;s par des particuliers et ils peuvent
&ecirc;tre&nbsp;op&eacute;rationnels ou non &agrave; un moment
donn&eacute;. Si vous voulez monter un "outproxy", renseignez-vous bien
sur les risques potentiels. La communaut&eacute; I2P pourra ou non vous
aider sur les aspects techniques, n'h&eacute;sitez pas &agrave; la
solliciter.
</p>



<h3 id="proxy_safe">Est-ce qu'un "Outproxy" est s&ucirc;r ?
<span class="permalink">(<a href="#proxy_safe">link</a>)</span></h3>


<p>A vous de voir. Cela d&eacute;pend de ce que vous faites, de votre strat&eacute;gie de d&eacute;fense (<a href="how_threatmodel.html">threat model)</a> et de votre degr&eacute; de confiance vis &agrave; vis de votre op&eacute;rateur&nbsp;"Outproxy".
</p>

<p>Comme Tor, I2P ne crypte pas l'internet d'un coup de baguette
magique. Vous vous exposez d&egrave;s lors &agrave;
l'indiscr&eacute;tion de l'op&eacute;rateur "Outproxy". La Foire Aux
Questions de Tor explique cela tr&egrave;s bien (<a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers">Tor FAQ</a>
). Il n'y a pas d'"Outproxy" HTTPS avec I2P, et vous ne pouvez pas
dissimuler votre trafic &agrave; un op&eacute;rateur HTTP en
"Outproxy".
</p>

<p>De plus, vous vous exposez &agrave; des collusions entre un
op&eacute;rateur "Outproxy" et des op&eacute;rateurs d'autres services
I2P si vous passez par les m&ecirc;mes tunnels ("shared clients"). Une
discussion sur le sujet est disponible sur <a href="http://zzz.i2p/topics/217">zzz.i2p</a>.
</p>



<h3 id="proxy_other">Comment acc&eacute;der aux "chats", torrents, et autres services de l'internet normal&nbsp;?
<span class="permalink">(<a href="#proxy_other">link</a>)</span></h3>


<p> On ne peut pas. Il faut monter un "Outproxy" pour chacun des
services. Il n'y a que deux types de "Outproxy" en service en ce moment
: HTTP et E-mail. Il n'y a pas de "Outproxy" SOCKS. En cas de besoin,
essayez <a href="http://www.torproject.org/">Tor</a>.
</p>



<h3 id="down">La plupart des eepsites sont hors-service ?
<span class="permalink">(<a href="#down">link</a>)</span></h3>


<p>Si l'on consid&egrave;re tous les sites cr&eacute;&eacute;s, oui, la
plupart d'entre-eux sont hors-service. Les gens, les eepsites vont et
viennent. Un bon moyen de d&eacute;marrer avec I2P est de
v&eacute;rifier une liste des eepsites en service. <a href="http://inproxy.tino.i2p/status.php">inproxy.tino.i2p</a> et
   <a href="http://perv.i2p/stats.cgi">perv.i2p</a> recensent les eepsites actifs.
</p>



<h3 id="myeepsite">Comment monter mon propre eepsite ?
<span class="permalink">(<a href="#myeepsite">link</a>)</span></h3>


<p>Cliquer sur "Serveur Web" (<a href="http://localhost:7658/">My Eepsite Link)</a>
   en haut &agrave; gauche de votre console pour les instructions.
</p>



<h3 id="slow">Pourquoi I2P est-il si lent?
<span class="permalink">(<a href="#slow">link</a>)</span></h3>


<p>Pourquoi les t&eacute;l&eacute;chargements, le surf et le reste sont-ils si lents sur I2P ?
Le cryptage et le routage dans le r&eacute;seau I2P&nbsp;chargent la barque et limitent la bande passante. L'anonymat a un prix.
</p>


<p>De plus tout le monde a probablement besoin d'accro&icirc;tre sa bande passante.
Les deux param&eacute;trages-cl&eacute;s sont les limiteurs de bande passante entrante et sortante sur&nbsp;
<a href="http://localhost:7657/config.jsp">the configuration page</a>.
Augmenter les param&egrave;tres (en restant &nbsp;dans les limites de votre connexion r&eacute;elle)
augmentera le taux de transfert potentiel dans I2P SNark et toutes les autres applications.
</p>

<p>De m&ecirc;me, avez-vous partag&eacute; suffisamment de bande
passante pour permettre aux tunnels participants de transiter par votre
routeur ? Croyez-le ou non, autoriser du trafic vous maintient bien
int&eacute;gr&eacute; dans le r&eacute;seau et contribue &agrave; votre
propre vitesse de transfert.
</p>

<p>I2P est un chantier en travaux. Nombre d'am&eacute;liorations et de
corrections sont apport&eacute;es, et de mani&egrave;re
g&eacute;n&eacute;rale l'utilisation de la derni&egrave;re version
contribuera &agrave; votre performance. Si vous ne l'avez pas,
installez l&agrave;&nbsp;&nbsp;<a href="download.html">ici</a>.
</p>



<h3 id="snark">Des question sur Bittorrent / I2PSnark / Azureus I2P Plugin&nbsp;?
<span class="permalink">(<a href="#snark">link</a>)</span></h3>


<p>Voir <a href="http://forum.i2p/viewtopic.php?t=2068">I2P Bittorrent FAQ</a>
<a href="http://forum.i2p2.de/viewtopic.php?t=2068">(outside I2P)</a>

</p>

<h3 id="irc">Comment "chatter" dans I2P?
<span class="permalink">(<a href="#irc">link</a>)</span></h3>


<p>Sur <a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel configuration page</a>, d&eacute;marrez ircProxy.
Puis dites &agrave; votre client IRC de se connecter au port 6668.

</p>

<h3 id="remote_webconsole">Comment se connecter &agrave; &agrave; la console depuis mes autres machines ou la prot&eacute;ger par mot de passe ?
<span class="permalink">(<a href="#remote_webconsole">link</a>)</span></h3>


<p> Pour des raisons de s&eacute;curit&eacute;, la console
d'administration n'&eacute;coute par d&eacute;faut que les connexions
de l'interface locale. Toutefois, avec un petit peu de piratage vous
pouvez lza rendre accessible &agrave; distance.
</p>



<ol>


  <li>Ouvrir clients.config et remplacer<br>


    <code>clientApp.0.args=7657 127.0.0.1 ./webapps/</code><br>


    par <br>


    <code>clientApp.0.args=7657 0.0.0.0 ./webapps/</code></li>


  <li>Aller sur <a href="http://localhost:7657/configadvanced.jsp">http://localhost:7657/configadvanced.jsp</a> et ajouter une option: <code>consolePassword=foo</code> (ou le mot de passe que vous voulez)</li>


  <li>Aller sur <a href="http://localhost:7657/index.jsp">http://localhost:7657/index.jsp</a> et choisir "Red&eacute;marrer", ce qui relance la JVM et recharge les applications client</li>


</ol>



<p>Apr&egrave;s cela, vous devez maintenant pouvoir acc&eacute;der
&agrave; votre console &agrave; distance. On vous demandera un nom
d'utilisateur et un mot de passe - le nom d'utilisateur est "admin" et
le mot de passe celui que vous avez d&eacute;fini &agrave;
l'&eacute;tape 2 ci-dessus. NB : le <code>0.0.0.0</code> d&eacute;finit une <i>interface</i>, pas un r&eacute;seau ou un masque de r&eacute;seau.  0.0.0.0
    signifie "lien avec toutes les interfaces", donc joignable &agrave; 127.0.0.1:7657 ou n'importe quelle IP LAN/WAN.
</p>



<h3 id="remote_i2cp">Comment utiliser des applications depuis mes autres machines&nbsp;?
<span class="permalink">(<a href="#remote_i2cp">link</a>)</span></h3>


<p>L'interface du routeur I2P (port 7654) pointe par d&eacute;faut sur
l'adresse 127.0.0.1. Pour pointer sur 0.0.0.0, param&eacute;trez
l'option de configuration avanc&eacute;e du routeur <tt>i2cp.tcp.bindAllInterfaces=true</tt> et r&eacute;d&eacute;marrez.
</p>



<h3 id="eepsite">Qu'est ce qu'un "eepsite"?
<span class="permalink">(<a href="#eepsite">link</a>)</span></h3>


<p>Un eepsite est un site internet h&eacute;berg&eacute; anonymement -
vous pouvez y acc&eacute;der en param&eacute;trant le proxy HTTP de
votre navigateur, typiquement sur le localhost (ex. 127.0.0.1) port
4444, et en surfant sur le site.
</p>



<h3 id="active">Que signifient les nombres Actifs x/y dans la console ?
<span class="permalink">(<a href="#active">link</a>)</span></h3>


<p> x repr&eacute;sente le nombre de pairs ayant re&ccedil;u ou
envoy&eacute; des messages depuis une minute, y le nombre de pairs vus
depuis environ une heure.
</p>



<h3 id="socks">Est il possible d'utiliser I2P comme un proxy SOCKS ?
<span class="permalink">(<a href="#socks">link</a>)</span></h3>


<p>
    The SOCKS proxy is working as of release 0.7.1. SOCKS 4/4a/5 are supported.
    There is no SOCKS outproxy so it is of limited use.
</p>

<p>
    In addition, many applications leak sensitive
    information that could identify you on the internet. I2P only filters
    connection data, but if the programme you intend to run sends this
    information as content, I2P has no way to protect your anonymity.  For
    example, some mail applications will send the IP address of the machine
    they are running on to a mail server. There is no way for I2P to filter
    this, thus using I2P to 'socksify' existing applications is possible, but
    extremely dangerous.
</p>

<p>
    If you would like more information on the socks proxy application anyway,
    there are some helpful hints on the <a href="socks.html">socks page</a>.
</p>



<h3 id="ports">Quels ports utilise I2P ?
<span class="permalink">(<a href="#ports">link</a>)</span></h3>


<p>
	D'accord, c'est parti pour la liste des ports par d&eacute;faut (tout est configurable bien sur) :
</p>

  Internet-facing ports
<ul>
  <li><b></b>
		
    
    <ul>


		<li><b>Outbound UDP from randomized port to arbitrary remote UDP ports, allowing replies</b></li>


		<li><b>Outbound TCP from random high ports to arbitrary remote TCP ports</b><br>


			By default, I2P does not listen for inbound TCP connections.<br>


			To start accepting them, you can either tell I2P to autodetect its address and port<br>


			using the UDP transport, or you can manually enter an IP address (or DNS name)<br>


			and a TCP port. You can activate this feature on the Configuration page.</li>


		<li><b>Outbound UDP on port 123, allowing replies</b><br>


			This is necessary for I2P's internal time sync (via SNTP - 
			querying a random SNTP host in pool.ntp.org or another
			server you specify)</li>


		
    
    </ul>


		</li>


	
  
</ul>



	
<ul>

  
  <p>
		</p>

  <li><b>Local I2P ports</b>, listening only to local connections by default,
                       except where noted:
		
    
    <ul>


			<li><b>1900:</b> UPnP SSDP UDP multicast listener.
                            <i>Cannot be changed. Binds to all interfaces.
                            May be disabled on <a href="http://localhost:7657/config.jsp">config.jsp</a>.
                            </i></li>


			<li><b>2827:</b> BOB bridge, a higher level socket API for clients
                            <i>Disabled by default.
                               May be enabled/disabled on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.
                               May be changed in the bob.config file.
                            </i></li>


			<li><b>4444:</b> HTTP proxy
                            <i>May be disabled or changed on the i2ptunnel page in the router console.
                            </i></li>


			<li><b>6668:</b> IRC proxy
                            <i>May be disabled or changed on the i2ptunnel page in the router console.
                            </i></li>


			<li><b>7652:</b> UPnP HTTP TCP event listener.
                            <i>Binds to the LAN address.
                            May be changed with advanced config i2np.upnp.HTTPPort=nnnn.
                            May be disabled on <a href="http://localhost:7657/config.jsp">config.jsp</a>.
                            </i></li>


			<li><b>7653:</b> UPnP SSDP UDP search response listener.
                            <i>Binds to all interfaces.
                            May be changed with advanced config i2np.upnp.SSDPPort=nnnn.
                            May be disabled on <a href="http://localhost:7657/config.jsp">config.jsp</a>.
                            </i></li>


			<li><b>7654:</b> I2P Client Protocol port, used by client apps.
                            <i>May be changed with the advanced configuration option</i> <tt>i2cp.port</tt>
                            <i>but this is not recommended.
                            </i></li>


			<li><b>7655:</b> UDP for SAM bridge, a higher level socket API for clients
                            <i>Only opened when a SAM V3 client requests a UDP session.
                               May be enabled/disabled on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.
                               May be changed in the clients.config file with the SAM command line option sam.udp.port=nnnn.
                            </i></li>


			<li><b>7656:</b> SAM bridge, a higher level socket API for clients
                            <i>Disabled by default for new installs as of release 0.6.5.
                               May be enabled/disabled on <a href="http://localhost:7657/configclients.jsp">configclients.jsp</a>.
                               May be changed in the clients.config file.
                            </i></li>


			<li><b>7657:</b> Your router console
                            <i>May be changed in the clients.config file</i></li>


			<li><b>7658:</b> Your eepsite
                            <i>May be disabled in the clients.config file</i></li>


			<li><b>7659:</b> Outgoing mail to smtp.postman.i2p
                            <i>May be disabled or changed on the i2ptunnel page in the router console.
                            </i></li>


			<li><b>7660:</b> Incoming mail from pop.postman.i2p
                            <i>May be disabled or changed on the i2ptunnel page in the router console.
                            </i></li>


			<li><b>8998:</b> mtn.i2p2.i2p (Monotone - disabled by default)
                            <i>May be disabled or changed on the i2ptunnel page in the router console.
                            </i></li>


			<li><b>32000:</b> local control channel for the service wrapper</li>


		
    
    </ul>


		</li>


	
  
</ul>





<p>Les ports locaux I2P et ceux des tunnels I2P n'ont pas besoin
d'&ecirc;tre joignables &agrave; partir de machines distantes, mais ils
*doivent* &ecirc;tre joignables localement. Vous pouvez
&eacute;galement ajouter des ports pour les instances de
I2PTunnel&nbsp;via http://localhost:7657/i2ptunnel/ (et
alors&nbsp;autoriser un acc&egrave;s local dans votre pare-feu, mais
pas d'acc&egrave;s distant sauf si vous le souhaitez vraiment)
</p>



<p>Pour r&eacute;sumer, inutile d'&ecirc;tre joignable &agrave;
distance par des pairs non sollicit&eacute;s, mais vous aurez de
meilleures performances si vous pouvez configurer votre pare-feu NAT
pour permettre les entr&eacute;es UDP et TCP sur le port I2P. Vous
devrez aussi pouvoir envoyer des paquets UDP &agrave; des pairs
distants arbitraires (bloquer des IP au hasard avec &nbsp;des trucs
comme PeerGuardian ne peut que vous nuire - &agrave; ne pas faire)
</p>



<h3 id="manual_reseed">Comment "reseeder" manuellement ?
<span class="permalink">(<a href="#manual_reseed">link</a>)</span></h3>


<p>Un routeur I2P n'a besoin de "reseeder" qu'une seule fois, pour
joindre le r&eacute;seau au d&eacute;but. "Reseeder" n'est rien d'autre
que des requ&ecirc;tes HTTP GET pour int&eacute;grer une liste de
r&eacute;pertoires et t&eacute;l&eacute;charger de multiples fichiers
"RouterInfo" &agrave; une URL de "reseed" pr&eacute;d&eacute;finie.
</p>



<p>Le sympt&ocirc;me typique d'un "reseed" manqu&eacute; est
l'indicateur Actifs/connu (panneau gauche de la console) qui affiche
une petite valeur (souvent inf&eacute;rieure &agrave; 5) qui n'augmente
pas. Cela peut arriver entre autre parceque votre pare-feu limite le
trafic sortant, et bloque la demande de "reseed".
</p>



<p>Pour "reseeder" votre routeur manuellement, proc&eacute;der comme suit :
	</p>

<ul>


	<li>Arr&eacute;ter votre routeur I2P</li>


	<li>Ouvrir <a href="http://i2pdb.tin0.de/netDb/">http://i2pdb.tin0.de/netDb/</a> ou
	    <a href="http://netdb.i2p2.de/">http://netdb.i2p2.de/</a> avec votre navigateur</li>


	<li>Enregistrer une douzaine de fichiers "routerInfo" dans votre r&eacute;pertoire&nbsp;"netDb" (ignorer les fichiers "leaseSet")</li>


	<li>(M&eacute;thode alternative, plus facile : t&eacute;l&eacute;charger <a href="http://i2pdb.tin0.de/latest.zip">http://i2pdb.tin0.de/latest.zip</a> et l'extraire dans votre r&eacute;pertoire I2P "netDb")
	</li>

  <li>D&eacute;marrer votre router I2P</li>


	
</ul>


<p></p>



<hr>
<h3 id="question">J'ai une question !
<span class="permalink">(<a href="#question">link</a>)</span></h3>


<p>Super! Rejoins-nous sur IRC irc.freenode.net #i2p ou sur le <a href="http://forum.i2p2.de/">forum</a>
</p>


{% endblock %}
</body>
</html>
