{% extends "_layout_de.html" %}
{% block title %}Wie Garlic Routen funktioniert{% endblock %}
{% block content %}<p>
wie kurz in der <a href="how_intro_de">Einleitung</a> erkl&auml;rt, benutzt I2P
in Erweiterung zum Senden von Nachrichten &uuml;ber Tunnel (via 
<a href="how_tunnelrouting_de">Tunnels</a>) eine Technik, die sich "Garlic 
Routing" nennt - schichtenweise verschl&uuml;sselung der Nachrichten und 
weiterleiten durch Knoten, die der urspr&uuml;ngliche Sender selektiert.

Dies ist &auml;hnlich zu der Technik, die Mixmaster f&uuml;r Nachrichten nutzt 
(siehe <a href="how_networkcomparisons">Netzwerk Vergleich</a>) - eine Nachricht
nehmen, verschl&uuml;sseln mit dem &ouml;ffentlichen Schl&uuml;ssel des Empf&auml;ngers,
diese nocheinmal verschl&uuml;sseln (mitsamt den Informationen, die die n&auml;chste
Station bestimmt) und dieses wiederum mit dem &ouml;ffentlichen Schl&uuml;ssel
der darauffolgenden Station, bis alle Stationen im Tunnel abgearbeitet sind (und
f&uuml;r jede Station eine Schicht von Verschl&uuml;sselung vorhanden ist).
Der einzige signifikante Unterschied zwischen dieser Technik und dem I2P "Garlic Routen"
ist, das in jeder Schicht anstelle von nur einer Nachrich eine beliebige Anzahl
von Nachrichten vorhanden sein kann.


<p>
<img src="http://dev.i2p.net/~jrandom/wiki/garlic.png">
<p>
In Erweiterung zu dem gepacktem Paket, enth&auml;lt jede entpackte "Garlic"
Nachricht eine Sender spezifische Anzahl von F&uuml;lldaten, die dem Sender einen
aktiven Schutz gegen Bandbreiten Analysen bietet
<p>
<H2>Anwendung in I2P</H2>

<p>
I2P benutzt das "Garlic Routen" in 3 Positionen:
<UL>
<li> Beim Tunnel Aufbau
<li> Um den Erfolg oder Misserfolg des Ende-Zu-Ende Transportes einer Nachricht zu ermitteln
     (indem es eine weitere "DeliveryStatusMessage" in die Nutzdaten einf&uuml;gt, wohingegen
     an dem gepacktem Paket eine "DeliveryStatusMessage" mit Instruktionen zum R&uuml;cktransport
     &uuml;ber andere Knoten und Tunnel angef&uuml;gt wird).

<li> Zum Publizieren von einigen Netzwerk Datenbank Eintr&auml;gen (verringern von der 
     Wahrscheinlichkeit einer erfolgreichen Traffic Analyse)
</UL>
<p>
Es existieren weitere Wege, mit denen durch diese Technik die Performance des Netzwerkes
erh&ouml;ht werden kann, die Balance zwischen Transportlatenz und Durchsatz umgangen werden
kann und Daten &uuml;ber redundante Wege transportiert werden kann, um die 
Zuverl&auml;ssigkeit zu erh&ouml;hen.
<p>
<H2>Verschl&uuml;sselung</H2>

<p>
Die Verschl&uuml;sselung in jeder Schicht der "Garlic" Nachricht nutzt den 
<a href="how_elgamalaes">ElGamal/AES+SessionTag</a> Algorhytmus, der die Kosten
einer vollen 2048bit ElGamal Verschl&uuml;sselung f&uuml;r folgende Nachrichten 
vermeidet, daf&uuml;r nutzt dieser einen zuf&auml;lligen SessionTag, der zuvor
spezifiziert wurde und 256bit AES Verschl&uuml;sselung.
<p>
<H2>Referenzen</H2>

<p>
Der Begriff "Garlic Routen" wurde zuerst von Michael Freedman in Roger Dingledines
Freehaven <a href="http://www.freehaven.net/doc/freehaven10.ps">[Aaster Arbeit]</a>
erw&auml;hnt, welche abgeleitet war vom <a href="http://onion-router.net/">[Onion Routen]</a>.
Der Hauptunterschied beim I2P "Garlic Routen" ist der unidirektionale Weg - es gibt
keinen Umkehrpunkt, der im Onion Routen zu finden ist, oder auch keine Mixmaster Antwort
Bl&ouml;cke. Dieses vereinfacht den Algorhytmus erheblich und erlaubt flexiblere
und zuverl&auml;ssigere Transporte. </p>
{% endblock %}
