{% extends "_layout.html" %}
{% block title %}Plugins{% endblock %}
{% block content %}
<h2>I2P-Zusatzprogramme</h2>

Diese Seite wurde zuletzt im August 2010 aktualisiert und bezieht sich auf die Routerversion (I2P-Version) 0.8.

<h3>Allgemeines</h3>
I2P ist auf Zusatzprogramme (<i>Plugins</i>) vorbereitet und sorgt dadurch nicht nur f&uuml;r eine unkomplizierte Installation zus&auml;tzlicher I2P-Anwendungen, sondern erleichtert auch dem Programmierer die Arbeit.

<p>
Es gibt mittlerweile Zusatzprogramme zum dezentralen Mailverkehr und f&uuml;r Blogs, IRC-Klienten, verteilte Datenspeicherung und mehr.
<p>
Die Vorteile f&uuml;r I2P-Nutzer und Anwendungsprogrammierer sind:
<ul>
<li>
	Einfache Verteilung von Anwendungen
<li>
	Macht die Entwicklung neuer Funktionalit&auml;t und das Einbinden neuer Bibliotheken m&ouml;glich, ohne dass sich die Gr&ouml;&szlig;e der i2pupdate.sud erh&ouml;ht
<li>
	Einfacher Zugang zu gro&szlig;en oder spezialisierten Anwendungen, die keine Chance auf Aufnahme in das I2P-Basispaket haben
<li>
	Kryptographisch signierte und &uuml;berpr&uuml;fte Anwendungen
<li>
	Die automatische Aktualisierung von Anwendungen - genau wie beim I2P-Router.
<li>
	Bei Bedarf ein separates Erstinstallations- und Aktualisierungspaket, um die Gr&ouml;&szlig;e der zu ladenden Aktualisierungspakete klein zu halten
<li>
	Ein-Klick-Installation von Anwendungen. Der Benutzer muss nicht mehr die Dateien wrapper.config und clients.config manuell bearbeiten.
<li>
	Trennung von Anwendungsverzeichnissen und dem Installationszerzeichnis $I2P
<li>
	Automatische Pr&uuml;fung der I2P-Version, Java-Version und bestehender Anwendungsversion
<li>
	Automatisches Hinzuf&uuml;gen eines Links zu der Anwendung in der Routerkonsole.
<li>
	Automatischer Start von Anwendungen und automatische Anpassung des Java-Klassenpfads, ohne Neustart von I2P
<li>
	Automatisches Hinzuf&uuml;gen und Start von Webanwendungen in der Jetty-Instanz der Routerkonsole
<li>
	Erleichtert den Aufbau von Programmsammlungen (&#8222;App Store&#8220;)
<li>
	Ein-Klick-Deinstallation
<li>
	Sprach- und Gestaltungspakete f&uuml;r die Konsole
<li>
	Detaillierte Informationen &uuml;ber Anwendungen in der Routerkonsole
<li>
	Auch Nicht-Java-Anwendungen werden unterst&uuml;tzt
</ul>


<h4>Ben&ouml;tigte I2P-version</h4>
0.7.12 oder h&ouml;her

<h4>Installation</h4>
Um ein Zusatzprogramm zu installieren und zu starten, muss der Installationslink (Endung .xpi2p) kopiert und unten auf der Seite <a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp in der Routerkonsole</a> eingef&uuml;gt werden. Dann ist auf &#8222;Zusatzprogramm installieren&#8220; zu klicken.<br/>
Nachdem ein Zusatzprogramm installiert und gestartet ist, erscheint in den meisten F&auml;llen ein entsprechender Link im &Uuml;bersichtskasten in der Routerkonsole (oben links).
<p>
Um ein Zusatzprogramm auf die neueste Version zu bringen, klickt man einfach auf den Knopf &#8222;Aktualisieren&#8220; auf der Seite
<a href="http://127.0.0.1:7657/configclients.jsp#plugin">configclients.jsp</a>.
Dort gibt es auch einen Knopf zum pr&uuml;fen auf neue Versionen.<br/>
Automatisch gepr&uuml;ft und aktualisiert wird derzeit noch nicht.




<h3>Entwicklung neuer Zusatzprogramme</h3>
Bitte die aktuelle 
<a href="plugin_spec.html">technische Beschreibung Zusatzprogramme</a>
(englisch) und das
<a href="http://zzz.i2p/forums/16">Forum Zusatzprogramme</a> (ebenfalls englisch) auf zzz.i2p konsultieren.
<p>
Weiterhin wird ein Blick in die Quelltext bereits bestehender Zusatzprogramme empfohlen.
Manche Zusatzprogramme wurden speziell als Beispielprogramme geschrieben.
<p>
<b>Programmierer gesucht!</b>
Zusatzprogramme eignen sich gut, um sich besser mit I2P vertraut zu machen oder neue Funktionalit&auml;ten zu realisieren.

<h3>Einstieg</h3>
Um aus einer bestehenden Anwendung ein Zusatzprogramm zu erstellen, ist das Skript makeplugin.sh aus dem
<a href="http://stats.i2p/cgi-bin/viewmtn/branch/head/browse/i2p.scripts/plugin/makeplugin.sh">Zweig i2p.scripts in Monotone</a> n&ouml;tig.


<h3>Bekannte Probleme</h3>
Beachte: Im Router laufende Zusatzprogramme unterliegen <b>KEINEN</b> weiteren Sicherheitsmechanismen - sie sind weder untereinander noch vom Router abgeschirmt.

<ul>
<li>
Aktualisierungen eines Zusatzprogramms auf neue Versionen werden nicht erkannt, wenn das Zusatzprogramm Jar-Dateien (keine War-Dateien) enth&auml;lt und es bereits l&auml;ft.
In dem Fall ist ein Neustart des Routers n&ouml;tig, weil der Klassencache geleert werden muss und das im laufenden Betrieb nur mit Tricksereien geht.
<li>
Die automatische Aktualisierung und Pr&uuml;fung auf neue Versionen ist nicht implementiert.
<li>
Der Stoppknopf wird auch dann angezeigt, wenn es gar nichts zu stoppen gibt.
<li>
Zusatzprogramme, die in einer eigenen JVM laufen, legen ein Verzeichnis namens logs in $CWD (also dem Arbeitsverzeichnis) an.
<li>
Im Urzustand sind als einzige Signaturschl&uuml;ssel die von jrandom und zzz enthalten (dieselben Schl&uuml;ssel wie die f&uuml;r die Routeraktualisierung). Neue Signierer werden automatisch hinzugef&uuml;t und der neue Signaturschl&uuml;ssel automatisch akzeptiert - es gibt keine zentrale Signaturschl&uuml;sselverwaltung.
<li>
Beim L&ouml;schen eines Zusatzprogrammes wird das Verzeichnis nicht immer gel&ouml;scht, vor allem unter Windows.
<li>
Wird ein Zusatzprogramm, das mit Pack200 komprimiert ist und Java 1.6 ben&ouml;tigt, unter Java 1.5 installiert, so erscheint die Fehlermeldung &#8222;Zusatzprogramm ist korrupt.&#8220;
<li>
Gestaltungs- und &Uuml;bersetzungszusatzmodule sind ungetestet.
<li>
Das automatische Starten l&auml;sst sich nicht immer deaktivieren.
</ul>

{% endblock %}
